./  ADD  SSI=02320522,NAME=ISTAUCAG
SVTM     TITLE 'ISTAUCAG - CSC ACCOUNTING EXIT DUMMY ROUTINE'           00001000
ISTAUCAG CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTAUCAG  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*   RETURN CODE(CAGRTVAL);          /* SET RTRN CODE AND           0003 00014000
*                                      RETURN TO CALLER              */ 00015000
*                                                                  0003 00016000
         SLR   @15,@15                                             0003 00017000
@EL00001 DS    0H                                                  0003 00018000
@EF00001 DS    0H                                                  0003 00019000
@ER00001 L     @14,12(,@13)                                        0003 00020000
         LM    @00,@12,20(@13)                                     0003 00021000
         BR    @14                                                 0003 00022000
*   END ISTAUCAG;                                                  0004 00023000
@DATA    DS    0H                                                       00024000
@DATD    DSECT                                                          00025000
         DS    0F                                                       00026000
ISTAUCAG CSECT                                                          00027000
         DS    0F                                                       00028000
@DATD    DSECT                                                          00029000
         DS    0D                                                       00030000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00031000
@ENDDATD EQU   *                                                        00032000
ISTAUCAG CSECT                                                          00033000
         DS    0F                                                       00034000
@SIZDATD DC    AL1(0)                                                   00035000
         DC    AL3(@ENDDATD-@DATD)                                      00036000
         DS    0D                                                       00037000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00038000
@01      EQU   01                                                       00039000
@02      EQU   02                                                       00040000
@03      EQU   03                                                       00041000
@04      EQU   04                                                       00042000
@05      EQU   05                                                       00043000
@06      EQU   06                                                       00044000
@07      EQU   07                                                       00045000
@08      EQU   08                                                       00046000
@09      EQU   09                                                       00047000
@10      EQU   10                                                       00048000
@11      EQU   11                                                       00049000
@12      EQU   12                                                       00050000
@13      EQU   13                                                       00051000
@14      EQU   14                                                       00052000
@15      EQU   15                                                       00053000
CAGBASER EQU   @12                                                      00054000
CAGRTREG EQU   @15                                                      00055000
@ENDDATA EQU   *                                                        00056000
         END   ISTAUCAG,(C'PLS2023',0702,80232)                         00057000
./  ADD  SSI=02320524,NAME=ISTAUCAT
SVTM     TITLE 'ISTAUCAT - CSC AUTHORIZATION EXIT DUMMY ROUTINE'        00001000
ISTAUCAT CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTAUCAT  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  ST    @14,12(,@13)                                        0001 00009000
         STM   @00,@12,20(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
*   RETURN CODE(CATRTVAL);          /* SET RTRN CODE AND           0003 00014000
*                                      RETURN TO CALLER              */ 00015000
*                                                                  0003 00016000
         SLR   @15,@15                                             0003 00017000
@EL00001 DS    0H                                                  0003 00018000
@EF00001 DS    0H                                                  0003 00019000
@ER00001 L     @14,12(,@13)                                        0003 00020000
         LM    @00,@12,20(@13)                                     0003 00021000
         BR    @14                                                 0003 00022000
*   END ISTAUCAT;                                                  0004 00023000
@DATA    DS    0H                                                       00024000
@DATD    DSECT                                                          00025000
         DS    0F                                                       00026000
ISTAUCAT CSECT                                                          00027000
         DS    0F                                                       00028000
@DATD    DSECT                                                          00029000
         DS    0D                                                       00030000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00031000
@ENDDATD EQU   *                                                        00032000
ISTAUCAT CSECT                                                          00033000
         DS    0F                                                       00034000
@SIZDATD DC    AL1(0)                                                   00035000
         DC    AL3(@ENDDATD-@DATD)                                      00036000
         DS    0D                                                       00037000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00038000
@01      EQU   01                                                       00039000
@02      EQU   02                                                       00040000
@03      EQU   03                                                       00041000
@04      EQU   04                                                       00042000
@05      EQU   05                                                       00043000
@06      EQU   06                                                       00044000
@07      EQU   07                                                       00045000
@08      EQU   08                                                       00046000
@09      EQU   09                                                       00047000
@10      EQU   10                                                       00048000
@11      EQU   11                                                       00049000
@12      EQU   12                                                       00050000
@13      EQU   13                                                       00051000
@14      EQU   14                                                       00052000
@15      EQU   15                                                       00053000
CATBASER EQU   @12                                                      00054000
CATRTREG EQU   @15                                                      00055000
@ENDDATA EQU   *                                                        00056000
         END   ISTAUCAT,(C'PLS2024',0702,80232)                         00057000
./  ADD  SSI=02410972,NAME=ISTINCIT
         TITLE '     ISTINCIT - INITIALIZATION CONTROL'                 00001000
ISTINCIT CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTINCIT  80.241'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @14,@SA00001                                        0001 00014000
         ST    @14,8(,@13)                                         0001 00015000
         LR    @13,@14                                             0001 00016000
         PRINT OFF                                                      00017000
         PRINT ON                                                       00018000
*                                                                  0191 00019000
*/* END OF ATBUILD */                /* @ZA03720*/                 0191 00020000
*/*------------------------------------------------------------------*/ 00021000
*/* THHIS MODULE INVOKS VTAM INITALIZATION MODULES                   */ 00022000
*/*-----------------------------------------------------------------*/  00023000
*                                                                  0191 00024000
*                                                                  0191 00025000
*  DO; /* LISATCVT CVTBASE(PAGEABLE,(ATCVTPTR)) */                 0191 00026000
*    ATCVTPTR = ATCLCPTR; /*SET UP ATCVT POINTER*/                 0192 00027000
         L     ATCVTPTR,ATCLCPTR                                   0192 00028000
*  END; /*LISATCVT*/        /*         @ZA03720*/                  0193 00029000
*        RFY ISTATCVT BASED (ATCVTPTR);                            0194 00030000
*        RFY ISTCONFT BASED (ATCCONFT);                            0195 00031000
*        CONF01SV = CHASAVE;                                       0196 00032000
         L     @14,ATCCONFT(,ATCVTPTR)                             0196 00033000
         L     @05,CHASAVE(,CITR13)                                0196 00034000
         ST    @05,CONF01SV(,@14)                                  0196 00035000
*        CALL  ISTINCIB;           /* LINK TO BASIC INITIALIZATION 0197 00036000
*                                     ROUTINE TO ESTABLISH BASE    0197 00037000
*                                     ENVIORNMENT                    */ 00038000
         L     @15,@CV00042                                        0197 00039000
         BALR  @14,@15                                             0197 00040000
*        IF  CITR15=0  THEN        /*    RETURN CODE EQUAL ZERO?    */  00041000
         LTR   CITR15,CITR15                                       0198 00042000
         BNZ   @RF00198                                            0198 00043000
*              CONSTAFP='7FFFFFFF'X; /* INDICATE CALL CRR   @ZA03720*/  00044000
         L     @14,ATCCONFT(,ATCVTPTR)                             0199 00045000
         MVC   CONSTAFP(4,@14),@CF00103                            0199 00046000
*            ELSE GOTO CITTREL;    /* NO-GO TO RELEASE RESOURCES RTN */ 00047000
*        CALL  ISTINCCC;           /*YES-LINK TO THE CONFIGURATION 0201 00048000
*                                         CONTROL RTN TO PROCESS   0201 00049000
*                                         OPTION PARAMETERS        */   00050000
         L     @15,@CV00040                                        0201 00051000
         BALR  @14,@15                                             0201 00052000
*        IF  CITR15=0  THEN;        /* RETURN CODE EQUAL ZERO?    */    00053000
         LTR   CITR15,CITR15                                       0202 00054000
         BNZ   @RF00202                                            0202 00055000
*            ELSE GOTO CITTREL;     /*NO-GO TO RELEASE RESOURCES RTN */ 00056000
*        CALL  ISTINCCF;            /*YES-LINK TO THE CONFIGURATION     00057000
*                                         ROUTINE                    */ 00058000
         L     @15,@CV00041                                        0205 00059000
         BALR  @14,@15                                             0205 00060000
*        IF  CITR15=0  THEN;        /* RETURN CODE EQUAL ZERO?    */    00061000
         LTR   CITR15,CITR15                                       0206 00062000
         BNZ   @RF00206                                            0206 00063000
*            ELSE GOTO CITTREL;     /*NO-GO TO RELEASE RESOURCES RTN */ 00064000
*        CALL  ISTINCOS;            /*YES-LINK TO THE OPTIONAL SERVICES 00065000
*                                         ROUTINE TO PROCESS OPTIONS */ 00066000
         L     @15,@CV00043                                        0209 00067000
         BALR  @14,@15                                             0209 00068000
*        IF  CITR15=0  THEN            /* RETURN CODE EQUAL ZERO?    */ 00069000
         LTR   CITR15,CITR15                                       0210 00070000
         BNZ   @RF00210                                            0210 00071000
*              CALL  ISTINCAW;      /*YES-LINK TO TASK CONTROL RTN   */ 00072000
         L     @15,@CV00039                                        0211 00073000
         BALR  @14,@15                                             0211 00074000
*            ELSE                                                  0212 00075000
*        CITTREL:       CALL ISTINCRR; /*NO-LINK TO THE RELEASE    0212 00076000
*                                        RESOURCES ROUTINE           */ 00077000
*                                                                  0212 00078000
         B     @RC00210                                            0212 00079000
@RF00210 DS    0H                                                  0212 00080000
CITTREL  L     @15,@CV00044                                        0212 00081000
         BALR  @14,@15                                             0212 00082000
* DO; /* TPEPILOG   */                                             0213 00083000
@RC00210 DS    0H                                                  0214 00084000
*                                                                  0214 00085000
* GEN (PRINT OFF);                                                 0214 00086000
         PRINT OFF                                                      00087000
* GEN (PRINT ON);                                                  0215 00088000
         PRINT ON                                                       00089000
* END;/* TPEPILOG */                                               0216 00090000
*        END;                                                      0217 00091000
@EL00001 L     @13,4(,@13)                                         0217 00092000
@EF00001 DS    0H                                                  0217 00093000
@ER00001 LM    @14,@12,12(@13)                                     0217 00094000
         BR    @14                                                 0217 00095000
@DATA    DS    0H                                                       00096000
         DS    0F                                                       00097000
@SA00001 DS    18F                                                      00098000
         DS    0F                                                       00099000
@CF00103 DC    XL4'7FFFFFFF'                                            00100000
@CV00039 DC    V(ISTINCAW)                                              00101000
@CV00040 DC    V(ISTINCCC)                                              00102000
@CV00041 DC    V(ISTINCCF)                                              00103000
@CV00042 DC    V(ISTINCIB)                                              00104000
@CV00043 DC    V(ISTINCOS)                                              00105000
@CV00044 DC    V(ISTINCRR)                                              00106000
         DS    0D                                                       00107000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00108000
@01      EQU   01                                                       00109000
@02      EQU   02                                                       00110000
@03      EQU   03                                                       00111000
@04      EQU   04                                                       00112000
@05      EQU   05                                                       00113000
@06      EQU   06                                                       00114000
@07      EQU   07                                                       00115000
@08      EQU   08                                                       00116000
@09      EQU   09                                                       00117000
@10      EQU   10                                                       00118000
@11      EQU   11                                                       00119000
@12      EQU   12                                                       00120000
@13      EQU   13                                                       00121000
@14      EQU   14                                                       00122000
@15      EQU   15                                                       00123000
ATCVTPTR EQU   @04                                                      00124000
CITR13   EQU   @13                                                      00125000
CITR15   EQU   @15                                                      00126000
RPHPTR   EQU   @01                                                      00127000
LDPRMPTR EQU   @01                                                      00128000
ATCLCPTR EQU   1032                                                     00129000
CITSAVE  EQU   0                                                        00130000
CHASAVE  EQU   CITSAVE+4                                                00131000
ISTLOK   EQU   0                                                        00132000
LOKCHN   EQU   ISTLOK+1                                                 00133000
LOKCHNG  EQU   LOKCHN                                                   00134000
@NM00003 EQU   LOKCHNG+2                                                00135000
ISTPAB   EQU   0                                                        00136000
PABWQCHN EQU   ISTPAB                                                   00137000
PABWEQA  EQU   PABWQCHN                                                 00138000
PABCHAIN EQU   PABWQCHN+4                                               00139000
PABRPHFG EQU   ISTPAB+12                                                00140000
PABFLAGS EQU   PABRPHFG                                                 00141000
PABEND   EQU   ISTPAB+16                                                00142000
ISTDYPAB EQU   0                                                        00143000
DYPCHAIN EQU   ISTDYPAB+4                                               00144000
DYPPACMD EQU   ISTDYPAB+12                                              00145000
ISTRPH   EQU   0                                                        00146000
RPHCNTL  EQU   ISTRPH                                                   00147000
RPHFLAGS EQU   RPHCNTL+2                                                00148000
RPHFLGB  EQU   RPHCNTL+3                                                00149000
RPHRPHA  EQU   ISTRPH+4                                                 00150000
RPHTSKID EQU   ISTRPH+8                                                 00151000
RPHRESMA EQU   ISTRPH+16                                                00152000
RPHWPFLG EQU   RPHRESMA                                                 00153000
RPHWEA   EQU   ISTRPH+24                                                00154000
RPHSRPRM EQU   ISTRPH+28                                                00155000
RPHWORK  EQU   ISTRPH+36                                                00156000
RPHSAVE1 EQU   RPHWORK                                                  00157000
RPHSBITS EQU   RPHSAVE1+1                                               00158000
ISTATCVT EQU   0                                                        00159000
ATCRPTCH EQU   ISTATCVT                                                 00160000
ATCITFLD EQU   ISTATCVT+8                                               00161000
ATCITPRM EQU   ATCITFLD                                                 00162000
ATCITCDS EQU   ATCITFLD+8                                               00163000
ATCITFLG EQU   ATCITCDS+4                                               00164000
ATCITRA1 EQU   ATCITFLG+2                                               00165000
ATCSMPAB EQU   ISTATCVT+88                                              00166000
ATCLDTIL EQU   ISTATCVT+408                                             00167000
ATCGTSTR EQU   ISTATCVT+644                                             00168000
ATCTSCIO EQU   ISTATCVT+736                                             00169000
ATCTSCUF EQU   ISTATCVT+776                                             00170000
@NM00016 EQU   ISTATCVT+792                                             00171000
ATCLUDVT EQU   ISTATCVT+800                                             00172000
ATCANYDT EQU   ISTATCVT+808                                             00173000
@NM00017 EQU   ISTATCVT+812                                             00174000
ATCPODVT EQU   ISTATCVT+832                                             00175000
ATCCONFT EQU   ISTATCVT+920                                             00176000
ATCSSDVT EQU   ISTATCVT+940                                             00177000
ATCSODVT EQU   ISTATCVT+944                                             00178000
ATCMBDVT EQU   ISTATCVT+952                                             00179000
ATCSTAT  EQU   ISTATCVT+972                                             00180000
ATCSTAT1 EQU   ATCSTAT                                                  00181000
@NM00018 EQU   ATCSTAT+1                                                00182000
ATCPOFLG EQU   ATCSTAT+2                                                00183000
ATCSTAT4 EQU   ATCSTAT+3                                                00184000
ATCBITAN EQU   ISTATCVT+976                                             00185000
ATCFLAG2 EQU   ATCBITAN+1                                               00186000
ATCONID  EQU   ISTATCVT+980                                             00187000
ATCSSCPA EQU   ISTATCVT+984                                             00188000
ATCHPGM  EQU   ISTATCVT+1040                                            00189000
ATCRNO   EQU   ISTATCVT+1044                                            00190000
ATCCPDVT EQU   ISTATCVT+1092                                            00191000
ATCSMSDQ EQU   ISTATCVT+1128                                            00192000
ATCRID   EQU   ISTATCVT+1144                                            00193000
ATCTKFLD EQU   ISTATCVT+1156                                            00194000
ATCIOINT EQU   ISTATCVT+1176                                            00195000
ATCTOD   EQU   ISTATCVT+1220                                            00196000
ATCVRTIL EQU   ISTATCVT+1264                                            00197000
ATCLKSWP EQU   ISTATCVT+1440                                            00198000
ATCWUDYP EQU   ISTATCVT+1448                                            00199000
ATCXCNCB EQU   ISTATCVT+1544                                            00200000
ATCSQAFR EQU   ISTATCVT+1560                                            00201000
ATCORTCB EQU   ATCSQAFR+4                                               00202000
ATCORSRB EQU   ATCORTCB                                                 00203000
ATCLDAPP EQU   ISTATCVT+1600                                            00204000
ATCDAPVT EQU   ISTATCVT+1620                                            00205000
ATCGSRBQ EQU   ISTATCVT+1672                                            00206000
ATCGSRBG EQU   ATCGSRBQ                                                 00207000
ATCENFLG EQU   ISTATCVT+1722                                            00208000
ATCCSCB  EQU   ISTATCVT+1724                                            00209000
ATCVTFLG EQU   ISTATCVT+1784                                            00210000
@NM00050 EQU   ISTATCVT+1816                                            00211000
ATCCRA   EQU   ISTATCVT+1840                                            00212000
ATCCRACN EQU   ATCCRA+4                                                 00213000
ATCCRPL  EQU   ISTATCVT+1848                                            00214000
ATCRPLCN EQU   ATCCRPL+4                                                00215000
ISTSRT   EQU   0                                                        00216000
SRTSRTE  EQU   ISTSRT+8                                                 00217000
SRTXTNBS EQU   ISTSRT+13                                                00218000
ISTDEVCH EQU   0                                                        00219000
DEVSHCH  EQU   ISTDEVCH                                                 00220000
DEVCHAR  EQU   DEVSHCH                                                  00221000
DEVTCODE EQU   ISTDEVCH+1                                               00222000
DEVFLAGS EQU   ISTDEVCH+3                                               00223000
DEVFCCTL EQU   DEVFLAGS                                                 00224000
DEVCHAR3 EQU   DEVFLAGS                                                 00225000
DEVMODE  EQU   ISTDEVCH+5                                               00226000
ISTRPRE  EQU   0                                                        00227000
RPRSRTHD EQU   ISTRPRE                                                  00228000
RPRDAFID EQU   ISTRPRE+16                                               00229000
RPRSTATE EQU   ISTRPRE+56                                               00230000
RPRCURST EQU   RPRSTATE                                                 00231000
RPRDESST EQU   RPRSTATE+2                                               00232000
RPRBITAN EQU   ISTRPRE+61                                               00233000
RPRFLAGS EQU   ISTRPRE+66                                               00234000
ISTRCPRE EQU   0                                                        00235000
RCPSARRY EQU   ISTRCPRE+84                                              00236000
RCPPACE  EQU   ISTRCPRE+108                                             00237000
RCPNCPPC EQU   ISTRCPRE+110                                             00238000
RCPPMODE EQU   ISTRCPRE+113                                             00239000
RCPCYMOD EQU   RCPPMODE                                                 00240000
RCPCYSET EQU   RCPPMODE                                                 00241000
RCPSESSM EQU   ISTRCPRE+115                                             00242000
RCPBITAN EQU   ISTRCPRE+116                                             00243000
ISTRDT   EQU   0                                                        00244000
RDTPLEN  EQU   ISTRDT+84                                                00245000
RDTPRIOR EQU   RDTPLEN                                                  00246000
RDTBITAN EQU   ISTRDT+113                                               00247000
RDTCRIA  EQU   ISTRDT+116                                               00248000
ISTRAP   EQU   0                                                        00249000
RAPBITAN EQU   ISTRAP+165                                               00250000
ISTLDPRM EQU   0                                                        00251000
LDPFG    EQU   ISTLDPRM+20                                              00252000
LDPFB2   EQU   ISTLDPRM+21                                              00253000
ISTUILTE EQU   0                                                        00254000
ISTRGP   EQU   0                                                        00255000
RGPBITAN EQU   ISTRGP+94                                                00256000
ISTSMHDR EQU   0                                                        00257000
SMHCHAR  EQU   ISTSMHDR+8                                               00258000
ISTSCHDR EQU   0                                                        00259000
SCHCHAR  EQU   ISTSCHDR                                                 00260000
ISTECB   EQU   0                                                        00261000
@NM00091 EQU   ISTECB                                                   00262000
ISTRRN   EQU   0                                                        00263000
RRNADR   EQU   ISTRRN+136                                               00264000
RRNFLAG  EQU   RRNADR                                                   00265000
RRNUCBAD EQU   RRNADR+1                                                 00266000
RRNHPRE  EQU   ISTRRN+196                                               00267000
RRNBITAN EQU   ISTRRN+201                                               00268000
RRNLVL   EQU   ISTRRN+204                                               00269000
RRNNMDPD EQU   ISTRRN+232                                               00270000
RRNLDFSM EQU   ISTRRN+298                                               00271000
ISTRCDRM EQU   0                                                        00272000
RCDRMPDN EQU   ISTRCDRM+188                                             00273000
RCDRMRPQ EQU   ISTRCDRM+196                                             00274000
RCDRMFGS EQU   ISTRCDRM+208                                             00275000
ISTCONFT EQU   0                                                        00276000
CONSTAFP EQU   ISTCONFT+100                                             00277000
CONF01SV EQU   ISTCONFT+116                                             00278000
CONECBAA EQU   ISTCONFT+136                                             00279000
CONSBFAA EQU   ISTCONFT+140                                             00280000
CONDBFAA EQU   ISTCONFT+144                                             00281000
CONVTHAA EQU   ISTCONFT+148                                             00282000
CONPUNAA EQU   ISTCONFT+152                                             00283000
CONTOLAA EQU   ISTCONFT+156                                             00284000
CONTRCAA EQU   ISTCONFT+160                                             00285000
CONNETAA EQU   ISTCONFT+164                                             00286000
CONUSSAA EQU   ISTCONFT+168                                             00287000
CONRVYAA EQU   ISTCONFT+172                                             00288000
CONSCPAA EQU   ISTCONFT+176                                             00289000
CONFNSAA EQU   ISTCONFT+180                                             00290000
CONFTRAA EQU   ISTCONFT+184                                             00291000
CONFLDAA EQU   ISTCONFT+188                                             00292000
CONFXXAA EQU   ISTCONFT+192                                             00293000
CONFTTAA EQU   ISTCONFT+196                                             00294000
CONFVRAA EQU   ISTCONFT+200                                             00295000
CONTUNAA EQU   ISTCONFT+204                                             00296000
CONCDPAA EQU   ISTCONFT+208                                             00297000
CONTDPAA EQU   ISTCONFT+212                                             00298000
CONAREAA EQU   ISTCONFT+216                                             00299000
CONSRTAA EQU   ISTCONFT+220                                             00300000
CONGRPAA EQU   ISTCONFT+224                                             00301000
CONEND   EQU   ISTCONFT+240                                             00302000
CONVARA  EQU   0                                                        00303000
CONAREAS EQU   CONVARA                                                  00304000
CONFLG01 EQU   CONAREAS                                                 00305000
CONHALT  EQU   CONAREAS+8                                               00306000
CONFLAGS EQU   CONAREAS+12                                              00307000
CONDSFLG EQU   CONFLAGS                                                 00308000
CONOPTFL EQU   CONFLAGS+1                                               00309000
CONSTAT  EQU   CONFLAGS+2                                               00310000
CONBUFF  EQU   CONFLAGS+3                                               00311000
CONSCPID EQU   CONAREAS+26                                              00312000
CONSTAID EQU   CONSCPID+3                                               00313000
CONDYPA  EQU   CONVARA+56                                               00314000
CONRDTA  EQU   CONVARA+120                                              00315000
CONLDPA  EQU   CONVARA+1844                                             00316000
CONECBA  EQU   CONVARA+2124                                             00317000
CONBUFA  EQU   CONVARA+2164                                             00318000
CONSRTA  EQU   CONVARA+2548                                             00319000
CONECBL  EQU   0                                                        00320000
CONSBFA  EQU   0                                                        00321000
CONDBFA  EQU   0                                                        00322000
ISTAVT   EQU   0                                                        00323000
ISTRETRG EQU   ISTAVT+44                                                00324000
CONCDRMP EQU   0                                                        00325000
CONFLDAT EQU   0                                                        00326000
CONFNSAT EQU   0                                                        00327000
CONFTRAT EQU   0                                                        00328000
CONFTTAT EQU   0                                                        00329000
CONFVRAT EQU   0                                                        00330000
CONFXXAT EQU   0                                                        00331000
CONNTSOL EQU   0                                                        00332000
CONRECON EQU   0                                                        00333000
CONSRTE  EQU   0                                                        00334000
CONTERMP EQU   0                                                        00335000
CONTOLTP EQU   0                                                        00336000
CONTRACE EQU   0                                                        00337000
CONTUNAT EQU   0                                                        00338000
CONUILTA EQU   0                                                        00339000
CONUSNOP EQU   0                                                        00340000
CONVGRP  EQU   0                                                        00341000
CONVPUNS EQU   0                                                        00342000
CONVTHDR EQU   0                                                        00343000
CONVVTAM EQU   0                                                        00344000
ISTXDYP  EQU   0                                                        00345000
PABXTNSN EQU   PABEND                                                   00346000
SRTXTNSN EQU   SRTXTNBS                                                 00347000
RCPSIBQ  EQU   RCPSARRY                                                 00348000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00349000
SRTDATA  EQU   SRTXTNSN+3                                               00350000
SRTUSELN EQU   SRTXTNSN+1                                               00351000
SRTFLAGS EQU   SRTXTNSN                                                 00352000
@NM00008 EQU   PABXTNSN+12                                              00353000
PABNPSSQ EQU   PABXTNSN+8                                               00354000
PABLOCK  EQU   PABXTNSN+4                                               00355000
PABLAST  EQU   PABXTNSN                                                 00356000
ISTRETR7 EQU   ISTRETRG+4                                               00357000
ISTRETR6 EQU   ISTRETRG                                                 00358000
ISTRSV01 EQU   ISTAVT+42                                                00359000
ISTPDAVP EQU   ISTAVT+38                                                00360000
ISTVTTP  EQU   ISTAVT+36                                                00361000
ISTAGTWT EQU   ISTAVT+34                                                00362000
ISTATRT  EQU   ISTAVT+32                                                00363000
ISTARID  EQU   ISTAVT+30                                                00364000
ISTX1    EQU   ISTAVT+29                                                00365000
ISTPHNM  EQU   ISTAVT+24                                                00366000
ISTAPSEX EQU   ISTAVT+20                                                00367000
ISTVTTIK EQU   ISTAVT+18                                                00368000
AVTASID  EQU   ISTAVT+16                                                00369000
ISTAPSTA EQU   ISTAVT+12                                                00370000
ISTAS53  EQU   ISTAVT+8                                                 00371000
ISTAS49  EQU   ISTAVT+4                                                 00372000
ISTACVT  EQU   ISTAVT                                                   00373000
CONCRPLD EQU   CONDBFA+192                                              00374000
CONPPDBF EQU   CONDBFA+176                                              00375000
CONNPDBF EQU   CONDBFA+160                                              00376000
CONAPDBF EQU   CONDBFA+144                                              00377000
CONWPDBF EQU   CONDBFA+128                                              00378000
CONIODBF EQU   CONDBFA+112                                              00379000
CONUEDBF EQU   CONDBFA+96                                               00380000
CONVPDBF EQU   CONDBFA+80                                               00381000
CONVFDBF EQU   CONDBFA+64                                               00382000
CONLPDBF EQU   CONDBFA+48                                               00383000
CONLFDBF EQU   CONDBFA+32                                               00384000
CONSPDBF EQU   CONDBFA+16                                               00385000
CONSFDBF EQU   CONDBFA                                                  00386000
CONCRPLS EQU   CONSBFA+176                                              00387000
CONPPSBF EQU   CONSBFA+160                                              00388000
CONNPSBF EQU   CONSBFA+144                                              00389000
CONAPSBF EQU   CONSBFA+128                                              00390000
CONWPSBF EQU   CONSBFA+112                                              00391000
CONIOSBF EQU   CONSBFA+96                                               00392000
CONVPSBF EQU   CONSBFA+80                                               00393000
CONVFSBF EQU   CONSBFA+64                                               00394000
CONLPSBF EQU   CONSBFA+48                                               00395000
CONLFSBF EQU   CONSBFA+32                                               00396000
CONSPSBF EQU   CONSBFA+16                                               00397000
CONSFSBF EQU   CONSBFA                                                  00398000
CONECDET EQU   CONECBL+28                                               00399000
CONAPPLE EQU   CONECBL+24                                               00400000
CONGRECB EQU   CONECBL+20                                               00401000
CONIOECB EQU   CONECBL+16                                               00402000
CONCDRME EQU   CONECBL+12                                               00403000
CONTERM  EQU   CONECBL+8                                                00404000
CONTIMER EQU   CONECBL+4                                                00405000
CONDEACT EQU   CONECBL                                                  00406000
CONSRTEA EQU   CONSRTA                                                  00407000
CONDBFSA EQU   CONBUFA+192                                              00408000
CONSBFSA EQU   CONBUFA                                                  00409000
@NM00134 EQU   CONECBA                                                  00410000
CONTUNLA EQU   CONLDPA+240                                              00411000
CONFVRLA EQU   CONLDPA+200                                              00412000
CONFTTLA EQU   CONLDPA+160                                              00413000
CONFXXLA EQU   CONLDPA+120                                              00414000
CONFLDLA EQU   CONLDPA+80                                               00415000
CONFTRLA EQU   CONLDPA+40                                               00416000
CONFNSLA EQU   CONLDPA                                                  00417000
CONGRPRA EQU   CONRDTA+1628                                             00418000
CONPUNRA EQU   CONRDTA+1296                                             00419000
CONNETRA EQU   CONRDTA+1108                                             00420000
CONRVYRA EQU   CONRDTA+920                                              00421000
CONUSSRA EQU   CONRDTA+732                                              00422000
CONTRCRA EQU   CONRDTA+544                                              00423000
CONTOLRA EQU   CONRDTA+356                                              00424000
CONSCPRA EQU   CONRDTA+136                                              00425000
CONVTHRA EQU   CONRDTA                                                  00426000
CONTDYPA EQU   CONDYPA+32                                               00427000
CONCDYPA EQU   CONDYPA                                                  00428000
@NM00133 EQU   CONAREAS+50                                              00429000
CONDLRVL EQU   CONAREAS+48                                              00430000
CONUESBF EQU   CONAREAS+32                                              00431000
CONSTVAR EQU   CONSTAID+1                                               00432000
CONSTFIL EQU   CONSTAID                                                 00433000
CONBLKNO EQU   CONSCPID+2                                               00434000
CONFILL  EQU   CONSCPID+1                                               00435000
CONFCNL  EQU   CONSCPID                                                 00436000
CONUNITS EQU   CONAREAS+24                                              00437000
@NM00132 EQU   CONAREAS+23                                              00438000
CONGLBBH EQU   CONAREAS+22                                              00439000
CONLIST  EQU   CONAREAS+20                                              00440000
CONMAXPL EQU   CONAREAS+18                                              00441000
@NM00131 EQU   CONAREAS+17                                              00442000
@NM00130 EQU   CONBUFF+1                                                00443000
@NM00129 EQU   CONBUFF+1                                                00444000
@NM00128 EQU   CONBUFF+1                                                00445000
CONCRPL  EQU   CONBUFF+1                                                00446000
CONPPEX  EQU   CONBUFF+1                                                00447000
CONNPEX  EQU   CONBUFF+1                                                00448000
CONAPEX  EQU   CONBUFF+1                                                00449000
CONWPEX  EQU   CONBUFF+1                                                00450000
CONIOEX  EQU   CONBUFF                                                  00451000
CONUECB  EQU   CONBUFF                                                  00452000
CONVPEX  EQU   CONBUFF                                                  00453000
CONVFEX  EQU   CONBUFF                                                  00454000
CONLPEX  EQU   CONBUFF                                                  00455000
CONLFEX  EQU   CONBUFF                                                  00456000
CONSPEX  EQU   CONBUFF                                                  00457000
CONSFEX  EQU   CONBUFF                                                  00458000
CONACTV  EQU   CONSTAT                                                  00459000
CONVRYIN EQU   CONSTAT                                                  00460000
CONLODED EQU   CONSTAT                                                  00461000
CONDSOPN EQU   CONSTAT                                                  00462000
CONSTOR  EQU   CONSTAT                                                  00463000
CONHSTDF EQU   CONSTAT                                                  00464000
@NM00127 EQU   CONSTAT                                                  00465000
@NM00126 EQU   CONSTAT                                                  00466000
CONIOTR  EQU   CONOPTFL                                                 00467000
CONMODTR EQU   CONOPTFL                                                 00468000
CONBTUTR EQU   CONOPTFL                                                 00469000
CONBUFTR EQU   CONOPTFL                                                 00470000
@NM00125 EQU   CONOPTFL                                                 00471000
@NM00124 EQU   CONOPTFL                                                 00472000
@NM00123 EQU   CONOPTFL                                                 00473000
CONWRMST EQU   CONOPTFL                                                 00474000
@NM00122 EQU   CONDSFLG                                                 00475000
@NM00121 EQU   CONDSFLG                                                 00476000
CONSYLST EQU   CONDSFLG                                                 00477000
CONSYLIB EQU   CONDSFLG                                                 00478000
CONSYOBJ EQU   CONDSFLG                                                 00479000
@NM00120 EQU   CONDSFLG                                                 00480000
@NM00119 EQU   CONDSFLG                                                 00481000
@NM00118 EQU   CONDSFLG                                                 00482000
CONMODFY EQU   CONAREAS+11                                              00483000
CONDISPL EQU   CONAREAS+10                                              00484000
CONVARY  EQU   CONAREAS+9                                               00485000
@NM00117 EQU   CONHALT                                                  00486000
@NM00116 EQU   CONHALT                                                  00487000
@NM00115 EQU   CONHALT                                                  00488000
@NM00114 EQU   CONHALT                                                  00489000
@NM00113 EQU   CONHALT                                                  00490000
@NM00112 EQU   CONHALT                                                  00491000
CONHLTS  EQU   CONHALT                                                  00492000
CONHLTQ  EQU   CONHALT                                                  00493000
CONLAST  EQU   CONAREAS+7                                               00494000
@NM00111 EQU   CONAREAS+6                                               00495000
CONCID   EQU   CONAREAS+4                                               00496000
CONBUFSZ EQU   CONAREAS+2                                               00497000
@NM00110 EQU   CONAREAS+1                                               00498000
CONNSNEC EQU   CONFLG01                                                 00499000
CONFTPSA EQU   CONFLG01                                                 00500000
CONFTTA  EQU   CONFLG01                                                 00501000
CONFTNSA EQU   CONFLG01                                                 00502000
CONFTNAC EQU   CONFLG01                                                 00503000
CONFTEXS EQU   CONFLG01                                                 00504000
CONFTTMR EQU   CONFLG01                                                 00505000
CONFTSTM EQU   CONFLG01                                                 00506000
CONUSSTN EQU   ISTCONFT+228                                             00507000
CONUILAA EQU   CONSRTAA                                                 00508000
CONDCDRM EQU   ISTCONFT+132                                             00509000
CONHCDRM EQU   ISTCONFT+128                                             00510000
CONINCTO EQU   ISTCONFT+124                                             00511000
CONCDCRT EQU   ISTCONFT+120                                             00512000
CONSDMLC EQU   ISTCONFT+112                                             00513000
CONSDECB EQU   ISTCONFT+108                                             00514000
CONCSCB  EQU   ISTCONFT+104                                             00515000
CONTPNCS EQU   ISTCONFT+96                                              00516000
CONDCBBA EQU   ISTCONFT+92                                              00517000
CONDCBLA EQU   ISTCONFT+88                                              00518000
CONDCBOA EQU   ISTCONFT+84                                              00519000
CONLDPRM EQU   ISTCONFT+80                                              00520000
CONRDBUF EQU   ISTCONFT+76                                              00521000
CONSTCIB EQU   ISTCONFT+72                                              00522000
CONENDLA EQU   ISTCONFT+68                                              00523000
CONVARLA EQU   ISTCONFT+64                                              00524000
CONMODLA EQU   ISTCONFT+60                                              00525000
CONHLTLA EQU   ISTCONFT+56                                              00526000
CONNCSLA EQU   ISTCONFT+52                                              00527000
CONDISLA EQU   ISTCONFT+48                                              00528000
CONCIBAD EQU   ISTCONFT+44                                              00529000
CONACB   EQU   ISTCONFT+40                                              00530000
CONFBPNM EQU   ISTCONFT+32                                              00531000
CONDMNM  EQU   ISTCONFT+24                                              00532000
CONAPSNM EQU   ISTCONFT+16                                              00533000
CONAPINM EQU   ISTCONFT+8                                               00534000
CONCONFG EQU   ISTCONFT                                                 00535000
RCDRMEND EQU   ISTRCDRM+220                                             00536000
@NM00109 EQU   ISTRCDRM+218                                             00537000
RCDRMSEQ EQU   ISTRCDRM+216                                             00538000
@NM00108 EQU   ISTRCDRM+213                                             00539000
RCDRMSC  EQU   ISTRCDRM+212                                             00540000
@NM00107 EQU   RCDRMFGS+3                                               00541000
@NM00106 EQU   RCDRMFGS+3                                               00542000
@NM00105 EQU   RCDRMFGS+3                                               00543000
@NM00104 EQU   RCDRMFGS+3                                               00544000
@NM00103 EQU   RCDRMFGS+3                                               00545000
@NM00102 EQU   RCDRMFGS+3                                               00546000
@NM00101 EQU   RCDRMFGS+3                                               00547000
RCDRMCD2 EQU   RCDRMFGS+3                                               00548000
RCDRCDRS EQU   RCDRMFGS+2                                               00549000
RCDRMDYN EQU   RCDRMFGS+2                                               00550000
RCDRMRID EQU   RCDRMFGS+2                                               00551000
RCDRMLOQ EQU   RCDRMFGS+2                                               00552000
RCDRMNMP EQU   RCDRMFGS+2                                               00553000
RCDRMPS  EQU   RCDRMFGS+2                                               00554000
RCDRMURC EQU   RCDRMFGS+2                                               00555000
RCDRMNAP EQU   RCDRMFGS+2                                               00556000
RCDRMVL  EQU   RCDRMFGS+1                                               00557000
RCDRMSPC EQU   RCDRMFGS+1                                               00558000
RCDRMINC EQU   RCDRMFGS+1                                               00559000
RCDRMLPS EQU   RCDRMFGS+1                                               00560000
RCDRMTCR EQU   RCDRMFGS+1                                               00561000
RCDRMDTC EQU   RCDRMFGS+1                                               00562000
RCDRMDT  EQU   RCDRMFGS+1                                               00563000
RCDRMCLR EQU   RCDRMFGS+1                                               00564000
RCDRMCLC EQU   RCDRMFGS                                                 00565000
RCDRMDCD EQU   RCDRMFGS                                                 00566000
RCDRMOVR EQU   RCDRMFGS                                                 00567000
RCDRMSDT EQU   RCDRMFGS                                                 00568000
RCDRMACT EQU   RCDRMFGS                                                 00569000
RCDRMSCA EQU   RCDRMFGS                                                 00570000
RCDRMPRI EQU   RCDRMFGS                                                 00571000
RCDRMHST EQU   RCDRMFGS                                                 00572000
RCDRMRP  EQU   ISTRCDRM+204                                             00573000
RCDRMLRP EQU   RCDRMRPQ+4                                               00574000
RCDRMFRP EQU   RCDRMRPQ                                                 00575000
RCDRMARP EQU   ISTRCDRM+192                                             00576000
RCDRMPDT EQU   RCDRMPDN                                                 00577000
RCDRMPR  EQU   ISTRCDRM                                                 00578000
RRNEND   EQU   ISTRRN+332                                               00579000
RRNLDRID EQU   ISTRRN+324                                               00580000
RRNCLDST EQU   ISTRRN+316                                               00581000
RRNGDSTA EQU   ISTRRN+308                                               00582000
RRNGLSTA EQU   ISTRRN+300                                               00583000
RRNLDCAT EQU   RRNLDFSM                                                 00584000
RRNVRID  EQU   ISTRRN+296                                               00585000
RRNPUXTN EQU   ISTRRN+292                                               00586000
RRNLUCT  EQU   ISTRRN+290                                               00587000
RRNPUCT  EQU   ISTRRN+288                                               00588000
RRNLPPTR EQU   ISTRRN+284                                               00589000
RRNTPPTR EQU   ISTRRN+280                                               00590000
RRNFNAEQ EQU   ISTRRN+276                                               00591000
@NM00100 EQU   ISTRRN+264                                               00592000
@NM00099 EQU   ISTRRN+260                                               00593000
RRNNMNCP EQU   ISTRRN+252                                               00594000
@NM00098 EQU   ISTRRN+249                                               00595000
RRNAMNUM EQU   ISTRRN+248                                               00596000
RRNAMLST EQU   ISTRRN+244                                               00597000
RRNCDPWE EQU   ISTRRN+240                                               00598000
RRNPUBI  EQU   RRNNMDPD+6                                               00599000
RRNDPLUB EQU   RRNNMDPD                                                 00600000
RRNINBFR EQU   ISTRRN+231                                               00601000
RRNDEFLV EQU   ISTRRN+230                                               00602000
RRNRNCUA EQU   ISTRRN+227                                               00603000
RRNRDCUA EQU   ISTRRN+224                                               00604000
RRNNCPNM EQU   ISTRRN+217                                               00605000
RRNCTPCC EQU   ISTRRN+216                                               00606000
RRNCPLUB EQU   ISTRRN+210                                               00607000
RRNDELAY EQU   ISTRRN+208                                               00608000
RRNMODL  EQU   RRNLVL+2                                                 00609000
RRNRELL  EQU   RRNLVL                                                   00610000
@NM00097 EQU   RRNBITAN+2                                               00611000
@NM00096 EQU   RRNBITAN+2                                               00612000
RRNAMLDA EQU   RRNBITAN+2                                               00613000
RRNLODNO EQU   RRNBITAN+2                                               00614000
RRNLODYS EQU   RRNBITAN+2                                               00615000
RRNRBMDL EQU   RRNBITAN+2                                               00616000
RRNALLOC EQU   RRNBITAN+2                                               00617000
RRNACQRD EQU   RRNBITAN+2                                               00618000
RRNREMPO EQU   RRNBITAN+1                                               00619000
RRNRBBUP EQU   RRNBITAN+1                                               00620000
RRNRBCT2 EQU   RRNBITAN+1                                               00621000
RRNRBCT1 EQU   RRNBITAN+1                                               00622000
RRNRBSEC EQU   RRNBITAN+1                                               00623000
RRNRBCCT EQU   RRNBITAN+1                                               00624000
RRNRBCCL EQU   RRNBITAN+1                                               00625000
RRNRBREM EQU   RRNBITAN+1                                               00626000
RRNRSYN  EQU   RRNBITAN                                                 00627000
RRNRAPEP EQU   RRNBITAN                                                 00628000
RRNRANCP EQU   RRNBITAN                                                 00629000
RRNRAOLT EQU   RRNBITAN                                                 00630000
RRNRASYN EQU   RRNBITAN                                                 00631000
RRNRADMP EQU   RRNBITAN                                                 00632000
RRNRAIPL EQU   RRNBITAN                                                 00633000
RRNRASHT EQU   RRNBITAN                                                 00634000
RRNHSTID EQU   ISTRRN+200                                               00635000
RRNHBUFS EQU   ISTRRN+198                                               00636000
RRNHLENT EQU   RRNHPRE+1                                                00637000
RRNHLENH EQU   RRNHPRE                                                  00638000
RRNNODCT EQU   ISTRRN+194                                               00639000
RRNEPADR EQU   ISTRRN+192                                               00640000
RRNCTENT EQU   ISTRRN+190                                               00641000
RRNCTECM EQU   ISTRRN+188                                               00642000
RRNCTEIN EQU   ISTRRN+186                                               00643000
RRNCTETR EQU   ISTRRN+184                                               00644000
RRNCTECL EQU   ISTRRN+182                                               00645000
RRNCTELI EQU   ISTRRN+180                                               00646000
RRNCTEGP EQU   ISTRRN+178                                               00647000
RRNCTBHS EQU   ISTRRN+176                                               00648000
RRNTABCT EQU   ISTRRN+172                                               00649000
RRNLASTE EQU   ISTRRN+168                                               00650000
RRNNCSPL EQU   ISTRRN+164                                               00651000
RRNRPLPT EQU   ISTRRN+160                                               00652000
RRNMSIZE EQU   ISTRRN+156                                               00653000
RRNFLUX  EQU   ISTRRN+152                                               00654000
RRNBHSET EQU   ISTRRN+148                                               00655000
RRNRINQP EQU   ISTRRN+144                                               00656000
RRNGRPA  EQU   ISTRRN+140                                               00657000
RRNLUBA  EQU   RRNUCBAD+1                                               00658000
RRNCHQI  EQU   RRNUCBAD                                                 00659000
@NM00095 EQU   RRNFLAG                                                  00660000
RRNACBAQ EQU   RRNFLAG                                                  00661000
RRNCHCON EQU   RRNFLAG                                                  00662000
RRNVFYLM EQU   RRNFLAG                                                  00663000
RRNLDET  EQU   RRNFLAG                                                  00664000
RRNRIMIP EQU   RRNFLAG                                                  00665000
RRNLCDIE EQU   RRNFLAG                                                  00666000
RRNLCSIP EQU   RRNFLAG                                                  00667000
RRNPRE   EQU   ISTRRN                                                   00668000
@NM00094 EQU   ISTECB+1                                                 00669000
@NM00093 EQU   @NM00091                                                 00670000
ECBCOMP  EQU   @NM00091                                                 00671000
@NM00092 EQU   @NM00091                                                 00672000
SCHLONG  EQU   ISTSCHDR+4                                               00673000
@NM00090 EQU   SCHCHAR+3                                                00674000
SCHKEY   EQU   SCHCHAR+2                                                00675000
@NM00089 EQU   SCHCHAR+1                                                00676000
@NM00088 EQU   SCHCHAR+1                                                00677000
@NM00087 EQU   SCHCHAR+1                                                00678000
@NM00086 EQU   SCHCHAR+1                                                00679000
@NM00085 EQU   SCHCHAR+1                                                00680000
@NM00084 EQU   SCHCHAR+1                                                00681000
SCHCSQAF EQU   SCHCHAR+1                                                00682000
SCHPGFR  EQU   SCHCHAR+1                                                00683000
SCHSBPL  EQU   SCHCHAR                                                  00684000
SMHLONG  EQU   ISTSMHDR+12                                              00685000
@NM00083 EQU   SMHCHAR+3                                                00686000
SMHKEY   EQU   SMHCHAR+2                                                00687000
@NM00082 EQU   SMHCHAR+1                                                00688000
@NM00081 EQU   SMHCHAR+1                                                00689000
@NM00080 EQU   SMHCHAR+1                                                00690000
@NM00079 EQU   SMHCHAR+1                                                00691000
@NM00078 EQU   SMHCHAR+1                                                00692000
@NM00077 EQU   SMHCHAR+1                                                00693000
SMHCSQAF EQU   SMHCHAR+1                                                00694000
SMHPGFR  EQU   SMHCHAR+1                                                00695000
SMHSBPL  EQU   SMHCHAR                                                  00696000
SMHCHTBF EQU   ISTSMHDR+4                                               00697000
SMHCHOBT EQU   ISTSMHDR                                                 00698000
RGPEND   EQU   ISTRGP+96                                                00699000
@NM00076 EQU   ISTRGP+95                                                00700000
@NM00075 EQU   RGPBITAN                                                 00701000
@NM00074 EQU   RGPBITAN                                                 00702000
@NM00073 EQU   RGPBITAN                                                 00703000
RGPX21SW EQU   RGPBITAN                                                 00704000
RGPASDLC EQU   RGPBITAN                                                 00705000
RGPABSC  EQU   RGPBITAN                                                 00706000
RGPASS   EQU   RGPBITAN                                                 00707000
RGPADIL  EQU   RGPBITAN                                                 00708000
@NM00072 EQU   ISTRGP+92                                                00709000
@NM00071 EQU   ISTRGP+90                                                00710000
@NM00070 EQU   ISTRGP+88                                                00711000
@NM00069 EQU   ISTRGP+86                                                00712000
@NM00068 EQU   ISTRGP+84                                                00713000
RGPPRE   EQU   ISTRGP                                                   00714000
UILEND   EQU   ISTUILTE+8                                               00715000
UILNAME  EQU   ISTUILTE                                                 00716000
LDPRSV04 EQU   ISTLDPRM+37                                              00717000
LDPRCNID EQU   ISTLDPRM+28                                              00718000
LDPTCEP  EQU   ISTLDPRM+24                                              00719000
LDPRSV02 EQU   ISTLDPRM+22                                              00720000
LDPRSV01 EQU   LDPFB2                                                   00721000
LDPTPPST EQU   LDPFB2                                                   00722000
LDPLOAD  EQU   LDPFB2                                                   00723000
LDPACTIF EQU   LDPFB2                                                   00724000
LDPATACH EQU   LDPFB2                                                   00725000
LDPFLAST EQU   LDPFB2                                                   00726000
LDPRSV03 EQU   LDPFG                                                    00727000
LDPRSYSD EQU   LDPFG                                                    00728000
LDPPB    EQU   LDPFG                                                    00729000
LDPFX    EQU   LDPFG                                                    00730000
LDPDCBA  EQU   ISTLDPRM+16                                              00731000
LDPPDS   EQU   ISTLDPRM+8                                               00732000
LDPMBR   EQU   ISTLDPRM                                                 00733000
RAPEND   EQU   ISTRAP+188                                               00734000
RAPMAXPV EQU   ISTRAP+184                                               00735000
RAPAPPWD EQU   ISTRAP+176                                               00736000
RAPACBN  EQU   ISTRAP+168                                               00737000
@NM00067 EQU   RAPBITAN+2                                               00738000
@NM00066 EQU   RAPBITAN+2                                               00739000
RAPSRTLN EQU   RAPBITAN+2                                               00740000
RAPSONSC EQU   RAPBITAN+2                                               00741000
RAPVFRR  EQU   RAPBITAN+2                                               00742000
RAPSRBX  EQU   RAPBITAN+2                                               00743000
@NM00065 EQU   RAPBITAN+2                                               00744000
RAPCSMA  EQU   RAPBITAN+2                                               00745000
RAPTSO   EQU   RAPBITAN+1                                               00746000
RAPAUTHE EQU   RAPBITAN+1                                               00747000
RAPANVPC EQU   RAPBITAN+1                                               00748000
RAPASPO  EQU   RAPBITAN+1                                               00749000
RAPAPPO  EQU   RAPBITAN+1                                               00750000
RAPAACQ  EQU   RAPBITAN+1                                               00751000
RAPAPRMT EQU   RAPBITAN+1                                               00752000
RAPAPASS EQU   RAPBITAN+1                                               00753000
RAPABLCK EQU   RAPBITAN                                                 00754000
RAPALLF  EQU   RAPBITAN                                                 00755000
RAPPARS  EQU   RAPBITAN                                                 00756000
RAPLSIZ  EQU   RAPBITAN                                                 00757000
RAPATLGN EQU   RAPBITAN                                                 00758000
RAPASLGI EQU   RAPBITAN                                                 00759000
RAPAQUI  EQU   RAPBITAN                                                 00760000
RAPABLGN EQU   RAPBITAN                                                 00761000
RAPBFACT EQU   ISTRAP+164                                               00762000
RAPBNA   EQU   ISTRAP+162                                               00763000
RAPEAS   EQU   ISTRAP+160                                               00764000
RAPACDEB EQU   ISTRAP+156                                               00765000
RAPACBA  EQU   ISTRAP+152                                               00766000
RAPENTAD EQU   ISTRAP+148                                               00767000
@NM00064 EQU   ISTRAP+146                                               00768000
RAPTRPRE EQU   ISTRAP+144                                               00769000
RAPPRE   EQU   ISTRAP                                                   00770000
RDTEND   EQU   ISTRDT+136                                               00771000
RDTVSRPL EQU   RDTCRIA+16                                               00772000
RDTCRSPW EQU   RDTCRIA+8                                                00773000
RDTCRSDS EQU   RDTCRIA                                                  00774000
@NM00063 EQU   ISTRDT+114                                               00775000
@NM00062 EQU   RDTBITAN                                                 00776000
@NM00061 EQU   RDTBITAN                                                 00777000
@NM00060 EQU   RDTBITAN                                                 00778000
RDTSSFLG EQU   RDTBITAN                                                 00779000
RDTHCDRM EQU   RDTBITAN                                                 00780000
RDTBHSET EQU   RDTBITAN                                                 00781000
RDTCDCTL EQU   RDTBITAN                                                 00782000
RDTCTPGD EQU   RDTBITAN                                                 00783000
RDTLGCT  EQU   ISTRDT+112                                               00784000
RDTNODID EQU   ISTRDT+111                                               00785000
RDTMAXID EQU   ISTRDT+110                                               00786000
@NM00059 EQU   ISTRDT+108                                               00787000
RDTVYRPH EQU   ISTRDT+104                                               00788000
RDTBACK  EQU   ISTRDT+100                                               00789000
RDTFORW  EQU   ISTRDT+96                                                00790000
RDTNAMTB EQU   ISTRDT+92                                                00791000
RDTENTAD EQU   ISTRDT+88                                                00792000
RDTLEN   EQU   RDTPLEN+1                                                00793000
RDTPRICA EQU   RDTPRIOR                                                 00794000
RDTPRILS EQU   RDTPRIOR                                                 00795000
RDTPRISW EQU   RDTPRIOR                                                 00796000
RDTPRIRN EQU   RDTPRIOR                                                 00797000
RDTPRILC EQU   RDTPRIOR                                                 00798000
RDTPRIAP EQU   RDTPRIOR                                                 00799000
RDTCDRSC EQU   RDTPRIOR                                                 00800000
RDTCDRM  EQU   RDTPRIOR                                                 00801000
RDTPRE   EQU   ISTRDT                                                   00802000
RCPEND   EQU   ISTRCPRE+144                                             00803000
RCPLGMOD EQU   ISTRCPRE+136                                             00804000
RCPDLGMD EQU   ISTRCPRE+128                                             00805000
RCPLGNAP EQU   ISTRCPRE+120                                             00806000
RCPQCNT  EQU   ISTRCPRE+118                                             00807000
@NM00058 EQU   ISTRCPRE+117                                             00808000
RCPOSAIP EQU   RCPBITAN                                                 00809000
RCPVLMSG EQU   RCPBITAN                                                 00810000
RCPCSM   EQU   RCPBITAN                                                 00811000
RCPALLOC EQU   RCPBITAN                                                 00812000
RCPSEC   EQU   RCPBITAN                                                 00813000
RCPSESSC EQU   RCPSESSM                                                 00814000
RCPSESPR EQU   RCPSESSM                                                 00815000
RCPSSCFM EQU   ISTRCPRE+114                                             00816000
RCPSTCAP EQU   RCPCYSET                                                 00817000
RCPSTRQD EQU   RCPCYSET                                                 00818000
RCPMDCAP EQU   RCPCYMOD                                                 00819000
RCPMDRQD EQU   RCPCYMOD                                                 00820000
RCPPRIM  EQU   RCPPMODE                                                 00821000
RCPCROSS EQU   RCPPMODE                                                 00822000
RCPRRECD EQU   RCPPMODE                                                 00823000
RCPRBASC EQU   RCPPMODE                                                 00824000
RCPBFLIM EQU   ISTRCPRE+112                                             00825000
RCPNCPPM EQU   RCPNCPPC+1                                               00826000
RCPNCPPN EQU   RCPNCPPC                                                 00827000
RCPPACEM EQU   RCPPACE+1                                                00828000
RCPPACEN EQU   RCPPACE                                                  00829000
RCPBHSI2 EQU   ISTRCPRE+107                                             00830000
RCPBHSI1 EQU   ISTRCPRE+106                                             00831000
RCPSESLM EQU   ISTRCPRE+104                                             00832000
RCPSESCT EQU   ISTRCPRE+102                                             00833000
RCPINTTI EQU   ISTRCPRE+100                                             00834000
RCPUSSTI EQU   ISTRCPRE+98                                              00835000
RCPMODTI EQU   ISTRCPRE+96                                              00836000
RCPLNAPA EQU   ISTRCPRE+92                                              00837000
RCPSIBS  EQU   RCPSARRY+4                                               00838000
RCPSIBP  EQU   RCPSARRY                                                 00839000
RCPPRE   EQU   ISTRCPRE                                                 00840000
RPREND   EQU   ISTRPRE+84                                               00841000
RPRDEVCH EQU   ISTRPRE+76                                               00842000
RPRCONID EQU   ISTRPRE+67                                               00843000
@NM00057 EQU   RPRFLAGS                                                 00844000
RPRDYNAM EQU   RPRFLAGS                                                 00845000
RPRNOACT EQU   RPRFLAGS                                                 00846000
RPRDAFAD EQU   RPRBITAN+4                                               00847000
RPRENTVA EQU   RPRBITAN+4                                               00848000
RPRDUMMY EQU   RPRBITAN+4                                               00849000
RPRIMPCH EQU   RPRBITAN+4                                               00850000
RPRIMPAC EQU   RPRBITAN+4                                               00851000
RPRNEO   EQU   RPRBITAN+4                                               00852000
RPRRNAA  EQU   RPRBITAN+4                                               00853000
RPRDRADD EQU   RPRBITAN+4                                               00854000
RPRFADD  EQU   RPRBITAN+3                                               00855000
RPRINTST EQU   RPRBITAN+3                                               00856000
RPRCLVPD EQU   RPRBITAN+3                                               00857000
RPRSHAD  EQU   RPRBITAN+3                                               00858000
RPRGIST  EQU   RPRBITAN+3                                               00859000
RPRRBISA EQU   RPRBITAN+3                                               00860000
RPRENTVT EQU   RPRBITAN+3                                               00861000
RPRDINOP EQU   RPRBITAN+3                                               00862000
RPRDINUS EQU   RPRBITAN+2                                               00863000
RPRCRCPT EQU   RPRBITAN+2                                               00864000
RPRNOSRT EQU   RPRBITAN+2                                               00865000
RPRDOM   EQU   RPRBITAN+2                                               00866000
RPRNOUSE EQU   RPRBITAN+2                                               00867000
RPRNOSNA EQU   RPRBITAN+2                                               00868000
RPRCLNUP EQU   RPRBITAN+2                                               00869000
RPRCONLD EQU   RPRBITAN+2                                               00870000
RPRCONP  EQU   RPRBITAN+1                                               00871000
RPRACTP  EQU   RPRBITAN+1                                               00872000
RPRINTIO EQU   RPRBITAN+1                                               00873000
RPRCONCT EQU   RPRBITAN+1                                               00874000
RPRHLVPD EQU   RPRBITAN+1                                               00875000
RPRHLACT EQU   RPRBITAN+1                                               00876000
RPRONLIN EQU   RPRBITAN+1                                               00877000
RPRRINOP EQU   RPRBITAN+1                                               00878000
RPRAOPN  EQU   RPRBITAN                                                 00879000
RPRENTVH EQU   RPRBITAN                                                 00880000
RPRLIVE  EQU   RPRBITAN                                                 00881000
RPRENTED EQU   RPRBITAN                                                 00882000
RPRLTASN EQU   RPRBITAN                                                 00883000
RPRENTIO EQU   RPRBITAN                                                 00884000
RPRENTBF EQU   RPRBITAN                                                 00885000
RPRINV   EQU   RPRBITAN                                                 00886000
RPRDEFLV EQU   RPRSTATE+4                                               00887000
RPRDESS1 EQU   RPRDESST                                                 00888000
RPRCURS1 EQU   RPRCURST                                                 00889000
RPRCMDWE EQU   ISTRPRE+52                                               00890000
RPRTNTQP EQU   ISTRPRE+48                                               00891000
RPRNSNEA EQU   ISTRPRE+44                                               00892000
RPRNCBA  EQU   ISTRPRE+40                                               00893000
RPRPELEN EQU   ISTRPRE+36                                               00894000
RPRELEN  EQU   ISTRPRE+32                                               00895000
RPRALPAD EQU   ISTRPRE+28                                               00896000
RPRENTAD EQU   ISTRPRE+24                                               00897000
RPRREQCT EQU   ISTRPRE+22                                               00898000
RPRINDEX EQU   ISTRPRE+20                                               00899000
RPRDAF   EQU   RPRDAFID+2                                               00900000
@NM00056 EQU   RPRDAFID                                                 00901000
@NM00055 EQU   ISTRPRE+15                                               00902000
RPRHDTYP EQU   ISTRPRE+14                                               00903000
RPRENTRY EQU   ISTRPRE+13                                               00904000
RPRNAME  EQU   RPRSRTHD                                                 00905000
DEVRSV01 EQU   ISTDEVCH+7                                               00906000
DEVAUXTP EQU   ISTDEVCH+6                                               00907000
DEVADVFE EQU   DEVMODE                                                  00908000
@NM00054 EQU   DEVMODE                                                  00909000
DEVBASIC EQU   DEVMODE                                                  00910000
DEVREC   EQU   DEVMODE                                                  00911000
DEVPHYSA EQU   ISTDEVCH+4                                               00912000
DEVCSLPN EQU   DEVCHAR3                                                 00913000
DEVCSTCL EQU   DEVCHAR3                                                 00914000
DEVCCHEK EQU   DEVCHAR3                                                 00915000
DEVCATTN EQU   DEVCHAR3                                                 00916000
DEVCSWL  EQU   DEVFCCTL                                                 00917000
DEVCRVB  EQU   DEVFCCTL                                                 00918000
DEVCSSL  EQU   DEVFCCTL                                                 00919000
DEVCBSC  EQU   DEVFCCTL                                                 00920000
DEVMCODE EQU   ISTDEVCH+2                                               00921000
DEVCHAR2 EQU   DEVTCODE                                                 00922000
DEVSPOLL EQU   DEVCHAR                                                  00923000
DEVCCTL  EQU   DEVCHAR                                                  00924000
DEVNNSPT EQU   DEVCHAR                                                  00925000
DEVSPS   EQU   DEVCHAR                                                  00926000
DEVSUBND EQU   DEVCHAR                                                  00927000
DEVCONVR EQU   DEVCHAR                                                  00928000
DEVOTPUT EQU   DEVCHAR                                                  00929000
DEVINPUT EQU   DEVCHAR                                                  00930000
SRTTYPE  EQU   ISTSRT+12                                                00931000
SRTSPECE EQU   SRTSRTE                                                  00932000
SRTSYMNM EQU   ISTSRT                                                   00933000
ATCAOS   EQU   ISTATCVT+2184                                            00934000
@NM00053 EQU   ISTATCVT+1928                                            00935000
ATCITECB EQU   ISTATCVT+1924                                            00936000
ATCINCTV EQU   ISTATCVT+1920                                            00937000
@NM00052 EQU   ISTATCVT+1918                                            00938000
ATCSAF   EQU   ISTATCVT+1916                                            00939000
ATCAPCSX EQU   ISTATCVT+1912                                            00940000
ATCTSC3I EQU   ISTATCVT+1908                                            00941000
ATCHWCSA EQU   ISTATCVT+1904                                            00942000
ATCAPCRM EQU   ISTATCVT+1900                                            00943000
ATCAPCFR EQU   ISTATCVT+1896                                            00944000
ATCCACSA EQU   ISTATCVT+1892                                            00945000
ATCMXCSA EQU   ISTATCVT+1888                                            00946000
ATCTPMPB EQU   ISTATCVT+1856                                            00947000
ATCRPLAC EQU   ATCRPLCN+2                                               00948000
ATCRPLRC EQU   ATCRPLCN                                                 00949000
ATCCRPLQ EQU   ATCCRPL                                                  00950000
ATCCRAAC EQU   ATCCRACN+2                                               00951000
ATCCRARC EQU   ATCCRACN                                                 00952000
ATCCRAQ  EQU   ATCCRA                                                   00953000
ATCITSAV EQU   ISTATCVT+1836                                            00954000
ATCVIOPM EQU   ISTATCVT+1832                                            00955000
ATCTPMMI EQU   ISTATCVT+1828                                            00956000
ATCPXSRB EQU   ISTATCVT+1824                                            00957000
ATCRPLCT EQU   ISTATCVT+1822                                            00958000
ATCCRACT EQU   ISTATCVT+1820                                            00959000
ATCSRBCT EQU   ISTATCVT+1818                                            00960000
ATCSTNSM EQU   ISTATCVT+1817                                            00961000
@NM00051 EQU   @NM00050                                                 00962000
ATCNOSTR EQU   @NM00050                                                 00963000
ATCVTMAB EQU   @NM00050                                                 00964000
ATCTPCP1 EQU   ISTATCVT+1812                                            00965000
ATCTPCP0 EQU   ISTATCVT+1808                                            00966000
ATCZR01  EQU   ISTATCVT+1804                                            00967000
ATCASCB  EQU   ISTATCVT+1800                                            00968000
ATCMPSTQ EQU   ISTATCVT+1796                                            00969000
ATCOCCSM EQU   ISTATCVT+1792                                            00970000
ATCPSTA  EQU   ISTATCVT+1788                                            00971000
@NM00049 EQU   ATCVTFLG                                                 00972000
ATCVTACT EQU   ATCVTFLG                                                 00973000
@NM00048 EQU   ISTATCVT+1732                                            00974000
ATCTRMWA EQU   ISTATCVT+1728                                            00975000
ATCCSCBG EQU   ATCCSCB                                                  00976000
@NM00047 EQU   ISTATCVT+1723                                            00977000
ATCSNUF  EQU   ATCENFLG                                                 00978000
ATCOPKL  EQU   ATCENFLG                                                 00979000
ATCABEN  EQU   ATCENFLG                                                 00980000
ATCSRDN  EQU   ATCENFLG                                                 00981000
ATCDLDN  EQU   ATCENFLG                                                 00982000
ATCACTRM EQU   ISTATCVT+1720                                            00983000
ATCSMABF EQU   ISTATCVT+1716                                            00984000
ATCSMAPR EQU   ISTATCVT+1712                                            00985000
ATCSMAID EQU   ISTATCVT+1708                                            00986000
ATCSMARA EQU   ISTATCVT+1704                                            00987000
ATCCACXA EQU   ISTATCVT+1700                                            00988000
ATCATA10 EQU   ISTATCVT+1696                                            00989000
ATCHLTCB EQU   ISTATCVT+1692                                            00990000
ATCCCOOC EQU   ISTATCVT+1688                                            00991000
ATCAIWT  EQU   ISTATCVT+1684                                            00992000
ATCOROBT EQU   ISTATCVT+1680                                            00993000
ATCPXCRA EQU   ISTATCVT+1676                                            00994000
ATCGSRBF EQU   ATCGSRBG                                                 00995000
ATCTSCPC EQU   ISTATCVT+1668                                            00996000
ATCCDTCB EQU   ISTATCVT+1664                                            00997000
ATCORFRL EQU   ISTATCVT+1660                                            00998000
ATCORFPX EQU   ISTATCVT+1656                                            00999000
ATCORFMG EQU   ISTATCVT+1652                                            01000000
ATCSMBQ  EQU   ISTATCVT+1648                                            01001000
ATCINFDD EQU   ISTATCVT+1644                                            01002000
@NM00046 EQU   ATCDAPVT+22                                              01003000
ATCDAPDG EQU   ATCDAPVT+20                                              01004000
ATCDXCEA EQU   ATCDAPVT+16                                              01005000
ATCDCEA  EQU   ATCDAPVT+12                                              01006000
ATCDPCIA EQU   ATCDAPVT+8                                               01007000
ATCDSIOA EQU   ATCDAPVT+4                                               01008000
ATCDEOEA EQU   ATCDAPVT                                                 01009000
ATCZLAEA EQU   ATCLDAPP+16                                              01010000
ATCZLCEA EQU   ATCLDAPP+12                                              01011000
ATCZLPCI EQU   ATCLDAPP+8                                               01012000
ATCSMFRR EQU   ATCLDAPP+4                                               01013000
ATCCDTID EQU   ATCLDAPP                                                 01014000
ATCTRMPB EQU   ISTATCVT+1568                                            01015000
ATCORQG  EQU   ATCORSRB                                                 01016000
ATCORTBF EQU   ATCSQAFR                                                 01017000
@NM00045 EQU   ISTATCVT+1560                                            01018000
@NM00044 EQU   ISTATCVT+1556                                            01019000
ATCTSCLR EQU   ISTATCVT+1552                                            01020000
ATCTSCX5 EQU   ATCXCNCB+4                                               01021000
ATCTSCXT EQU   ATCXCNCB                                                 01022000
ATCTSCXB EQU   ISTATCVT+1540                                            01023000
ATCTSCXS EQU   ISTATCVT+1536                                            01024000
ATCTSCPD EQU   ISTATCVT+1532                                            01025000
ATCCDCNE EQU   ISTATCVT+1528                                            01026000
@NM00043 EQU   ISTATCVT+1526                                            01027000
ATCHASHN EQU   ISTATCVT+1524                                            01028000
ATCNOST  EQU   ISTATCVT+1520                                            01029000
ATCSMMWA EQU   ISTATCVT+1516                                            01030000
ATCSDCFR EQU   ISTATCVT+1512                                            01031000
ATCTSCRA EQU   ISTATCVT+1508                                            01032000
ATCSOCNT EQU   ISTATCVT+1504                                            01033000
ATCSOTHR EQU   ISTATCVT+1502                                            01034000
ATCSOPR2 EQU   ISTATCVT+1501                                            01035000
ATCSOPR1 EQU   ISTATCVT+1500                                            01036000
ATCAPCAT EQU   ISTATCVT+1496                                            01037000
ATCTSCWU EQU   ISTATCVT+1492                                            01038000
ATCMWRDT EQU   ISTATCVT+1488                                            01039000
ATCSTCK  EQU   ISTATCVT+1480                                            01040000
ATCWUPAB EQU   ATCWUDYP+16                                              01041000
@NM00042 EQU   ATCWUDYP                                                 01042000
ATCLKCNT EQU   ATCLKSWP+4                                               01043000
ATCCLOCK EQU   ATCLKSWP                                                 01044000
ATCNCBQ  EQU   ISTATCVT+1436                                            01045000
ATCPUCWC EQU   ISTATCVT+1432                                            01046000
ATCTSCQV EQU   ISTATCVT+1428                                            01047000
ATCTSCQU EQU   ISTATCVT+1424                                            01048000
ATCTSCQM EQU   ISTATCVT+1420                                            01049000
ATCTSCQF EQU   ISTATCVT+1416                                            01050000
ATCAPCVR EQU   ISTATCVT+1412                                            01051000
ATCHSQLK EQU   ISTATCVT+1408                                            01052000
ATCICIDM EQU   ISTATCVT+1406                                            01053000
ATCYRANG EQU   ISTATCVT+1405                                            01054000
ATCDRNUM EQU   ISTATCVT+1404                                            01055000
ATCSACNT EQU   ISTATCVT+1400                                            01056000
ATCTSCFA EQU   ISTATCVT+1396                                            01057000
ATCCDCVR EQU   ISTATCVT+1392                                            01058000
ATCCDCRI EQU   ISTATCVT+1388                                            01059000
ATCCDCRT EQU   ISTATCVT+1384                                            01060000
ATCVRNDX EQU   ISTATCVT+1380                                            01061000
@NM00041 EQU   ISTATCVT+1376                                            01062000
ATCPSTLK EQU   ISTATCVT+1372                                            01063000
ATCOCAOA EQU   ISTATCVT+1368                                            01064000
ATCPUCEF EQU   ISTATCVT+1364                                            01065000
ATCPUCBM EQU   ISTATCVT+1360                                            01066000
ATCAPCES EQU   ISTATCVT+1356                                            01067000
ATCAPCPC EQU   ISTATCVT+1352                                            01068000
ATCAPCTE EQU   ISTATCVT+1348                                            01069000
ATCAPCIN EQU   ISTATCVT+1344                                            01070000
ATCAPCPD EQU   ISTATCVT+1340                                            01071000
ATCAPCAD EQU   ISTATCVT+1336                                            01072000
ATCAPCSD EQU   ISTATCVT+1332                                            01073000
ATCAPCIE EQU   ISTATCVT+1328                                            01074000
ATCAPCUE EQU   ISTATCVT+1324                                            01075000
ATCAPCRP EQU   ISTATCVT+1320                                            01076000
ATCAPCRS EQU   ISTATCVT+1316                                            01077000
ATCAPCTP EQU   ISTATCVT+1312                                            01078000
ATCAPCTW EQU   ISTATCVT+1308                                            01079000
ATCAPCPS EQU   ISTATCVT+1304                                            01080000
ATCAPCTS EQU   ISTATCVT+1300                                            01081000
ATCAPCTQ EQU   ISTATCVT+1296                                            01082000
ATCAPCTX EQU   ISTATCVT+1292                                            01083000
ATCSDCOS EQU   ISTATCVT+1288                                            01084000
ATCEXCVR EQU   ISTATCVT+1284                                            01085000
ATCCPCSV EQU   ISTATCVT+1280                                            01086000
ATCVRECB EQU   ATCVRTIL+12                                              01087000
ATCVRLCK EQU   ATCVRTIL+8                                               01088000
ATCVRWEL EQU   ATCVRTIL+4                                               01089000
ATCVRWEQ EQU   ATCVRTIL                                                 01090000
ATCMGPAB EQU   ISTATCVT+1248                                            01091000
ATCTSCMS EQU   ISTATCVT+1244                                            01092000
ATCVRATB EQU   ISTATCVT+1240                                            01093000
ATCVRWAP EQU   ISTATCVT+1236                                            01094000
ATCPVRAQ EQU   ISTATCVT+1232                                            01095000
ATCTOWA  EQU   ISTATCVT+1228                                            01096000
ATCTOD2  EQU   ATCTOD+4                                                 01097000
ATCTOD1  EQU   ATCTOD                                                   01098000
ATCERTP  EQU   ISTATCVT+1216                                            01099000
ATCBINDQ EQU   ISTATCVT+1212                                            01100000
ATCTIMER EQU   ISTATCVT+1208                                            01101000
ATCTSCDN EQU   ISTATCVT+1204                                            01102000
ATCTSCCN EQU   ISTATCVT+1200                                            01103000
ATCTSCL0 EQU   ISTATCVT+1196                                            01104000
ATCTSCP2 EQU   ISTATCVT+1192                                            01105000
ATCTSC3S EQU   ISTATCVT+1188                                            01106000
ATCTSC3R EQU   ISTATCVT+1184                                            01107000
ATCTSC3O EQU   ISTATCVT+1180                                            01108000
ATCIOPRG EQU   ATCIOINT                                                 01109000
ATCTSCMI EQU   ISTATCVT+1172                                            01110000
ATCTSCMO EQU   ISTATCVT+1168                                            01111000
ATCTSCP4 EQU   ISTATCVT+1164                                            01112000
ATCPUSCT EQU   ISTATCVT+1160                                            01113000
ATCTKINT EQU   ATCTKFLD+2                                               01114000
ATCTKCNT EQU   ATCTKFLD                                                 01115000
ATCTIMCK EQU   ISTATCVT+1152                                            01116000
@NM00040 EQU   ATCRID+2                                                 01117000
ATCCDRMA EQU   ATCRID                                                   01118000
ATCCPCGD EQU   ISTATCVT+1140                                            01119000
@NM00039 EQU   ATCSMSDQ+8                                               01120000
@NM00038 EQU   ATCSMSDQ+4                                               01121000
@NM00037 EQU   ATCSMSDQ                                                 01122000
ATCSEQNO EQU   ISTATCVT+1124                                            01123000
ATCSMPMD EQU   ISTATCVT+1120                                            01124000
ATCPAREA EQU   ISTATCVT+1116                                            01125000
ATCCPCSM EQU   ISTATCVT+1112                                            01126000
ATCSQCDS EQU   ISTATCVT+1108                                            01127000
ATCUSSVT EQU   ISTATCVT+1104                                            01128000
ATCNOSQ  EQU   ISTATCVT+1100                                            01129000
ATCINCIP EQU   ATCCPDVT+4                                               01130000
ATCTSCNI EQU   ATCCPDVT                                                 01131000
ATCMGCRT EQU   ISTATCVT+1088                                            01132000
ATCMACRT EQU   ISTATCVT+1084                                            01133000
ATCCSMT  EQU   ISTATCVT+1080                                            01134000
ATCINCNO EQU   ISTATCVT+1076                                            01135000
ATCRACON EQU   ISTATCVT+1072                                            01136000
ATCCFCDR EQU   ISTATCVT+1068                                            01137000
ATCONFIG EQU   ISTATCVT+1060                                            01138000
ATCNODEL EQU   ISTATCVT+1052                                            01139000
ATCCDTIM EQU   ISTATCVT+1050                                            01140000
ATCNMCTR EQU   ISTATCVT+1048                                            01141000
ATCPOIA  EQU   ATCRNO+1                                                 01142000
@NM00036 EQU   ATCRNO                                                   01143000
ATCHBSIZ EQU   ATCHPGM+2                                                01144000
ATCHBFNO EQU   ATCHPGM                                                  01145000
ATCMROUT EQU   ISTATCVT+1031                                            01146000
ATCXRANG EQU   ISTATCVT+1030                                            01147000
ATCMAXID EQU   ISTATCVT+1029                                            01148000
ATCMSGSP EQU   ISTATCVT+1028                                            01149000
ATCECTLP EQU   ISTATCVT+1024                                            01150000
ATCECSES EQU   ISTATCVT+1020                                            01151000
ATCECDSP EQU   ISTATCVT+1016                                            01152000
ATCECVRY EQU   ISTATCVT+1012                                            01153000
ATCECHLT EQU   ISTATCVT+1008                                            01154000
ATCECMOD EQU   ISTATCVT+1004                                            01155000
ATCRDTLK EQU   ISTATCVT+1000                                            01156000
ATCVOCLK EQU   ISTATCVT+996                                             01157000
ATCCIDM  EQU   ISTATCVT+994                                             01158000
ATCITLIM EQU   ISTATCVT+992                                             01159000
ATCTMINV EQU   ISTATCVT+990                                             01160000
ATCHOSTA EQU   ISTATCVT+988                                             01161000
ATCPUNSA EQU   ISTATCVT+986                                             01162000
ATCVTMID EQU   ATCSSCPA                                                 01163000
ATCHCNID EQU   ATCONID+2                                                01164000
ATCSCNID EQU   ATCONID                                                  01165000
@NM00035 EQU   ATCBITAN+3                                               01166000
@NM00034 EQU   ATCBITAN+2                                               01167000
@NM00033 EQU   ATCFLAG2                                                 01168000
ATCMSGID EQU   ATCFLAG2                                                 01169000
ATCINACT EQU   ATCFLAG2                                                 01170000
ATCCRYPF EQU   ATCFLAG2                                                 01171000
ATCTUNCL EQU   ATCFLAG2                                                 01172000
ATCTUNRQ EQU   ATCFLAG2                                                 01173000
ATCTUNAC EQU   ATCFLAG2                                                 01174000
ATCCDLRA EQU   ATCFLAG2                                                 01175000
@NM00032 EQU   ATCBITAN                                                 01176000
@NM00031 EQU   ATCSTAT4                                                 01177000
@NM00030 EQU   ATCSTAT4                                                 01178000
@NM00029 EQU   ATCSTAT4                                                 01179000
@NM00028 EQU   ATCSTAT4                                                 01180000
@NM00027 EQU   ATCSTAT4                                                 01181000
@NM00026 EQU   ATCSTAT4                                                 01182000
ATCNCSD  EQU   ATCSTAT4                                                 01183000
ATCMTST  EQU   ATCSTAT4                                                 01184000
@NM00025 EQU   ATCPOFLG                                                 01185000
@NM00024 EQU   ATCPOFLG                                                 01186000
@NM00023 EQU   ATCPOFLG                                                 01187000
@NM00022 EQU   ATCPOFLG                                                 01188000
@NM00021 EQU   ATCPOFLG                                                 01189000
@NM00020 EQU   ATCPOFLG                                                 01190000
@NM00019 EQU   ATCPOFLG                                                 01191000
ATCPOUNS EQU   ATCPOFLG                                                 01192000
ATCITEXT EQU   @NM00018                                                 01193000
ATCHIP   EQU   ATCSTAT1                                                 01194000
ATCMDHLT EQU   ATCSTAT1                                                 01195000
ATCINHLT EQU   ATCSTAT1                                                 01196000
ATCNETSL EQU   ATCSTAT1                                                 01197000
ATCQKHLT EQU   ATCSTAT1                                                 01198000
ATCSNHLT EQU   ATCSTAT1                                                 01199000
ATCACTIV EQU   ATCSTAT1                                                 01200000
ATCSTART EQU   ATCSTAT1                                                 01201000
ATCNOP00 EQU   ISTATCVT+968                                             01202000
ATCTSBUF EQU   ISTATCVT+964                                             01203000
ATCSSOQH EQU   ISTATCVT+960                                             01204000
ATCSSIQH EQU   ISTATCVT+956                                             01205000
ATCTSCMB EQU   ATCMBDVT                                                 01206000
ATCSOPAC EQU   ISTATCVT+950                                             01207000
ATCSOTIM EQU   ISTATCVT+948                                             01208000
ATCTSCON EQU   ATCSODVT                                                 01209000
ATCTSCSC EQU   ATCSSDVT                                                 01210000
ATCTSCRO EQU   ISTATCVT+936                                             01211000
ATCTSCRI EQU   ISTATCVT+932                                             01212000
ATCFEPT  EQU   ISTATCVT+928                                             01213000
ATCFDVT  EQU   ISTATCVT+924                                             01214000
ATCSIBQ  EQU   ISTATCVT+916                                             01215000
ATCDSPLQ EQU   ISTATCVT+912                                             01216000
ATCVARYQ EQU   ISTATCVT+908                                             01217000
ATCHALTQ EQU   ISTATCVT+904                                             01218000
ATCMODQ  EQU   ISTATCVT+900                                             01219000
ATCSRT   EQU   ISTATCVT+896                                             01220000
ATCRDT   EQU   ISTATCVT+892                                             01221000
ATCSDVT  EQU   ISTATCVT+888                                             01222000
ATCDLRPT EQU   ISTATCVT+884                                             01223000
ATCBPDA  EQU   ISTATCVT+880                                             01224000
ATCACDA  EQU   ISTATCVT+876                                             01225000
ATCMNT   EQU   ISTATCVT+872                                             01226000
ATCNODDS EQU   ISTATCVT+868                                             01227000
ATCITRT  EQU   ISTATCVT+864                                             01228000
ATCTODVT EQU   ISTATCVT+860                                             01229000
ATCTRCPT EQU   ISTATCVT+856                                             01230000
ATCMODTB EQU   ISTATCVT+852                                             01231000
ATCUSSPT EQU   ISTATCVT+848                                             01232000
ATCTUBUF EQU   ISTATCVT+844                                             01233000
ATCTACB  EQU   ISTATCVT+840                                             01234000
ATCDWA   EQU   ISTATCVT+836                                             01235000
ATCCFCR2 EQU   ATCPODVT                                                 01236000
ATCPULQB EQU   @NM00017+16                                              01237000
ATCMCQAB EQU   @NM00017+12                                              01238000
ATCLUSMQ EQU   @NM00017+8                                               01239000
ATCLUIOQ EQU   @NM00017+4                                               01240000
ATCIOLQB EQU   @NM00017                                                 01241000
ATCTSCAP EQU   ATCANYDT                                                 01242000
ATCTSCCO EQU   ATCLUDVT+4                                               01243000
ATCTSCSR EQU   ATCLUDVT                                                 01244000
ATCVTLOD EQU   ISTATCVT+796                                             01245000
ATCTSCLF EQU   @NM00016                                                 01246000
ATCTSCLE EQU   ISTATCVT+788                                             01247000
ATCTSCLB EQU   ISTATCVT+784                                             01248000
ATCTSCLS EQU   ISTATCVT+780                                             01249000
ATCTSCCF EQU   ATCTSCUF                                                 01250000
ATCTSCFV EQU   ISTATCVT+772                                             01251000
ATCTSCCE EQU   ISTATCVT+768                                             01252000
ATCTSCCB EQU   ISTATCVT+764                                             01253000
ATCTSCWS EQU   ISTATCVT+760                                             01254000
ATCTSCEM EQU   ISTATCVT+756                                             01255000
ATCTSCNS EQU   ISTATCVT+752                                             01256000
ATCTSCER EQU   ISTATCVT+748                                             01257000
ATCTSCPR EQU   ISTATCVT+744                                             01258000
ATCTSCGR EQU   ISTATCVT+740                                             01259000
ATCTSCCI EQU   ATCTSCIO                                                 01260000
ATCTSVT  EQU   ISTATCVT+732                                             01261000
ATCDVLOD EQU   ISTATCVT+728                                             01262000
ATCCDCNR EQU   ISTATCVT+724                                             01263000
ATCCDCNF EQU   ISTATCVT+720                                             01264000
ATCCDCND EQU   ISTATCVT+716                                             01265000
ATCCDCNA EQU   ISTATCVT+712                                             01266000
ATCCDCCP EQU   ISTATCVT+708                                             01267000
ATCCDFDN EQU   ISTATCVT+704                                             01268000
ATCCDFIN EQU   ISTATCVT+700                                             01269000
ATCCDFND EQU   ISTATCVT+696                                             01270000
ATCCDDEL EQU   ISTATCVT+692                                             01271000
ATCCDADD EQU   ISTATCVT+688                                             01272000
ATCTCLIM EQU   ISTATCVT+684                                             01273000
ATCRACTR EQU   ISTATCVT+680                                             01274000
ATCRACTI EQU   ISTATCVT+676                                             01275000
ATCREMOV EQU   ISTATCVT+672                                             01276000
ATCRACIO EQU   ISTATCVT+668                                             01277000
ATCADD   EQU   ISTATCVT+664                                             01278000
ATCPUCRT EQU   ISTATCVT+660                                             01279000
ATCSMRS  EQU   ISTATCVT+656                                             01280000
ATCSMRQ  EQU   ISTATCVT+652                                             01281000
ATCORCAF EQU   ISTATCVT+648                                             01282000
ATCFRSTR EQU   ATCGTSTR                                                 01283000
ATCSTMA  EQU   ISTATCVT+640                                             01284000
ATCSRTAD EQU   ISTATCVT+636                                             01285000
ATCOCCFS EQU   ISTATCVT+632                                             01286000
ATCOCCFP EQU   ISTATCVT+628                                             01287000
ATCSRTDF EQU   ISTATCVT+624                                             01288000
ATCLUCRT EQU   ISTATCVT+620                                             01289000
ATCINCY5 EQU   ISTATCVT+616                                             01290000
ATCINCW3 EQU   ISTATCVT+612                                             01291000
ATCINCU6 EQU   ISTATCVT+608                                             01292000
ATCINCTQ EQU   ISTATCVT+604                                             01293000
ATCINCS1 EQU   ISTATCVT+600                                             01294000
ATCSRTAB EQU   ISTATCVT+596                                             01295000
ATCINCRD EQU   ISTATCVT+592                                             01296000
ATCINCPH EQU   ISTATCVT+588                                             01297000
ATCINCLQ EQU   ISTATCVT+584                                             01298000
ATCNOCRT EQU   ISTATCVT+580                                             01299000
ATCINCF1 EQU   ISTATCVT+576                                             01300000
ATCINCCI EQU   ISTATCVT+572                                             01301000
ATCINCCO EQU   ISTATCVT+568                                             01302000
ATCBLDLA EQU   ISTATCVT+564                                             01303000
ATCALOAD EQU   ISTATCVT+560                                             01304000
ATCADEL  EQU   ISTATCVT+556                                             01305000
ATCRACEP EQU   ISTATCVT+552                                             01306000
ATCESC01 EQU   ISTATCVT+548                                             01307000
ATCDEC01 EQU   ISTATCVT+544                                             01308000
ATCDEC00 EQU   ISTATCVT+540                                             01309000
ATCCPCRT EQU   ISTATCVT+536                                             01310000
ATCAP35  EQU   ISTATCVT+532                                             01311000
ATCCPCFR EQU   ISTATCVT+528                                             01312000
ATCCPCGR EQU   ISTATCVT+524                                             01313000
ATCCPCPP EQU   ISTATCVT+520                                             01314000
ATCCPCNT EQU   ISTATCVT+516                                             01315000
ATCAUTHA EQU   ISTATCVT+512                                             01316000
ATCACCTA EQU   ISTATCVT+508                                             01317000
ATCMSGP  EQU   ISTATCVT+504                                             01318000
ATCAP39  EQU   ISTATCVT+500                                             01319000
ATCAP36  EQU   ISTATCVT+496                                             01320000
ATCMSGM  EQU   ISTATCVT+492                                             01321000
ATCAP33  EQU   ISTATCVT+488                                             01322000
ATCAICPT EQU   ISTATCVT+484                                             01323000
ATCAPI   EQU   ISTATCVT+480                                             01324000
ATCACC01 EQU   ISTATCVT+476                                             01325000
ATCACC00 EQU   ISTATCVT+472                                             01326000
ATCMBPAB EQU   ISTATCVT+456                                             01327000
ATCSOPAB EQU   ISTATCVT+440                                             01328000
ATCSSPAB EQU   ISTATCVT+424                                             01329000
ATCLDECB EQU   ATCLDTIL+12                                              01330000
ATCLDLCK EQU   ATCLDTIL+8                                               01331000
ATCLDLST EQU   ATCLDTIL+4                                               01332000
ATCLDNCS EQU   ATCLDTIL                                                 01333000
ATCNOSPB EQU   ISTATCVT+376                                             01334000
ATCNSPAB EQU   ISTATCVT+344                                             01335000
ATCLUSRT EQU   ISTATCVT+312                                             01336000
ATCPUIOP EQU   ISTATCVT+280                                             01337000
ATCPUPAB EQU   ISTATCVT+248                                             01338000
ATCPXPAB EQU   ISTATCVT+216                                             01339000
ATCPOPAB EQU   ISTATCVT+184                                             01340000
ATCVDPAB EQU   ISTATCVT+152                                             01341000
ATCTCIPB EQU   ISTATCVT+120                                             01342000
ATCCSPAB EQU   ATCSMPAB+16                                              01343000
@NM00015 EQU   ATCSMPAB                                                 01344000
ATCTMRPB EQU   ISTATCVT+56                                              01345000
ATCITPAB EQU   ISTATCVT+24                                              01346000
@NM00014 EQU   ATCITRA1+1                                               01347000
ATCITCIO EQU   ATCITRA1                                                 01348000
ATCITSCP EQU   ATCITRA1                                                 01349000
ATCITMSG EQU   ATCITRA1                                                 01350000
ATCITPIU EQU   ATCITRA1                                                 01351000
ATCITSMS EQU   ATCITRA1                                                 01352000
ATCITPSS EQU   ATCITRA1                                                 01353000
ATCITLCK EQU   ATCITRA1                                                 01354000
ATCITAPI EQU   ATCITRA1                                                 01355000
ATCITCNT EQU   ATCITFLG                                                 01356000
ATCITRPH EQU   ATCITCDS                                                 01357000
ATCITTBL EQU   ATCITFLD+4                                               01358000
ATCITMAX EQU   ATCITPRM                                                 01359000
ATCPTCHA EQU   ATCRPTCH+4                                               01360000
ATCVTLVL EQU   ATCRPTCH                                                 01361000
RPHUPSTA EQU   ISTRPH+100                                               01362000
RPHSAV16 EQU   RPHWORK+60                                               01363000
RPHSAV15 EQU   RPHWORK+56                                               01364000
RPHSAV14 EQU   RPHWORK+52                                               01365000
RPHSAV13 EQU   RPHWORK+48                                               01366000
RPHSAV12 EQU   RPHWORK+44                                               01367000
RPHSAV11 EQU   RPHWORK+40                                               01368000
RPHSAV10 EQU   RPHWORK+36                                               01369000
RPHSAVE9 EQU   RPHWORK+32                                               01370000
RPHSAVE8 EQU   RPHWORK+28                                               01371000
RPHSAVE7 EQU   RPHWORK+24                                               01372000
RPHSAVE6 EQU   RPHWORK+20                                               01373000
RPHSAVE5 EQU   RPHWORK+16                                               01374000
RPHSAVE4 EQU   RPHWORK+12                                               01375000
RPHSAVE3 EQU   RPHWORK+8                                                01376000
RPHSAVE2 EQU   RPHWORK+4                                                01377000
RPHSHALF EQU   RPHSAVE1+2                                               01378000
RPHSBIT8 EQU   RPHSBITS                                                 01379000
RPHSBIT7 EQU   RPHSBITS                                                 01380000
RPHSBIT6 EQU   RPHSBITS                                                 01381000
RPHSBIT5 EQU   RPHSBITS                                                 01382000
RPHSBIT4 EQU   RPHSBITS                                                 01383000
RPHSBIT3 EQU   RPHSBITS                                                 01384000
RPHSBIT2 EQU   RPHSBITS                                                 01385000
RPHSBIT1 EQU   RPHSBITS                                                 01386000
RPHSBYTE EQU   RPHSAVE1                                                 01387000
RPHCRR   EQU   ISTRPH+32                                                01388000
RPHSRP34 EQU   RPHSRPRM+2                                               01389000
RPHSRP12 EQU   RPHSRPRM                                                 01390000
RPHWEGT  EQU   RPHWEA                                                   01391000
RPHMAJCB EQU   ISTRPH+21                                                01392000
RPHPABOF EQU   ISTRPH+20                                                01393000
RPHRESUM EQU   RPHRESMA+1                                               01394000
@NM00013 EQU   RPHWPFLG                                                 01395000
RPHPURGE EQU   RPHWPFLG                                                 01396000
RPHPT    EQU   RPHWPFLG                                                 01397000
RPHWT    EQU   RPHWPFLG                                                 01398000
RPHRSKEY EQU   RPHWPFLG                                                 01399000
RPHDVTA  EQU   ISTRPH+12                                                01400000
RPHTIK   EQU   RPHTSKID+3                                               01401000
@NM00012 EQU   RPHTSKID                                                 01402000
RPHRPHAP EQU   RPHRPHA+1                                                01403000
@NM00011 EQU   RPHRPHA                                                  01404000
RPHGATE  EQU   RPHRPHA                                                  01405000
@NM00010 EQU   RPHFLGB                                                  01406000
RPHABEND EQU   RPHFLGB                                                  01407000
RPHUWAIT EQU   RPHFLGB                                                  01408000
RPHRLCRA EQU   RPHFLGB                                                  01409000
RPHSYNCH EQU   RPHFLGB                                                  01410000
RPHPGCMP EQU   RPHFLGB                                                  01411000
RPHLOCK  EQU   RPHFLGB                                                  01412000
@NM00009 EQU   RPHFLAGS                                                 01413000
RPHSMCLR EQU   RPHFLAGS                                                 01414000
RPHSMTYP EQU   RPHFLAGS                                                 01415000
RPHSMQ   EQU   RPHFLAGS                                                 01416000
RPHLNGTH EQU   RPHCNTL+1                                                01417000
RPHTYPE  EQU   RPHCNTL                                                  01418000
DYPPAB   EQU   ISTDYPAB+16                                              01419000
DYPOCRPH EQU   DYPPACMD                                                 01420000
DYPTSKID EQU   ISTDYPAB+8                                               01421000
DYPPACTB EQU   DYPCHAIN                                                 01422000
DYPFLGS  EQU   ISTDYPAB+2                                               01423000
DYPLNGTH EQU   ISTDYPAB+1                                               01424000
DYPTYPE  EQU   ISTDYPAB                                                 01425000
PABRPHA  EQU   PABRPHFG+1                                               01426000
@NM00007 EQU   PABFLAGS                                                 01427000
PABKPRPH EQU   PABFLAGS                                                 01428000
PABNODQ  EQU   PABFLAGS                                                 01429000
PABXTND  EQU   PABFLAGS                                                 01430000
PABSYNCH EQU   PABFLAGS                                                 01431000
PABCDP   EQU   PABFLAGS                                                 01432000
PABUNCON EQU   PABFLAGS                                                 01433000
PABDVTA  EQU   ISTPAB+9                                                 01434000
PABOFFST EQU   ISTPAB+8                                                 01435000
PABCHNGP EQU   PABCHAIN+1                                               01436000
@NM00006 EQU   PABCHAIN                                                 01437000
PABCHNG  EQU   PABCHAIN                                                 01438000
PABWEQP  EQU   PABWEQA+1                                                01439000
@NM00005 EQU   PABWEQA                                                  01440000
PABWEQG  EQU   PABWEQA                                                  01441000
LOKXCL   EQU   @NM00003                                                 01442000
LOKPRY   EQU   @NM00003                                                 01443000
@NM00004 EQU   @NM00003                                                 01444000
@NM00002 EQU   LOKCHNG                                                  01445000
LOKCT    EQU   ISTLOK                                                   01446000
@NM00001 EQU   CITSAVE                                                  01447000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01448000
@RF00198 EQU   CITTREL                                                  01449000
@RF00202 EQU   CITTREL                                                  01450000
@RF00206 EQU   CITTREL                                                  01451000
@ENDDATA EQU   *                                                        01452000
         END   ISTINCIT,(C'PLS2246',0702,80241)                         01453000
./  ADD  SSI=02320554,NAME=ISTINCRS
         TITLE 'ISTINCRS - READ RECORD ROUTINE'                         00001000
ISTINCRS CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTINCRS  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         ST    @13,@SA00001+4                                      0001 00013000
         LA    @09,@SA00001                                        0001 00014000
         ST    @09,8(,@13)                                         0001 00015000
         LR    @13,@09                                             0001 00016000
         PRINT OFF                                                      00017000
         PRINT ON                                                       00018000
*   RDPRMPTR=R1;                    /* REBASE PARM LIST      @ZA03720*/ 00019000
         LR    RDPRMPTR,R1                                         0058 00020000
*   DCBPTR=RSPDCBA;                 /* ADDR OF DCB           @ZA03720*/ 00021000
         L     DCBPTR,RSPDCBA(,RDPRMPTR)                           0059 00022000
*   IF RSPMEMBN=XZEROS THEN         /* IF ZERO NO NEED TO FIND       */ 00023000
         CLC   RSPMEMBN(8,RDPRMPTR),XZEROS                         0060 00024000
         BNE   @RF00060                                            0060 00025000
*     RTNCDE=0;                     /* INDICATE FIND NOT NEEDED      */ 00026000
         SLR   @09,@09                                             0061 00027000
         ST    @09,RTNCDE                                          0061 00028000
*   ELSE                                                           0062 00029000
*     DO;                                                          0062 00030000
         B     @RC00060                                            0062 00031000
@RF00060 DS    0H                                                  0063 00032000
*       R3=ADDR(RSPMEMBN);          /* ADDR OF MEMBER NAME           */ 00033000
         LA    R3,RSPMEMBN(,RDPRMPTR)                              0063 00034000
*       GEN REFS(DCBPTR,R3)(FIND (2),(3),D);/*               @ZA03720*/ 00035000
         FIND (2),(3),D                                                 00036000
*       IF R15¬=0 THEN              /* TEST FOR ERROR FROM FIND      */ 00037000
         LTR   R15,R15                                             0065 00038000
         BZ    @RF00065                                            0065 00039000
*         RTNCDE=12;                /* MEMBER NOT FOUND      @ZA03720*/ 00040000
         MVC   RTNCDE(4),@CF00032                                  0066 00041000
*       ELSE                        /* MEMBER FOUND          @ZA03720*/ 00042000
*         DO;                       /*                       @ZA03720*/ 00043000
         B     @RC00065                                            0067 00044000
@RF00065 DS    0H                                                  0068 00045000
*           DONTREAD='0'B;          /* INDICATE READ REQUIRD @ZA03720*/ 00046000
         NI    DONTREAD,B'01111111'                                0068 00047000
*           RTNCDE=0;               /* INDICATE FIND SUCCESS @ZA03720*/ 00048000
         SLR   @09,@09                                             0069 00049000
         ST    @09,RTNCDE                                          0069 00050000
*         END;                      /*                       @ZA03720*/ 00051000
*     END;                                                         0071 00052000
@RC00065 DS    0H                                                  0072 00053000
*   IF RTNCDE=0 THEN                /* READ A RECORD         @ZA03720*/ 00054000
@RC00060 L     @09,RTNCDE                                          0072 00055000
         LTR   @09,@09                                             0072 00056000
         BNZ   @RF00072                                            0072 00057000
*     CALL READRTN;                 /* YES - READ SUBRTN     @ZA03720*/ 00058000
         BAL   @14,READRTN                                         0073 00059000
*   GOTO EXIT;                      /* RETURN                @ZA03720*/ 00060000
*                                                                  0074 00061000
         B     EXIT                                                0074 00062000
*   /*****************************************************************/ 00063000
*   /*                                                               */ 00064000
*   /* SYNAD ROUTINE                                                 */ 00065000
*   /*                                                               */ 00066000
*   /*****************************************************************/ 00067000
*                                                                  0075 00068000
*ISTINFRT:                          /*                       @XM06409*/ 00069000
*   IOERR='1'B;                     /* INDICATE I/O ERROR    @ZA03721*/ 00070000
ISTINFRT OI    IOERR,B'01000000'                                   0075 00071000
*   GEN EXIT NOSEQFLOW(BR  R14);    /* RETURN TO SYSTEM TO CLEAN UP     00072000
*                                      DCB                   @ZA03721*/ 00073000
*                                                                  0076 00074000
         BR  R14                                                        00075000
*   /*****************************************************************/ 00076000
*   /*                                                               */ 00077000
*   /* EODAD ROUTINE                                                 */ 00078000
*   /*                                                               */ 00079000
*   /*****************************************************************/ 00080000
*                                                                  0077 00081000
*ISTINFRU:                          /*                       @XM06409*/ 00082000
*   RTNCDE=4;                       /* INDICATE EODAD        @ZA03720*/ 00083000
ISTINFRU MVC   RTNCDE(4),@CF00040                                  0077 00084000
*EXIT:                                                             0078 00085000
*   RETURN CODE(RTNCDE);            /* RETURN TO CALLER      @ZA03720*/ 00086000
EXIT     L     @15,RTNCDE                                          0078 00087000
         L     @13,4(,@13)                                         0078 00088000
         L     @14,12(,@13)                                        0078 00089000
         LM    @00,@12,20(@13)                                     0078 00090000
         BR    @14                                                 0078 00091000
*READRTN:                                                          0079 00092000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA,RETREG);/*                @ZA03720*/ 00093000
*                                                                  0079 00094000
READRTN  DS    0H                                                  0080 00095000
*   /*****************************************************************/ 00096000
*   /*                                                               */ 00097000
*   /* THIS ROUTINE READS A BLOCK FROM VTAMLST. IT DEBLOCKS THE DATA */ 00098000
*   /* AND PASSES ONE RECORD AT A TIME TO INCRD.                     */ 00099000
*   /*                                                               */ 00100000
*   /*****************************************************************/ 00101000
*                                                                  0080 00102000
*   R14SAVE=R14;                    /* SAVE RETURN ADDRESS   @ZA03720*/ 00103000
         ST    R14,R14SAVE                                         0080 00104000
*   IF DONTREAD='0'B THEN           /* IS RECORD IN BUFFER   @ZA03720*/ 00105000
         TM    DONTREAD,B'10000000'                                0081 00106000
         BNZ   @RF00081                                            0081 00107000
*     DO;                           /* NO                    @ZA03720*/ 00108000
*       R3=BUFRADR;                 /* BUFFER ADDR FOR READ  @ZA03720*/ 00109000
         L     @09,@CA00659                                        0083 00110000
         L     R3,BUFRADR-BUFRADR(,@09)                            0083 00111000
*       GEN FLOWS(ISTINFRT,ISTINFRU);                              0084 00112000
*                                           /*               @ZA03720*/ 00113000
              READ DECB,SF,(2),(3),'S'                                  00114000
              CHECK DECB                                                00115000
*       IF IOERR='1'B THEN          /* WAS THERE AN I/O ERROR      0085 00116000
*                                                            @ZA03721*/ 00117000
         TM    IOERR,B'01000000'                                   0085 00118000
         BNO   @RF00085                                            0085 00119000
*         DO;                       /* YES                   @ZA03721*/ 00120000
*           IOERR='0'B;             /* RESET ERROR FLAG      @ZA03721*/ 00121000
         NI    IOERR,B'10111111'                                   0087 00122000
*           RTNCDE=8;               /* INDICATE I/O ERROR    @ZA03721*/ 00123000
         MVC   RTNCDE(4),@CF00042                                  0088 00124000
*           GOTO READOUT;           /* EXIT READ ROUTINE     @ZA03721*/ 00125000
         B     READOUT                                             0089 00126000
*         END;                      /*                       @ZA03721*/ 00127000
*       RECNUMBR=((DCBBLKSI-RESIDCT)/RCDSIZE);/* COMPUTE NUMBER OF 0091 00128000
*                                      RECORDS IN EACK BLOCK @ZA03720*/ 00129000
@RF00085 LH    @04,DCBBLKSI+52(,DCBPTR)                            0091 00130000
         L     @09,IOBSTPTR                                        0091 00131000
         SH    @04,RESIDCT(,@09)                                   0091 00132000
         SRDA  @04,32                                              0091 00133000
         D     @04,@CF00306                                        0091 00134000
         STH   @05,RECNUMBR                                        0091 00135000
*       DATAPTR=BUFRADR;            /* POINT TO FIRST RECORD @ZA03720*/ 00136000
         L     @09,@CA00659                                        0092 00137000
         L     @09,BUFRADR-BUFRADR(,@09)                           0092 00138000
         ST    @09,DATAPTR                                         0092 00139000
*       DONTREAD='1'B;              /* INDICATE DATA AVAIL   @ZA03720*/ 00140000
         OI    DONTREAD,B'10000000'                                0093 00141000
*     END;                          /*                       @ZA03720*/ 00142000
*   RECNUMBR=RECNUMBR-1;            /* DECREMENT RECORD CNT  @ZA03720*/ 00143000
@RF00081 LH    @09,RECNUMBR                                        0095 00144000
         BCTR  @09,0                                               0095 00145000
         STH   @09,RECNUMBR                                        0095 00146000
*   CRDBUFR=RECORD;                 /* MOVE RECORD INTO BUFFER     0096 00147000
*                                      PROVIDED BY INCRD     @ZA03720*/ 00148000
         L     @11,RSPBUFA(,RDPRMPTR)                              0096 00149000
         L     @10,DATAPTR                                         0096 00150000
         MVC   CRDBUFR(80,@11),RECORD(@10)                         0096 00151000
*   IF RECNUMBR¬=0 THEN             /* ANY MORE RECORDS LEFT @ZA03720*/ 00152000
         LTR   @09,@09                                             0097 00153000
         BZ    @RF00097                                            0097 00154000
*     DATAPTR=DATAPTR+RCDSIZE;      /* YES - POINT TO NEXT RECORD  0098 00155000
*                                                            @ZA03720*/ 00156000
         AL    @10,@CF00306                                        0098 00157000
         ST    @10,DATAPTR                                         0098 00158000
*   ELSE                            /* NO - NO RECORDS LEFT  @ZA03720*/ 00159000
*     DONTREAD='0'B;                /* INDICATE TO READ NEXT BLOCK 0099 00160000
*                                                            @ZA03720*/ 00161000
         B     @RC00097                                            0099 00162000
@RF00097 NI    DONTREAD,B'01111111'                                0099 00163000
*   RTNCDE=0;                       /* INDICATE SUCCESSFUL READ    0100 00164000
*                                                            @ZA03720*/ 00165000
@RC00097 SLR   @11,@11                                             0100 00166000
         ST    @11,RTNCDE                                          0100 00167000
*READOUT:                                                          0101 00168000
*   R14=R14SAVE;                    /* RESTORE RETURN ADDR   @ZA03720*/ 00169000
READOUT  L     R14,R14SAVE                                         0101 00170000
*   END READRTN;                    /*                       @ZA03720*/ 00171000
@EL00002 DS    0H                                                  0102 00172000
@EF00002 DS    0H                                                  0102 00173000
@ER00002 BR    @14                                                 0102 00174000
*   END ISTINCRS                                                   0103 00175000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00176000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                        * 00177000
*/*%INCLUDE SYSLIB  (IHADCB  )                                        * 00178000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        * 00179000
*;                                                                 0103 00180000
@DATA    DS    0H                                                       00181000
         DS    0F                                                       00182000
@SA00001 DS    18F                                                      00183000
         DS    0F                                                       00184000
@CF00040 DC    F'4'                                                     00185000
@CF00042 DC    F'8'                                                     00186000
@CF00032 DC    F'12'                                                    00187000
@CF00306 DC    F'80'                                                    00188000
@CA00659 DC    A(BUFRADR)                                               00189000
         DS    0D                                                       00190000
DATAPTR  DS    A                                                        00191000
RTNCDE   DC    F'0'                                                     00192000
R14SAVE  DC    A(0)                                                     00193000
RECNUMBR DS    H                                                        00194000
XZEROS   DC    X'0000000000000000'                                      00195000
CRSSW    DC    XL1'0'                                                   00196000
         ORG   CRSSW                                                    00197000
DONTREAD DS    BL1                                                      00198000
IOERR    EQU   CRSSW+0                                                  00199000
         ORG   CRSSW+1                                                  00200000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00201000
@01      EQU   01                                                       00202000
@02      EQU   02                                                       00203000
@03      EQU   03                                                       00204000
@04      EQU   04                                                       00205000
@05      EQU   05                                                       00206000
@06      EQU   06                                                       00207000
@07      EQU   07                                                       00208000
@08      EQU   08                                                       00209000
@09      EQU   09                                                       00210000
@10      EQU   10                                                       00211000
@11      EQU   11                                                       00212000
@12      EQU   12                                                       00213000
@13      EQU   13                                                       00214000
@14      EQU   14                                                       00215000
@15      EQU   15                                                       00216000
RDPRMPTR EQU   @08                                                      00217000
DCBPTR   EQU   @02                                                      00218000
R0       EQU   @00                                                      00219000
R1       EQU   @01                                                      00220000
R3       EQU   @03                                                      00221000
R14      EQU   @14                                                      00222000
R15      EQU   @15                                                      00223000
         ENTRY ISTINFRT                                                 00224000
         ENTRY ISTINFRU                                                 00225000
         EXTRN BUFRADR                                                  00226000
IHADCB   EQU   0                                                        00227000
IHADCS00 EQU   0                                                        00228000
DCBFDAD  EQU   IHADCS00+5                                               00229000
IHADCS01 EQU   0                                                        00230000
DCBDVTBL EQU   IHADCS01                                                 00231000
IHADCS11 EQU   0                                                        00232000
DCBRELB  EQU   IHADCS11                                                 00233000
DCBREL   EQU   DCBRELB+1                                                00234000
DCBBUFCB EQU   IHADCS11+4                                               00235000
DCBDSORG EQU   IHADCS11+10                                              00236000
DCBDSRG1 EQU   DCBDSORG                                                 00237000
DCBDSRG2 EQU   DCBDSORG+1                                               00238000
DCBIOBAD EQU   IHADCS11+12                                              00239000
DCBODEB  EQU   DCBIOBAD                                                 00240000
DCBLNP   EQU   DCBODEB                                                  00241000
DCBQSLM  EQU   DCBLNP                                                   00242000
DCBIOBAA EQU   DCBODEB+1                                                00243000
IHADCS50 EQU   0                                                        00244000
DCBSVCXL EQU   IHADCS50                                                 00245000
DCBEODAD EQU   IHADCS50+4                                               00246000
DCBBFALN EQU   DCBEODAD                                                 00247000
DCBHIARC EQU   DCBBFALN                                                 00248000
DCBBFTEK EQU   DCBHIARC                                                 00249000
DCBBFT   EQU   DCBBFTEK                                                 00250000
DCBEXLST EQU   IHADCS50+8                                               00251000
DCBRECFM EQU   DCBEXLST                                                 00252000
DCBRECLA EQU   DCBRECFM                                                 00253000
IHADCS24 EQU   0                                                        00254000
DCBOFLGS EQU   IHADCS24+8                                               00255000
DCBOFLWR EQU   DCBOFLGS                                                 00256000
DCBIFLG  EQU   IHADCS24+9                                               00257000
DCBIBPCT EQU   DCBIFLG                                                  00258000
DCBMACR  EQU   IHADCS24+10                                              00259000
DCBMACR1 EQU   DCBMACR                                                  00260000
DCBMRFE  EQU   DCBMACR1                                                 00261000
DCBMRGET EQU   DCBMRFE                                                  00262000
DCBMRAPG EQU   DCBMACR1                                                 00263000
DCBMRRD  EQU   DCBMRAPG                                                 00264000
DCBMRCI  EQU   DCBMACR1                                                 00265000
DCBMRMVG EQU   DCBMRCI                                                  00266000
DCBMRLCG EQU   DCBMACR1                                                 00267000
DCBMRABC EQU   DCBMACR1                                                 00268000
DCBMRPT1 EQU   DCBMRABC                                                 00269000
DCBMRSBG EQU   DCBMRPT1                                                 00270000
DCBMRCRL EQU   DCBMACR1                                                 00271000
DCBMRCHK EQU   DCBMRCRL                                                 00272000
DCBMRRDX EQU   DCBMRCHK                                                 00273000
DCBMRDMG EQU   DCBMACR1                                                 00274000
DCBMACR2 EQU   DCBMACR+1                                                00275000
DCBMRPUT EQU   DCBMACR2                                                 00276000
DCBMRWRT EQU   DCBMACR2                                                 00277000
DCBMRMVP EQU   DCBMACR2                                                 00278000
DCBMR5WD EQU   DCBMACR2                                                 00279000
DCBMRLDM EQU   DCBMR5WD                                                 00280000
DCBMRLCP EQU   DCBMRLDM                                                 00281000
DCBMR4WD EQU   DCBMACR2                                                 00282000
DCBMRPT2 EQU   DCBMR4WD                                                 00283000
DCBMRTMD EQU   DCBMRPT2                                                 00284000
DCBMR3WD EQU   DCBMACR2                                                 00285000
DCBMRCTL EQU   DCBMR3WD                                                 00286000
DCBMRSTK EQU   DCBMRCTL                                                 00287000
DCBMR1WD EQU   DCBMACR2                                                 00288000
DCBMRSWA EQU   DCBMR1WD                                                 00289000
DCBMRDMD EQU   DCBMRSWA                                                 00290000
IHADCS25 EQU   0                                                        00291000
DCBMACRF EQU   IHADCS25+2                                               00292000
DCBMACF1 EQU   DCBMACRF                                                 00293000
DCBMFFE  EQU   DCBMACF1                                                 00294000
DCBMFGET EQU   DCBMFFE                                                  00295000
DCBMFAPG EQU   DCBMACF1                                                 00296000
DCBMFRD  EQU   DCBMFAPG                                                 00297000
DCBMFCI  EQU   DCBMACF1                                                 00298000
DCBMFMVG EQU   DCBMFCI                                                  00299000
DCBMFLCG EQU   DCBMACF1                                                 00300000
DCBMFABC EQU   DCBMACF1                                                 00301000
DCBMFPT1 EQU   DCBMFABC                                                 00302000
DCBMFSBG EQU   DCBMFPT1                                                 00303000
DCBMFCRL EQU   DCBMACF1                                                 00304000
DCBMFCHK EQU   DCBMFCRL                                                 00305000
DCBMFDMG EQU   DCBMACF1                                                 00306000
DCBMACF2 EQU   DCBMACRF+1                                               00307000
DCBMFPUT EQU   DCBMACF2                                                 00308000
DCBMFWRT EQU   DCBMACF2                                                 00309000
DCBMFMVP EQU   DCBMACF2                                                 00310000
DCBMF5WD EQU   DCBMACF2                                                 00311000
DCBMFLDM EQU   DCBMF5WD                                                 00312000
DCBMFLCP EQU   DCBMFLDM                                                 00313000
DCBMF4WD EQU   DCBMACF2                                                 00314000
DCBMFPT2 EQU   DCBMF4WD                                                 00315000
DCBMFTMD EQU   DCBMFPT2                                                 00316000
DCBMF3WD EQU   DCBMACF2                                                 00317000
DCBMFCTL EQU   DCBMF3WD                                                 00318000
DCBMFSTK EQU   DCBMFCTL                                                 00319000
DCBMF1WD EQU   DCBMACF2                                                 00320000
DCBMFSWA EQU   DCBMF1WD                                                 00321000
DCBMFDMD EQU   DCBMFSWA                                                 00322000
DCBDEBAD EQU   IHADCS25+4                                               00323000
DCBIFLGS EQU   DCBDEBAD                                                 00324000
DCBIFPCT EQU   DCBIFLGS                                                 00325000
IHADCS26 EQU   0                                                        00326000
DCBWRITE EQU   IHADCS26                                                 00327000
DCBREAD  EQU   DCBWRITE                                                 00328000
DCBWRITA EQU   DCBREAD+1                                                00329000
IHADCS36 EQU   0                                                        00330000
DCBGERR  EQU   IHADCS36                                                 00331000
DCBPERR  EQU   DCBGERR                                                  00332000
DCBCHECK EQU   DCBPERR                                                  00333000
DCBOPTCD EQU   DCBCHECK                                                 00334000
DCBOPTH  EQU   DCBOPTCD                                                 00335000
DCBOPTO  EQU   DCBOPTH                                                  00336000
DCBOPTZ  EQU   DCBOPTCD                                                 00337000
DCBGERRA EQU   DCBCHECK+1                                               00338000
DCBPERRA EQU   DCBGERRA                                                 00339000
DCBSYNAD EQU   IHADCS36+4                                               00340000
DCBCIND1 EQU   IHADCS36+8                                               00341000
DCBCIND2 EQU   IHADCS36+9                                               00342000
DCBBLKSI EQU   IHADCS36+10                                              00343000
DCBIOBA  EQU   IHADCS36+16                                              00344000
DCBCICB  EQU   DCBIOBA                                                  00345000
IHADCS52 EQU   0                                                        00346000
DCBDIRCT EQU   IHADCS52                                                 00347000
DCBQSWS  EQU   DCBDIRCT                                                 00348000
DCBUSASI EQU   DCBQSWS                                                  00349000
DCBQADFS EQU   DCBUSASI                                                 00350000
DCBBUFOF EQU   DCBDIRCT+1                                               00351000
IHADCS37 EQU   0                                                        00352000
DCBFLAG1 EQU   IHADCS37                                                 00353000
IHADCS38 EQU   0                                                        00354000
DCBEOBR  EQU   IHADCS38                                                 00355000
DCBPOINT EQU   IHADCS38+12                                              00356000
DCBCNTRL EQU   DCBPOINT                                                 00357000
IOBPREFX EQU   0                                                        00358000
IOBCFLG1 EQU   IOBPREFX                                                 00359000
IOBSTDRD EQU   0                                                        00360000
IOBFLAG1 EQU   IOBSTDRD                                                 00361000
IOBCYCCK EQU   IOBFLAG1                                                 00362000
IOBRSTRT EQU   IOBFLAG1                                                 00363000
IOBFLAG2 EQU   IOBSTDRD+1                                               00364000
IOBPURGE EQU   IOBFLAG2                                                 00365000
IOBRDHA0 EQU   IOBFLAG2                                                 00366000
IOBSENS0 EQU   IOBSTDRD+2                                               00367000
IOBS0B7  EQU   IOBSENS0                                                 00368000
IOBSENS1 EQU   IOBSTDRD+3                                               00369000
IOBECBPT EQU   IOBSTDRD+4                                               00370000
IOBFLAG3 EQU   IOBSTDRD+8                                               00371000
IOBFL3   EQU   IOBFLAG3                                                 00372000
IOBCNC   EQU   IOBFL3                                                   00373000
IOBICL   EQU   IOBFL3                                                   00374000
IOBCSW   EQU   IOBSTDRD+9                                               00375000
IOBIOCSW EQU   IOBCSW                                                   00376000
IOBSTBYT EQU   IOBIOCSW+3                                               00377000
IOBUSTAT EQU   IOBSTBYT                                                 00378000
IOBCSTAT EQU   IOBSTBYT+1                                               00379000
IOBSTART EQU   IOBSTDRD+16                                              00380000
IOBDCBPT EQU   IOBSTDRD+20                                              00381000
IOBFLAG4 EQU   IOBDCBPT                                                 00382000
IOBRESTR EQU   IOBSTDRD+24                                              00383000
IOBINCAM EQU   IOBSTDRD+28                                              00384000
IOBBTAMF EQU   IOBINCAM                                                 00385000
ISTRSPRM EQU   0                                                        00386000
RSPMEMBN EQU   ISTRSPRM+8                                               00387000
RSPDCBA  EQU   ISTRSPRM+16                                              00388000
RSPBUFA  EQU   ISTRSPRM+20                                              00389000
RECORD   EQU   0                                                        00390000
CRDBUFR  EQU   0                                                        00391000
IOBPTR   EQU   DECB+16                                                  00392000
IOBORG01 EQU   IOBPREFX+8                                               00393000
IOBNIOBA EQU   IOBORG01                                                 00394000
IOBNFLG1 EQU   IOBNIOBA                                                 00395000
IOBPRTOV EQU   IOBNFLG1                                                 00396000
IOBORG02 EQU   IOBPREFX+8                                               00397000
IOBDQADA EQU   IOBORG02                                                 00398000
IOBDEQIN EQU   IOBDQADA                                                 00399000
IOBORG03 EQU   IOBPREFX+12                                              00400000
IOBSTPTR EQU   IOBPTR                                                   00401000
IOBORG04 EQU   IOBINCAM                                                 00402000
IOBORG12 EQU   IOBINCAM                                                 00403000
IOBFL4   EQU   IOBORG12                                                 00404000
IOBEXTEN EQU   IOBSTDRD+32                                              00405000
IOBSEEK  EQU   IOBEXTEN                                                 00406000
IOBBB    EQU   IOBSEEK+1                                                00407000
IOBCC    EQU   IOBSEEK+3                                                00408000
IOBHH    EQU   IOBSEEK+5                                                00409000
IOBORG05 EQU   IOBEXTEN                                                 00410000
IOBORG06 EQU   IOBEXTEN                                                 00411000
IOBNXTPT EQU   IOBORG06+4                                               00412000
IOBSTATA EQU   IOBNXTPT                                                 00413000
IOBORG07 EQU   IOBEXTEN+8                                               00414000
W1IEXTEN EQU   IOBORG07                                                 00415000
IOBORG08 EQU   IOBEXTEN+8                                               00416000
IOBINDCT EQU   IOBORG08+4                                               00417000
IOBUNSQR EQU   IOBORG08+5                                               00418000
IOBFCHAD EQU   IOBORG08+8                                               00419000
IOBORG09 EQU   IOBEXTEN+8                                               00420000
IOBDPLAD EQU   IOBORG09+4                                               00421000
IOBDTYPE EQU   IOBORG09+8                                               00422000
IOBDTYP2 EQU   IOBORG09+9                                               00423000
IOBDSTAT EQU   IOBORG09+10                                              00424000
IOBSTAT1 EQU   IOBDSTAT                                                 00425000
IOBORG10 EQU   IOBEXTEN+8                                               00426000
IOBSEEK2 EQU   IOBORG10                                                 00427000
IOBORG11 EQU   IOBEXTEN                                                 00428000
IOBERCT  EQU   IOBORG11                                                 00429000
IOBUCBXV EQU   IOBERCT                                                  00430000
IOBNAME  EQU   IOBORG11+4                                               00431000
IOBORG13 EQU   IOBEXTEN                                                 00432000
IOBSKADR EQU   IOBORG13                                                 00433000
CSWSTATS EQU   IOBCSW                                                   00434000
RESIDCT  EQU   CSWSTATS+5                                               00435000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00436000
@NM00022 EQU   CSWSTATS                                                 00437000
IOBSKSS  EQU   IOBSKADR+3                                               00438000
IOBSK0   EQU   IOBSKADR+2                                               00439000
IOBSKTT  EQU   IOBSKADR+1                                               00440000
IOBSKRV  EQU   IOBSKADR                                                 00441000
IOBCSWSV EQU   IOBORG11+17                                              00442000
IOBSENSV EQU   IOBORG11+16                                              00443000
IOBRCD   EQU   IOBORG11+12                                              00444000
IOBMDREC EQU   IOBORG11+8                                               00445000
IOBNAMEA EQU   IOBNAME+1                                                00446000
IOBNAMSZ EQU   IOBNAME                                                  00447000
IOBERCTA EQU   IOBERCT+1                                                00448000
IOBRTYPE EQU   IOBUCBXV                                                 00449000
IOBRDCHP EQU   IOBORG10+20                                              00450000
IOBNEXTA EQU   IOBORG10+16                                              00451000
IOBREADA EQU   IOBORG10+12                                              00452000
IOBBUFC  EQU   IOBORG10+8                                               00453000
IOBSK2R  EQU   IOBSEEK2+7                                               00454000
IOBSK2HH EQU   IOBSEEK2+5                                               00455000
IOBSK2CC EQU   IOBSEEK2+3                                               00456000
IOBSK2BB EQU   IOBSEEK2+1                                               00457000
IOBSK2M  EQU   IOBSEEK2                                                 00458000
IOBCHNPR EQU   IOBORG09+40                                              00459000
IOBDNCRF EQU   IOBORG09+32                                              00460000
IOBRSV35 EQU   IOBORG09+24                                              00461000
IOBDQPTR EQU   IOBORG09+20                                              00462000
IOBRSV34 EQU   IOBORG09+18                                              00463000
IOBDBYTN EQU   IOBORG09+16                                              00464000
IOBDCPND EQU   IOBORG09+12                                              00465000
IOBSTAT2 EQU   IOBDSTAT+1                                               00466000
IOBSIORT EQU   IOBSTAT1                                                 00467000
IOBADDVU EQU   IOBSTAT1                                                 00468000
IOBBUFF  EQU   IOBSTAT1                                                 00469000
IOBENQUE EQU   IOBSTAT1                                                 00470000
IOBPASS2 EQU   IOBSTAT1                                                 00471000
IOBSYNCH EQU   IOBSTAT1                                                 00472000
IOBNEWVL EQU   IOBSTAT1                                                 00473000
IOBABNRM EQU   IOBSTAT1                                                 00474000
IOBRELEX EQU   IOBDTYP2                                                 00475000
IOBADDTY EQU   IOBDTYP2                                                 00476000
IOBTYPE  EQU   IOBDTYP2                                                 00477000
IOBRQUST EQU   IOBDTYP2                                                 00478000
IOBSUFFX EQU   IOBDTYP2                                                 00479000
IOBSBLKL EQU   IOBDTYP2                                                 00480000
IOBSKEY  EQU   IOBDTYP2                                                 00481000
IOBRELBL EQU   IOBDTYPE                                                 00482000
IOBRDEXC EQU   IOBDTYPE                                                 00483000
IOBDYNBF EQU   IOBDTYPE                                                 00484000
IOBACTAD EQU   IOBDTYPE                                                 00485000
IOBFDBCK EQU   IOBDTYPE                                                 00486000
IOBEXTSC EQU   IOBDTYPE                                                 00487000
IOBOVFLO EQU   IOBDTYPE                                                 00488000
IOBVERFY EQU   IOBDTYPE                                                 00489000
IOBDPLB  EQU   IOBDPLAD+1                                               00490000
IOBDAYLI EQU   IOBDPLAD                                                 00491000
IOBDIOBS EQU   IOBORG09+2                                               00492000
IOBDBYTR EQU   IOBORG09                                                 00493000
IOBBCHAD EQU   IOBORG08+12                                              00494000
IOBFCHNB EQU   IOBFCHAD+1                                               00495000
IOBCOUNT EQU   IOBFCHAD                                                 00496000
IOBASYN  EQU   IOBORG08+7                                               00497000
IOBAPP   EQU   IOBORG08+6                                               00498000
IOBRSV32 EQU   IOBUNSQR                                                 00499000
IOBRSV31 EQU   IOBUNSQR                                                 00500000
IOBRSV30 EQU   IOBUNSQR                                                 00501000
IOBKNRWR EQU   IOBUNSQR                                                 00502000
IOBKNWR  EQU   IOBUNSQR                                                 00503000
IOBNTAV2 EQU   IOBUNSQR                                                 00504000
IOBNTAV1 EQU   IOBUNSQR                                                 00505000
IOBCPBSY EQU   IOBUNSQR                                                 00506000
IOBCHNNL EQU   IOBINDCT                                                 00507000
IOBRSV29 EQU   IOBINDCT                                                 00508000
IOBRSV28 EQU   IOBINDCT                                                 00509000
IOBRSV27 EQU   IOBINDCT                                                 00510000
IOBKEYAD EQU   IOBINDCT                                                 00511000
IOBOVPTR EQU   IOBINDCT                                                 00512000
IOBUNSCH EQU   IOBINDCT                                                 00513000
IOBDEQCP EQU   IOBINDCT                                                 00514000
IOBCCWAD EQU   IOBORG08                                                 00515000
W1OEXTEN EQU   W1IEXTEN                                                 00516000
IOBCCW   EQU   IOBORG06+8                                               00517000
IOBNXTPB EQU   IOBNXTPT+1                                               00518000
IOBRSV26 EQU   IOBSTATA                                                 00519000
IOBRSV25 EQU   IOBSTATA                                                 00520000
IOBRSV24 EQU   IOBSTATA                                                 00521000
IOBRSV23 EQU   IOBSTATA                                                 00522000
IOBRSV22 EQU   IOBSTATA                                                 00523000
IOBRSV21 EQU   IOBSTATA                                                 00524000
IOBRSV20 EQU   IOBSTATA                                                 00525000
IOBAVLFL EQU   IOBSTATA                                                 00526000
IOBRSV37 EQU   IOBORG06+1                                               00527000
IOBUCBXG EQU   IOBORG06                                                 00528000
IOBCPA   EQU   IOBORG05+32                                              00529000
IOBERINF EQU   IOBORG05+16                                              00530000
IOBERCCW EQU   IOBORG05+8                                               00531000
IOBSNDPT EQU   IOBORG05+7                                               00532000
IOBRCVPT EQU   IOBORG05+6                                               00533000
IOBWORK  EQU   IOBORG05+1                                               00534000
IOBUCBX  EQU   IOBORG05                                                 00535000
IOBR     EQU   IOBSEEK+7                                                00536000
IOBHH2   EQU   IOBHH+1                                                  00537000
IOBHH1   EQU   IOBHH                                                    00538000
IOBCC2   EQU   IOBCC+1                                                  00539000
IOBCC1   EQU   IOBCC                                                    00540000
IOBBB2   EQU   IOBBB+1                                                  00541000
IOBBB1   EQU   IOBBB                                                    00542000
IOBM     EQU   IOBSEEK                                                  00543000
IOBRSV46 EQU   IOBFL4                                                   00544000
IOBRSV47 EQU   IOBFL4                                                   00545000
IOBENT   EQU   IOBFL4                                                   00546000
IOBEQP   EQU   IOBFL4                                                   00547000
IOBBUS   EQU   IOBFL4                                                   00548000
IOBDCK   EQU   IOBFL4                                                   00549000
IOBREJ   EQU   IOBFL4                                                   00550000
IOBOVR   EQU   IOBFL4                                                   00551000
IOBCRILC EQU   IOBORG04+1                                               00552000
IOBCRDCC EQU   IOBORG04                                                 00553000
IOBGQECB EQU   IOBORG03                                                 00554000
IOBSWAP  EQU   IOBORG02+4                                               00555000
IOBDQADB EQU   IOBDQADA+1                                               00556000
IOBRSV13 EQU   IOBDEQIN                                                 00557000
IOBRSV12 EQU   IOBDEQIN                                                 00558000
IOBRSV11 EQU   IOBDEQIN                                                 00559000
IOBRSV10 EQU   IOBDEQIN                                                 00560000
IOBRSV09 EQU   IOBDEQIN                                                 00561000
IOBRSV08 EQU   IOBDEQIN                                                 00562000
IOBRSV07 EQU   IOBDEQIN                                                 00563000
IOBDEQ   EQU   IOBDEQIN                                                 00564000
IOBNECB  EQU   IOBORG01+4                                               00565000
IOBNIOBB EQU   IOBNIOBA+1                                               00566000
IOBFIRST EQU   IOBNFLG1                                                 00567000
IOBUPERR EQU   IOBNFLG1                                                 00568000
IOBSPAN  EQU   IOBNFLG1                                                 00569000
IOBBKSPC EQU   IOBNFLG1                                                 00570000
IOBUPDAT EQU   IOBNFLG1                                                 00571000
IOBREAD  EQU   IOBNFLG1                                                 00572000
IOBWRITE EQU   IOBNFLG1                                                 00573000
IOBSEGMT EQU   IOBPRTOV                                                 00574000
@NM00021 EQU   DECB                                                     00575000
RSPLIBN  EQU   ISTRSPRM                                                 00576000
IOBERRCT EQU   IOBSTDRD+30                                              00577000
IOBRSV19 EQU   IOBINCAM+1                                               00578000
IOBOLTST EQU   IOBBTAMF                                                 00579000
IOBRFTMG EQU   IOBBTAMF                                                 00580000
IOBRSV17 EQU   IOBBTAMF                                                 00581000
IOBRSV16 EQU   IOBBTAMF                                                 00582000
IOBRSV15 EQU   IOBBTAMF                                                 00583000
IOBRSV14 EQU   IOBBTAMF                                                 00584000
IOBINUSE EQU   IOBBTAMF                                                 00585000
IOBPRMER EQU   IOBBTAMF                                                 00586000
IOBRSTRB EQU   IOBRESTR+1                                               00587000
IOBREPOS EQU   IOBRESTR                                                 00588000
IOBDCBPB EQU   IOBDCBPT+1                                               00589000
IOBRSV44 EQU   IOBFLAG4                                                 00590000
IOBJES3I EQU   IOBFLAG4                                                 00591000
IOBRSV42 EQU   IOBFLAG4                                                 00592000
IOBRSV41 EQU   IOBFLAG4                                                 00593000
IOBRSV40 EQU   IOBFLAG4                                                 00594000
IOBPMERR EQU   IOBFLAG4                                                 00595000
IOBCC3WE EQU   IOBFLAG4                                                 00596000
IOBGDPOL EQU   IOBFLAG4                                                 00597000
IOBSTRTB EQU   IOBSTART+1                                               00598000
IOBSIOCC EQU   IOBSTART                                                 00599000
IOBCSB7  EQU   IOBCSTAT                                                 00600000
IOBCSB6  EQU   IOBCSTAT                                                 00601000
IOBCSB5  EQU   IOBCSTAT                                                 00602000
IOBCSB4  EQU   IOBCSTAT                                                 00603000
IOBCSB3  EQU   IOBCSTAT                                                 00604000
IOBCSB2  EQU   IOBCSTAT                                                 00605000
IOBCSB1  EQU   IOBCSTAT                                                 00606000
IOBCSB0  EQU   IOBCSTAT                                                 00607000
IOBUSB7  EQU   IOBUSTAT                                                 00608000
IOBUSB6  EQU   IOBUSTAT                                                 00609000
IOBUSB5  EQU   IOBUSTAT                                                 00610000
IOBUSB4  EQU   IOBUSTAT                                                 00611000
IOBUSB3  EQU   IOBUSTAT                                                 00612000
IOBUSB2  EQU   IOBUSTAT                                                 00613000
IOBUSB1  EQU   IOBUSTAT                                                 00614000
IOBUSB0  EQU   IOBUSTAT                                                 00615000
IOBCMDA  EQU   IOBIOCSW                                                 00616000
IOBLOG   EQU   IOBFL3                                                   00617000
IOBJAM   EQU   IOBICL                                                   00618000
IOBMSG   EQU   IOBFL3                                                   00619000
IOBSDR   EQU   IOBCNC                                                   00620000
IOBACU   EQU   IOBFL3                                                   00621000
IOBCDC   EQU   IOBFL3                                                   00622000
IOBICC   EQU   IOBFL3                                                   00623000
IOBCCC   EQU   IOBFL3                                                   00624000
IOBECBPB EQU   IOBECBPT+1                                               00625000
IOBECBCC EQU   IOBECBPT                                                 00626000
IOBS1B7  EQU   IOBSENS1                                                 00627000
IOBS1B6  EQU   IOBSENS1                                                 00628000
IOBS1B5  EQU   IOBSENS1                                                 00629000
IOBS1B4  EQU   IOBSENS1                                                 00630000
IOBS1B3  EQU   IOBSENS1                                                 00631000
IOBS1B2  EQU   IOBSENS1                                                 00632000
IOBS1B1  EQU   IOBSENS1                                                 00633000
IOBS1B0  EQU   IOBSENS1                                                 00634000
IOBSNSC9 EQU   IOBS0B7                                                  00635000
IOBS0B6  EQU   IOBSENS0                                                 00636000
IOBS0B5  EQU   IOBSENS0                                                 00637000
IOBS0B4  EQU   IOBSENS0                                                 00638000
IOBS0B3  EQU   IOBSENS0                                                 00639000
IOBS0B2  EQU   IOBSENS0                                                 00640000
IOBS0B1  EQU   IOBSENS0                                                 00641000
IOBS0B0  EQU   IOBSENS0                                                 00642000
IOBPNCH  EQU   IOBFLAG2                                                 00643000
IOBSTATO EQU   IOBFLAG2                                                 00644000
IOBSKUPD EQU   IOBFLAG2                                                 00645000
IOBALTTR EQU   IOBFLAG2                                                 00646000
IOBRRT2  EQU   IOBRDHA0                                                 00647000
IOBRRT3  EQU   IOBPURGE                                                 00648000
IOBSENSE EQU   IOBFLAG2                                                 00649000
IOBHALT  EQU   IOBFLAG2                                                 00650000
IOBSPSVC EQU   IOBRSTRT                                                 00651000
IOBUNREL EQU   IOBFLAG1                                                 00652000
IOBIOERR EQU   IOBFLAG1                                                 00653000
IOBFCREX EQU   IOBCYCCK                                                 00654000
IOBRPSTN EQU   IOBFLAG1                                                 00655000
IOBERRTN EQU   IOBFLAG1                                                 00656000
IOBCMDCH EQU   IOBFLAG1                                                 00657000
IOBDATCH EQU   IOBFLAG1                                                 00658000
IOBCNOPA EQU   IOBPREFX+12                                              00659000
IOBCICB  EQU   IOBPREFX+8                                               00660000
IOBCECB  EQU   IOBPREFX+4                                               00661000
IOBCONOP EQU   IOBPREFX+3                                               00662000
IOBCINOP EQU   IOBPREFX+2                                               00663000
IOBRSV05 EQU   IOBPREFX+1                                               00664000
IOBPCI   EQU   IOBCFLG1                                                 00665000
IOBRSTCH EQU   IOBCFLG1                                                 00666000
IOBABAPP EQU   IOBCFLG1                                                 00667000
IOBPTST  EQU   IOBCFLG1                                                 00668000
IOBRSV04 EQU   IOBCFLG1                                                 00669000
IOBRSV03 EQU   IOBCFLG1                                                 00670000
IOBRSV02 EQU   IOBCFLG1                                                 00671000
IOBRSV01 EQU   IOBCFLG1                                                 00672000
DCBNOTE  EQU   DCBCNTRL                                                 00673000
DCBLRECL EQU   IHADCS38+10                                              00674000
@NM00020 EQU   IHADCS38+8                                               00675000
DCBEOBW  EQU   IHADCS38+4                                               00676000
DCBEOBRA EQU   DCBEOBR+1                                                00677000
DCBNCP   EQU   DCBEOBR                                                  00678000
@NM00019 EQU   DCBFLAG1                                                 00679000
DCBSTFLS EQU   DCBFLAG1                                                 00680000
DCBSTQCK EQU   DCBFLAG1                                                 00681000
DCBDIRCQ EQU   DCBBUFOF                                                 00682000
DCBQSTRU EQU   DCBUSASI                                                 00683000
@NM00018 EQU   DCBUSASI                                                 00684000
DCBQADF3 EQU   DCBQADFS                                                 00685000
DCBQADF2 EQU   DCBQADFS                                                 00686000
DCBQADF1 EQU   DCBQADFS                                                 00687000
DCBBLBP  EQU   DCBUSASI                                                 00688000
@NM00017 EQU   DCBUSASI                                                 00689000
DCBCICBA EQU   DCBCICB+1                                                00690000
@NM00016 EQU   DCBCICB                                                  00691000
DCBOFFSW EQU   IHADCS36+15                                              00692000
DCBOFFSR EQU   IHADCS36+14                                              00693000
DCBWCPL  EQU   IHADCS36+13                                              00694000
DCBWCPO  EQU   IHADCS36+12                                              00695000
DCBCNQSM EQU   DCBCIND2                                                 00696000
DCBCNFEO EQU   DCBCIND2                                                 00697000
DCBCNCHS EQU   DCBCIND2                                                 00698000
DCBCNBFP EQU   DCBCIND2                                                 00699000
DCBCNIOE EQU   DCBCIND2                                                 00700000
DCBCNCLO EQU   DCBCIND2                                                 00701000
DCBCNWRO EQU   DCBCIND2                                                 00702000
DCBCNSTO EQU   DCBCIND2                                                 00703000
DCBCNEXB EQU   DCBCIND1                                                 00704000
@NM00015 EQU   DCBCIND1                                                 00705000
DCBCNBRM EQU   DCBCIND1                                                 00706000
@NM00014 EQU   DCBCIND1                                                 00707000
DCBCNEVA EQU   DCBCIND1                                                 00708000
DCBCNEVB EQU   DCBCIND1                                                 00709000
DCBCNSRD EQU   DCBCIND1                                                 00710000
DCBCNTOV EQU   DCBCIND1                                                 00711000
DCBSYNA  EQU   DCBSYNAD+1                                               00712000
DCBIOBL  EQU   DCBSYNAD                                                 00713000
DCBCHCKA EQU   DCBPERRA                                                 00714000
DCBOPTJ  EQU   DCBOPTCD                                                 00715000
DCBOPTT  EQU   DCBOPTCD                                                 00716000
DCBSRCHD EQU   DCBOPTZ                                                  00717000
DCBOPTQ  EQU   DCBOPTCD                                                 00718000
DCBBCKPT EQU   DCBOPTO                                                  00719000
DCBOPTC  EQU   DCBOPTCD                                                 00720000
DCBOPTU  EQU   DCBOPTCD                                                 00721000
DCBOPTW  EQU   DCBOPTCD                                                 00722000
DCBREADA EQU   DCBWRITA                                                 00723000
@NM00013 EQU   DCBREAD                                                  00724000
DCBDEBA  EQU   DCBDEBAD+1                                               00725000
@NM00012 EQU   DCBIFLGS                                                 00726000
DCBIFIOE EQU   DCBIFLGS                                                 00727000
DCBCH12  EQU   DCBIFPCT                                                 00728000
DCBCH9   EQU   DCBIFPCT                                                 00729000
DCBIFEC  EQU   DCBIFLGS                                                 00730000
DCBMFSTI EQU   DCBMFDMD                                                 00731000
DCBMFAWR EQU   DCBMFSTK                                                 00732000
DCBMFUIP EQU   DCBMFTMD                                                 00733000
DCBMFIDW EQU   DCBMFLCP                                                 00734000
DCBMFWRK EQU   DCBMFMVP                                                 00735000
DCBMFRDQ EQU   DCBMFWRT                                                 00736000
DCBMFGTQ EQU   DCBMFPUT                                                 00737000
DCBMFSTL EQU   DCBMACF2                                                 00738000
DCBMFCK  EQU   DCBMFDMG                                                 00739000
DCBMFRDX EQU   DCBMFCHK                                                 00740000
DCBMFDBF EQU   DCBMFSBG                                                 00741000
DCBMFRDI EQU   DCBMFLCG                                                 00742000
DCBMFRDK EQU   DCBMFMVG                                                 00743000
DCBMFWRQ EQU   DCBMFRD                                                  00744000
DCBMFPTQ EQU   DCBMFGET                                                 00745000
DCBMFECP EQU   DCBMACF1                                                 00746000
DCBTIOT  EQU   IHADCS25                                                 00747000
DCBMRSTI EQU   DCBMRDMD                                                 00748000
DCBMRAWR EQU   DCBMRSTK                                                 00749000
DCBMRUIP EQU   DCBMRTMD                                                 00750000
DCBMRIDW EQU   DCBMRLCP                                                 00751000
DCBMRWRK EQU   DCBMRMVP                                                 00752000
DCBMRRDQ EQU   DCBMRWRT                                                 00753000
DCBMRGTQ EQU   DCBMRPUT                                                 00754000
DCBMRSTL EQU   DCBMACR2                                                 00755000
DCBMRCK  EQU   DCBMRDMG                                                 00756000
DCBPGFXA EQU   DCBMRRDX                                                 00757000
DCBMRDBF EQU   DCBMRSBG                                                 00758000
DCBMRRDI EQU   DCBMRLCG                                                 00759000
DCBMRRDK EQU   DCBMRMVG                                                 00760000
DCBMRWRQ EQU   DCBMRRD                                                  00761000
DCBMRPTQ EQU   DCBMRGET                                                 00762000
DCBMRECP EQU   DCBMACR1                                                 00763000
@NM00011 EQU   DCBIFLG                                                  00764000
DCBIBIOE EQU   DCBIFLG                                                  00765000
DCBICH12 EQU   DCBIBPCT                                                 00766000
DCBICH9  EQU   DCBIBPCT                                                 00767000
DCBIBEC  EQU   DCBIFLG                                                  00768000
DCBOFIOF EQU   DCBOFLGS                                                 00769000
DCBOFUEX EQU   DCBOFLGS                                                 00770000
DCBOFTM  EQU   DCBOFLGS                                                 00771000
DCBOFPPC EQU   DCBOFLGS                                                 00772000
DCBOFOPN EQU   DCBOFLGS                                                 00773000
DCBOFEOV EQU   DCBOFLGS                                                 00774000
DCBOFLRB EQU   DCBOFLGS                                                 00775000
DCBOFIOD EQU   DCBOFLWR                                                 00776000
DCBDDNAM EQU   IHADCS24                                                 00777000
DCBEXLSA EQU   DCBEXLST+1                                               00778000
DCBRECKL EQU   DCBRECFM                                                 00779000
DCBRECCC EQU   DCBRECFM                                                 00780000
DCBRECSB EQU   DCBRECFM                                                 00781000
DCBRECBR EQU   DCBRECFM                                                 00782000
DCBRECTO EQU   DCBRECLA                                                 00783000
DCBRECL  EQU   DCBRECLA                                                 00784000
DCBEODA  EQU   DCBEODAD+1                                               00785000
DCBBFA   EQU   DCBBFTEK                                                 00786000
DCBH0    EQU   DCBBFTEK                                                 00787000
DCBBFTKD EQU   DCBBFTEK                                                 00788000
DCBBFTE  EQU   DCBBFT                                                   00789000
DCBBFTKR EQU   DCBBFT                                                   00790000
DCBBFTS  EQU   DCBBFT                                                   00791000
DCBH1    EQU   DCBBFTEK                                                 00792000
DCBSVCXA EQU   DCBSVCXL+1                                               00793000
@NM00010 EQU   DCBSVCXL                                                 00794000
DCBODEBA EQU   DCBIOBAA                                                 00795000
@NM00009 EQU   DCBQSLM                                                  00796000
DCBUPDBT EQU   DCBQSLM                                                  00797000
DCBUPDCM EQU   DCBQSLM                                                  00798000
DCB1DVDS EQU   DCBQSLM                                                  00799000
@NM00008 EQU   DCBDSRG2                                                 00800000
DCBDSGTR EQU   DCBDSRG2                                                 00801000
DCBACBM  EQU   DCBDSRG2                                                 00802000
@NM00007 EQU   DCBDSRG2                                                 00803000
DCBDSGTQ EQU   DCBDSRG2                                                 00804000
DCBDSGTX EQU   DCBDSRG2                                                 00805000
DCBDSGGS EQU   DCBDSRG2                                                 00806000
DCBDSGU  EQU   DCBDSRG1                                                 00807000
DCBDSGPO EQU   DCBDSRG1                                                 00808000
@NM00006 EQU   DCBDSRG1                                                 00809000
@NM00005 EQU   DCBDSRG1                                                 00810000
DCBDSGCX EQU   DCBDSRG1                                                 00811000
DCBDSGDA EQU   DCBDSRG1                                                 00812000
DCBDSGPS EQU   DCBDSRG1                                                 00813000
DCBDSGIS EQU   DCBDSRG1                                                 00814000
DCBBUFL  EQU   IHADCS11+8                                               00815000
DCBBUFCA EQU   DCBBUFCB+1                                               00816000
DCBBUFNO EQU   DCBBUFCB                                                 00817000
DCBDEVT  EQU   DCBREL                                                   00818000
DCBKEYLE EQU   DCBRELB                                                  00819000
DCBTRBAL EQU   IHADCS01+6                                               00820000
@NM00004 EQU   IHADCS01+5                                               00821000
@NM00003 EQU   IHADCS01+4                                               00822000
DCBDVTBA EQU   DCBDVTBL+1                                               00823000
@NM00002 EQU   DCBDVTBL                                                 00824000
DCBKEYCN EQU   IHADCS00+4                                               00825000
DCBRELAD EQU   IHADCS00                                                 00826000
@NM00001 EQU   IHADCB                                                   00827000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00828000
@RF00072 EQU   EXIT                                                     00829000
@ENDDATA EQU   *                                                        00830000
         END   ISTINCRS,(C'PLS2114',0702,80232)                         00831000
./  ADD  SSI=02670214,NAME=ISTINCY1
SVTM     TITLE ' SSCP  ISTINFY1  OS/VS APUNS TRANS I/O EXEC'            00001000
ISTINCY1 CSECT ,                                                01S0001 00002000
@MAINENT DS    0H                                               01S0001 00003000
         USING *,@15                                            01S0001 00004000
         B     @PROLOG                                          01S0001 00005000
         DC    AL1(16)                                          01S0001 00006000
         DC    C'ISTINCY1  80.267'                              01S0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                  01S0001 00009000
         BALR  @12,0                                            01S0001 00010000
@PSTART  DS    0H                                               01S0001 00011000
         USING @PSTART,@12                                      01S0001 00012000
         PRINT OFF                                                      00013000
         PRINT ON                                                       00014000
         PRINT OFF                                                      00015000
         PRINT ON                                                       00016000
*      /* MAINLINE CODE OF ISTINFY1  */                         01S0539 00017000
* R1INPUT = R1;         /* SAVE ADDR(INPUT PARAMETER LIST) */   01S0539 00018000
         LR    R1INPUT,R1                                       01S0539 00019000
* RFY FY1PARML BASED(R1INPUT);     /* ADDRESSABILITY FOR PLIST */       00020000
* RFY GTSTOREG RSTD;       /* RESTRICT GETSTORE OUTPUT REG */   01S0541 00021000
*   DO; /* GETSTOR  SIZE(LENGTH(FY1WORKA)+@SIZDATD-4)TYPE(PAGEABLE)CLEA 00022000
*(NO)SAVE(NO) */                                                01S0542 00023000
*                                                               01S0543 00024000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */               01S0543 00025000
*/* END OF ATBUILD */                                           01S0543 00026000
*                                                               01S0543 00027000
*                                                               01S0543 00028000
*   DO;                                                         01S0543 00029000
*   END;                                                        01S0544 00030000
*                                                               01S0545 00031000
*                                                               01S0545 00032000
*   DO;                                                         01S0545 00033000
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                     01S0546 00034000
*   END;                                                        01S0547 00035000
*     GPR00F = LENGTH(FY1WORKA)+@SIZDATD-4;            /*SIZE IN REG0*/ 00036000
         L     GPR00F,@SIZDATD                                  01S0548 00037000
         SL    GPR00F,@CF03374                                  01S0548 00038000
*     DCL 1 CMZA0006 FIXED(31) STATIC LOCAL,                    01S0549 00039000
*           2 * FIXED(8) INIT(0),                    /* OPTION FLAGS */ 00040000
*           2 * FIXED(8) INIT(96),                    /* STORAGE KEY */ 00041000
*           2 * FIXED(8) INIT(231),                /* SUBPOOL NUMBER */ 00042000
*           2 * FIXED(8) INIT('00'X);                /* REQUEST TYPE */ 00043000
*     GPR03F = CMZA0006;                                        01S0550 00044000
*                                                               01S0550 00045000
         L     GPR03F,CMZA0006                                  01S0550 00046000
*   DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */               01S0551 00047000
*     GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/               01S0552 00048000
         L     GPR02P,ATCLCPTR                                  01S0552 00049000
*   END; /*LISATCVT*/                                           01S0553 00050000
*     CALL GPR02P -> ATCGTSTR;                        /*CALL ISTORFSR*/ 00051000
*                                                               01S0554 00052000
*                                                               01S0554 00053000
         L     @15,ATCGTSTR(,GPR02P)                            01S0554 00054000
         BALR  @14,@15                                          01S0554 00055000
*   DO;                                                         01S0555 00056000
*   RFY (GPR00P,GPR01P,GPR02P,GPR03P) UNRSTD;                   01S0556 00057000
*   END;                                                        01S0557 00058000
*                                                               01S0558 00059000
*   END;/* GETSTOR */                                           01S0558 00060000
* IF R15¬=0                          /*GETSTORE OK ? */         01S0559 00061000
*    THEN RETCODE = THRTYTWO;               /* SET RC = 32  */  01S0559 00062000
         LTR   R15,R15                                          01S0559 00063000
         BZ    @RF00559                                         01S0559 00064000
         LA    RETCODE,32                                       01S0560 00065000
*      ELSE DO;                             /*GETSTOR OK    */  01S0561 00066000
         B     @RC00559                                         01S0561 00067000
@RF00559 DS    0H                                               01S0562 00068000
*      R15  = R13;                /*TEMP SAVE CALLERS REGSV PTR*/       00069000
         LR    R15,R13                                          01S0562 00070000
*      R13 =GTSTOREG;                /* REG SAVE PTR      */    01S0563 00071000
         LR    R13,GTSTOREG                                     01S0563 00072000
* RFY GTSTOREG UNRSTD;                                          01S0564 00073000
* RFY FY1WORKA BASED(R13);  /* ADDRESSABILITY FOR WORK AREA */  01S0565 00074000
* R15->FY1FWDPT = R13;              /* SET CALLERS FORWARD PTR */       00075000
         ST    R13,FY1FWDPT(,R15)                               01S0566 00076000
* R13->FY1BAKPT = R15;             /* SET ISTINFY1 BACK PTR */  01S0567 00077000
         ST    R15,FY1BAKPT(,R13)                               01S0567 00078000
* R13-> FY1FWDPT = 0;           /* ZERO ISTINFY1 FORWARD PTR */ 01S0568 00079000
         SLR   @14,@14                                          01S0568 00080000
         ST    @14,FY1FWDPT(,R13)                               01S0568 00081000
* R10 = ADDR(FY1EXTRA);           /* GET ADDR OF COMPILER VARIABLES */  00082000
         LA    R10,FY1EXTRA(,R13)                               01S0569 00083000
* GEN REFS(R10);                                                01S0570 00084000
      USING @DATD,R10            ADDRESSABILITY FOR COMPILER VARIABLES  00085000
*      RFY ISTNCSPL BASED(FY1NCSPL);       /* BASE FOR NCSPL */ 01S0571 00086000
*                                                               01S0571 00087000
*        FY1IOB = FY1IOB && FY1IOB;          /* ZERO IOB   */   01S0572 00088000
         XC    FY1IOB(40,R13),FY1IOB(R13)                       01S0572 00089000
*        FY1IOBW1= IOBWORD1;               /* INIT FIRST WD IOB */      00090000
         MVC   FY1IOBW1(4,R13),@CB03274                         01S0573 00091000
*        FY1IOBW2 = ADDR(FY1ECB);       /* W2 IOB = @ ECB */    01S0574 00092000
         LA    @14,FY1ECB(,R13)                                 01S0574 00093000
         ST    @14,FY1IOBW2(,R13)                               01S0574 00094000
*        FY1IOBW5 = FY1CHPGM;               /* W5 IOB = @ CHAN PGM*/    00095000
         L     @14,FY1CHPGM(,R1INPUT)                           01S0575 00096000
         ST    @14,FY1IOBW5(,R13)                               01S0575 00097000
*        FY1IOBW6 = NCSPLRPT->RPRNSNEA->RPRNCBA->ICNDCBAD;      01S0576 00098000
         L     @14,FY1NCSPL(,R1INPUT)                           01S0576 00099000
         L     @14,NCSPLRPT(,@14)                               01S0576 00100000
         L     @14,RPRNSNEA(,@14)                               01S0576 00101000
         L     @14,RPRNCBA(,@14)                                01S0576 00102000
         L     @09,ICNDCBAD-1(,@14)                             01S0576 00103000
         LA    @09,0(,@09)                                      01S0576 00104000
         ST    @09,FY1IOBW6(,R13)                               01S0576 00105000
*        FY1CC3WE = '1'B;                   /* POST ON CC=3  @ZA27624*/ 00106000
*                                                               01S0577 00107000
         OI    FY1CC3WE(R13),B'01000000'                        01S0577 00108000
*        ACDEBPTR = NCSPLRPT->RPRNSNEA->RPRNCBA->ICNDEBAD;      01S0578 00109000
         L     ACDEBPTR,ICNDEBAD-1(,@14)                        01S0578 00110000
         LA    ACDEBPTR,0(,ACDEBPTR)                            01S0578 00111000
*        ICNCBPTR = NCSPLRPT->RPRNSNEA->RPRNCBA;           /*@AM00431*/ 00112000
         LR    ICNCBPTR,@14                                     01S0579 00113000
*        RFY ISTACDEB BASED(ACDEBPTR); /* BASEING FOR ACDEB */  01S0580 00114000
*        RFY ISTICNCB BASED(ICNCBPTR); /* BASEING FOR ICNCB  @AM00431*/ 00115000
*                                                               01S0581 00116000
*        FY1ECB=ZERO;       /* ZERO ECB */                      01S0582 00117000
         SLR   @14,@14                                          01S0582 00118000
         ST    @14,FY1ECB(,R13)                                 01S0582 00119000
*   EVAL(FY1IOBW6+FORTFOUR)->DCBBITS=FY1BITON; /* BITS ON */    01S0583 00120000
         LA    @14,44                                           01S0583 00121000
         AL    @14,FY1IOBW6(,R13)                               01S0583 00122000
         OI    DCBBITS(@14),B'00001100'                         01S0583 00123000
*        FAPPADSV = ICNAPPAD;       /* SAVE CURRENT STATUS   @AM00431*/ 00124000
         L     FAPPADSV,ICNAPPAD-1(,ICNCBPTR)                   01S0584 00125000
         LA    FAPPADSV,0(,FAPPADSV)                            01S0584 00126000
*        ICNAPPAD = ADDR(ATCDAPVT); /*UNHOOK TPIOS APPENDAGE @AM00431*/ 00127000
*                                                               01S0585 00128000
         L     @14,ATCLCPTR                                     01S0585 00129000
         LA    @14,ATCDAPVT(,@14)                               01S0585 00130000
         STCM  @14,7,ICNAPPAD(ICNCBPTR)                         01S0585 00131000
*               /* END OF INITILIZATION OF IOB  */              01S0586 00132000
*                                                               01S0586 00133000
*/*VMDESET  ((15),ZERO,(2))*/                                   01S0586 00134000
*      DO;                               /* INVOKE MODESET MACRO    */  00135000
*        GEN SETS (2);                                          01S0587 00136000
*                                                               01S0587 00137000
         MODESET EXTKEY=ZERO,SAVEKEY=(2),WORKREG=2                      00138000
*      DO; /* CMZMREG (15) RESTRICT */                          01S0588 00139000
*      RFY (GPR15P) RSTD;                                       01S0589 00140000
*                                                               01S0589 00141000
*      END;/* CMZMREG */                                        01S0590 00142000
*        GPR15F=0;                                              01S0591 00143000
*                                                               01S0591 00144000
         SLR   GPR15F,GPR15F                                    01S0591 00145000
*      DO; /* CMZMREG (15) RELEASE */                           01S0592 00146000
*      RFY (GPR15P) UNRSTD;                                     01S0593 00147000
*                                                               01S0593 00148000
*      END;/* CMZMREG */                 /*PUT RETURN CODE IN RCREG*/   00149000
*      END;  /* VMDESET */                            /*@VS44020*/      00150000
*      R1 = ADDR(ICNUCBAD);                    /*PASS UCB    @VS44020*/ 00151000
         LA    R1,ICNUCBAD(,ICNCBPTR)                           01S0596 00152000
*      CALL ATCVIOPM;           /*GET PATH ASSUME SUCCESS    @VS44020*/ 00153000
*                                                               01S0597 00154000
         L     @09,ATCLCPTR                                     01S0597 00155000
         L     @15,ATCVIOPM(,@09)                               01S0597 00156000
         BALR  @14,@15                                          01S0597 00157000
*/*VMDESET  ((15),,,(2))*/                                      01S0598 00158000
*       DO;                              /* INVOKE MODESET MACRO    */  00159000
*         GEN SETS (2);                                         01S0599 00160000
*                                                               01S0599 00161000
         MODESET KEYADDR=(2),WORKREG=2                                  00162000
*       DO; /* CMZMREG (15) RESTRICT */                         01S0600 00163000
*       RFY (GPR15P) RSTD;                                      01S0601 00164000
*                                                               01S0601 00165000
*       END;/* CMZMREG */                                       01S0602 00166000
*         GPR15F=0;                                             01S0603 00167000
*                                                               01S0603 00168000
         SLR   GPR15F,GPR15F                                    01S0603 00169000
*       DO; /* CMZMREG (15) RELEASE */                          01S0604 00170000
*       RFY (GPR15P) UNRSTD;                                    01S0605 00171000
*                                                               01S0605 00172000
*       END;/* CMZMREG */                /*PUT RETURN CODE IN RCREG*/   00173000
*       END;  /* VMDESET */                              /*@VS44020*/   00174000
*        R1 = ADDR(FY1IOB);          /* ADDR OF IOB */          01S0608 00175000
         LA    R1,FY1IOB(,R13)                                  01S0608 00176000
* GEN CODE SETS(FY1IOB,FY1ECB) REFS(R1);                   /*@AM00432*/ 00177000
         EXCP (R1)                                                      00178000
         WAIT ECB=FY1ECB(,13)                                           00179000
*       IF FY1ECBRC = FY1IONRM              /*I/O COMP NORM?*/  01S0610 00180000
*         & FY1CSWST = FY1CEDE              /* AND CE, DE ONLY */       00181000
*         THEN                              /* YES  */          01S0610 00182000
         CLI   FY1ECBRC(R13),X'7F'                              01S0610 00183000
         BNE   @RF00610                                         01S0610 00184000
         CLC   FY1CSWST(2,R13),@CB00905                         01S0610 00185000
         BNE   @RF00610                                         01S0610 00186000
*           RETCODE = ZERO;                /* GOOD RC  */       01S0611 00187000
         SLR   RETCODE,RETCODE                                  01S0611 00188000
*         ELSE DO;                          /* NOT NORM I/O */  01S0612 00189000
         B     @RC00610                                         01S0612 00190000
@RF00610 DS    0H                                               01S0613 00191000
*           IF FY1SIOCC = FY1BITON          /* SIO CC = 3? */   01S0613 00192000
*              THEN                         /* YES  */          01S0613 00193000
         TM    FY1SIOCC(R13),B'00110000'                        01S0613 00194000
         BNO   @RF00613                                         01S0613 00195000
*                RETCODE = EIGHT;          /* RC = 8  */        01S0614 00196000
         LA    RETCODE,8                                        01S0614 00197000
*              ELSE DO;                     /* SIO CC ¬=3 */    01S0615 00198000
         B     @RC00613                                         01S0615 00199000
@RF00613 DS    0H                                               01S0616 00200000
*                RETCODE = FOUR;           /* RC = 4  */        01S0616 00201000
         LA    RETCODE,4                                        01S0616 00202000
*                FYENDCSW->FY1CSW = FY1IOBW3;                   01S0617 00203000
         L     @14,FYENDCSW(,R1INPUT)                           01S0617 00204000
         MVC   FY1CSW(8,@14),FY1IOBW3(R13)                      01S0617 00205000
*                FY1SENSE->CY1SENS = FY1SDATA;                  01S0618 00206000
         L     @14,FY1SENSE(,R1INPUT)                           01S0618 00207000
         MVC   CY1SENS(2,@14),FY1SDATA(R13)                     01S0618 00208000
*                   END;                    /* END SIO CC ¬=3 */        00209000
*              END;                         /* END NOT NORM I/O */      00210000
*                                                               01S0620 00211000
@RC00613 DS    0H                                               01S0621 00212000
*          ICNAPPAD = FAPPADSV;      /* HOOK UP TPIOS APDG   @AM00431*/ 00213000
@RC00610 STCM  FAPPADSV,7,ICNAPPAD(ICNCBPTR)                    01S0621 00214000
*   EVAL(FY1IOBW6+FORTFOUR)->DCBBITS=FY1BTOFF; /* BITS ON    @AM00430*/ 00215000
         LA    @14,44                                           01S0622 00216000
         AL    @14,FY1IOBW6(,R13)                               01S0622 00217000
         NI    DCBBITS(@14),B'11110011'                         01S0622 00218000
*    R13 = R13->FY1BAKPT;    /* RESTORE ADDR CALLER SAVE AREA */        00219000
         L     R13,FY1BAKPT(,R13)                               01S0623 00220000
*    R11 = RETCODE;        /* SAVE EXTERNAL RETURN CODE */      01S0624 00221000
*                                                               01S0624 00222000
         LR    R11,RETCODE                                      01S0624 00223000
*     DO; /* FREESTOR  AREA((R13->FY1FWDPT))SIZE(LENGTH(FY1WORKA)+@SIZD 00224000
*TD-4)TYPE(PAGEABLE)CLEAR(NO)SAVE(NO) */                        01S0625 00225000
*                                                               01S0626 00226000
*/* ATBUILD (ISTPAB,ISTDYPAB,ISTATCVT,ISTRPH)  */               01S0626 00227000
*/* END OF ATBUILD */                                           01S0626 00228000
*                                                               01S0626 00229000
*                                                               01S0626 00230000
*     DO;                                                       01S0626 00231000
*     END;                                                      01S0627 00232000
*                                                               01S0628 00233000
*                                                               01S0628 00234000
*     DO;                                                       01S0628 00235000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P) RSTD;                   01S0629 00236000
*     END;                                                      01S0630 00237000
*       GPR00F = LENGTH(FY1WORKA)+@SIZDATD-4;          /*SIZE IN REG0*/ 00238000
         L     GPR00F,@SIZDATD                                  01S0631 00239000
         SL    GPR00F,@CF03374                                  01S0631 00240000
*       DCL 1 CMZA0044 FIXED(31) STATIC LOCAL,                  01S0632 00241000
*             2 * FIXED(8) INIT(0),                  /* OPTION FLAGS */ 00242000
*             2 * FIXED(8) INIT(96),                  /* STORAGE KEY */ 00243000
*             2 * FIXED(8) INIT(231),              /* SUBPOOL NUMBER */ 00244000
*             2 * FIXED(8) INIT('01'X);              /* REQUEST TYPE */ 00245000
*       GPR03F = CMZA0044;                                      01S0633 00246000
*                                                               01S0633 00247000
*                                                               01S0633 00248000
         L     GPR03F,CMZA0044                                  01S0633 00249000
*     DO;                                                       01S0634 00250000
*     RFY (GPR04P) RSTD;                                        01S0635 00251000
*     END;                                                      01S0636 00252000
*       GPR04P = (R13->FY1FWDPT);         /*PUT FREEMAIN ADDR IN REG4*/ 00253000
*                                                               01S0637 00254000
         L     GPR04P,FY1FWDPT(,R13)                            01S0637 00255000
*     DO; /* LISATCVT CVTBASE(PAGEABLE,(GPR02P)) */             01S0638 00256000
*       GPR02P = ATCLCPTR; /*SET UP ATCVT POINTER*/             01S0639 00257000
         L     GPR02P,ATCLCPTR                                  01S0639 00258000
*     END; /*LISATCVT*/                                         01S0640 00259000
*       CALL GPR02P -> ATCGTSTR;                      /*CALL ISTORFSR*/ 00260000
*                                                               01S0641 00261000
*                                                               01S0641 00262000
         L     @15,ATCGTSTR(,GPR02P)                            01S0641 00263000
         BALR  @14,@15                                          01S0641 00264000
*     DO;                                                       01S0642 00265000
*     RFY (GPR00P,GPR01P,GPR02P,GPR03P,GPR04P) UNRSTD;          01S0643 00266000
*     END;                                                      01S0644 00267000
*                                                               01S0645 00268000
*     END;/* FREESTOR */                                        01S0645 00269000
*                                                               01S0645 00270000
*                                                               01S0645 00271000
*    END;                           /* END GET STOR OK */       01S0646 00272000
*RETURN CODE(R11);      /* RETURN TO THE CALLER */              01S0647 00273000
*                                                               01S0647 00274000
@RC00559 LR    @15,R11                                          01S0647 00275000
         L     @14,12(,@13)                                     01S0647 00276000
         LM    @00,@12,20(@13)                                  01S0647 00277000
         BR    @14                                              01S0647 00278000
*   DO; /* TPEPILOG   */                                        01S0648 00279000
*                                                               01S0649 00280000
*   GEN (PRINT OFF);                                            01S0649 00281000
*                                                               01S0649 00282000
         PRINT OFF                                                      00283000
*   DO;                                                         01S0650 00284000
*   DCL GPR00F FIXED(31) REG(00),GPR00P PTR(31) REG(00),GPR01F FIXED(31 00285000
* REG(01),GPR01P PTR(31) REG(01),GPR02F FIXED(31) REG(02),GPR02P PTR(31 00286000
* REG(02),GPR03F FIXED(31) REG(03),GPR03P PTR(31) REG(03),GPR04F FIXED( 00287000
*1) REG(04),GPR04P PTR(31) REG(04),GPR05F FIXED(31) REG(05),GPR05P PTR( 00288000
*1) REG(05),GPR06F FIXED(31) REG(06),GPR06P PTR(31) REG(06),GPR07F FIXE 00289000
*(31) REG(07),GPR07P PTR(31) REG(07),GPR08F FIXED(31) REG(08),GPR08P PT 00290000
*(31) REG(08),GPR09F FIXED(31) REG(09),GPR09P PTR(31) REG(09),GPR10F FI 00291000
*ED(31) REG(10),GPR10P PTR(31) REG(10),GPR11F FIXED(31) REG(11),GPR11P  00292000
*TR(31) REG(11),GPR12F FIXED(31) REG(12),GPR12P PTR(31) REG(12),GPR13F  00293000
*IXED(31) REG(13),GPR13P PTR(31) REG(13),GPR14F FIXED(31) REG(14),GPR14 00294000
* PTR(31) REG(14),GPR15F FIXED(31) REG(15),GPR15P PTR(31) REG(15);      00295000
*   END;                                                        01S0652 00296000
*                                                               01S0653 00297000
*   GEN (PRINT ON);                                             01S0653 00298000
         PRINT ON                                                       00299000
*   END;/* TPEPILOG */                                          01S0654 00300000
*      END                   /* END OF PROCEDURE ISTINFY1 */    01S0655 00301000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.      * 00302000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                        * 00303000
*/*%INCLUDE SYSLIB  (IHASRB  )                                        * 00304000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                        * 00305000
*;                                                              01S0655 00306000
@EL00001 DS    0H                                               01S0655 00307000
@EF00001 DS    0H                                               01S0655 00308000
@ER00001 LM    @14,@12,12(@13)                                  01S0655 00309000
         BR    @14                                              01S0655 00310000
@DATA    DS    0H                                                       00311000
@DATD    DSECT                                                          00312000
         DS    0F                                                       00313000
ISTINCY1 CSECT                                                          00314000
         DS    0F                                                       00315000
@CF03374 DC    F'-120'                                                  00316000
@DATD    DSECT                                                          00317000
         DS    0D                                                       00318000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00319000
@ENDDATD EQU   *                                                        00320000
ISTINCY1 CSECT                                                          00321000
         DS    0F                                                       00322000
@SIZDATD DC    AL1(0)                                                   00323000
         DC    AL3(@ENDDATD-@DATD)                                      00324000
         DS    0D                                                       00325000
CMZA0006 DS    FL4                                                      00326000
         ORG   CMZA0006                                                 00327000
@NM00250 DC    AL1(0)                                                   00328000
@NM00251 DC    AL1(96)                                                  00329000
@NM00252 DC    AL1(231)                                                 00330000
@NM00253 DC    XL1'00'                                                  00331000
         ORG   CMZA0006+4                                               00332000
CMZA0044 DS    FL4                                                      00333000
         ORG   CMZA0044                                                 00334000
@NM00254 DC    AL1(0)                                                   00335000
@NM00255 DC    AL1(96)                                                  00336000
@NM00256 DC    AL1(231)                                                 00337000
@NM00257 DC    XL1'01'                                                  00338000
         ORG   CMZA0044+4                                               00339000
@CB03274 DC    X'42000000'                                              00340000
@CB00905 DC    X'0C00'                                                  00341000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00342000
@01      EQU   01                                                       00343000
@02      EQU   02                                                       00344000
@03      EQU   03                                                       00345000
@04      EQU   04                                                       00346000
@05      EQU   05                                                       00347000
@06      EQU   06                                                       00348000
@07      EQU   07                                                       00349000
@08      EQU   08                                                       00350000
@09      EQU   09                                                       00351000
@10      EQU   10                                                       00352000
@11      EQU   11                                                       00353000
@12      EQU   12                                                       00354000
@13      EQU   13                                                       00355000
@14      EQU   14                                                       00356000
@15      EQU   15                                                       00357000
RETCODE  EQU   @07                                                      00358000
FAPPADSV EQU   @08                                                      00359000
ICNCBPTR EQU   @04                                                      00360000
ACDEBPTR EQU   @04                                                      00361000
NCBREG00 EQU   @00                                                      00362000
RPHPTR   EQU   @01                                                      00363000
R0       EQU   @00                                                      00364000
R1       EQU   @01                                                      00365000
R2       EQU   @02                                                      00366000
R1INPUT  EQU   @11                                                      00367000
GTSTOREG EQU   @03                                                      00368000
BASEREG  EQU   @12                                                      00369000
R10      EQU   @10                                                      00370000
R11      EQU   @11                                                      00371000
R13      EQU   @13                                                      00372000
R15      EQU   @15                                                      00373000
GPR00P   EQU   @00                                                      00374000
GPR01P   EQU   @01                                                      00375000
GPR02P   EQU   @02                                                      00376000
GPR03P   EQU   @03                                                      00377000
GPR00F   EQU   @00                                                      00378000
GPR03F   EQU   @03                                                      00379000
GPR15P   EQU   @15                                                      00380000
GPR15F   EQU   @15                                                      00381000
GPR04P   EQU   @04                                                      00382000
GPR01F   EQU   @01                                                      00383000
GPR02F   EQU   @02                                                      00384000
GPR04F   EQU   @04                                                      00385000
GPR05F   EQU   @05                                                      00386000
GPR05P   EQU   @05                                                      00387000
GPR06F   EQU   @06                                                      00388000
GPR06P   EQU   @06                                                      00389000
GPR07F   EQU   @07                                                      00390000
GPR07P   EQU   @07                                                      00391000
GPR08F   EQU   @08                                                      00392000
GPR08P   EQU   @08                                                      00393000
GPR09F   EQU   @09                                                      00394000
GPR09P   EQU   @09                                                      00395000
GPR10F   EQU   @10                                                      00396000
GPR10P   EQU   @10                                                      00397000
GPR11F   EQU   @11                                                      00398000
GPR11P   EQU   @11                                                      00399000
GPR12F   EQU   @12                                                      00400000
GPR12P   EQU   @12                                                      00401000
GPR13F   EQU   @13                                                      00402000
GPR13P   EQU   @13                                                      00403000
GPR14F   EQU   @14                                                      00404000
GPR14P   EQU   @14                                                      00405000
ATCLCPTR EQU   1032                                                     00406000
IOSB     EQU   0                                                        00407000
IOSFLA   EQU   IOSB                                                     00408000
IOSACHN  EQU   IOSFLA                                                   00409000
IOSFLB   EQU   IOSB+1                                                   00410000
IOSFLC   EQU   IOSB+2                                                   00411000
IOSDVALT EQU   IOSFLC                                                   00412000
IOSPKEY  EQU   IOSB+12                                                  00413000
IOSOPT   EQU   IOSB+14                                                  00414000
IOSOPT2  EQU   IOSB+15                                                  00415000
@NM00002 EQU   IOSB+20                                                  00416000
IOSCSW   EQU   @NM00002+1                                               00417000
IOSTATUS EQU   IOSCSW+3                                                 00418000
IOSIPIB  EQU   IOSB+44                                                  00419000
IOSPATH  EQU   IOSB+86                                                  00420000
IOSCHN   EQU   IOSPATH                                                  00421000
IOSCKEY  EQU   IOSB+89                                                  00422000
IOSEEKA  EQU   IOSB+100                                                 00423000
IOSCCHH  EQU   IOSEEKA+3                                                00424000
IOSSKHH  EQU   IOSCCHH+2                                                00425000
SRBSECT  EQU   0                                                        00426000
SRBFLC   EQU   SRBSECT+12                                               00427000
IOBPREFX EQU   0                                                        00428000
IOBCFLG1 EQU   IOBPREFX                                                 00429000
IOBSTDRD EQU   0                                                        00430000
IOBFLAG1 EQU   IOBSTDRD                                                 00431000
IOBCYCCK EQU   IOBFLAG1                                                 00432000
IOBRSTRT EQU   IOBFLAG1                                                 00433000
IOBFLAG2 EQU   IOBSTDRD+1                                               00434000
IOBPURGE EQU   IOBFLAG2                                                 00435000
IOBRDHA0 EQU   IOBFLAG2                                                 00436000
IOBSENS0 EQU   IOBSTDRD+2                                               00437000
IOBS0B7  EQU   IOBSENS0                                                 00438000
IOBSENS1 EQU   IOBSTDRD+3                                               00439000
IOBECBPT EQU   IOBSTDRD+4                                               00440000
IOBFLAG3 EQU   IOBSTDRD+8                                               00441000
IOBFL3   EQU   IOBFLAG3                                                 00442000
IOBCNC   EQU   IOBFL3                                                   00443000
IOBICL   EQU   IOBFL3                                                   00444000
IOBCSW   EQU   IOBSTDRD+9                                               00445000
IOBIOCSW EQU   IOBCSW                                                   00446000
IOBSTBYT EQU   IOBIOCSW+3                                               00447000
IOBUSTAT EQU   IOBSTBYT                                                 00448000
IOBCSTAT EQU   IOBSTBYT+1                                               00449000
IOBSTART EQU   IOBSTDRD+16                                              00450000
IOBDCBPT EQU   IOBSTDRD+20                                              00451000
IOBFLAG4 EQU   IOBDCBPT                                                 00452000
IOBRESTR EQU   IOBSTDRD+24                                              00453000
IOBINCAM EQU   IOBSTDRD+28                                              00454000
IOBBTAMF EQU   IOBINCAM                                                 00455000
ISTPOHD  EQU   0                                                        00456000
POHSTAT  EQU   ISTPOHD+1                                                00457000
ISTCPCB  EQU   0                                                        00458000
CPCBFL   EQU   ISTCPCB+2                                                00459000
CPCBTD   EQU   ISTCPCB+8                                                00460000
@NM00010 EQU   CPCBTD                                                   00461000
CPCBPH   EQU   CPCBTD+4                                                 00462000
CPCBOPC  EQU   ISTCPCB+16                                               00463000
ISTNCSPL EQU   0                                                        00464000
NCSPFX   EQU   ISTNCSPL                                                 00465000
NCSFLAGS EQU   NCSPFX+2                                                 00466000
NCSPLWEL EQU   NCSPFX+8                                                 00467000
@NM00018 EQU   NCSPFX+16                                                00468000
NCSVERB  EQU   @NM00018+1                                               00469000
NCSPLVBF EQU   NCSVERB+1                                                00470000
NCSPLSID EQU   NCSPFX+35                                                00471000
NCSPLSTA EQU   NCSPLSID                                                 00472000
NCSPLPHD EQU   NCSPLSID+1                                               00473000
NCSCRRTN EQU   ISTNCSPL+44                                              00474000
NCSPLVFL EQU   ISTNCSPL+45                                              00475000
NCSPLLID EQU   ISTNCSPL+61                                              00476000
NCSCDRMN EQU   NCSPLLID                                                 00477000
NCSTROPT EQU   ISTNCSPL+79                                              00478000
NCSPLRPT EQU   ISTNCSPL+80                                              00479000
NCSPLCMD EQU   ISTNCSPL+88                                              00480000
NCSCMDA  EQU   NCSPLCMD                                                 00481000
NCSITFL2 EQU   ISTNCSPL+90                                              00482000
NCSCRFLG EQU   ISTNCSPL+95                                              00483000
NCSIOCID EQU   ISTNCSPL+176                                             00484000
NCSPLCID EQU   NCSIOCID                                                 00485000
NCSMDFY  EQU   ISTNCSPL+188                                             00486000
NCSPLFSB EQU   ISTNCSPL+196                                             00487000
NCSPLFL1 EQU   ISTNCSPL+200                                             00488000
NCSPLFL2 EQU   ISTNCSPL+201                                             00489000
NCSPLFL3 EQU   ISTNCSPL+202                                             00490000
NCSPLFL4 EQU   ISTNCSPL+203                                             00491000
NCSPLFL5 EQU   ISTNCSPL+205                                             00492000
NCSPLAPP EQU   ISTNCSPL+228                                             00493000
NCSSENSE EQU   ISTNCSPL+264                                             00494000
NCSPLREP EQU   ISTNCSPL+268                                             00495000
NCSCRMSK EQU   ISTNCSPL+284                                             00496000
NCSCHKPT EQU   NCSCRMSK                                                 00497000
NCSCRMOD EQU   NCSCRMSK+2                                               00498000
NCSPLFL6 EQU   ISTNCSPL+316                                             00499000
NCSNCPLF EQU   ISTNCSPL+333                                             00500000
NCSNCPDF EQU   ISTNCSPL+341                                             00501000
NCSPLITF EQU   0                                                        00502000
NCSITFL1 EQU   NCSPLITF                                                 00503000
NCSAPP   EQU   0                                                        00504000
NCSAPBUE EQU   NCSAPP+88                                                00505000
NCSUSSRU EQU   0                                                        00506000
ISTSRT   EQU   0                                                        00507000
SRTSRTE  EQU   ISTSRT+8                                                 00508000
SRTXTNBS EQU   ISTSRT+13                                                00509000
ISTDEVCH EQU   0                                                        00510000
DEVSHCH  EQU   ISTDEVCH                                                 00511000
DEVCHAR  EQU   DEVSHCH                                                  00512000
DEVTCODE EQU   ISTDEVCH+1                                               00513000
DEVFLAGS EQU   ISTDEVCH+3                                               00514000
DEVFCCTL EQU   DEVFLAGS                                                 00515000
DEVCHAR3 EQU   DEVFLAGS                                                 00516000
DEVMODE  EQU   ISTDEVCH+5                                               00517000
ISTLOK   EQU   0                                                        00518000
LOKCHN   EQU   ISTLOK+1                                                 00519000
LOKCHNG  EQU   LOKCHN                                                   00520000
@NM00037 EQU   LOKCHNG+2                                                00521000
ISTRPRE  EQU   0                                                        00522000
RPRSRTHD EQU   ISTRPRE                                                  00523000
RPRDAFID EQU   ISTRPRE+16                                               00524000
RPRNCBA  EQU   ISTRPRE+40                                               00525000
RPRNSNEA EQU   ISTRPRE+44                                               00526000
RPRSTATE EQU   ISTRPRE+56                                               00527000
RPRCURST EQU   RPRSTATE                                                 00528000
RPRDESST EQU   RPRSTATE+2                                               00529000
RPRBITAN EQU   ISTRPRE+61                                               00530000
RPRFLAGS EQU   ISTRPRE+66                                               00531000
ISTRCPRE EQU   0                                                        00532000
RCPSARRY EQU   ISTRCPRE+84                                              00533000
RCPPACE  EQU   ISTRCPRE+108                                             00534000
RCPNCPPC EQU   ISTRCPRE+110                                             00535000
RCPPMODE EQU   ISTRCPRE+113                                             00536000
RCPCYMOD EQU   RCPPMODE                                                 00537000
RCPCYSET EQU   RCPPMODE                                                 00538000
RCPSESSM EQU   ISTRCPRE+115                                             00539000
RCPBITAN EQU   ISTRCPRE+116                                             00540000
ISTRAP   EQU   0                                                        00541000
RAPBITAN EQU   ISTRAP+165                                               00542000
ISTRDT   EQU   0                                                        00543000
RDTPLEN  EQU   ISTRDT+84                                                00544000
RDTPRIOR EQU   RDTPLEN                                                  00545000
RDTBITAN EQU   ISTRDT+113                                               00546000
RDTCRIA  EQU   ISTRDT+116                                               00547000
ISTRLN   EQU   0                                                        00548000
RLNADR   EQU   ISTRLN+84                                                00549000
RLNFLAG  EQU   RLNADR                                                   00550000
RLNUCBAD EQU   RLNADR+1                                                 00551000
RLNCSLRC EQU   ISTRLN+104                                               00552000
RLNBITAN EQU   ISTRLN+112                                               00553000
RLNRACNT EQU   RLNBITAN                                                 00554000
RLNCONCT EQU   RLNBITAN+2                                               00555000
RLNLSCMD EQU   RLNBITAN+3                                               00556000
RLNINBFR EQU   ISTRLN+132                                               00557000
ISTRPU   EQU   0                                                        00558000
RPUSTAID EQU   ISTRPU+92                                                00559000
RPUID48  EQU   RPUSTAID+2                                               00560000
ISTRAPRE EQU   0                                                        00561000
ISTRTR   EQU   0                                                        00562000
RTRADR   EQU   ISTRTR+144                                               00563000
RTRFLAG  EQU   RTRADR                                                   00564000
RTRBITAN EQU   ISTRTR+164                                               00565000
RTRRAALL EQU   RTRBITAN                                                 00566000
RTRBSCID EQU   ISTRTR+171                                               00567000
ISTRSW   EQU   0                                                        00568000
ISTRRN   EQU   0                                                        00569000
RRNADR   EQU   ISTRRN+136                                               00570000
RRNFLAG  EQU   RRNADR                                                   00571000
RRNUCBAD EQU   RRNADR+1                                                 00572000
RRNHPRE  EQU   ISTRRN+196                                               00573000
RRNBITAN EQU   ISTRRN+201                                               00574000
RRNLVL   EQU   ISTRRN+204                                               00575000
RRNNMDPD EQU   ISTRRN+232                                               00576000
RRNLDFSM EQU   ISTRRN+298                                               00577000
ISTRPX   EQU   0                                                        00578000
ISTRPT   EQU   0                                                        00579000
RPTXTCID EQU   ISTRPT+136                                               00580000
RPTLNCID EQU   RPTXTCID                                                 00581000
RPTDITT  EQU   ISTRPT+144                                               00582000
RPTBITAN EQU   ISTRPT+166                                               00583000
ISTRLX   EQU   0                                                        00584000
RLXBITAN EQU   ISTRLX+92                                                00585000
ISTRLU   EQU   0                                                        00586000
RLUBITAN EQU   ISTRLU+146                                               00587000
ISTRLS   EQU   0                                                        00588000
ISTRLC   EQU   0                                                        00589000
RLCADR   EQU   ISTRLC+84                                                00590000
RLCFLAG  EQU   RLCADR                                                   00591000
ISTRIN   EQU   0                                                        00592000
RINDAFID EQU   ISTRIN+124                                               00593000
RINBITAN EQU   ISTRIN+130                                               00594000
RINFLAGS EQU   ISTRIN+149                                               00595000
ISTRGP   EQU   0                                                        00596000
RGPBITAN EQU   ISTRGP+94                                                00597000
ISTRDS   EQU   0                                                        00598000
ISTRDA   EQU   0                                                        00599000
ISTRCL   EQU   0                                                        00600000
RCLADR   EQU   ISTRCL+84                                                00601000
RCLFLAG  EQU   RCLADR                                                   00602000
ISTRCDRS EQU   0                                                        00603000
@NM00142 EQU   ISTRCDRS+166                                             00604000
ISTRCDRM EQU   0                                                        00605000
RCDRMPDN EQU   ISTRCDRM+188                                             00606000
RCDRMRPQ EQU   ISTRCDRM+196                                             00607000
RCDRMFGS EQU   ISTRCDRM+208                                             00608000
ISTRCC   EQU   0                                                        00609000
RCCBITAN EQU   ISTRCC+105                                               00610000
ISTPAT   EQU   0                                                        00611000
PATFLAGA EQU   ISTPAT+7                                                 00612000
ISTGNT   EQU   0                                                        00613000
ISTDOT   EQU   0                                                        00614000
ISTDNT   EQU   0                                                        00615000
DNTTELNO EQU   ISTDNT+1                                                 00616000
ISTPAB   EQU   0                                                        00617000
PABWQCHN EQU   ISTPAB                                                   00618000
PABWEQA  EQU   PABWQCHN                                                 00619000
PABCHAIN EQU   PABWQCHN+4                                               00620000
PABRPHFG EQU   ISTPAB+12                                                00621000
PABFLAGS EQU   PABRPHFG                                                 00622000
PABEND   EQU   ISTPAB+16                                                00623000
ISTDYPAB EQU   0                                                        00624000
DYPCHAIN EQU   ISTDYPAB+4                                               00625000
DYPPACMD EQU   ISTDYPAB+12                                              00626000
ISTCCW   EQU   0                                                        00627000
CCWVADDR EQU   ISTCCW                                                   00628000
CCWFLAGS EQU   ISTCCW+4                                                 00629000
ISTNCB   EQU   0                                                        00630000
NCBBASE  EQU   ISTNCB                                                   00631000
NCBPCDYP EQU   NCBBASE+16                                               00632000
NCBDLCIA EQU   ISTNCB+48                                                00633000
NCBPENDQ EQU   NCBDLCIA+32                                              00634000
NCBBUFFQ EQU   NCBDLCIA+40                                              00635000
NCBSENSE EQU   NCBDLCIA+60                                              00636000
NCBBFT   EQU   NCBDLCIA+76                                              00637000
NCBFLAGS EQU   NCBDLCIA+92                                              00638000
NCBDSFLG EQU   NCBFLAGS                                                 00639000
NCBUFFLG EQU   NCBFLAGS+1                                               00640000
NCBCEFLG EQU   NCBFLAGS+2                                               00641000
ISTICNCB EQU   0                                                        00642000
ICNDEVCA EQU   ISTICNCB+152                                             00643000
@NM00176 EQU   ISTICNCB+220                                             00644000
ICNSYSUA EQU   ISTICNCB+240                                             00645000
ICNCKFLD EQU   ICNSYSUA                                                 00646000
ICNDCDEB EQU   ICNSYSUA+16                                              00647000
ICNDCBAD EQU   ICNDCDEB+25                                              00648000
ICNAPPAD EQU   ICNDCDEB+29                                              00649000
ICNUCBAD EQU   ICNDCDEB+32                                              00650000
ICNDIDEB EQU   ICNDCDEB+36                                              00651000
ICNDEBAD EQU   ICNDIDEB+1                                               00652000
ICNSPACE EQU   ICNDCDEB+40                                              00653000
ISTRPH   EQU   0                                                        00654000
RPHCNTL  EQU   ISTRPH                                                   00655000
RPHFLAGS EQU   RPHCNTL+2                                                00656000
RPHFLGB  EQU   RPHCNTL+3                                                00657000
RPHRPHA  EQU   ISTRPH+4                                                 00658000
RPHTSKID EQU   ISTRPH+8                                                 00659000
RPHRESMA EQU   ISTRPH+16                                                00660000
RPHWPFLG EQU   RPHRESMA                                                 00661000
RPHWEA   EQU   ISTRPH+24                                                00662000
RPHSRPRM EQU   ISTRPH+28                                                00663000
RPHWORK  EQU   ISTRPH+36                                                00664000
RPHSAVE1 EQU   RPHWORK                                                  00665000
RPHSBITS EQU   RPHSAVE1+1                                               00666000
ISTATCVT EQU   0                                                        00667000
ATCRPTCH EQU   ISTATCVT                                                 00668000
ATCITFLD EQU   ISTATCVT+8                                               00669000
ATCITPRM EQU   ATCITFLD                                                 00670000
ATCITCDS EQU   ATCITFLD+8                                               00671000
ATCITFLG EQU   ATCITCDS+4                                               00672000
ATCITRA1 EQU   ATCITFLG+2                                               00673000
ATCSMPAB EQU   ISTATCVT+88                                              00674000
ATCLDTIL EQU   ISTATCVT+408                                             00675000
ATCGTSTR EQU   ISTATCVT+644                                             00676000
ATCLUDVT EQU   ISTATCVT+800                                             00677000
ATCANYDT EQU   ISTATCVT+808                                             00678000
@NM00201 EQU   ISTATCVT+812                                             00679000
ATCPODVT EQU   ISTATCVT+832                                             00680000
ATCSSDVT EQU   ISTATCVT+940                                             00681000
ATCSODVT EQU   ISTATCVT+944                                             00682000
ATCMBDVT EQU   ISTATCVT+952                                             00683000
ATCSTAT  EQU   ISTATCVT+972                                             00684000
ATCSTAT1 EQU   ATCSTAT                                                  00685000
@NM00202 EQU   ATCSTAT+1                                                00686000
ATCPOFLG EQU   ATCSTAT+2                                                00687000
ATCSTAT4 EQU   ATCSTAT+3                                                00688000
ATCBITAN EQU   ISTATCVT+976                                             00689000
ATCFLAG2 EQU   ATCBITAN+1                                               00690000
ATCONID  EQU   ISTATCVT+980                                             00691000
ATCSSCPA EQU   ISTATCVT+984                                             00692000
ATCHPGM  EQU   ISTATCVT+1040                                            00693000
ATCRNO   EQU   ISTATCVT+1044                                            00694000
ATCCPDVT EQU   ISTATCVT+1092                                            00695000
ATCSMSDQ EQU   ISTATCVT+1128                                            00696000
ATCRID   EQU   ISTATCVT+1144                                            00697000
ATCTKFLD EQU   ISTATCVT+1156                                            00698000
ATCIOINT EQU   ISTATCVT+1176                                            00699000
ATCTOD   EQU   ISTATCVT+1220                                            00700000
ATCVRTIL EQU   ISTATCVT+1264                                            00701000
ATCLKSWP EQU   ISTATCVT+1440                                            00702000
ATCWUDYP EQU   ISTATCVT+1448                                            00703000
ATCSQAFR EQU   ISTATCVT+1560                                            00704000
ATCORTCB EQU   ATCSQAFR+4                                               00705000
ATCORSRB EQU   ATCORTCB                                                 00706000
ATCLDAPP EQU   ISTATCVT+1600                                            00707000
ATCDAPVT EQU   ISTATCVT+1620                                            00708000
ATCGSRBQ EQU   ISTATCVT+1672                                            00709000
ATCGSRBG EQU   ATCGSRBQ                                                 00710000
ATCENFLG EQU   ISTATCVT+1722                                            00711000
ATCCSCB  EQU   ISTATCVT+1724                                            00712000
ATCVTFLG EQU   ISTATCVT+1784                                            00713000
@NM00232 EQU   ISTATCVT+1816                                            00714000
ATCVIOPM EQU   ISTATCVT+1832                                            00715000
ATCCRA   EQU   ISTATCVT+1840                                            00716000
ATCCRACN EQU   ATCCRA+4                                                 00717000
ATCCRPL  EQU   ISTATCVT+1848                                            00718000
ATCRPLCN EQU   ATCCRPL+4                                                00719000
ISTACDEB EQU   0                                                        00720000
ACDANYQ  EQU   ISTACDEB+48                                              00721000
ACDLUFLG EQU   ISTACDEB+102                                             00722000
@NM00238 EQU   ISTACDEB+114                                             00723000
FY1WORKA EQU   0                                                        00724000
FY1IOB   EQU   FY1WORKA+72                                              00725000
FY1IOBW1 EQU   FY1IOB                                                   00726000
FY1SDATA EQU   FY1IOBW1+2                                               00727000
FY1IOBW2 EQU   FY1IOB+4                                                 00728000
FY1IOBW3 EQU   FY1IOB+8                                                 00729000
FY1IOBW4 EQU   FY1IOBW3+4                                               00730000
FY1CSWST EQU   FY1IOBW4                                                 00731000
FY1IOBW5 EQU   FY1IOB+16                                                00732000
FY1SIOCC EQU   FY1IOBW5                                                 00733000
FY1IOBW6 EQU   FY1IOB+20                                                00734000
FY1CC3WE EQU   FY1IOBW6                                                 00735000
FY1ECB   EQU   FY1WORKA+112                                             00736000
FY1ECBRC EQU   FY1ECB                                                   00737000
FY1EXTRA EQU   FY1WORKA+120                                             00738000
FY1CSW   EQU   0                                                        00739000
CY1SENS  EQU   0                                                        00740000
FY1PARML EQU   0                                                        00741000
FY1CHPGM EQU   FY1PARML                                                 00742000
FY1NCSPL EQU   FY1PARML+4                                               00743000
FYENDCSW EQU   FY1PARML+8                                               00744000
FY1SENSE EQU   FY1PARML+12                                              00745000
FY1DBITS EQU   0                                                        00746000
DCBBITS  EQU   FY1DBITS                                                 00747000
FY1RGSAV EQU   0                                                        00748000
FY1BAKPT EQU   FY1RGSAV+4                                               00749000
FY1FWDPT EQU   FY1RGSAV+8                                               00750000
ISTXDYP  EQU   0                                                        00751000
IOSATTSC EQU   IOSIPIB                                                  00752000
IOSWTOWA EQU   IOSIPIB                                                  00753000
IOSPCISC EQU   IOSIPIB                                                  00754000
IOBORG01 EQU   IOBPREFX+8                                               00755000
IOBNIOBA EQU   IOBORG01                                                 00756000
IOBNFLG1 EQU   IOBNIOBA                                                 00757000
IOBPRTOV EQU   IOBNFLG1                                                 00758000
IOBORG02 EQU   IOBPREFX+8                                               00759000
IOBDQADA EQU   IOBORG02                                                 00760000
IOBDEQIN EQU   IOBDQADA                                                 00761000
IOBORG03 EQU   IOBPREFX+12                                              00762000
IOBORG04 EQU   IOBINCAM                                                 00763000
IOBORG12 EQU   IOBINCAM                                                 00764000
IOBFL4   EQU   IOBORG12                                                 00765000
IOBEXTEN EQU   IOBSTDRD+32                                              00766000
IOBSEEK  EQU   IOBEXTEN                                                 00767000
IOBBB    EQU   IOBSEEK+1                                                00768000
IOBCC    EQU   IOBSEEK+3                                                00769000
IOBHH    EQU   IOBSEEK+5                                                00770000
IOBORG05 EQU   IOBEXTEN                                                 00771000
IOBORG06 EQU   IOBEXTEN                                                 00772000
IOBNXTPT EQU   IOBORG06+4                                               00773000
IOBSTATA EQU   IOBNXTPT                                                 00774000
IOBORG07 EQU   IOBEXTEN+8                                               00775000
W1IEXTEN EQU   IOBORG07                                                 00776000
IOBORG08 EQU   IOBEXTEN+8                                               00777000
IOBINDCT EQU   IOBORG08+4                                               00778000
IOBUNSQR EQU   IOBORG08+5                                               00779000
IOBFCHAD EQU   IOBORG08+8                                               00780000
IOBORG09 EQU   IOBEXTEN+8                                               00781000
IOBDPLAD EQU   IOBORG09+4                                               00782000
IOBDTYPE EQU   IOBORG09+8                                               00783000
IOBDTYP2 EQU   IOBORG09+9                                               00784000
IOBDSTAT EQU   IOBORG09+10                                              00785000
IOBSTAT1 EQU   IOBDSTAT                                                 00786000
IOBORG10 EQU   IOBEXTEN+8                                               00787000
IOBSEEK2 EQU   IOBORG10                                                 00788000
IOBORG11 EQU   IOBEXTEN                                                 00789000
IOBERCT  EQU   IOBORG11                                                 00790000
IOBUCBXV EQU   IOBERCT                                                  00791000
IOBNAME  EQU   IOBORG11+4                                               00792000
IOBORG13 EQU   IOBEXTEN                                                 00793000
IOBSKADR EQU   IOBORG13                                                 00794000
NCSTUNST EQU   NCSMDFY                                                  00795000
NCSTSFLG EQU   NCSTUNST+2                                               00796000
NCSLS    EQU   NCSMDFY                                                  00797000
NCSCYPTO EQU   NCSMDFY                                                  00798000
NCSCYFLG EQU   NCSCYPTO                                                 00799000
SRTXTNSN EQU   SRTXTNBS                                                 00800000
PABXTNSN EQU   PABEND                                                   00801000
@NM00182 EQU   ICNSPACE                                                 00802000
ICNZH002 EQU   @NM00182+12                                              00803000
ICNZS002 EQU   ICNZH002                                                 00804000
ICNZS003 EQU   ICNZH002                                                 00805000
ICNZS004 EQU   ICNZH002                                                 00806000
ICNZS006 EQU   ICNZH002                                                 00807000
ICNZS007 EQU   ICNZH002                                                 00808000
ICNZS008 EQU   ICNZH002                                                 00809000
ICNZS009 EQU   ICNZH002+1                                               00810000
ICNZS00A EQU   ICNZH002+1                                               00811000
@NM00183 EQU   @NM00182+19                                              00812000
ICNRSRT  EQU   @NM00183                                                 00813000
@NM00185 EQU   @NM00182+20                                              00814000
ICNSENSE EQU   NCBSENSE                                                 00815000
@NM00190 EQU   ICNSENSE                                                 00816000
ICNDTCHK EQU   @NM00190                                                 00817000
ICNOVRUN EQU   @NM00190                                                 00818000
@NM00191 EQU   ICNSENSE+1                                               00819000
ISTICNCT EQU   ISTICNCB                                                 00820000
ICNSTATS EQU   ISTICNCT+472                                             00821000
RCPSIBQ  EQU   RCPSARRY                                                 00822000
SRB      EQU   SRBSECT                                                  00823000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00824000
ICNSLODN EQU   ICNSTATS+28                                              00825000
ICNRDBUF EQU   ICNSTATS+24                                              00826000
ICNOPIU  EQU   ICNSTATS+20                                              00827000
ICNIPIU  EQU   ICNSTATS+16                                              00828000
ICNRDATN EQU   ICNSTATS+12                                              00829000
ICNATTN  EQU   ICNSTATS+8                                               00830000
ICNCHRD  EQU   ICNSTATS+4                                               00831000
ICNCHWR  EQU   ICNSTATS                                                 00832000
@NM00193 EQU   ISTICNCT                                                 00833000
@NM00192 EQU   @NM00191                                                 00834000
ICNDTREJ EQU   @NM00191                                                 00835000
ICNDLCHK EQU   @NM00191                                                 00836000
ICNABORT EQU   @NM00190                                                 00837000
ICNIPLRQ EQU   @NM00190                                                 00838000
ICNSN02  EQU   ICNOVRUN                                                 00839000
ICNSN01  EQU   ICNDTCHK                                                 00840000
ICNEQCHK EQU   @NM00190                                                 00841000
ICNBOCHK EQU   @NM00190                                                 00842000
ICNINTRQ EQU   @NM00190                                                 00843000
ICNCMDRJ EQU   @NM00190                                                 00844000
@NM00189 EQU   @NM00182+23                                              00845000
ICNHKMSK EQU   @NM00182+22                                              00846000
ICNERCNT EQU   @NM00182+21                                              00847000
@NM00188 EQU   @NM00185                                                 00848000
@NM00187 EQU   @NM00185                                                 00849000
@NM00186 EQU   @NM00185                                                 00850000
ICNZF026 EQU   @NM00185                                                 00851000
ICNZF024 EQU   @NM00185                                                 00852000
ICNZF023 EQU   @NM00185                                                 00853000
ICNZF022 EQU   @NM00185                                                 00854000
ICNZF021 EQU   @NM00185                                                 00855000
@NM00184 EQU   @NM00183                                                 00856000
ICNZF016 EQU   @NM00183                                                 00857000
ICNZF011 EQU   @NM00183                                                 00858000
ICNZF00E EQU   ICNRSRT                                                  00859000
ICNZF00A EQU   @NM00183                                                 00860000
ICNZF005 EQU   @NM00183                                                 00861000
ICNZF004 EQU   @NM00183                                                 00862000
ICNZF001 EQU   @NM00183                                                 00863000
ICNZX013 EQU   @NM00182+18                                              00864000
ICNZX012 EQU   @NM00182+17                                              00865000
ICNZX011 EQU   @NM00182+16                                              00866000
ICNZX010 EQU   @NM00182+14                                              00867000
ICNZS010 EQU   ICNZH002+1                                               00868000
ICNZS00F EQU   ICNZH002+1                                               00869000
ICNZS00E EQU   ICNZH002+1                                               00870000
ICNZS00D EQU   ICNZH002+1                                               00871000
ICNZS00C EQU   ICNZH002+1                                               00872000
ICNZS00B EQU   ICNZH002+1                                               00873000
ICNZS01A EQU   ICNZS00A                                                 00874000
ICNZS019 EQU   ICNZS009                                                 00875000
ICNZS018 EQU   ICNZS008                                                 00876000
ICNZS017 EQU   ICNZS007                                                 00877000
ICNZS016 EQU   ICNZS006                                                 00878000
ICNZS005 EQU   ICNZH002                                                 00879000
ICNZS014 EQU   ICNZS004                                                 00880000
ICNZS013 EQU   ICNZS003                                                 00881000
ICNZS012 EQU   ICNZS002                                                 00882000
ICNZS001 EQU   ICNZH002                                                 00883000
ICNZV006 EQU   @NM00182+8                                               00884000
ICNZC001 EQU   @NM00182                                                 00885000
@NM00172 EQU   PABXTNSN+12                                              00886000
PABNPSSQ EQU   PABXTNSN+8                                               00887000
PABLOCK  EQU   PABXTNSN+4                                               00888000
PABLAST  EQU   PABXTNSN                                                 00889000
SRTDATA  EQU   SRTXTNSN+3                                               00890000
SRTUSELN EQU   SRTXTNSN+1                                               00891000
SRTFLAGS EQU   SRTXTNSN                                                 00892000
@NM00034 EQU   NCSCYPTO+1                                               00893000
@NM00033 EQU   NCSCYFLG                                                 00894000
NCSENCR  EQU   NCSCYFLG                                                 00895000
@NM00032 EQU   NCSLS+2                                                  00896000
NCSPLRCD EQU   NCSLS+1                                                  00897000
NCSLSCMD EQU   NCSLS                                                    00898000
@NM00031 EQU   NCSTUNST+3                                               00899000
@NM00030 EQU   NCSTSFLG                                                 00900000
NCSTUNCS EQU   NCSTSFLG                                                 00901000
NCSTUNON EQU   NCSTSFLG                                                 00902000
NCSTUTIM EQU   NCSTUNST                                                 00903000
IOBSKSS  EQU   IOBSKADR+3                                               00904000
IOBSK0   EQU   IOBSKADR+2                                               00905000
IOBSKTT  EQU   IOBSKADR+1                                               00906000
IOBSKRV  EQU   IOBSKADR                                                 00907000
IOBCSWSV EQU   IOBORG11+17                                              00908000
IOBSENSV EQU   IOBORG11+16                                              00909000
IOBRCD   EQU   IOBORG11+12                                              00910000
IOBMDREC EQU   IOBORG11+8                                               00911000
IOBNAMEA EQU   IOBNAME+1                                                00912000
IOBNAMSZ EQU   IOBNAME                                                  00913000
IOBERCTA EQU   IOBERCT+1                                                00914000
IOBRTYPE EQU   IOBUCBXV                                                 00915000
IOBRDCHP EQU   IOBORG10+20                                              00916000
IOBNEXTA EQU   IOBORG10+16                                              00917000
IOBREADA EQU   IOBORG10+12                                              00918000
IOBBUFC  EQU   IOBORG10+8                                               00919000
IOBSK2R  EQU   IOBSEEK2+7                                               00920000
IOBSK2HH EQU   IOBSEEK2+5                                               00921000
IOBSK2CC EQU   IOBSEEK2+3                                               00922000
IOBSK2BB EQU   IOBSEEK2+1                                               00923000
IOBSK2M  EQU   IOBSEEK2                                                 00924000
IOBCHNPR EQU   IOBORG09+40                                              00925000
IOBDNCRF EQU   IOBORG09+32                                              00926000
IOBRSV35 EQU   IOBORG09+24                                              00927000
IOBDQPTR EQU   IOBORG09+20                                              00928000
IOBRSV34 EQU   IOBORG09+18                                              00929000
IOBDBYTN EQU   IOBORG09+16                                              00930000
IOBDCPND EQU   IOBORG09+12                                              00931000
IOBSTAT2 EQU   IOBDSTAT+1                                               00932000
IOBSIORT EQU   IOBSTAT1                                                 00933000
IOBADDVU EQU   IOBSTAT1                                                 00934000
IOBBUFF  EQU   IOBSTAT1                                                 00935000
IOBENQUE EQU   IOBSTAT1                                                 00936000
IOBPASS2 EQU   IOBSTAT1                                                 00937000
IOBSYNCH EQU   IOBSTAT1                                                 00938000
IOBNEWVL EQU   IOBSTAT1                                                 00939000
IOBABNRM EQU   IOBSTAT1                                                 00940000
IOBRELEX EQU   IOBDTYP2                                                 00941000
IOBADDTY EQU   IOBDTYP2                                                 00942000
IOBTYPE  EQU   IOBDTYP2                                                 00943000
IOBRQUST EQU   IOBDTYP2                                                 00944000
IOBSUFFX EQU   IOBDTYP2                                                 00945000
IOBSBLKL EQU   IOBDTYP2                                                 00946000
IOBSKEY  EQU   IOBDTYP2                                                 00947000
IOBRELBL EQU   IOBDTYPE                                                 00948000
IOBRDEXC EQU   IOBDTYPE                                                 00949000
IOBDYNBF EQU   IOBDTYPE                                                 00950000
IOBACTAD EQU   IOBDTYPE                                                 00951000
IOBFDBCK EQU   IOBDTYPE                                                 00952000
IOBEXTSC EQU   IOBDTYPE                                                 00953000
IOBOVFLO EQU   IOBDTYPE                                                 00954000
IOBVERFY EQU   IOBDTYPE                                                 00955000
IOBDPLB  EQU   IOBDPLAD+1                                               00956000
IOBDAYLI EQU   IOBDPLAD                                                 00957000
IOBDIOBS EQU   IOBORG09+2                                               00958000
IOBDBYTR EQU   IOBORG09                                                 00959000
IOBBCHAD EQU   IOBORG08+12                                              00960000
IOBFCHNB EQU   IOBFCHAD+1                                               00961000
IOBCOUNT EQU   IOBFCHAD                                                 00962000
IOBASYN  EQU   IOBORG08+7                                               00963000
IOBAPP   EQU   IOBORG08+6                                               00964000
IOBRSV32 EQU   IOBUNSQR                                                 00965000
IOBRSV31 EQU   IOBUNSQR                                                 00966000
IOBRSV30 EQU   IOBUNSQR                                                 00967000
IOBKNRWR EQU   IOBUNSQR                                                 00968000
IOBKNWR  EQU   IOBUNSQR                                                 00969000
IOBNTAV2 EQU   IOBUNSQR                                                 00970000
IOBNTAV1 EQU   IOBUNSQR                                                 00971000
IOBCPBSY EQU   IOBUNSQR                                                 00972000
IOBCHNNL EQU   IOBINDCT                                                 00973000
IOBRSV29 EQU   IOBINDCT                                                 00974000
IOBRSV28 EQU   IOBINDCT                                                 00975000
IOBRSV27 EQU   IOBINDCT                                                 00976000
IOBKEYAD EQU   IOBINDCT                                                 00977000
IOBOVPTR EQU   IOBINDCT                                                 00978000
IOBUNSCH EQU   IOBINDCT                                                 00979000
IOBDEQCP EQU   IOBINDCT                                                 00980000
IOBCCWAD EQU   IOBORG08                                                 00981000
W1OEXTEN EQU   W1IEXTEN                                                 00982000
IOBCCW   EQU   IOBORG06+8                                               00983000
IOBNXTPB EQU   IOBNXTPT+1                                               00984000
IOBRSV26 EQU   IOBSTATA                                                 00985000
IOBRSV25 EQU   IOBSTATA                                                 00986000
IOBRSV24 EQU   IOBSTATA                                                 00987000
IOBRSV23 EQU   IOBSTATA                                                 00988000
IOBRSV22 EQU   IOBSTATA                                                 00989000
IOBRSV21 EQU   IOBSTATA                                                 00990000
IOBRSV20 EQU   IOBSTATA                                                 00991000
IOBAVLFL EQU   IOBSTATA                                                 00992000
IOBRSV37 EQU   IOBORG06+1                                               00993000
IOBUCBXG EQU   IOBORG06                                                 00994000
IOBCPA   EQU   IOBORG05+32                                              00995000
IOBERINF EQU   IOBORG05+16                                              00996000
IOBERCCW EQU   IOBORG05+8                                               00997000
IOBSNDPT EQU   IOBORG05+7                                               00998000
IOBRCVPT EQU   IOBORG05+6                                               00999000
IOBWORK  EQU   IOBORG05+1                                               01000000
IOBUCBX  EQU   IOBORG05                                                 01001000
IOBR     EQU   IOBSEEK+7                                                01002000
IOBHH2   EQU   IOBHH+1                                                  01003000
IOBHH1   EQU   IOBHH                                                    01004000
IOBCC2   EQU   IOBCC+1                                                  01005000
IOBCC1   EQU   IOBCC                                                    01006000
IOBBB2   EQU   IOBBB+1                                                  01007000
IOBBB1   EQU   IOBBB                                                    01008000
IOBM     EQU   IOBSEEK                                                  01009000
IOBRSV46 EQU   IOBFL4                                                   01010000
IOBRSV47 EQU   IOBFL4                                                   01011000
IOBENT   EQU   IOBFL4                                                   01012000
IOBEQP   EQU   IOBFL4                                                   01013000
IOBBUS   EQU   IOBFL4                                                   01014000
IOBDCK   EQU   IOBFL4                                                   01015000
IOBREJ   EQU   IOBFL4                                                   01016000
IOBOVR   EQU   IOBFL4                                                   01017000
IOBCRILC EQU   IOBORG04+1                                               01018000
IOBCRDCC EQU   IOBORG04                                                 01019000
IOBGQECB EQU   IOBORG03                                                 01020000
IOBSWAP  EQU   IOBORG02+4                                               01021000
IOBDQADB EQU   IOBDQADA+1                                               01022000
IOBRSV13 EQU   IOBDEQIN                                                 01023000
IOBRSV12 EQU   IOBDEQIN                                                 01024000
IOBRSV11 EQU   IOBDEQIN                                                 01025000
IOBRSV10 EQU   IOBDEQIN                                                 01026000
IOBRSV09 EQU   IOBDEQIN                                                 01027000
IOBRSV08 EQU   IOBDEQIN                                                 01028000
IOBRSV07 EQU   IOBDEQIN                                                 01029000
IOBDEQ   EQU   IOBDEQIN                                                 01030000
IOBNECB  EQU   IOBORG01+4                                               01031000
IOBNIOBB EQU   IOBNIOBA+1                                               01032000
IOBFIRST EQU   IOBNFLG1                                                 01033000
IOBUPERR EQU   IOBNFLG1                                                 01034000
IOBSPAN  EQU   IOBNFLG1                                                 01035000
IOBBKSPC EQU   IOBNFLG1                                                 01036000
IOBUPDAT EQU   IOBNFLG1                                                 01037000
IOBREAD  EQU   IOBNFLG1                                                 01038000
IOBWRITE EQU   IOBNFLG1                                                 01039000
IOBSEGMT EQU   IOBPRTOV                                                 01040000
IOSPCIWA EQU   IOSPCISC+44                                              01041000
IOSPCIRS EQU   IOSPCISC+8                                               01042000
@NM00007 EQU   IOSPCISC+4                                               01043000
@NM00006 EQU   IOSPCISC                                                 01044000
IOSWRNDR EQU   IOSWTOWA+4                                               01045000
IOSWTOPT EQU   IOSWTOWA+3                                               01046000
IOSWTOCP EQU   IOSWTOWA+2                                               01047000
IOSWTOCH EQU   IOSWTOWA                                                 01048000
IOSATTWA EQU   IOSATTSC+40                                              01049000
@NM00005 EQU   IOSATTSC+24                                              01050000
IOSATTSN EQU   IOSATTSC                                                 01051000
@NM00249 EQU   FY1RGSAV+12                                              01052000
@NM00248 EQU   FY1RGSAV                                                 01053000
@NM00247 EQU   FY1DBITS                                                 01054000
@NM00246 EQU   FY1IOB+24                                                01055000
@NM00245 EQU   FY1IOBW6                                                 01056000
@NM00244 EQU   FY1IOBW6                                                 01057000
@NM00243 EQU   FY1IOBW5                                                 01058000
@NM00242 EQU   FY1IOBW3                                                 01059000
@NM00241 EQU   FY1IOBW1                                                 01060000
FY1REGSV EQU   FY1WORKA                                                 01061000
ACDNIB   EQU   ISTACDEB+116                                             01062000
@NM00240 EQU   ISTACDEB+115                                             01063000
@NM00239 EQU   @NM00238                                                 01064000
ACDAUTH  EQU   @NM00238                                                 01065000
ACDSSCIP EQU   @NM00238                                                 01066000
ACDVFRR  EQU   @NM00238                                                 01067000
ACDSRBX  EQU   @NM00238                                                 01068000
ACDMMEM  EQU   @NM00238                                                 01069000
ACDEAS   EQU   ISTACDEB+112                                             01070000
ACDUNTNM EQU   ISTACDEB+104                                             01071000
@NM00237 EQU   ACDLUFLG+1                                               01072000
ACDAACQ  EQU   ACDLUFLG+1                                               01073000
ACDAPASS EQU   ACDLUFLG+1                                               01074000
ACDCSM   EQU   ACDLUFLG+1                                               01075000
ACDPARS  EQU   ACDLUFLG+1                                               01076000
ACDTSO   EQU   ACDLUFLG+1                                               01077000
ACDSCIP  EQU   ACDLUFLG+1                                               01078000
ACDNSEXT EQU   ACDLUFLG+1                                               01079000
ACDAUTHE EQU   ACDLUFLG                                                 01080000
ACDTPEND EQU   ACDLUFLG                                                 01081000
ACDABEND EQU   ACDLUFLG                                                 01082000
ACDCLOSE EQU   ACDLUFLG                                                 01083000
ACDQUIES EQU   ACDLUFLG                                                 01084000
ACDNSESS EQU   ACDLUFLG                                                 01085000
ACDREADY EQU   ACDLUFLG                                                 01086000
ACDACTIV EQU   ACDLUFLG                                                 01087000
ACDRQID  EQU   ISTACDEB+100                                             01088000
ACDSMCNT EQU   ISTACDEB+96                                              01089000
ACDPACNT EQU   ISTACDEB+92                                              01090000
ACDASCNT EQU   ISTACDEB+88                                              01091000
@NM00236 EQU   ISTACDEB+84                                              01092000
ACDSSCNT EQU   ISTACDEB+80                                              01093000
ACDECB   EQU   ISTACDEB+76                                              01094000
ACDLUCBA EQU   ISTACDEB+72                                              01095000
ACDLOCK  EQU   ISTACDEB+68                                              01096000
ACDACB   EQU   ISTACDEB+64                                              01097000
ACDDEB   EQU   ISTACDEB+60                                              01098000
ACDTCB   EQU   ISTACDEB+56                                              01099000
ACDRARQ  EQU   ACDANYQ+4                                                01100000
ACDRAFQ  EQU   ACDANYQ                                                  01101000
ACDSSPAB EQU   ISTACDEB+32                                              01102000
ACDNEPAB EQU   ISTACDEB+16                                              01103000
ACDRDTE  EQU   ISTACDEB+12                                              01104000
ACDTSKID EQU   ISTACDEB+8                                               01105000
ACDCHN   EQU   ISTACDEB+4                                               01106000
ACDSAF   EQU   ISTACDEB+2                                               01107000
ACDLNGTH EQU   ISTACDEB+1                                               01108000
ACDTYPE  EQU   ISTACDEB                                                 01109000
ATCAOS   EQU   ISTATCVT+2184                                            01110000
@NM00235 EQU   ISTATCVT+1928                                            01111000
ATCITECB EQU   ISTATCVT+1924                                            01112000
ATCINCTV EQU   ISTATCVT+1920                                            01113000
@NM00234 EQU   ISTATCVT+1918                                            01114000
ATCSAF   EQU   ISTATCVT+1916                                            01115000
ATCAPCSX EQU   ISTATCVT+1912                                            01116000
ATCTSC3I EQU   ISTATCVT+1908                                            01117000
ATCHWCSA EQU   ISTATCVT+1904                                            01118000
ATCAPCRM EQU   ISTATCVT+1900                                            01119000
ATCAPCFR EQU   ISTATCVT+1896                                            01120000
ATCCACSA EQU   ISTATCVT+1892                                            01121000
ATCMXCSA EQU   ISTATCVT+1888                                            01122000
ATCTPMPB EQU   ISTATCVT+1856                                            01123000
ATCRPLAC EQU   ATCRPLCN+2                                               01124000
ATCRPLRC EQU   ATCRPLCN                                                 01125000
ATCCRPLQ EQU   ATCCRPL                                                  01126000
ATCCRAAC EQU   ATCCRACN+2                                               01127000
ATCCRARC EQU   ATCCRACN                                                 01128000
ATCCRAQ  EQU   ATCCRA                                                   01129000
ATCITSAV EQU   ISTATCVT+1836                                            01130000
ATCTPMMI EQU   ISTATCVT+1828                                            01131000
ATCPXSRB EQU   ISTATCVT+1824                                            01132000
ATCRPLCT EQU   ISTATCVT+1822                                            01133000
ATCCRACT EQU   ISTATCVT+1820                                            01134000
ATCSRBCT EQU   ISTATCVT+1818                                            01135000
ATCSTNSM EQU   ISTATCVT+1817                                            01136000
@NM00233 EQU   @NM00232                                                 01137000
ATCNOSTR EQU   @NM00232                                                 01138000
ATCVTMAB EQU   @NM00232                                                 01139000
ATCTPCP1 EQU   ISTATCVT+1812                                            01140000
ATCTPCP0 EQU   ISTATCVT+1808                                            01141000
ATCZR01  EQU   ISTATCVT+1804                                            01142000
ATCASCB  EQU   ISTATCVT+1800                                            01143000
ATCMPSTQ EQU   ISTATCVT+1796                                            01144000
ATCOCCSM EQU   ISTATCVT+1792                                            01145000
ATCPSTA  EQU   ISTATCVT+1788                                            01146000
@NM00231 EQU   ATCVTFLG                                                 01147000
ATCVTACT EQU   ATCVTFLG                                                 01148000
@NM00230 EQU   ISTATCVT+1732                                            01149000
ATCTRMWA EQU   ISTATCVT+1728                                            01150000
ATCCSCBG EQU   ATCCSCB                                                  01151000
@NM00229 EQU   ISTATCVT+1723                                            01152000
ATCSNUF  EQU   ATCENFLG                                                 01153000
ATCOPKL  EQU   ATCENFLG                                                 01154000
ATCABEN  EQU   ATCENFLG                                                 01155000
ATCSRDN  EQU   ATCENFLG                                                 01156000
ATCDLDN  EQU   ATCENFLG                                                 01157000
ATCACTRM EQU   ISTATCVT+1720                                            01158000
ATCSMABF EQU   ISTATCVT+1716                                            01159000
ATCSMAPR EQU   ISTATCVT+1712                                            01160000
ATCSMAID EQU   ISTATCVT+1708                                            01161000
ATCSMARA EQU   ISTATCVT+1704                                            01162000
ATCCACXA EQU   ISTATCVT+1700                                            01163000
ATCATA10 EQU   ISTATCVT+1696                                            01164000
ATCHLTCB EQU   ISTATCVT+1692                                            01165000
ATCCCOOC EQU   ISTATCVT+1688                                            01166000
ATCAIWT  EQU   ISTATCVT+1684                                            01167000
ATCOROBT EQU   ISTATCVT+1680                                            01168000
ATCPXCRA EQU   ISTATCVT+1676                                            01169000
ATCGSRBF EQU   ATCGSRBG                                                 01170000
ATCTSCPC EQU   ISTATCVT+1668                                            01171000
ATCCDTCB EQU   ISTATCVT+1664                                            01172000
ATCORFRL EQU   ISTATCVT+1660                                            01173000
ATCORFPX EQU   ISTATCVT+1656                                            01174000
ATCORFMG EQU   ISTATCVT+1652                                            01175000
ATCSMBQ  EQU   ISTATCVT+1648                                            01176000
ATCINFDD EQU   ISTATCVT+1644                                            01177000
@NM00228 EQU   ATCDAPVT+22                                              01178000
ATCDAPDG EQU   ATCDAPVT+20                                              01179000
ATCDXCEA EQU   ATCDAPVT+16                                              01180000
ATCDCEA  EQU   ATCDAPVT+12                                              01181000
ATCDPCIA EQU   ATCDAPVT+8                                               01182000
ATCDSIOA EQU   ATCDAPVT+4                                               01183000
ATCDEOEA EQU   ATCDAPVT                                                 01184000
ATCZLAEA EQU   ATCLDAPP+16                                              01185000
ATCZLCEA EQU   ATCLDAPP+12                                              01186000
ATCZLPCI EQU   ATCLDAPP+8                                               01187000
ATCSMFRR EQU   ATCLDAPP+4                                               01188000
ATCCDTID EQU   ATCLDAPP                                                 01189000
ATCTRMPB EQU   ISTATCVT+1568                                            01190000
ATCORQG  EQU   ATCORSRB                                                 01191000
ATCORTBF EQU   ATCSQAFR                                                 01192000
@NM00227 EQU   ISTATCVT+1560                                            01193000
@NM00226 EQU   ISTATCVT+1556                                            01194000
ATCTSCLR EQU   ISTATCVT+1552                                            01195000
@NM00225 EQU   ISTATCVT+1532                                            01196000
ATCCDCNE EQU   ISTATCVT+1528                                            01197000
@NM00224 EQU   ISTATCVT+1526                                            01198000
ATCHASHN EQU   ISTATCVT+1524                                            01199000
ATCNOST  EQU   ISTATCVT+1520                                            01200000
ATCSMMWA EQU   ISTATCVT+1516                                            01201000
ATCSDCFR EQU   ISTATCVT+1512                                            01202000
ATCTSCRA EQU   ISTATCVT+1508                                            01203000
ATCSOCNT EQU   ISTATCVT+1504                                            01204000
ATCSOTHR EQU   ISTATCVT+1502                                            01205000
ATCSOPR2 EQU   ISTATCVT+1501                                            01206000
ATCSOPR1 EQU   ISTATCVT+1500                                            01207000
ATCAPCAT EQU   ISTATCVT+1496                                            01208000
ATCTSCWU EQU   ISTATCVT+1492                                            01209000
ATCMWRDT EQU   ISTATCVT+1488                                            01210000
ATCSTCK  EQU   ISTATCVT+1480                                            01211000
ATCWUPAB EQU   ATCWUDYP+16                                              01212000
@NM00223 EQU   ATCWUDYP                                                 01213000
ATCLKCNT EQU   ATCLKSWP+4                                               01214000
ATCCLOCK EQU   ATCLKSWP                                                 01215000
ATCNCBQ  EQU   ISTATCVT+1436                                            01216000
ATCPUCWC EQU   ISTATCVT+1432                                            01217000
ATCTSCQV EQU   ISTATCVT+1428                                            01218000
ATCTSCQU EQU   ISTATCVT+1424                                            01219000
ATCTSCQM EQU   ISTATCVT+1420                                            01220000
ATCTSCQF EQU   ISTATCVT+1416                                            01221000
ATCAPCVR EQU   ISTATCVT+1412                                            01222000
ATCHSQLK EQU   ISTATCVT+1408                                            01223000
ATCICIDM EQU   ISTATCVT+1406                                            01224000
ATCYRANG EQU   ISTATCVT+1405                                            01225000
ATCDRNUM EQU   ISTATCVT+1404                                            01226000
ATCSACNT EQU   ISTATCVT+1400                                            01227000
ATCTSCFA EQU   ISTATCVT+1396                                            01228000
ATCCDCVR EQU   ISTATCVT+1392                                            01229000
ATCCDCRI EQU   ISTATCVT+1388                                            01230000
ATCCDCRT EQU   ISTATCVT+1384                                            01231000
ATCVRNDX EQU   ISTATCVT+1380                                            01232000
ATCRACVB EQU   ISTATCVT+1376                                            01233000
ATCPSTLK EQU   ISTATCVT+1372                                            01234000
ATCOCAOA EQU   ISTATCVT+1368                                            01235000
ATCPUCEF EQU   ISTATCVT+1364                                            01236000
ATCPUCBM EQU   ISTATCVT+1360                                            01237000
ATCAPCES EQU   ISTATCVT+1356                                            01238000
ATCAPCPC EQU   ISTATCVT+1352                                            01239000
ATCAPCTE EQU   ISTATCVT+1348                                            01240000
ATCAPCIN EQU   ISTATCVT+1344                                            01241000
ATCAPCPD EQU   ISTATCVT+1340                                            01242000
ATCAPCAD EQU   ISTATCVT+1336                                            01243000
ATCAPCSD EQU   ISTATCVT+1332                                            01244000
ATCAPCIE EQU   ISTATCVT+1328                                            01245000
ATCAPCUE EQU   ISTATCVT+1324                                            01246000
ATCAPCRP EQU   ISTATCVT+1320                                            01247000
ATCAPCRS EQU   ISTATCVT+1316                                            01248000
ATCAPCTP EQU   ISTATCVT+1312                                            01249000
ATCAPCTW EQU   ISTATCVT+1308                                            01250000
ATCAPCPS EQU   ISTATCVT+1304                                            01251000
ATCAPCTS EQU   ISTATCVT+1300                                            01252000
ATCAPCTQ EQU   ISTATCVT+1296                                            01253000
ATCAPCTX EQU   ISTATCVT+1292                                            01254000
ATCSDCOS EQU   ISTATCVT+1288                                            01255000
ATCEXCVR EQU   ISTATCVT+1284                                            01256000
ATCCPCSV EQU   ISTATCVT+1280                                            01257000
ATCVRECB EQU   ATCVRTIL+12                                              01258000
ATCVRLCK EQU   ATCVRTIL+8                                               01259000
ATCVRWEL EQU   ATCVRTIL+4                                               01260000
ATCVRWEQ EQU   ATCVRTIL                                                 01261000
ATCMGPAB EQU   ISTATCVT+1248                                            01262000
ATCTSCMS EQU   ISTATCVT+1244                                            01263000
ATCVRATB EQU   ISTATCVT+1240                                            01264000
ATCVRWAP EQU   ISTATCVT+1236                                            01265000
ATCPVRAQ EQU   ISTATCVT+1232                                            01266000
ATCTOWA  EQU   ISTATCVT+1228                                            01267000
ATCTOD2  EQU   ATCTOD+4                                                 01268000
ATCTOD1  EQU   ATCTOD                                                   01269000
ATCERTP  EQU   ISTATCVT+1216                                            01270000
ATCBINDQ EQU   ISTATCVT+1212                                            01271000
ATCTIMER EQU   ISTATCVT+1208                                            01272000
ATCTSCDN EQU   ISTATCVT+1204                                            01273000
ATCTSCCN EQU   ISTATCVT+1200                                            01274000
ATCTSCL0 EQU   ISTATCVT+1196                                            01275000
ATCTSCP2 EQU   ISTATCVT+1192                                            01276000
ATCTSC3S EQU   ISTATCVT+1188                                            01277000
ATCTSC3R EQU   ISTATCVT+1184                                            01278000
ATCTSC3O EQU   ISTATCVT+1180                                            01279000
ATCIOPRG EQU   ATCIOINT                                                 01280000
ATCTSCMI EQU   ISTATCVT+1172                                            01281000
ATCTSCMO EQU   ISTATCVT+1168                                            01282000
ATCTSCP4 EQU   ISTATCVT+1164                                            01283000
ATCPUSCT EQU   ISTATCVT+1160                                            01284000
ATCTKINT EQU   ATCTKFLD+2                                               01285000
ATCTKCNT EQU   ATCTKFLD                                                 01286000
ATCTIMCK EQU   ISTATCVT+1152                                            01287000
@NM00222 EQU   ATCRID+2                                                 01288000
ATCCDRMA EQU   ATCRID                                                   01289000
ATCCPCGD EQU   ISTATCVT+1140                                            01290000
@NM00221 EQU   ATCSMSDQ+8                                               01291000
@NM00220 EQU   ATCSMSDQ+4                                               01292000
@NM00219 EQU   ATCSMSDQ                                                 01293000
ATCSEQNO EQU   ISTATCVT+1124                                            01294000
ATCSMPMD EQU   ISTATCVT+1120                                            01295000
ATCPAREA EQU   ISTATCVT+1116                                            01296000
ATCCPCSM EQU   ISTATCVT+1112                                            01297000
ATCSQCDS EQU   ISTATCVT+1108                                            01298000
ATCUSSVT EQU   ISTATCVT+1104                                            01299000
ATCNOSQ  EQU   ISTATCVT+1100                                            01300000
ATCINCIP EQU   ATCCPDVT+4                                               01301000
ATCTSCNI EQU   ATCCPDVT                                                 01302000
ATCMGCRT EQU   ISTATCVT+1088                                            01303000
ATCMACRT EQU   ISTATCVT+1084                                            01304000
ATCCSMT  EQU   ISTATCVT+1080                                            01305000
ATCINCNO EQU   ISTATCVT+1076                                            01306000
ATCRACON EQU   ISTATCVT+1072                                            01307000
ATCCFCDR EQU   ISTATCVT+1068                                            01308000
ATCONFIG EQU   ISTATCVT+1060                                            01309000
ATCNODEL EQU   ISTATCVT+1052                                            01310000
ATCCDTIM EQU   ISTATCVT+1050                                            01311000
ATCNMCTR EQU   ISTATCVT+1048                                            01312000
ATCPOIA  EQU   ATCRNO+1                                                 01313000
@NM00218 EQU   ATCRNO                                                   01314000
ATCHBSIZ EQU   ATCHPGM+2                                                01315000
ATCHBFNO EQU   ATCHPGM                                                  01316000
ATCMROUT EQU   ISTATCVT+1031                                            01317000
ATCXRANG EQU   ISTATCVT+1030                                            01318000
ATCMAXID EQU   ISTATCVT+1029                                            01319000
ATCMSGSP EQU   ISTATCVT+1028                                            01320000
ATCECTLP EQU   ISTATCVT+1024                                            01321000
ATCECSES EQU   ISTATCVT+1020                                            01322000
ATCECDSP EQU   ISTATCVT+1016                                            01323000
ATCECVRY EQU   ISTATCVT+1012                                            01324000
ATCECHLT EQU   ISTATCVT+1008                                            01325000
ATCECMOD EQU   ISTATCVT+1004                                            01326000
ATCRDTLK EQU   ISTATCVT+1000                                            01327000
ATCVOCLK EQU   ISTATCVT+996                                             01328000
ATCCIDM  EQU   ISTATCVT+994                                             01329000
ATCITLIM EQU   ISTATCVT+992                                             01330000
ATCTMINV EQU   ISTATCVT+990                                             01331000
ATCHOSTA EQU   ISTATCVT+988                                             01332000
ATCPUNSA EQU   ISTATCVT+986                                             01333000
ATCVTMID EQU   ATCSSCPA                                                 01334000
ATCHCNID EQU   ATCONID+2                                                01335000
ATCSCNID EQU   ATCONID                                                  01336000
@NM00217 EQU   ATCBITAN+3                                               01337000
@NM00216 EQU   ATCBITAN+2                                               01338000
@NM00215 EQU   ATCFLAG2                                                 01339000
ATCMSGID EQU   ATCFLAG2                                                 01340000
ATCINACT EQU   ATCFLAG2                                                 01341000
ATCCRYPF EQU   ATCFLAG2                                                 01342000
ATCTUNCL EQU   ATCFLAG2                                                 01343000
ATCTUNRQ EQU   ATCFLAG2                                                 01344000
ATCTUNAC EQU   ATCFLAG2                                                 01345000
ATCCDLRA EQU   ATCFLAG2                                                 01346000
@NM00214 EQU   ATCBITAN                                                 01347000
@NM00213 EQU   ATCSTAT4                                                 01348000
@NM00212 EQU   ATCSTAT4                                                 01349000
@NM00211 EQU   ATCSTAT4                                                 01350000
ATCPUIOT EQU   ATCSTAT4                                                 01351000
ATCPUBUF EQU   ATCSTAT4                                                 01352000
@NM00210 EQU   ATCSTAT4                                                 01353000
ATCNCSD  EQU   ATCSTAT4                                                 01354000
ATCMTST  EQU   ATCSTAT4                                                 01355000
@NM00209 EQU   ATCPOFLG                                                 01356000
@NM00208 EQU   ATCPOFLG                                                 01357000
@NM00207 EQU   ATCPOFLG                                                 01358000
@NM00206 EQU   ATCPOFLG                                                 01359000
@NM00205 EQU   ATCPOFLG                                                 01360000
@NM00204 EQU   ATCPOFLG                                                 01361000
@NM00203 EQU   ATCPOFLG                                                 01362000
ATCPOUNS EQU   ATCPOFLG                                                 01363000
ATCITEXT EQU   @NM00202                                                 01364000
ATCHIP   EQU   ATCSTAT1                                                 01365000
ATCMDHLT EQU   ATCSTAT1                                                 01366000
ATCINHLT EQU   ATCSTAT1                                                 01367000
ATCNETSL EQU   ATCSTAT1                                                 01368000
ATCQKHLT EQU   ATCSTAT1                                                 01369000
ATCSNHLT EQU   ATCSTAT1                                                 01370000
ATCACTIV EQU   ATCSTAT1                                                 01371000
ATCSTART EQU   ATCSTAT1                                                 01372000
ATCNOP00 EQU   ISTATCVT+968                                             01373000
ATCTSBUF EQU   ISTATCVT+964                                             01374000
ATCSSOQH EQU   ISTATCVT+960                                             01375000
ATCSSIQH EQU   ISTATCVT+956                                             01376000
ATCTSCMB EQU   ATCMBDVT                                                 01377000
ATCSOPAC EQU   ISTATCVT+950                                             01378000
ATCSOTIM EQU   ISTATCVT+948                                             01379000
ATCTSCON EQU   ATCSODVT                                                 01380000
ATCTSCSC EQU   ATCSSDVT                                                 01381000
ATCTSCRO EQU   ISTATCVT+936                                             01382000
ATCTSCRI EQU   ISTATCVT+932                                             01383000
ATCFEPT  EQU   ISTATCVT+928                                             01384000
ATCFDVT  EQU   ISTATCVT+924                                             01385000
ATCCONFT EQU   ISTATCVT+920                                             01386000
ATCSIBQ  EQU   ISTATCVT+916                                             01387000
ATCDSPLQ EQU   ISTATCVT+912                                             01388000
ATCVARYQ EQU   ISTATCVT+908                                             01389000
ATCHALTQ EQU   ISTATCVT+904                                             01390000
ATCMODQ  EQU   ISTATCVT+900                                             01391000
ATCSRT   EQU   ISTATCVT+896                                             01392000
ATCRDT   EQU   ISTATCVT+892                                             01393000
ATCSDVT  EQU   ISTATCVT+888                                             01394000
ATCDLRPT EQU   ISTATCVT+884                                             01395000
ATCBPDA  EQU   ISTATCVT+880                                             01396000
ATCACDA  EQU   ISTATCVT+876                                             01397000
ATCMNT   EQU   ISTATCVT+872                                             01398000
ATCNODDS EQU   ISTATCVT+868                                             01399000
ATCITRT  EQU   ISTATCVT+864                                             01400000
ATCTODVT EQU   ISTATCVT+860                                             01401000
ATCTRCPT EQU   ISTATCVT+856                                             01402000
ATCMODTB EQU   ISTATCVT+852                                             01403000
ATCUSSPT EQU   ISTATCVT+848                                             01404000
ATCTUBUF EQU   ISTATCVT+844                                             01405000
ATCTACB  EQU   ISTATCVT+840                                             01406000
ATCDWA   EQU   ISTATCVT+836                                             01407000
ATCCFCR2 EQU   ATCPODVT                                                 01408000
ATCPULQB EQU   @NM00201+16                                              01409000
ATCMCQAB EQU   @NM00201+12                                              01410000
ATCLUSMQ EQU   @NM00201+8                                               01411000
ATCLUIOQ EQU   @NM00201+4                                               01412000
ATCIOLQB EQU   @NM00201                                                 01413000
ATCTSCAP EQU   ATCANYDT                                                 01414000
ATCTSCCO EQU   ATCLUDVT+4                                               01415000
ATCTSCSR EQU   ATCLUDVT                                                 01416000
ATCVTLOD EQU   ISTATCVT+796                                             01417000
ATCTSCLF EQU   ISTATCVT+792                                             01418000
ATCTSCLE EQU   ISTATCVT+788                                             01419000
ATCTSCLB EQU   ISTATCVT+784                                             01420000
ATCTSCLS EQU   ISTATCVT+780                                             01421000
ATCTSCCF EQU   ISTATCVT+776                                             01422000
ATCTSCFV EQU   ISTATCVT+772                                             01423000
ATCTSCCE EQU   ISTATCVT+768                                             01424000
ATCTSCCB EQU   ISTATCVT+764                                             01425000
ATCTSCWS EQU   ISTATCVT+760                                             01426000
ATCTSCEM EQU   ISTATCVT+756                                             01427000
ATCTSCNS EQU   ISTATCVT+752                                             01428000
ATCTSCER EQU   ISTATCVT+748                                             01429000
ATCTSCPR EQU   ISTATCVT+744                                             01430000
ATCTSCGR EQU   ISTATCVT+740                                             01431000
ATCTSCCI EQU   ISTATCVT+736                                             01432000
ATCTSVT  EQU   ISTATCVT+732                                             01433000
ATCDVLOD EQU   ISTATCVT+728                                             01434000
ATCCDCNR EQU   ISTATCVT+724                                             01435000
ATCCDCNF EQU   ISTATCVT+720                                             01436000
ATCCDCND EQU   ISTATCVT+716                                             01437000
ATCCDCNA EQU   ISTATCVT+712                                             01438000
ATCCDCCP EQU   ISTATCVT+708                                             01439000
ATCCDFDN EQU   ISTATCVT+704                                             01440000
ATCCDFIN EQU   ISTATCVT+700                                             01441000
ATCCDFND EQU   ISTATCVT+696                                             01442000
ATCCDDEL EQU   ISTATCVT+692                                             01443000
ATCCDADD EQU   ISTATCVT+688                                             01444000
ATCTCLIM EQU   ISTATCVT+684                                             01445000
ATCRACTR EQU   ISTATCVT+680                                             01446000
ATCRACTI EQU   ISTATCVT+676                                             01447000
ATCREMOV EQU   ISTATCVT+672                                             01448000
ATCRACIO EQU   ISTATCVT+668                                             01449000
ATCADD   EQU   ISTATCVT+664                                             01450000
ATCPUCRT EQU   ISTATCVT+660                                             01451000
ATCSMRS  EQU   ISTATCVT+656                                             01452000
ATCSMRQ  EQU   ISTATCVT+652                                             01453000
ATCORCAF EQU   ISTATCVT+648                                             01454000
ATCFRSTR EQU   ATCGTSTR                                                 01455000
ATCSTMA  EQU   ISTATCVT+640                                             01456000
ATCSRTAD EQU   ISTATCVT+636                                             01457000
ATCOCCFS EQU   ISTATCVT+632                                             01458000
ATCOCCFP EQU   ISTATCVT+628                                             01459000
ATCSRTDF EQU   ISTATCVT+624                                             01460000
ATCLUCRT EQU   ISTATCVT+620                                             01461000
ATCINCY5 EQU   ISTATCVT+616                                             01462000
ATCINCW3 EQU   ISTATCVT+612                                             01463000
ATCINCU6 EQU   ISTATCVT+608                                             01464000
ATCINCTQ EQU   ISTATCVT+604                                             01465000
ATCINCS1 EQU   ISTATCVT+600                                             01466000
ATCSRTAB EQU   ISTATCVT+596                                             01467000
ATCINCRD EQU   ISTATCVT+592                                             01468000
ATCINCPH EQU   ISTATCVT+588                                             01469000
ATCINCLQ EQU   ISTATCVT+584                                             01470000
ATCNOCRT EQU   ISTATCVT+580                                             01471000
ATCINCF1 EQU   ISTATCVT+576                                             01472000
ATCINCCI EQU   ISTATCVT+572                                             01473000
ATCINCCO EQU   ISTATCVT+568                                             01474000
ATCBLDLA EQU   ISTATCVT+564                                             01475000
ATCALOAD EQU   ISTATCVT+560                                             01476000
ATCADEL  EQU   ISTATCVT+556                                             01477000
ATCRACEP EQU   ISTATCVT+552                                             01478000
ATCESC01 EQU   ISTATCVT+548                                             01479000
ATCDEC01 EQU   ISTATCVT+544                                             01480000
ATCDEC00 EQU   ISTATCVT+540                                             01481000
ATCCPCRT EQU   ISTATCVT+536                                             01482000
ATCAP35  EQU   ISTATCVT+532                                             01483000
ATCCPCFR EQU   ISTATCVT+528                                             01484000
ATCCPCGR EQU   ISTATCVT+524                                             01485000
ATCCPCPP EQU   ISTATCVT+520                                             01486000
ATCCPCNT EQU   ISTATCVT+516                                             01487000
ATCAUTHA EQU   ISTATCVT+512                                             01488000
ATCACCTA EQU   ISTATCVT+508                                             01489000
ATCMSGP  EQU   ISTATCVT+504                                             01490000
ATCAP39  EQU   ISTATCVT+500                                             01491000
ATCAP36  EQU   ISTATCVT+496                                             01492000
ATCMSGM  EQU   ISTATCVT+492                                             01493000
ATCAP33  EQU   ISTATCVT+488                                             01494000
ATCAICPT EQU   ISTATCVT+484                                             01495000
ATCAPI   EQU   ISTATCVT+480                                             01496000
ATCACC01 EQU   ISTATCVT+476                                             01497000
ATCACC00 EQU   ISTATCVT+472                                             01498000
ATCMBPAB EQU   ISTATCVT+456                                             01499000
ATCSOPAB EQU   ISTATCVT+440                                             01500000
ATCSSPAB EQU   ISTATCVT+424                                             01501000
ATCLDECB EQU   ATCLDTIL+12                                              01502000
ATCLDLCK EQU   ATCLDTIL+8                                               01503000
ATCLDLST EQU   ATCLDTIL+4                                               01504000
ATCLDNCS EQU   ATCLDTIL                                                 01505000
ATCNOSPB EQU   ISTATCVT+376                                             01506000
ATCNSPAB EQU   ISTATCVT+344                                             01507000
ATCLUSRT EQU   ISTATCVT+312                                             01508000
ATCPUIOP EQU   ISTATCVT+280                                             01509000
ATCPUPAB EQU   ISTATCVT+248                                             01510000
ATCPXPAB EQU   ISTATCVT+216                                             01511000
ATCPOPAB EQU   ISTATCVT+184                                             01512000
ATCVDPAB EQU   ISTATCVT+152                                             01513000
ATCTCIPB EQU   ISTATCVT+120                                             01514000
ATCCSPAB EQU   ATCSMPAB+16                                              01515000
@NM00200 EQU   ATCSMPAB                                                 01516000
ATCTMRPB EQU   ISTATCVT+56                                              01517000
ATCITPAB EQU   ISTATCVT+24                                              01518000
@NM00199 EQU   ATCITRA1+1                                               01519000
ATCITCIO EQU   ATCITRA1                                                 01520000
ATCITSCP EQU   ATCITRA1                                                 01521000
ATCITMSG EQU   ATCITRA1                                                 01522000
ATCITPIU EQU   ATCITRA1                                                 01523000
ATCITSMS EQU   ATCITRA1                                                 01524000
ATCITPSS EQU   ATCITRA1                                                 01525000
ATCITLCK EQU   ATCITRA1                                                 01526000
ATCITAPI EQU   ATCITRA1                                                 01527000
ATCITCNT EQU   ATCITFLG                                                 01528000
ATCITRPH EQU   ATCITCDS                                                 01529000
ATCITTBL EQU   ATCITFLD+4                                               01530000
ATCITMAX EQU   ATCITPRM                                                 01531000
ATCPTCHA EQU   ATCRPTCH+4                                               01532000
ATCVTLVL EQU   ATCRPTCH                                                 01533000
RPHUPSTA EQU   ISTRPH+100                                               01534000
RPHSAV16 EQU   RPHWORK+60                                               01535000
RPHSAV15 EQU   RPHWORK+56                                               01536000
RPHSAV14 EQU   RPHWORK+52                                               01537000
RPHSAV13 EQU   RPHWORK+48                                               01538000
RPHSAV12 EQU   RPHWORK+44                                               01539000
RPHSAV11 EQU   RPHWORK+40                                               01540000
RPHSAV10 EQU   RPHWORK+36                                               01541000
RPHSAVE9 EQU   RPHWORK+32                                               01542000
RPHSAVE8 EQU   RPHWORK+28                                               01543000
RPHSAVE7 EQU   RPHWORK+24                                               01544000
RPHSAVE6 EQU   RPHWORK+20                                               01545000
RPHSAVE5 EQU   RPHWORK+16                                               01546000
RPHSAVE4 EQU   RPHWORK+12                                               01547000
RPHSAVE3 EQU   RPHWORK+8                                                01548000
RPHSAVE2 EQU   RPHWORK+4                                                01549000
RPHSHALF EQU   RPHSAVE1+2                                               01550000
RPHSBIT8 EQU   RPHSBITS                                                 01551000
RPHSBIT7 EQU   RPHSBITS                                                 01552000
RPHSBIT6 EQU   RPHSBITS                                                 01553000
RPHSBIT5 EQU   RPHSBITS                                                 01554000
RPHSBIT4 EQU   RPHSBITS                                                 01555000
RPHSBIT3 EQU   RPHSBITS                                                 01556000
RPHSBIT2 EQU   RPHSBITS                                                 01557000
RPHSBIT1 EQU   RPHSBITS                                                 01558000
RPHSBYTE EQU   RPHSAVE1                                                 01559000
RPHCRR   EQU   ISTRPH+32                                                01560000
RPHSRP34 EQU   RPHSRPRM+2                                               01561000
RPHSRP12 EQU   RPHSRPRM                                                 01562000
RPHWEGT  EQU   RPHWEA                                                   01563000
RPHMAJCB EQU   ISTRPH+21                                                01564000
RPHPABOF EQU   ISTRPH+20                                                01565000
RPHRESUM EQU   RPHRESMA+1                                               01566000
@NM00198 EQU   RPHWPFLG                                                 01567000
RPHPURGE EQU   RPHWPFLG                                                 01568000
RPHPT    EQU   RPHWPFLG                                                 01569000
RPHWT    EQU   RPHWPFLG                                                 01570000
RPHRSKEY EQU   RPHWPFLG                                                 01571000
RPHDVTA  EQU   ISTRPH+12                                                01572000
RPHTIK   EQU   RPHTSKID+3                                               01573000
@NM00197 EQU   RPHTSKID                                                 01574000
RPHRPHAP EQU   RPHRPHA+1                                                01575000
@NM00196 EQU   RPHRPHA                                                  01576000
RPHGATE  EQU   RPHRPHA                                                  01577000
@NM00195 EQU   RPHFLGB                                                  01578000
RPHABEND EQU   RPHFLGB                                                  01579000
RPHUWAIT EQU   RPHFLGB                                                  01580000
RPHRLCRA EQU   RPHFLGB                                                  01581000
RPHSYNCH EQU   RPHFLGB                                                  01582000
RPHPGCMP EQU   RPHFLGB                                                  01583000
RPHLOCK  EQU   RPHFLGB                                                  01584000
@NM00194 EQU   RPHFLAGS                                                 01585000
RPHSMCLR EQU   RPHFLAGS                                                 01586000
RPHSMTYP EQU   RPHFLAGS                                                 01587000
RPHSMQ   EQU   RPHFLAGS                                                 01588000
RPHLNGTH EQU   RPHCNTL+1                                                01589000
RPHTYPE  EQU   RPHCNTL                                                  01590000
@NM00181 EQU   ICNSYSUA+232                                             01591000
ICNSRB   EQU   ICNSYSUA+188                                             01592000
ICNIOSB  EQU   ICNDCDEB+64                                              01593000
ICNDCBIF EQU   ICNDIDEB                                                 01594000
ICNEXSCL EQU   ICNDCDEB+28                                              01595000
ICNDEBID EQU   ICNDCDEB+24                                              01596000
@NM00180 EQU   ICNDCDEB                                                 01597000
ICNERPWA EQU   ICNSYSUA+8                                               01598000
ICNCNTRL EQU   ICNSYSUA+4                                               01599000
ICNCKPAB EQU   ICNCKFLD+1                                               01600000
@NM00179 EQU   ICNCKFLD                                                 01601000
ICNCKBIT EQU   ICNCKFLD                                                 01602000
ICNQDSIO EQU   ISTICNCB+238                                             01603000
ICNQDPTH EQU   ISTICNCB+236                                             01604000
ICNMWRDT EQU   ISTICNCB+232                                             01605000
ICNCLOCK EQU   ISTICNCB+228                                             01606000
ICNNCBQ  EQU   ISTICNCB+224                                             01607000
ICNNPIUS EQU   ISTICNCB+222                                             01608000
@NM00178 EQU   ISTICNCB+221                                             01609000
@NM00177 EQU   @NM00176                                                 01610000
ICNREAD  EQU   @NM00176                                                 01611000
ICNMM    EQU   @NM00176                                                 01612000
ICNLCLUS EQU   @NM00176                                                 01613000
ICNTGN   EQU   ISTICNCB+219                                             01614000
ICNLNKMD EQU   ISTICNCB+218                                             01615000
ICNPUNA  EQU   ISTICNCB+216                                             01616000
ICNSUBA  EQU   ISTICNCB+212                                             01617000
ICNMSIZE EQU   ISTICNCB+208                                             01618000
ICNRSTIC EQU   ICNDEVCA+48                                              01619000
ICNRSCCW EQU   ICNDEVCA+40                                              01620000
ICNSMNOP EQU   ICNDEVCA+32                                              01621000
ICNNPCCW EQU   ICNDEVCA+24                                              01622000
ICNWBCCW EQU   ICNDEVCA+16                                              01623000
ICNWSTIC EQU   ICNDEVCA+8                                               01624000
ICNWSCCW EQU   ICNDEVCA                                                 01625000
ICNCB    EQU   ISTICNCB                                                 01626000
NCBEND   EQU   ISTNCB+152                                               01627000
@NM00175 EQU   NCBDLCIA+102                                             01628000
NCBSTANA EQU   NCBDLCIA+100                                             01629000
NCBUFRPH EQU   NCBDLCIA+96                                              01630000
NCBDCFLG EQU   NCBFLAGS+3                                               01631000
NCBCEALK EQU   NCBCEFLG                                                 01632000
NCBERP   EQU   NCBCEFLG                                                 01633000
NCBEXSDA EQU   NCBCEFLG                                                 01634000
NCBEXSNO EQU   NCBCEFLG                                                 01635000
NCBEXAIL EQU   NCBCEFLG                                                 01636000
NCBEXAIC EQU   NCBCEFLG                                                 01637000
NCBPOSTF EQU   NCBCEFLG                                                 01638000
NCBERROR EQU   NCBCEFLG                                                 01639000
NCBWRREQ EQU   NCBUFFLG                                                 01640000
@NM00174 EQU   NCBUFFLG                                                 01641000
NCBURQCN EQU   NCBUFFLG                                                 01642000
NCBUIOEM EQU   NCBUFFLG                                                 01643000
NCBUDELR EQU   NCBUFFLG                                                 01644000
NCBRHELD EQU   NCBDSFLG                                                 01645000
NCBASYNC EQU   NCBDSFLG                                                 01646000
NCBVIRT  EQU   NCBDSFLG                                                 01647000
NCBPOLL  EQU   NCBDSFLG                                                 01648000
NCBSLOW  EQU   NCBDSFLG                                                 01649000
NCBRDREQ EQU   NCBDSFLG                                                 01650000
NCBIOTRC EQU   NCBDSFLG                                                 01651000
NCBBUSYF EQU   NCBDSFLG                                                 01652000
NCBLOCK  EQU   NCBDLCIA+88                                              01653000
NCBSIB   EQU   NCBDLCIA+84                                              01654000
NCBUNAME EQU   NCBDLCIA+80                                              01655000
NCBLUST  EQU   NCBBFT                                                   01656000
NCBPUREQ EQU   NCBDLCIA+72                                              01657000
NCBWRUPE EQU   NCBDLCIA+68                                              01658000
NCBHRUPE EQU   NCBDLCIA+64                                              01659000
NCBSIOCT EQU   NCBDLCIA+62                                              01660000
NCBSNS2  EQU   NCBSENSE+1                                               01661000
NCBSNS1  EQU   NCBSENSE                                                 01662000
NCBCAW   EQU   NCBDLCIA+56                                              01663000
NCBCSW   EQU   NCBDLCIA+48                                              01664000
NCBBUFRQ EQU   NCBBUFFQ+6                                               01665000
NCBBUFNO EQU   NCBBUFFQ+4                                               01666000
NCBBUFQH EQU   NCBBUFFQ                                                 01667000
NCBPNDQT EQU   NCBPENDQ+4                                               01668000
NCBPNDQH EQU   NCBPENDQ                                                 01669000
NCBUFPAB EQU   NCBDLCIA+16                                              01670000
NCBPUPAB EQU   NCBDLCIA                                                 01671000
NCBPCPAB EQU   NCBBASE+32                                               01672000
NCBWORKQ EQU   NCBPCDYP+12                                              01673000
@NM00173 EQU   NCBPCDYP                                                 01674000
NCBUSECT EQU   NCBBASE+14                                               01675000
NCBLNKST EQU   NCBBASE+13                                               01676000
NCBTECT  EQU   NCBBASE+12                                               01677000
NCBTSKID EQU   NCBBASE+8                                                01678000
NCBRDTE  EQU   NCBBASE+4                                                01679000
NCBDAF   EQU   NCBBASE+2                                                01680000
NCBLNGTH EQU   NCBBASE+1                                                01681000
NCBTYPE  EQU   NCBBASE                                                  01682000
CCWCOUNT EQU   ISTCCW+6                                                 01683000
CCWSPARE EQU   ISTCCW+5                                                 01684000
CCWNULL  EQU   CCWFLAGS                                                 01685000
CCWPCI   EQU   CCWFLAGS                                                 01686000
CCWSKIP  EQU   CCWFLAGS                                                 01687000
CCWSLI   EQU   CCWFLAGS                                                 01688000
CCWCC    EQU   CCWFLAGS                                                 01689000
CCWCD    EQU   CCWFLAGS                                                 01690000
CCWADDR  EQU   CCWVADDR+1                                               01691000
CCWCODE  EQU   CCWVADDR                                                 01692000
DYPPAB   EQU   ISTDYPAB+16                                              01693000
DYPOCRPH EQU   DYPPACMD                                                 01694000
DYPTSKID EQU   ISTDYPAB+8                                               01695000
DYPPACTB EQU   DYPCHAIN                                                 01696000
DYPFLGS  EQU   ISTDYPAB+2                                               01697000
DYPLNGTH EQU   ISTDYPAB+1                                               01698000
DYPTYPE  EQU   ISTDYPAB                                                 01699000
PABRPHA  EQU   PABRPHFG+1                                               01700000
@NM00171 EQU   PABFLAGS                                                 01701000
PABKPRPH EQU   PABFLAGS                                                 01702000
PABNODQ  EQU   PABFLAGS                                                 01703000
PABXTND  EQU   PABFLAGS                                                 01704000
PABSYNCH EQU   PABFLAGS                                                 01705000
PABCDP   EQU   PABFLAGS                                                 01706000
PABUNCON EQU   PABFLAGS                                                 01707000
PABDVTA  EQU   ISTPAB+9                                                 01708000
PABOFFST EQU   ISTPAB+8                                                 01709000
PABCHNGP EQU   PABCHAIN+1                                               01710000
@NM00170 EQU   PABCHAIN                                                 01711000
PABCHNG  EQU   PABCHAIN                                                 01712000
PABWEQP  EQU   PABWEQA+1                                                01713000
@NM00169 EQU   PABWEQA                                                  01714000
PABWEQG  EQU   PABWEQA                                                  01715000
DNTNAME  EQU   DNTTELNO                                                 01716000
DNTCTDIG EQU   ISTDNT                                                   01717000
DOTADTRM EQU   ISTDOT                                                   01718000
GNTGRPNM EQU   ISTGNT                                                   01719000
@NM00168 EQU   PATFLAGA                                                 01720000
@NM00167 EQU   PATFLAGA                                                 01721000
@NM00166 EQU   PATFLAGA                                                 01722000
@NM00165 EQU   PATFLAGA                                                 01723000
@NM00164 EQU   PATFLAGA                                                 01724000
@NM00163 EQU   PATFLAGA                                                 01725000
PATDCALL EQU   PATFLAGA                                                 01726000
PATUSEFG EQU   PATFLAGA                                                 01727000
PATRDCNT EQU   ISTPAT+6                                                 01728000
PATGRPID EQU   ISTPAT+5                                                 01729000
PATPTHID EQU   ISTPAT+4                                                 01730000
PATDINDX EQU   ISTPAT+2                                                 01731000
PATGINDX EQU   ISTPAT                                                   01732000
RCCEND   EQU   ISTRCC+132                                               01733000
@NM00162 EQU   ISTRCC+130                                               01734000
RCCSESCT EQU   ISTRCC+129                                               01735000
RCCCNCNT EQU   ISTRCC+128                                               01736000
RCCPUXPT EQU   ISTRCC+124                                               01737000
@NM00161 EQU   ISTRCC+122                                               01738000
RCCINDEX EQU   ISTRCC+120                                               01739000
RCCPATHZ EQU   ISTRCC+118                                               01740000
RCCCTELU EQU   ISTRCC+116                                               01741000
RCCTIMER EQU   ISTRCC+112                                               01742000
RCCPATHT EQU   ISTRCC+108                                               01743000
@NM00160 EQU   ISTRCC+107                                               01744000
@NM00159 EQU   RCCBITAN+1                                               01745000
@NM00158 EQU   RCCBITAN+1                                               01746000
@NM00157 EQU   RCCBITAN+1                                               01747000
@NM00156 EQU   RCCBITAN+1                                               01748000
@NM00155 EQU   RCCBITAN+1                                               01749000
@NM00154 EQU   RCCBITAN+1                                               01750000
RCCANS   EQU   RCCBITAN+1                                               01751000
RCCBNNSP EQU   RCCBITAN+1                                               01752000
RCCIRETR EQU   RCCBITAN                                                 01753000
RCCDSNPR EQU   RCCBITAN                                                 01754000
RCCACTPU EQU   RCCBITAN                                                 01755000
RCCBRKCN EQU   RCCBITAN                                                 01756000
RCCFINAL EQU   RCCBITAN                                                 01757000
RCCDIALP EQU   RCCBITAN                                                 01758000
RCCBRKF  EQU   RCCBITAN                                                 01759000
RCCCTPGD EQU   RCCBITAN                                                 01760000
RCCCDFLG EQU   ISTRCC+104                                               01761000
RCCPRE   EQU   ISTRCC                                                   01762000
RCDRMEND EQU   ISTRCDRM+220                                             01763000
@NM00153 EQU   ISTRCDRM+218                                             01764000
RCDRMSEQ EQU   ISTRCDRM+216                                             01765000
@NM00152 EQU   ISTRCDRM+213                                             01766000
RCDRMSC  EQU   ISTRCDRM+212                                             01767000
@NM00151 EQU   RCDRMFGS+3                                               01768000
@NM00150 EQU   RCDRMFGS+3                                               01769000
@NM00149 EQU   RCDRMFGS+3                                               01770000
@NM00148 EQU   RCDRMFGS+3                                               01771000
@NM00147 EQU   RCDRMFGS+3                                               01772000
@NM00146 EQU   RCDRMFGS+3                                               01773000
@NM00145 EQU   RCDRMFGS+3                                               01774000
RCDRMCD2 EQU   RCDRMFGS+3                                               01775000
RCDRCDRS EQU   RCDRMFGS+2                                               01776000
RCDRMDYN EQU   RCDRMFGS+2                                               01777000
RCDRMRID EQU   RCDRMFGS+2                                               01778000
RCDRMLOQ EQU   RCDRMFGS+2                                               01779000
RCDRMNMP EQU   RCDRMFGS+2                                               01780000
RCDRMPS  EQU   RCDRMFGS+2                                               01781000
RCDRMURC EQU   RCDRMFGS+2                                               01782000
RCDRMNAP EQU   RCDRMFGS+2                                               01783000
RCDRMVL  EQU   RCDRMFGS+1                                               01784000
RCDRMSPC EQU   RCDRMFGS+1                                               01785000
RCDRMINC EQU   RCDRMFGS+1                                               01786000
RCDRMLPS EQU   RCDRMFGS+1                                               01787000
RCDRMTCR EQU   RCDRMFGS+1                                               01788000
RCDRMDTC EQU   RCDRMFGS+1                                               01789000
RCDRMDT  EQU   RCDRMFGS+1                                               01790000
RCDRMCLR EQU   RCDRMFGS+1                                               01791000
RCDRMCLC EQU   RCDRMFGS                                                 01792000
RCDRMDCD EQU   RCDRMFGS                                                 01793000
RCDRMOVR EQU   RCDRMFGS                                                 01794000
RCDRMSDT EQU   RCDRMFGS                                                 01795000
RCDRMACT EQU   RCDRMFGS                                                 01796000
RCDRMSCA EQU   RCDRMFGS                                                 01797000
RCDRMPRI EQU   RCDRMFGS                                                 01798000
RCDRMHST EQU   RCDRMFGS                                                 01799000
RCDRMRP  EQU   ISTRCDRM+204                                             01800000
RCDRMLRP EQU   RCDRMRPQ+4                                               01801000
RCDRMFRP EQU   RCDRMRPQ                                                 01802000
RCDRMARP EQU   ISTRCDRM+192                                             01803000
RCDRMPDT EQU   RCDRMPDN                                                 01804000
RCDRMPR  EQU   ISTRCDRM                                                 01805000
RCDRSEND EQU   ISTRCDRS+168                                             01806000
@NM00144 EQU   ISTRCDRS+167                                             01807000
@NM00143 EQU   @NM00142                                                 01808000
RCDRDYN  EQU   @NM00142                                                 01809000
RCDTKCNT EQU   ISTRCDRS+164                                             01810000
RCDCDRMN EQU   ISTRCDRS+156                                             01811000
RCDRCDRM EQU   ISTRCDRS+148                                             01812000
RCDRSARP EQU   ISTRCDRS+144                                             01813000
RCDRSPR  EQU   ISTRCDRS                                                 01814000
RCLEND   EQU   ISTRCL+100                                               01815000
@NM00141 EQU   ISTRCL+98                                                01816000
RCLCTNGP EQU   ISTRCL+96                                                01817000
RCLCTECM EQU   ISTRCL+94                                                01818000
RCLCTETR EQU   ISTRCL+92                                                01819000
RCLGPOLA EQU   ISTRCL+88                                                01820000
RCLGPADR EQU   RCLADR+1                                                 01821000
@NM00140 EQU   RCLFLAG                                                  01822000
@NM00139 EQU   RCLFLAG                                                  01823000
@NM00138 EQU   RCLFLAG                                                  01824000
@NM00137 EQU   RCLFLAG                                                  01825000
@NM00136 EQU   RCLFLAG                                                  01826000
@NM00135 EQU   RCLFLAG                                                  01827000
@NM00134 EQU   RCLFLAG                                                  01828000
RCLBATCH EQU   RCLFLAG                                                  01829000
RCLPRE   EQU   ISTRCL                                                   01830000
RDAEND   EQU   ISTRDA+136                                               01831000
RDAPRE   EQU   ISTRDA                                                   01832000
RDSEND   EQU   ISTRDS+92                                                01833000
RDSCTATR EQU   ISTRDS+90                                                01834000
RDSCTTRM EQU   ISTRDS+88                                                01835000
RDSADDOT EQU   ISTRDS+84                                                01836000
RDSPRE   EQU   ISTRDS                                                   01837000
RGPEND   EQU   ISTRGP+96                                                01838000
@NM00133 EQU   ISTRGP+95                                                01839000
@NM00132 EQU   RGPBITAN                                                 01840000
@NM00131 EQU   RGPBITAN                                                 01841000
@NM00130 EQU   RGPBITAN                                                 01842000
RGPX21SW EQU   RGPBITAN                                                 01843000
RGPASDLC EQU   RGPBITAN                                                 01844000
RGPABSC  EQU   RGPBITAN                                                 01845000
RGPASS   EQU   RGPBITAN                                                 01846000
RGPADIL  EQU   RGPBITAN                                                 01847000
@NM00129 EQU   ISTRGP+92                                                01848000
@NM00128 EQU   ISTRGP+90                                                01849000
@NM00127 EQU   ISTRGP+88                                                01850000
@NM00126 EQU   ISTRGP+86                                                01851000
@NM00125 EQU   ISTRGP+84                                                01852000
RGPPRE   EQU   ISTRGP                                                   01853000
RINEND   EQU   ISTRIN+152                                               01854000
@NM00124 EQU   ISTRIN+150                                               01855000
@NM00123 EQU   RINFLAGS                                                 01856000
RINCHCON EQU   RINFLAGS                                                 01857000
RINTG    EQU   ISTRIN+148                                               01858000
RINXTRIN EQU   ISTRIN+144                                               01859000
RINNCPPT EQU   ISTRIN+140                                               01860000
RINREAL  EQU   ISTRIN+132                                               01861000
RINDEFTG EQU   ISTRIN+131                                               01862000
RINBCKUP EQU   RINBITAN                                                 01863000
RINCHAN  EQU   RINBITAN                                                 01864000
RINPRSWD EQU   RINBITAN                                                 01865000
RINLOCAL EQU   RINBITAN                                                 01866000
RINPEER  EQU   RINBITAN                                                 01867000
RINLDISC EQU   RINBITAN                                                 01868000
RINNODEF EQU   RINBITAN                                                 01869000
RINREMPO EQU   RINBITAN                                                 01870000
RINCNCNT EQU   ISTRIN+129                                               01871000
RINNODID EQU   ISTRIN+128                                               01872000
RINRLDAF EQU   RINDAFID+2                                               01873000
@NM00122 EQU   RINDAFID                                                 01874000
RINLOCRN EQU   ISTRIN+120                                               01875000
RINCPLVL EQU   ISTRIN+116                                               01876000
RINCTDRU EQU   ISTRIN+112                                               01877000
RINREMOT EQU   ISTRIN+108                                               01878000
RINTRENT EQU   ISTRIN+104                                               01879000
RINCRPRE EQU   ISTRIN                                                   01880000
RLCEND   EQU   ISTRLC+92                                                01881000
@NM00121 EQU   ISTRLC+91                                                01882000
RLCLCCUA EQU   ISTRLC+88                                                01883000
RLCUCBAD EQU   RLCADR+1                                                 01884000
@NM00120 EQU   RLCFLAG                                                  01885000
@NM00119 EQU   RLCFLAG                                                  01886000
@NM00118 EQU   RLCFLAG                                                  01887000
@NM00117 EQU   RLCFLAG                                                  01888000
@NM00116 EQU   RLCFLAG                                                  01889000
@NM00115 EQU   RLCFLAG                                                  01890000
RLCACNT  EQU   RLCFLAG                                                  01891000
RLCALLOC EQU   RLCFLAG                                                  01892000
RLCPRE   EQU   ISTRLC                                                   01893000
RLSEND   EQU   ISTRLS+140                                               01894000
@NM00114 EQU   ISTRLS+138                                               01895000
RLSCTELU EQU   ISTRLS+136                                               01896000
RLSPRE   EQU   ISTRLS                                                   01897000
RLUEND   EQU   ISTRLU+152                                               01898000
RLUSEQNO EQU   ISTRLU+148                                               01899000
@NM00113 EQU   RLUBITAN+1                                               01900000
@NM00112 EQU   RLUBITAN+1                                               01901000
@NM00111 EQU   RLUBITAN+1                                               01902000
@NM00110 EQU   RLUBITAN+1                                               01903000
@NM00109 EQU   RLUBITAN+1                                               01904000
@NM00108 EQU   RLUBITAN+1                                               01905000
@NM00107 EQU   RLUBITAN+1                                               01906000
@NM00106 EQU   RLUBITAN+1                                               01907000
@NM00105 EQU   RLUBITAN                                                 01908000
RLUOSAIP EQU   RLUBITAN                                                 01909000
RLULOCSE EQU   RLUBITAN                                                 01910000
RLUCLNUP EQU   RLUBITAN                                                 01911000
RLUACTLU EQU   RLUBITAN                                                 01912000
RLUCDCTL EQU   RLUBITAN                                                 01913000
RLUNDSES EQU   RLUBITAN                                                 01914000
RLUBATCH EQU   RLUBITAN                                                 01915000
RLULOCAD EQU   ISTRLU+145                                               01916000
RLUTYPE  EQU   ISTRLU+144                                               01917000
RLUCRPR  EQU   ISTRLU                                                   01918000
RLXEND   EQU   ISTRLX+96                                                01919000
@NM00104 EQU   ISTRLX+93                                                01920000
@NM00103 EQU   RLXBITAN                                                 01921000
@NM00102 EQU   RLXBITAN                                                 01922000
@NM00101 EQU   RLXBITAN                                                 01923000
@NM00100 EQU   RLXBITAN                                                 01924000
@NM00099 EQU   RLXBITAN                                                 01925000
@NM00098 EQU   RLXBITAN                                                 01926000
@NM00097 EQU   RLXBITAN                                                 01927000
RLXINUSE EQU   RLXBITAN                                                 01928000
RLXLUPTR EQU   ISTRLX+88                                                01929000
RLXNLUX  EQU   ISTRLX+84                                                01930000
RLXPRE   EQU   ISTRLX                                                   01931000
RPTEND   EQU   ISTRPT+176                                               01932000
RPTCTNM  EQU   ISTRPT+168                                               01933000
@NM00096 EQU   RPTBITAN+1                                               01934000
@NM00095 EQU   RPTBITAN+1                                               01935000
@NM00094 EQU   RPTBITAN+1                                               01936000
@NM00093 EQU   RPTBITAN+1                                               01937000
@NM00092 EQU   RPTBITAN+1                                               01938000
@NM00091 EQU   RPTBITAN+1                                               01939000
@NM00090 EQU   RPTBITAN+1                                               01940000
@NM00089 EQU   RPTBITAN+1                                               01941000
RPTISTAT EQU   RPTBITAN                                                 01942000
RPTDYNAM EQU   RPTBITAN                                                 01943000
RPTVYIMM EQU   RPTBITAN                                                 01944000
RPTVIODN EQU   RPTBITAN                                                 01945000
RPTONLIN EQU   RPTBITAN                                                 01946000
RPTHLVPD EQU   RPTBITAN                                                 01947000
RPTVRYPD EQU   RPTBITAN                                                 01948000
RPTASLEP EQU   RPTBITAN                                                 01949000
RPTDAFSV EQU   ISTRPT+164                                               01950000
RPTPTHCT EQU   ISTRPT+162                                               01951000
RPTPEPCT EQU   ISTRPT+160                                               01952000
RPTNSNSV EQU   ISTRPT+156                                               01953000
RPTUTERM EQU   ISTRPT+152                                               01954000
RPTATERM EQU   ISTRPT+148                                               01955000
RPTDIVT  EQU   RPTDITT                                                  01956000
@NM00088 EQU   RPTXTCID+4                                               01957000
RPTLNDAF EQU   RPTLNCID+2                                               01958000
RPTLNSAF EQU   RPTLNCID                                                 01959000
RPTLN    EQU   ISTRPT                                                   01960000
RPXEND   EQU   ISTRPX+96                                                01961000
@NM00087 EQU   ISTRPX+93                                                01962000
RPXMAXLU EQU   ISTRPX+92                                                01963000
RPXPUPTR EQU   ISTRPX+88                                                01964000
RPXFLUX  EQU   ISTRPX+84                                                01965000
RPXPRE   EQU   ISTRPX                                                   01966000
RRNEND   EQU   ISTRRN+332                                               01967000
RRNLDRID EQU   ISTRRN+324                                               01968000
RRNCLDST EQU   ISTRRN+316                                               01969000
RRNGDSTA EQU   ISTRRN+308                                               01970000
RRNGLSTA EQU   ISTRRN+300                                               01971000
RRNLDCAT EQU   RRNLDFSM                                                 01972000
RRNVRID  EQU   ISTRRN+296                                               01973000
RRNPUXTN EQU   ISTRRN+292                                               01974000
RRNLUCT  EQU   ISTRRN+290                                               01975000
RRNPUCT  EQU   ISTRRN+288                                               01976000
RRNLPPTR EQU   ISTRRN+284                                               01977000
RRNTPPTR EQU   ISTRRN+280                                               01978000
RRNFNAEQ EQU   ISTRRN+276                                               01979000
@NM00086 EQU   ISTRRN+270                                               01980000
RRNMARTY EQU   ISTRRN+268                                               01981000
RRNMATID EQU   ISTRRN+264                                               01982000
@NM00085 EQU   ISTRRN+260                                               01983000
RRNNMNCP EQU   ISTRRN+252                                               01984000
@NM00084 EQU   ISTRRN+251                                               01985000
RRNOLRC  EQU   ISTRRN+250                                               01986000
RRNILRC  EQU   ISTRRN+249                                               01987000
RRNAMNUM EQU   ISTRRN+248                                               01988000
RRNAMLST EQU   ISTRRN+244                                               01989000
RRNCDPWE EQU   ISTRRN+240                                               01990000
RRNPUBI  EQU   RRNNMDPD+6                                               01991000
RRNDPLUB EQU   RRNNMDPD                                                 01992000
RRNINBFR EQU   ISTRRN+231                                               01993000
RRNDEFLV EQU   ISTRRN+230                                               01994000
RRNRNCUA EQU   ISTRRN+227                                               01995000
RRNRDCUA EQU   ISTRRN+224                                               01996000
RRNNCPNM EQU   ISTRRN+217                                               01997000
RRNCTPCC EQU   ISTRRN+216                                               01998000
RRNCPLUB EQU   ISTRRN+210                                               01999000
RRNDELAY EQU   ISTRRN+208                                               02000000
RRNMODL  EQU   RRNLVL+2                                                 02001000
RRNRELL  EQU   RRNLVL                                                   02002000
@NM00083 EQU   RRNBITAN+2                                               02003000
@NM00082 EQU   RRNBITAN+2                                               02004000
RRNAMLDA EQU   RRNBITAN+2                                               02005000
RRNLODNO EQU   RRNBITAN+2                                               02006000
RRNLODYS EQU   RRNBITAN+2                                               02007000
RRNRBMDL EQU   RRNBITAN+2                                               02008000
RRNALLOC EQU   RRNBITAN+2                                               02009000
RRNACQRD EQU   RRNBITAN+2                                               02010000
RRNREMPO EQU   RRNBITAN+1                                               02011000
RRNRBBUP EQU   RRNBITAN+1                                               02012000
RRNRBCT2 EQU   RRNBITAN+1                                               02013000
RRNRBCT1 EQU   RRNBITAN+1                                               02014000
RRNRBSEC EQU   RRNBITAN+1                                               02015000
RRNRBCCT EQU   RRNBITAN+1                                               02016000
RRNRBCCL EQU   RRNBITAN+1                                               02017000
RRNRBREM EQU   RRNBITAN+1                                               02018000
RRNRSYN  EQU   RRNBITAN                                                 02019000
RRNRAPEP EQU   RRNBITAN                                                 02020000
RRNRANCP EQU   RRNBITAN                                                 02021000
RRNRAOLT EQU   RRNBITAN                                                 02022000
RRNRASYN EQU   RRNBITAN                                                 02023000
RRNRADMP EQU   RRNBITAN                                                 02024000
RRNRAIPL EQU   RRNBITAN                                                 02025000
RRNRASHT EQU   RRNBITAN                                                 02026000
RRNHSTID EQU   ISTRRN+200                                               02027000
RRNHBUFS EQU   ISTRRN+198                                               02028000
RRNHLENT EQU   RRNHPRE+1                                                02029000
RRNHLENH EQU   RRNHPRE                                                  02030000
RRNNODCT EQU   ISTRRN+194                                               02031000
RRNEPADR EQU   ISTRRN+192                                               02032000
RRNCTENT EQU   ISTRRN+190                                               02033000
RRNCTECM EQU   ISTRRN+188                                               02034000
RRNCTEIN EQU   ISTRRN+186                                               02035000
RRNCTETR EQU   ISTRRN+184                                               02036000
RRNCTECL EQU   ISTRRN+182                                               02037000
RRNCTELI EQU   ISTRRN+180                                               02038000
RRNCTEGP EQU   ISTRRN+178                                               02039000
RRNCTBHS EQU   ISTRRN+176                                               02040000
RRNTABCT EQU   ISTRRN+172                                               02041000
RRNLASTE EQU   ISTRRN+168                                               02042000
RRNNCSPL EQU   ISTRRN+164                                               02043000
RRNRPLPT EQU   ISTRRN+160                                               02044000
RRNMSIZE EQU   ISTRRN+156                                               02045000
RRNFLUX  EQU   ISTRRN+152                                               02046000
RRNBHSET EQU   ISTRRN+148                                               02047000
RRNRINQP EQU   ISTRRN+144                                               02048000
RRNGRPA  EQU   ISTRRN+140                                               02049000
RRNLUBA  EQU   RRNUCBAD+1                                               02050000
RRNCHQI  EQU   RRNUCBAD                                                 02051000
RRNRNAME EQU   RRNFLAG                                                  02052000
RRNACBAQ EQU   RRNFLAG                                                  02053000
RRNCHCON EQU   RRNFLAG                                                  02054000
RRNVFYLM EQU   RRNFLAG                                                  02055000
RRNLDET  EQU   RRNFLAG                                                  02056000
RRNRIMIP EQU   RRNFLAG                                                  02057000
RRNLCDIE EQU   RRNFLAG                                                  02058000
RRNLCSIP EQU   RRNFLAG                                                  02059000
RRNPRE   EQU   ISTRRN                                                   02060000
RSWEND   EQU   ISTRSW+152                                               02061000
@NM00081 EQU   ISTRSW+150                                               02062000
RSWCTELU EQU   ISTRSW+148                                               02063000
RSWGRUPZ EQU   ISTRSW+146                                               02064000
RSWDIALZ EQU   ISTRSW+144                                               02065000
RSWGRUPT EQU   ISTRSW+140                                               02066000
RSWDIALT EQU   ISTRSW+136                                               02067000
RSWPRE   EQU   ISTRSW                                                   02068000
RTREND   EQU   ISTRTR+208                                               02069000
RTRCADDR EQU   ISTRTR+200                                               02070000
RTRBHSN1 EQU   ISTRTR+192                                               02071000
RTRIDCAS EQU   RTRBSCID+1                                               02072000
RTRIDLEN EQU   RTRBSCID                                                 02073000
RTRLCTI  EQU   ISTRTR+170                                               02074000
RTRTRMAX EQU   ISTRTR+169                                               02075000
@NM00080 EQU   RTRBITAN+4                                               02076000
@NM00079 EQU   RTRBITAN+4                                               02077000
@NM00078 EQU   RTRBITAN+4                                               02078000
@NM00077 EQU   RTRBITAN+4                                               02079000
@NM00076 EQU   RTRBITAN+4                                               02080000
@NM00075 EQU   RTRBITAN+4                                               02081000
@NM00074 EQU   RTRBITAN+4                                               02082000
@NM00073 EQU   RTRBITAN+4                                               02083000
@NM00072 EQU   RTRBITAN+3                                               02084000
RTRDTRLM EQU   RTRBITAN+3                                               02085000
RTRRAATN EQU   RTRBITAN+3                                               02086000
RTRLSCMD EQU   RTRBITAN+3                                               02087000
RTRRFDEK EQU   RTRBITAN+3                                               02088000
RTRRFANK EQU   RTRBITAN+3                                               02089000
RTRRFPFK EQU   RTRBITAN+3                                               02090000
RTRRFPEN EQU   RTRBITAN+3                                               02091000
RTRRFXCT EQU   RTRBITAN+2                                               02092000
RTRRESCT EQU   RTRBITAN+2                                               02093000
RTRRESUP EQU   RTRBITAN+2                                               02094000
RTRREATT EQU   RTRBITAN+2                                               02095000
RTRRECHK EQU   RTRBITAN+2                                               02096000
RTRREACR EQU   RTRBITAN+2                                               02097000
@NM00071 EQU   RTRBITAN+2                                               02098000
RTRREBRK EQU   RTRBITAN+2                                               02099000
RTRRDBHI EQU   RTRBITAN+1                                               02100000
RTRRDBHD EQU   RTRBITAN+1                                               02101000
RTRRDBHN EQU   RTRBITAN+1                                               02102000
RTRRCXMS EQU   RTRBITAN+1                                               02103000
RTRRCMSG EQU   RTRBITAN+1                                               02104000
RTRRCBLK EQU   RTRBITAN+1                                               02105000
RTRRCPT3 EQU   RTRBITAN+1                                               02106000
RTRRCIT2 EQU   RTRBITAN+1                                               02107000
RTRRCIT1 EQU   RTRBITAN                                                 02108000
RTRRBEND EQU   RTRBITAN                                                 02109000
RTRRBECT EQU   RTRBITAN                                                 02110000
RTRRACTR EQU   RTRBITAN                                                 02111000
RTRRACDT EQU   RTRBITAN                                                 02112000
RTRRAPT3 EQU   RTRRAALL                                                 02113000
RTRRAPT2 EQU   RTRRAALL                                                 02114000
RTRRAPT1 EQU   RTRRAALL                                                 02115000
RTRCTADR EQU   ISTRTR+162                                               02116000
RTRCTPOL EQU   ISTRTR+160                                               02117000
RTRCTDIA EQU   ISTRTR+158                                               02118000
RTRCTECM EQU   ISTRTR+156                                               02119000
RTRDIAA  EQU   ISTRTR+152                                               02120000
RTRPOLA  EQU   ISTRTR+148                                               02121000
RTRADRPT EQU   RTRADR+1                                                 02122000
@NM00070 EQU   RTRFLAG                                                  02123000
@NM00069 EQU   RTRFLAG                                                  02124000
@NM00068 EQU   RTRFLAG                                                  02125000
@NM00067 EQU   RTRFLAG                                                  02126000
@NM00066 EQU   RTRFLAG                                                  02127000
@NM00065 EQU   RTRFLAG                                                  02128000
@NM00064 EQU   RTRFLAG                                                  02129000
RTRVTERM EQU   RTRFLAG                                                  02130000
RTRCRPR  EQU   ISTRTR                                                   02131000
RAPREND  EQU   ISTRAPRE+144                                             02132000
RAPHPRE  EQU   ISTRAPRE                                                 02133000
RPUEND   EQU   ISTRPU+104                                               02134000
RPUENTAD EQU   ISTRPU+100                                               02135000
RPUIDNUM EQU   RPUID48+3                                                02136000
RPUIDBLK EQU   RPUID48+2                                                02137000
RPUIDPA2 EQU   RPUID48+1                                                02138000
RPUIDPUT EQU   RPUID48                                                  02139000
RPUIDPA1 EQU   RPUSTAID                                                 02140000
RPUPASSL EQU   ISTRPU+91                                                02141000
RPUMXOUT EQU   ISTRPU+90                                                02142000
RPUMXDAT EQU   ISTRPU+88                                                02143000
RPURSV01 EQU   ISTRPU+87                                                02144000
RPURETYM EQU   ISTRPU+86                                                02145000
RPUADDR  EQU   ISTRPU+85                                                02146000
RPUTYPE  EQU   ISTRPU+84                                                02147000
RPUPRE   EQU   ISTRPU                                                   02148000
RLNEND   EQU   ISTRLN+136                                               02149000
RLNTGCS  EQU   ISTRLN+135                                               02150000
RLNCURTR EQU   ISTRLN+134                                               02151000
RLNINBMX EQU   RLNINBFR+1                                               02152000
RLNINBN  EQU   RLNINBFR                                                 02153000
RLNRTYM  EQU   ISTRLN+131                                               02154000
RLNSERVL EQU   ISTRLN+130                                               02155000
RLNREPTO EQU   ISTRLN+129                                               02156000
RLNACTTO EQU   ISTRLN+128                                               02157000
RLNCTPCC EQU   ISTRLN+127                                               02158000
RLNPUBI  EQU   ISTRLN+126                                               02159000
RLNDCUA  EQU   ISTRLN+123                                               02160000
RLNCUA   EQU   ISTRLN+120                                               02161000
RLNPAUSE EQU   ISTRLN+119                                               02162000
RLNPOLMT EQU   ISTRLN+118                                               02163000
RLNCTSES EQU   ISTRLN+117                                               02164000
@NM00063 EQU   ISTRLN+116                                               02165000
@NM00062 EQU   RLNBITAN+3                                               02166000
@NM00061 EQU   RLNBITAN+3                                               02167000
RLNSWEP  EQU   RLNBITAN+3                                               02168000
RLNSVSKP EQU   RLNLSCMD                                                 02169000
RLNSESLM EQU   RLNLSCMD                                                 02170000
RLNNPRLM EQU   RLNLSCMD                                                 02171000
RLNSWNCP EQU   RLNBITAN+3                                               02172000
RLNACTLN EQU   RLNBITAN+2                                               02173000
@NM00060 EQU   RLNBITAN+2                                               02174000
@NM00059 EQU   RLNBITAN+2                                               02175000
@NM00058 EQU   RLNBITAN+2                                               02176000
@NM00057 EQU   RLNBITAN+2                                               02177000
RLNDCALL EQU   RLNCONCT                                                 02178000
RLNAUTO  EQU   RLNCONCT                                                 02179000
RLNMANUL EQU   RLNCONCT                                                 02180000
@NM00056 EQU   RLNBITAN+1                                               02181000
RLNWANSW EQU   RLNBITAN+1                                               02182000
RLNINUSE EQU   RLNBITAN+1                                               02183000
RLNMULTP EQU   RLNBITAN+1                                               02184000
RLNIDV   EQU   RLNBITAN+1                                               02185000
RLNTTV   EQU   RLNBITAN+1                                               02186000
@NM00055 EQU   RLNBITAN+1                                               02187000
RLNRBUSE EQU   RLNBITAN+1                                               02188000
RLNRAPEP EQU   RLNBITAN                                                 02189000
RLNRANCP EQU   RLNBITAN                                                 02190000
RLNRAEP  EQU   RLNBITAN                                                 02191000
RLNRAPOL EQU   RLNBITAN                                                 02192000
RLNRATRN EQU   RLNBITAN                                                 02193000
RLNGANSW EQU   RLNBITAN                                                 02194000
RLNRACAN EQU   RLNRACNT                                                 02195000
RLNRACAT EQU   RLNRACNT                                                 02196000
@NM00054 EQU   ISTRLN+111                                               02197000
RLNMAXLA EQU   ISTRLN+110                                               02198000
RLNDESAM EQU   ISTRLN+109                                               02199000
RLNCURAM EQU   ISTRLN+108                                               02200000
RLNACTSN EQU   RLNCSLRC+2                                               02201000
RLNACTRM EQU   RLNCSLRC+1                                               02202000
RLNLRC   EQU   RLNCSLRC                                                 02203000
RLNAUTOA EQU   ISTRLN+102                                               02204000
RLNACTCT EQU   ISTRLN+100                                               02205000
RLNCTECM EQU   ISTRLN+98                                                02206000
RLNCTEIN EQU   ISTRLN+96                                                02207000
RLNCTETR EQU   ISTRLN+94                                                02208000
RLNCTECL EQU   ISTRLN+92                                                02209000
RLNENTAD EQU   ISTRLN+88                                                02210000
RLNLUBA  EQU   RLNUCBAD+1                                               02211000
RLNCHQI  EQU   RLNUCBAD                                                 02212000
@NM00053 EQU   RLNFLAG                                                  02213000
@NM00052 EQU   RLNFLAG                                                  02214000
RLNIDACT EQU   RLNFLAG                                                  02215000
RLNCHAN  EQU   RLNFLAG                                                  02216000
RLNACLNK EQU   RLNFLAG                                                  02217000
RLNBKDUP EQU   RLNFLAG                                                  02218000
RLNBCKUP EQU   RLNFLAG                                                  02219000
RLNCDLNK EQU   RLNFLAG                                                  02220000
RLNPRE   EQU   ISTRLN                                                   02221000
RDTEND   EQU   ISTRDT+136                                               02222000
RDTVSRPL EQU   RDTCRIA+16                                               02223000
RDTCRSPW EQU   RDTCRIA+8                                                02224000
RDTCRSDS EQU   RDTCRIA                                                  02225000
@NM00051 EQU   ISTRDT+114                                               02226000
@NM00050 EQU   RDTBITAN                                                 02227000
@NM00049 EQU   RDTBITAN                                                 02228000
@NM00048 EQU   RDTBITAN                                                 02229000
RDTSSFLG EQU   RDTBITAN                                                 02230000
RDTHCDRM EQU   RDTBITAN                                                 02231000
RDTBHSET EQU   RDTBITAN                                                 02232000
RDTCDCTL EQU   RDTBITAN                                                 02233000
RDTCTPGD EQU   RDTBITAN                                                 02234000
RDTLGCT  EQU   ISTRDT+112                                               02235000
RDTNODID EQU   ISTRDT+111                                               02236000
RDTMAXID EQU   ISTRDT+110                                               02237000
@NM00047 EQU   ISTRDT+108                                               02238000
RDTVYRPH EQU   ISTRDT+104                                               02239000
RDTBACK  EQU   ISTRDT+100                                               02240000
RDTFORW  EQU   ISTRDT+96                                                02241000
RDTNAMTB EQU   ISTRDT+92                                                02242000
RDTENTAD EQU   ISTRDT+88                                                02243000
RDTLEN   EQU   RDTPLEN+1                                                02244000
RDTPRICA EQU   RDTPRIOR                                                 02245000
RDTPRILS EQU   RDTPRIOR                                                 02246000
RDTPRISW EQU   RDTPRIOR                                                 02247000
RDTPRIRN EQU   RDTPRIOR                                                 02248000
RDTPRILC EQU   RDTPRIOR                                                 02249000
RDTPRIAP EQU   RDTPRIOR                                                 02250000
RDTCDRSC EQU   RDTPRIOR                                                 02251000
RDTCDRM  EQU   RDTPRIOR                                                 02252000
RDTPRE   EQU   ISTRDT                                                   02253000
RAPEND   EQU   ISTRAP+188                                               02254000
RAPMAXPV EQU   ISTRAP+184                                               02255000
RAPAPPWD EQU   ISTRAP+176                                               02256000
RAPACBN  EQU   ISTRAP+168                                               02257000
@NM00046 EQU   RAPBITAN+2                                               02258000
@NM00045 EQU   RAPBITAN+2                                               02259000
RAPSRTLN EQU   RAPBITAN+2                                               02260000
RAPSONSC EQU   RAPBITAN+2                                               02261000
RAPVFRR  EQU   RAPBITAN+2                                               02262000
RAPSRBX  EQU   RAPBITAN+2                                               02263000
@NM00044 EQU   RAPBITAN+2                                               02264000
RAPCSMA  EQU   RAPBITAN+2                                               02265000
RAPTSO   EQU   RAPBITAN+1                                               02266000
RAPAUTHE EQU   RAPBITAN+1                                               02267000
RAPANVPC EQU   RAPBITAN+1                                               02268000
RAPASPO  EQU   RAPBITAN+1                                               02269000
RAPAPPO  EQU   RAPBITAN+1                                               02270000
RAPAACQ  EQU   RAPBITAN+1                                               02271000
RAPAPRMT EQU   RAPBITAN+1                                               02272000
RAPAPASS EQU   RAPBITAN+1                                               02273000
RAPABLCK EQU   RAPBITAN                                                 02274000
RAPALLF  EQU   RAPBITAN                                                 02275000
RAPPARS  EQU   RAPBITAN                                                 02276000
RAPLSIZ  EQU   RAPBITAN                                                 02277000
RAPATLGN EQU   RAPBITAN                                                 02278000
RAPASLGI EQU   RAPBITAN                                                 02279000
RAPAQUI  EQU   RAPBITAN                                                 02280000
RAPABLGN EQU   RAPBITAN                                                 02281000
RAPBFACT EQU   ISTRAP+164                                               02282000
RAPBNA   EQU   ISTRAP+162                                               02283000
RAPEAS   EQU   ISTRAP+160                                               02284000
RAPACDEB EQU   ISTRAP+156                                               02285000
RAPACBA  EQU   ISTRAP+152                                               02286000
RAPENTAD EQU   ISTRAP+148                                               02287000
@NM00043 EQU   ISTRAP+146                                               02288000
RAPTRPRE EQU   ISTRAP+144                                               02289000
RAPPRE   EQU   ISTRAP                                                   02290000
RCPEND   EQU   ISTRCPRE+144                                             02291000
RCPLGMOD EQU   ISTRCPRE+136                                             02292000
RCPDLGMD EQU   ISTRCPRE+128                                             02293000
RCPLGNAP EQU   ISTRCPRE+120                                             02294000
RCPQCNT  EQU   ISTRCPRE+118                                             02295000
@NM00042 EQU   ISTRCPRE+117                                             02296000
RCPOSAIP EQU   RCPBITAN                                                 02297000
RCPVLMSG EQU   RCPBITAN                                                 02298000
RCPCSM   EQU   RCPBITAN                                                 02299000
RCPALLOC EQU   RCPBITAN                                                 02300000
RCPSEC   EQU   RCPBITAN                                                 02301000
RCPSESSC EQU   RCPSESSM                                                 02302000
RCPSESPR EQU   RCPSESSM                                                 02303000
RCPSSCFM EQU   ISTRCPRE+114                                             02304000
RCPSTCAP EQU   RCPCYSET                                                 02305000
RCPSTRQD EQU   RCPCYSET                                                 02306000
RCPMDCAP EQU   RCPCYMOD                                                 02307000
RCPMDRQD EQU   RCPCYMOD                                                 02308000
RCPPRIM  EQU   RCPPMODE                                                 02309000
RCPCROSS EQU   RCPPMODE                                                 02310000
RCPRRECD EQU   RCPPMODE                                                 02311000
RCPRBASC EQU   RCPPMODE                                                 02312000
RCPBFLIM EQU   ISTRCPRE+112                                             02313000
RCPNCPPM EQU   RCPNCPPC+1                                               02314000
RCPNCPPN EQU   RCPNCPPC                                                 02315000
RCPPACEM EQU   RCPPACE+1                                                02316000
RCPPACEN EQU   RCPPACE                                                  02317000
RCPBHSI2 EQU   ISTRCPRE+107                                             02318000
RCPBHSI1 EQU   ISTRCPRE+106                                             02319000
RCPSESLM EQU   ISTRCPRE+104                                             02320000
RCPSESCT EQU   ISTRCPRE+102                                             02321000
RCPINTTI EQU   ISTRCPRE+100                                             02322000
RCPUSSTI EQU   ISTRCPRE+98                                              02323000
RCPMODTI EQU   ISTRCPRE+96                                              02324000
RCPLNAPA EQU   ISTRCPRE+92                                              02325000
RCPSIBS  EQU   RCPSARRY+4                                               02326000
RCPSIBP  EQU   RCPSARRY                                                 02327000
RCPPRE   EQU   ISTRCPRE                                                 02328000
RPREND   EQU   ISTRPRE+84                                               02329000
RPRDEVCH EQU   ISTRPRE+76                                               02330000
RPRCONID EQU   ISTRPRE+67                                               02331000
@NM00041 EQU   RPRFLAGS                                                 02332000
RPRDYNAM EQU   RPRFLAGS                                                 02333000
RPRNOACT EQU   RPRFLAGS                                                 02334000
RPRDAFAD EQU   RPRBITAN+4                                               02335000
RPRENTVA EQU   RPRBITAN+4                                               02336000
RPRDUMMY EQU   RPRBITAN+4                                               02337000
RPRIMPCH EQU   RPRBITAN+4                                               02338000
RPRIMPAC EQU   RPRBITAN+4                                               02339000
RPRNEO   EQU   RPRBITAN+4                                               02340000
RPRRNAA  EQU   RPRBITAN+4                                               02341000
RPRDRADD EQU   RPRBITAN+4                                               02342000
RPRFADD  EQU   RPRBITAN+3                                               02343000
RPRINTST EQU   RPRBITAN+3                                               02344000
RPRCLVPD EQU   RPRBITAN+3                                               02345000
RPRSHAD  EQU   RPRBITAN+3                                               02346000
RPRGIST  EQU   RPRBITAN+3                                               02347000
RPRRBISA EQU   RPRBITAN+3                                               02348000
RPRENTVT EQU   RPRBITAN+3                                               02349000
RPRDINOP EQU   RPRBITAN+3                                               02350000
RPRDINUS EQU   RPRBITAN+2                                               02351000
RPRCRCPT EQU   RPRBITAN+2                                               02352000
RPRNOSRT EQU   RPRBITAN+2                                               02353000
RPRDOM   EQU   RPRBITAN+2                                               02354000
RPRNOUSE EQU   RPRBITAN+2                                               02355000
RPRNOSNA EQU   RPRBITAN+2                                               02356000
RPRCLNUP EQU   RPRBITAN+2                                               02357000
RPRCONLD EQU   RPRBITAN+2                                               02358000
RPRCONP  EQU   RPRBITAN+1                                               02359000
RPRACTP  EQU   RPRBITAN+1                                               02360000
RPRINTIO EQU   RPRBITAN+1                                               02361000
RPRCONCT EQU   RPRBITAN+1                                               02362000
RPRHLVPD EQU   RPRBITAN+1                                               02363000
RPRHLACT EQU   RPRBITAN+1                                               02364000
RPRONLIN EQU   RPRBITAN+1                                               02365000
RPRRINOP EQU   RPRBITAN+1                                               02366000
RPRAOPN  EQU   RPRBITAN                                                 02367000
RPRENTVH EQU   RPRBITAN                                                 02368000
RPRLIVE  EQU   RPRBITAN                                                 02369000
RPRENTED EQU   RPRBITAN                                                 02370000
RPRLTASN EQU   RPRBITAN                                                 02371000
RPRENTIO EQU   RPRBITAN                                                 02372000
RPRENTBF EQU   RPRBITAN                                                 02373000
RPRINV   EQU   RPRBITAN                                                 02374000
RPRDEFLV EQU   RPRSTATE+4                                               02375000
RPRDESS1 EQU   RPRDESST                                                 02376000
RPRCURS1 EQU   RPRCURST                                                 02377000
RPRCMDWE EQU   ISTRPRE+52                                               02378000
RPRTNTQP EQU   ISTRPRE+48                                               02379000
RPRPELEN EQU   ISTRPRE+36                                               02380000
RPRELEN  EQU   ISTRPRE+32                                               02381000
RPRALPAD EQU   ISTRPRE+28                                               02382000
RPRENTAD EQU   ISTRPRE+24                                               02383000
RPRREQCT EQU   ISTRPRE+22                                               02384000
RPRINDEX EQU   ISTRPRE+20                                               02385000
RPRDAF   EQU   RPRDAFID+2                                               02386000
@NM00040 EQU   RPRDAFID                                                 02387000
@NM00039 EQU   ISTRPRE+15                                               02388000
RPRHDTYP EQU   ISTRPRE+14                                               02389000
RPRENTRY EQU   ISTRPRE+13                                               02390000
RPRNAME  EQU   RPRSRTHD                                                 02391000
LOKXCL   EQU   @NM00037                                                 02392000
LOKPRY   EQU   @NM00037                                                 02393000
@NM00038 EQU   @NM00037                                                 02394000
@NM00036 EQU   LOKCHNG                                                  02395000
LOKCT    EQU   ISTLOK                                                   02396000
DEVRSV01 EQU   ISTDEVCH+7                                               02397000
DEVAUXTP EQU   ISTDEVCH+6                                               02398000
DEVADVFE EQU   DEVMODE                                                  02399000
@NM00035 EQU   DEVMODE                                                  02400000
DEVBASIC EQU   DEVMODE                                                  02401000
DEVREC   EQU   DEVMODE                                                  02402000
DEVPHYSA EQU   ISTDEVCH+4                                               02403000
DEVCSLPN EQU   DEVCHAR3                                                 02404000
DEVCSTCL EQU   DEVCHAR3                                                 02405000
DEVCCHEK EQU   DEVCHAR3                                                 02406000
DEVCATTN EQU   DEVCHAR3                                                 02407000
DEVCSWL  EQU   DEVFCCTL                                                 02408000
DEVCRVB  EQU   DEVFCCTL                                                 02409000
DEVCSSL  EQU   DEVFCCTL                                                 02410000
DEVCBSC  EQU   DEVFCCTL                                                 02411000
DEVMCODE EQU   ISTDEVCH+2                                               02412000
DEVCHAR2 EQU   DEVTCODE                                                 02413000
DEVSPOLL EQU   DEVCHAR                                                  02414000
DEVCCTL  EQU   DEVCHAR                                                  02415000
DEVNNSPT EQU   DEVCHAR                                                  02416000
DEVSPS   EQU   DEVCHAR                                                  02417000
DEVSUBND EQU   DEVCHAR                                                  02418000
DEVCONVR EQU   DEVCHAR                                                  02419000
DEVOTPUT EQU   DEVCHAR                                                  02420000
DEVINPUT EQU   DEVCHAR                                                  02421000
SRTTYPE  EQU   ISTSRT+12                                                02422000
SRTSPECE EQU   SRTSRTE                                                  02423000
SRTSYMNM EQU   ISTSRT                                                   02424000
NCSRUITS EQU   NCSUSSRU+2                                               02425000
NCSRULEN EQU   NCSUSSRU                                                 02426000
NCSAPPAB EQU   NCSAPP+608                                               02427000
NCSAPDAT EQU   NCSAPBUE+8                                               02428000
NCSAPRU  EQU   NCSAPBUE+3                                               02429000
NCSAPLEN EQU   NCSAPBUE+1                                               02430000
NCSRSV04 EQU   NCSAPBUE                                                 02431000
NCSAPEND EQU   NCSAPP+84                                                02432000
NCSAPTXT EQU   NCSAPP+76                                                02433000
NCSAPECB EQU   NCSAPP+72                                                02434000
NCSAPSA  EQU   NCSAPP                                                   02435000
NCSITSIZ EQU   NCSPLITF+2                                               02436000
@NM00029 EQU   NCSITFL1+1                                               02437000
NCSITCIO EQU   NCSITFL1                                                 02438000
NCSITSCP EQU   NCSITFL1                                                 02439000
NCSITMSG EQU   NCSITFL1                                                 02440000
NCSITPIU EQU   NCSITFL1                                                 02441000
NCSITSMS EQU   NCSITFL1                                                 02442000
NCSITPSS EQU   NCSITFL1                                                 02443000
NCSITLCK EQU   NCSITFL1                                                 02444000
NCSITAPI EQU   NCSITFL1                                                 02445000
NCSLDDCB EQU   ISTNCSPL+352                                             02446000
NCSLDPUB EQU   ISTNCSPL+351                                             02447000
NCSLDLUB EQU   ISTNCSPL+349                                             02448000
@NM00028 EQU   NCSNCPDF+6                                               02449000
NCSNCPDL EQU   NCSNCPDF                                                 02450000
@NM00027 EQU   NCSNCPLF+6                                               02451000
NCSNCPLL EQU   NCSNCPLF                                                 02452000
NCSNCPLM EQU   ISTNCSPL+325                                             02453000
NCSNCPNM EQU   ISTNCSPL+317                                             02454000
NCSPLITU EQU   NCSPLFL6                                                 02455000
NCSNCPIT EQU   NCSPLFL6                                                 02456000
NCSCTP23 EQU   NCSPLFL6                                                 02457000
NCSNCPCA EQU   NCSPLFL6                                                 02458000
NCSCDLIN EQU   NCSPLFL6                                                 02459000
NCSHALT  EQU   NCSPLFL6                                                 02460000
NCSLODYS EQU   NCSPLFL6                                                 02461000
NCSLODNO EQU   NCSPLFL6                                                 02462000
NCSDPSTA EQU   ISTNCSPL+308                                             02463000
NCSLDSTA EQU   ISTNCSPL+300                                             02464000
NCSDRDS  EQU   ISTNCSPL+292                                             02465000
NCSRNMLT EQU   ISTNCSPL+288                                             02466000
NCSRNMCT EQU   ISTNCSPL+287                                             02467000
NCSRSVD2 EQU   NCSCRMOD                                                 02468000
NCSPTMOD EQU   NCSCRMOD                                                 02469000
NCSAIMOD EQU   NCSCRMOD                                                 02470000
NCSRSVD1 EQU   NCSCHKPT+1                                               02471000
NCSCKCRY EQU   NCSCHKPT+1                                               02472000
NCSCKRIN EQU   NCSCHKPT+1                                               02473000
NCSPTUSE EQU   NCSCHKPT+1                                               02474000
NCSRNME  EQU   NCSCHKPT+1                                               02475000
NCSCUA   EQU   NCSCHKPT+1                                               02476000
NCSANSMD EQU   NCSCHKPT+1                                               02477000
NCSLGMOD EQU   NCSCHKPT                                                 02478000
NCSLGAPL EQU   NCSCHKPT                                                 02479000
NCSDTRLM EQU   NCSCHKPT                                                 02480000
NCSESLM  EQU   NCSCHKPT                                                 02481000
NCSNRPL  EQU   NCSCHKPT                                                 02482000
NCSPOLD  EQU   NCSCHKPT                                                 02483000
NCSPACTV EQU   NCSCHKPT                                                 02484000
NCSACTV  EQU   NCSCHKPT                                                 02485000
NCSPLRTY EQU   ISTNCSPL+283                                             02486000
NCSPLRH  EQU   ISTNCSPL+280                                             02487000
NCSUFMCB EQU   ISTNCSPL+276                                             02488000
NCSMGLPT EQU   NCSPLREP+4                                               02489000
NCSCPWPT EQU   NCSPLREP                                                 02490000
NCSSENS2 EQU   NCSSENSE+2                                               02491000
NCSSNS2  EQU   NCSSENSE+1                                               02492000
NCSSNS1  EQU   NCSSENSE                                                 02493000
NCSPLNSN EQU   ISTNCSPL+260                                             02494000
NCSPLMID EQU   ISTNCSPL+252                                             02495000
NCSPLPID EQU   ISTNCSPL+251                                             02496000
NCSPLGID EQU   ISTNCSPL+250                                             02497000
NCSPLSQN EQU   ISTNCSPL+248                                             02498000
NCSCDRMO EQU   ISTNCSPL+240                                             02499000
NCSLDRID EQU   ISTNCSPL+232                                             02500000
NCSPLRUI EQU   ISTNCSPL+224                                             02501000
NCSPLRUO EQU   ISTNCSPL+220                                             02502000
NCSPLRRP EQU   ISTNCSPL+216                                             02503000
NCSCRWKA EQU   ISTNCSPL+212                                             02504000
NCSPLSPL EQU   ISTNCSPL+208                                             02505000
NCSPLOLN EQU   ISTNCSPL+206                                             02506000
NCSPLHIS EQU   NCSPLFL5                                                 02507000
NCSCDLRA EQU   NCSPLFL5                                                 02508000
NCSINACT EQU   NCSPLFL5                                                 02509000
NCSERP2N EQU   NCSPLFL5                                                 02510000
NCSSKPSC EQU   NCSPLFL5                                                 02511000
NCSFORCE EQU   NCSPLFL5                                                 02512000
NCSSDLK  EQU   NCSPLFL5                                                 02513000
NCSSCPPS EQU   NCSPLFL5                                                 02514000
NCSDLRSN EQU   ISTNCSPL+204                                             02515000
NCSPL2AP EQU   NCSPLFL4                                                 02516000
NCSDSPN  EQU   NCSPLFL4                                                 02517000
NCSDSPI  EQU   NCSPLFL4                                                 02518000
NCSDSPA  EQU   NCSPLFL4                                                 02519000
NCSDSPE  EQU   NCSPLFL4                                                 02520000
NCSPLVID EQU   NCSPLFL4                                                 02521000
NCSPLRSO EQU   NCSPLFL4                                                 02522000
NCSDLNID EQU   NCSPLFL4                                                 02523000
NCSEND   EQU   NCSPLFL3                                                 02524000
NCSFINAL EQU   NCSPLFL3                                                 02525000
NCSANS   EQU   NCSPLFL3                                                 02526000
NCSPID   EQU   NCSPLFL3                                                 02527000
NCSGID   EQU   NCSPLFL3                                                 02528000
NCSPLANS EQU   NCSPLFL3                                                 02529000
NCSEPP   EQU   NCSPLFL3                                                 02530000
NCSPLMOM EQU   NCSPLFL3                                                 02531000
NCSPLVIT EQU   NCSPLFL2                                                 02532000
NCSPLVIS EQU   NCSPLFL2                                                 02533000
NCSREMPO EQU   NCSPLFL2                                                 02534000
NCSPLDS  EQU   NCSPLFL2                                                 02535000
NCSOUFMC EQU   NCSPLFL2                                                 02536000
NCSPLRIO EQU   NCSPLFL2                                                 02537000
NCSPLRSF EQU   NCSPLFL2                                                 02538000
NCSPLVDP EQU   NCSPLFL2                                                 02539000
NCSPLPOS EQU   NCSPLFL1                                                 02540000
NCSPL2CN EQU   NCSPLFL1                                                 02541000
NCSPLAPU EQU   NCSPLFL1                                                 02542000
NCSMSG   EQU   NCSPLFL1                                                 02543000
NCSPLSMN EQU   NCSPLFL1                                                 02544000
NCSPLEBN EQU   NCSPLFL1                                                 02545000
NCSPLSOM EQU   NCSPLFL1                                                 02546000
NCSPL2IN EQU   NCSPLFL1                                                 02547000
NCSPLECB EQU   ISTNCSPL+192                                             02548000
NCSPLCVT EQU   ISTNCSPL+184                                             02549000
NCSPLWKA EQU   ISTNCSPL+180                                             02550000
NCSPLDAF EQU   NCSPLCID+2                                               02551000
NCSPLSAF EQU   NCSPLCID                                                 02552000
NCSPLRAD EQU   ISTNCSPL+172                                             02553000
NCSPLWRF EQU   ISTNCSPL+100                                             02554000
NCSPLWRE EQU   ISTNCSPL+96                                              02555000
NCSSTCMD EQU   NCSCRFLG                                                 02556000
NCSUSRNF EQU   NCSCRFLG                                                 02557000
NCSOPRQU EQU   NCSCRFLG                                                 02558000
NCSCRDSE EQU   NCSCRFLG                                                 02559000
NCSFMERP EQU   NCSCRFLG                                                 02560000
NCSFMCLD EQU   NCSCRFLG                                                 02561000
NCSPLCLD EQU   NCSCRFLG                                                 02562000
NCSPLWRM EQU   NCSCRFLG                                                 02563000
NCSPLUAD EQU   ISTNCSPL+92                                              02564000
NCSMSGSP EQU   ISTNCSPL+91                                              02565000
@NM00026 EQU   NCSITFL2                                                 02566000
NCSITEND EQU   NCSITFL2                                                 02567000
NCSITEXT EQU   NCSITFL2                                                 02568000
NCSITINT EQU   NCSITFL2                                                 02569000
NCSCMDB  EQU   NCSPLCMD+1                                               02570000
@NM00025 EQU   NCSCMDA                                                  02571000
NCSPLINT EQU   NCSCMDA                                                  02572000
NCSPLUFM EQU   NCSCMDA                                                  02573000
NCSPLFLO EQU   NCSCMDA                                                  02574000
NCSPLSYN EQU   NCSCMDA                                                  02575000
NCSPLCTL EQU   NCSCMDA                                                  02576000
NCSPLSYS EQU   NCSCMDA                                                  02577000
NCSPLLPT EQU   ISTNCSPL+84                                              02578000
@NM00024 EQU   NCSTROPT                                                 02579000
NCSTVOPT EQU   NCSTROPT                                                 02580000
NCSCMDNT EQU   ISTNCSPL+78                                              02581000
NCSNCPEP EQU   ISTNCSPL+77                                              02582000
NCSCRPID EQU   ISTNCSPL+76                                              02583000
NCSCRCMD EQU   ISTNCSPL+75                                              02584000
NCSDLID  EQU   ISTNCSPL+69                                              02585000
NCSDEST  EQU   NCSCDRMN+4                                               02586000
NCSADJ   EQU   NCSCDRMN                                                 02587000
NCSPLRID EQU   ISTNCSPL+53                                              02588000
NCSRRNPT EQU   ISTNCSPL+49                                              02589000
NCSDRFLG EQU   ISTNCSPL+48                                              02590000
NCSPRMRC EQU   ISTNCSPL+47                                              02591000
NCSSCOPE EQU   ISTNCSPL+46                                              02592000
NCSPLREL EQU   NCSPLVFL                                                 02593000
NCSDCTCT EQU   NCSPLVFL                                                 02594000
NCSDACLK EQU   NCSPLVFL                                                 02595000
NCSABCON EQU   NCSPLVFL                                                 02596000
NCSDCONT EQU   NCSPLVFL                                                 02597000
NCSPLACQ EQU   NCSPLVFL                                                 02598000
NCSVDEL  EQU   NCSPLVFL                                                 02599000
NCSVNCSA EQU   NCSPLVFL                                                 02600000
@NM00023 EQU   NCSCRRTN                                                 02601000
NCSMDRQD EQU   NCSCRRTN                                                 02602000
NCSPLPDB EQU   NCSPLSID+5                                               02603000
NCSPLNID EQU   NCSPLPHD                                                 02604000
NCSPLPO  EQU   NCSPLSTA                                                 02605000
NCSFSCON EQU   NCSPLSTA                                                 02606000
NCSRSVD4 EQU   NCSPLSTA                                                 02607000
@NM00022 EQU   NCSPFX+33                                                02608000
@NM00021 EQU   NCSPFX+24                                                02609000
@NM00020 EQU   NCSPFX+20                                                02610000
NCSVBF16 EQU   NCSPLVBF+1                                               02611000
NCSVBF15 EQU   NCSPLVBF+1                                               02612000
NCSVBF14 EQU   NCSPLVBF+1                                               02613000
NCSVBF13 EQU   NCSPLVBF+1                                               02614000
NCSVBF12 EQU   NCSPLVBF+1                                               02615000
NCSVBF11 EQU   NCSPLVBF+1                                               02616000
NCSVBF10 EQU   NCSPLVBF+1                                               02617000
NCSVBF09 EQU   NCSPLVBF+1                                               02618000
NCSVBF08 EQU   NCSPLVBF                                                 02619000
NCSVBF07 EQU   NCSPLVBF                                                 02620000
NCSVBF06 EQU   NCSPLVBF                                                 02621000
NCSVBF05 EQU   NCSPLVBF                                                 02622000
NCSVBF04 EQU   NCSPLVBF                                                 02623000
NCSVBF03 EQU   NCSPLVBF                                                 02624000
NCSVBF02 EQU   NCSPLVBF                                                 02625000
NCSVBF01 EQU   NCSPLVBF                                                 02626000
NCSPLVCD EQU   NCSVERB                                                  02627000
@NM00019 EQU   @NM00018                                                 02628000
NCSPLRPH EQU   NCSPFX+12                                                02629000
NCSWLPTR EQU   NCSPLWEL+1                                               02630000
@NM00017 EQU   NCSPLWEL                                                 02631000
@NM00016 EQU   NCSPFX+4                                                 02632000
NCSIORC  EQU   NCSPFX+3                                                 02633000
@NM00015 EQU   NCSFLAGS                                                 02634000
@NM00014 EQU   NCSFLAGS                                                 02635000
@NM00013 EQU   NCSFLAGS                                                 02636000
@NM00012 EQU   NCSFLAGS                                                 02637000
NCSPLNON EQU   NCSFLAGS                                                 02638000
NCSPRIV  EQU   NCSFLAGS                                                 02639000
NCSPLREQ EQU   NCSFLAGS                                                 02640000
NCSVSTAT EQU   NCSFLAGS                                                 02641000
@NM00011 EQU   NCSPFX+1                                                 02642000
NCSCBID  EQU   NCSPFX                                                   02643000
CPCBCON  EQU   ISTCPCB+35                                               02644000
CPCBR00  EQU   ISTCPCB+34                                               02645000
CPCBMNR  EQU   ISTCPCB+33                                               02646000
CPCBURC  EQU   ISTCPCB+24                                               02647000
CPCBUSR  EQU   ISTCPCB+20                                               02648000
CPCBFMH  EQU   CPCBOPC+1                                                02649000
CPCBCAT  EQU   CPCBOPC                                                  02650000
CPCB13   EQU   CPCBPH                                                   02651000
CPCBFA   EQU   @NM00010                                                 02652000
CPCBQP   EQU   ISTCPCB+4                                                02653000
CPCBRC   EQU   ISTCPCB+3                                                02654000
CPCBNW   EQU   CPCBFL                                                   02655000
CPCBXC   EQU   CPCBFL                                                   02656000
CPCBDX   EQU   CPCBFL                                                   02657000
CPCBIB   EQU   CPCBFL                                                   02658000
CPCBXN   EQU   CPCBFL                                                   02659000
CPCBPV   EQU   CPCBFL                                                   02660000
CPCBRS   EQU   CPCBFL                                                   02661000
CPCBST   EQU   CPCBFL                                                   02662000
CPCBLN   EQU   ISTCPCB+1                                                02663000
CPCBID   EQU   ISTCPCB                                                  02664000
POHID    EQU   ISTPOHD+2                                                02665000
POHGEN   EQU   POHSTAT                                                  02666000
POHRREQ  EQU   POHSTAT                                                  02667000
POHRSVD2 EQU   POHSTAT                                                  02668000
POHCNTRL EQU   POHSTAT                                                  02669000
POHLBL   EQU   POHSTAT                                                  02670000
POHDATA  EQU   POHSTAT                                                  02671000
POHEND   EQU   POHSTAT                                                  02672000
POHRSVD1 EQU   ISTPOHD                                                  02673000
IOBERRCT EQU   IOBSTDRD+30                                              02674000
IOBRSV19 EQU   IOBINCAM+1                                               02675000
IOBOLTST EQU   IOBBTAMF                                                 02676000
IOBRFTMG EQU   IOBBTAMF                                                 02677000
IOBRSV17 EQU   IOBBTAMF                                                 02678000
IOBRSV16 EQU   IOBBTAMF                                                 02679000
IOBRSV15 EQU   IOBBTAMF                                                 02680000
IOBRSV14 EQU   IOBBTAMF                                                 02681000
IOBINUSE EQU   IOBBTAMF                                                 02682000
IOBPRMER EQU   IOBBTAMF                                                 02683000
IOBRSTRB EQU   IOBRESTR+1                                               02684000
IOBREPOS EQU   IOBRESTR                                                 02685000
IOBDCBPB EQU   IOBDCBPT+1                                               02686000
IOBRSV44 EQU   IOBFLAG4                                                 02687000
IOBJES3I EQU   IOBFLAG4                                                 02688000
IOBRSV42 EQU   IOBFLAG4                                                 02689000
IOBRSV41 EQU   IOBFLAG4                                                 02690000
IOBRSV40 EQU   IOBFLAG4                                                 02691000
IOBPMERR EQU   IOBFLAG4                                                 02692000
IOBCC3WE EQU   IOBFLAG4                                                 02693000
IOBGDPOL EQU   IOBFLAG4                                                 02694000
IOBSTRTB EQU   IOBSTART+1                                               02695000
IOBSIOCC EQU   IOBSTART                                                 02696000
IOBCSB7  EQU   IOBCSTAT                                                 02697000
IOBCSB6  EQU   IOBCSTAT                                                 02698000
IOBCSB5  EQU   IOBCSTAT                                                 02699000
IOBCSB4  EQU   IOBCSTAT                                                 02700000
IOBCSB3  EQU   IOBCSTAT                                                 02701000
IOBCSB2  EQU   IOBCSTAT                                                 02702000
IOBCSB1  EQU   IOBCSTAT                                                 02703000
IOBCSB0  EQU   IOBCSTAT                                                 02704000
IOBUSB7  EQU   IOBUSTAT                                                 02705000
IOBUSB6  EQU   IOBUSTAT                                                 02706000
IOBUSB5  EQU   IOBUSTAT                                                 02707000
IOBUSB4  EQU   IOBUSTAT                                                 02708000
IOBUSB3  EQU   IOBUSTAT                                                 02709000
IOBUSB2  EQU   IOBUSTAT                                                 02710000
IOBUSB1  EQU   IOBUSTAT                                                 02711000
IOBUSB0  EQU   IOBUSTAT                                                 02712000
IOBCMDA  EQU   IOBIOCSW                                                 02713000
IOBLOG   EQU   IOBFL3                                                   02714000
IOBJAM   EQU   IOBICL                                                   02715000
IOBMSG   EQU   IOBFL3                                                   02716000
IOBSDR   EQU   IOBCNC                                                   02717000
IOBACU   EQU   IOBFL3                                                   02718000
IOBCDC   EQU   IOBFL3                                                   02719000
IOBICC   EQU   IOBFL3                                                   02720000
IOBCCC   EQU   IOBFL3                                                   02721000
IOBECBPB EQU   IOBECBPT+1                                               02722000
IOBECBCC EQU   IOBECBPT                                                 02723000
IOBS1B7  EQU   IOBSENS1                                                 02724000
IOBS1B6  EQU   IOBSENS1                                                 02725000
IOBS1B5  EQU   IOBSENS1                                                 02726000
IOBS1B4  EQU   IOBSENS1                                                 02727000
IOBS1B3  EQU   IOBSENS1                                                 02728000
IOBS1B2  EQU   IOBSENS1                                                 02729000
IOBS1B1  EQU   IOBSENS1                                                 02730000
IOBS1B0  EQU   IOBSENS1                                                 02731000
IOBSNSC9 EQU   IOBS0B7                                                  02732000
IOBS0B6  EQU   IOBSENS0                                                 02733000
IOBS0B5  EQU   IOBSENS0                                                 02734000
IOBS0B4  EQU   IOBSENS0                                                 02735000
IOBS0B3  EQU   IOBSENS0                                                 02736000
IOBS0B2  EQU   IOBSENS0                                                 02737000
IOBS0B1  EQU   IOBSENS0                                                 02738000
IOBS0B0  EQU   IOBSENS0                                                 02739000
IOBPNCH  EQU   IOBFLAG2                                                 02740000
IOBSTATO EQU   IOBFLAG2                                                 02741000
IOBSKUPD EQU   IOBFLAG2                                                 02742000
IOBALTTR EQU   IOBFLAG2                                                 02743000
IOBRRT2  EQU   IOBRDHA0                                                 02744000
IOBRRT3  EQU   IOBPURGE                                                 02745000
IOBSENSE EQU   IOBFLAG2                                                 02746000
IOBHALT  EQU   IOBFLAG2                                                 02747000
IOBSPSVC EQU   IOBRSTRT                                                 02748000
IOBUNREL EQU   IOBFLAG1                                                 02749000
IOBIOERR EQU   IOBFLAG1                                                 02750000
IOBFCREX EQU   IOBCYCCK                                                 02751000
IOBRPSTN EQU   IOBFLAG1                                                 02752000
IOBERRTN EQU   IOBFLAG1                                                 02753000
IOBCMDCH EQU   IOBFLAG1                                                 02754000
IOBDATCH EQU   IOBFLAG1                                                 02755000
IOBCNOPA EQU   IOBPREFX+12                                              02756000
IOBCICB  EQU   IOBPREFX+8                                               02757000
IOBCECB  EQU   IOBPREFX+4                                               02758000
IOBCONOP EQU   IOBPREFX+3                                               02759000
IOBCINOP EQU   IOBPREFX+2                                               02760000
IOBRSV05 EQU   IOBPREFX+1                                               02761000
IOBPCI   EQU   IOBCFLG1                                                 02762000
IOBRSTCH EQU   IOBCFLG1                                                 02763000
IOBABAPP EQU   IOBCFLG1                                                 02764000
IOBPTST  EQU   IOBCFLG1                                                 02765000
IOBRSV04 EQU   IOBCFLG1                                                 02766000
IOBRSV03 EQU   IOBCFLG1                                                 02767000
IOBRSV02 EQU   IOBCFLG1                                                 02768000
IOBRSV01 EQU   IOBCFLG1                                                 02769000
@NM00009 EQU   SRBSECT+40                                               02770000
@NM00008 EQU   SRBSECT+38                                               02771000
SRBPRIOR EQU   SRBSECT+37                                               02772000
SRBPKF   EQU   SRBSECT+36                                               02773000
SRBSAVE  EQU   SRBSECT+32                                               02774000
SRBPARM  EQU   SRBSECT+28                                               02775000
SRBRMTR  EQU   SRBSECT+24                                               02776000
SRBEP    EQU   SRBSECT+20                                               02777000
SRBPTCB  EQU   SRBFLC+4                                                 02778000
SRBPASID EQU   SRBFLC+2                                                 02779000
SRBCPAFF EQU   SRBFLC                                                   02780000
SRBASCB  EQU   SRBSECT+8                                                02781000
SRBFLNK  EQU   SRBSECT+4                                                02782000
SRBID    EQU   SRBSECT                                                  02783000
IOSEND   EQU   IOSB+108                                                 02784000
IOSSKR   EQU   IOSEEKA+7                                                02785000
IOSSKH2  EQU   IOSSKHH+1                                                02786000
IOSSKH1  EQU   IOSSKHH                                                  02787000
IOSSKCC  EQU   IOSCCHH                                                  02788000
IOSSKBB  EQU   IOSEEKA+1                                                02789000
IOSSKM   EQU   IOSEEKA                                                  02790000
IOSEEK   EQU   IOSB+92                                                  02791000
IOSMDM   EQU   IOSB+91                                                  02792000
IOSMDB   EQU   IOSB+90                                                  02793000
IOSCKEY7 EQU   IOSCKEY                                                  02794000
IOSCKEY6 EQU   IOSCKEY                                                  02795000
IOSCKEY5 EQU   IOSCKEY                                                  02796000
IOSCKEY4 EQU   IOSCKEY                                                  02797000
@NM00004 EQU   IOSCKEY                                                  02798000
IOSFMSK  EQU   IOSB+88                                                  02799000
IOSCUDEV EQU   IOSPATH+1                                                02800000
@NM00003 EQU   IOSCHN                                                   02801000
IOSPATH3 EQU   IOSCHN                                                   02802000
IOSPATH2 EQU   IOSCHN                                                   02803000
IOSEXP   EQU   IOSCHN                                                   02804000
IOSGDP   EQU   IOSCHN                                                   02805000
IOSAFF   EQU   IOSB+85                                                  02806000
IOSRSS1B EQU   IOSB+84                                                  02807000
IOSDSID  EQU   IOSB+80                                                  02808000
IOSVST   EQU   IOSB+76                                                  02809000
IOSRST   EQU   IOSB+72                                                  02810000
IOSDIE   EQU   IOSB+68                                                  02811000
IOSABN   EQU   IOSB+64                                                  02812000
IOSNRM   EQU   IOSB+60                                                  02813000
IOSPCI   EQU   IOSB+56                                                  02814000
IOSERP   EQU   IOSB+52                                                  02815000
IOSPCHN  EQU   IOSB+48                                                  02816000
IOSSNS   EQU   IOSB+42                                                  02817000
IOSAPMSK EQU   IOSB+40                                                  02818000
IOSRES4A EQU   IOSB+36                                                  02819000
IOSUSE   EQU   IOSB+32                                                  02820000
IOSSRB   EQU   IOSB+28                                                  02821000
IOSCSWRC EQU   IOSCSW+5                                                 02822000
IOSTSB   EQU   IOSTATUS+1                                               02823000
IOSTSA   EQU   IOSTATUS                                                 02824000
IOSCSWCA EQU   IOSCSW                                                   02825000
IOSCC    EQU   @NM00002                                                 02826000
IOSUCB   EQU   IOSB+16                                                  02827000
IOSOPT2X EQU   IOSOPT2                                                  02828000
IOSHTP   EQU   IOSOPT2                                                  02829000
IOSRELSE EQU   IOSOPT                                                   02830000
IOSAPR   EQU   IOSOPT                                                   02831000
IOSTSLL  EQU   IOSOPT                                                   02832000
IOSNERP  EQU   IOSOPT                                                   02833000
IOSPSLL  EQU   IOSOPT                                                   02834000
IOSQISCE EQU   IOSOPT                                                   02835000
IOSDEP   EQU   IOSOPT                                                   02836000
IOSBYP   EQU   IOSOPT                                                   02837000
IOSCOD   EQU   IOSB+13                                                  02838000
IOSPKY7  EQU   IOSPKEY                                                  02839000
IOSPGDPX EQU   IOSPKEY                                                  02840000
IOSIDR   EQU   IOSPKEY                                                  02841000
IOSLCL   EQU   IOSPKEY                                                  02842000
@NM00001 EQU   IOSPKEY                                                  02843000
IOSPGAD  EQU   IOSB+8                                                   02844000
IOSASID  EQU   IOSB+6                                                   02845000
IOSPRLVL EQU   IOSB+5                                                   02846000
IOSDVRID EQU   IOSB+4                                                   02847000
IOSPROC  EQU   IOSB+3                                                   02848000
IOSFLC7  EQU   IOSFLC                                                   02849000
IOSFLC6  EQU   IOSFLC                                                   02850000
IOSRWAIT EQU   IOSFLC                                                   02851000
IOSTP    EQU   IOSFLC                                                   02852000
IOSCC3WE EQU   IOSFLC                                                   02853000
IOSVERIF EQU   IOSDVALT                                                 02854000
IOSDVMNT EQU   IOSFLC                                                   02855000
IOSLOG   EQU   IOSFLB                                                   02856000
IOSBDCST EQU   IOSFLB                                                   02857000
IOSMSG   EQU   IOSFLB                                                   02858000
IOSFLB4  EQU   IOSFLB                                                   02859000
IOSFLB3  EQU   IOSFLB                                                   02860000
IOSFLB2  EQU   IOSFLB                                                   02861000
IOSSDR   EQU   IOSFLB                                                   02862000
IOSDIESE EQU   IOSFLB                                                   02863000
IOSIOSB  EQU   IOSFLA                                                   02864000
IOSDOM   EQU   IOSFLA                                                   02865000
IOSEX    EQU   IOSFLA                                                   02866000
IOSSMDB  EQU   IOSFLA                                                   02867000
IOSSMDA  EQU   IOSFLA                                                   02868000
IOSERR   EQU   IOSFLA                                                   02869000
IOSCCHN  EQU   IOSACHN                                                  02870000
IOSDCHN  EQU   IOSACHN                                                  02871000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02872000
@ENDDATA EQU   *                                                        02873000
         END   ISTINCY1,(C'PLS1247',0702,80267)                         02874000
./  ADD  SSI=02410973,NAME=ISTORFID
         TITLE 'SMS SET TASKID ROUTINE - ISTORAID(OS/VS1), ISTORFID(OS/*00001000
               VS2)'                                                    00002000
ISTORFID CSECT ,                                                   0001 00003000
@PROLOG  BALR  @09,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@09                                         0001 00006000
         PRINT OFF                                                      00007000
         PRINT ON                                                       00008000
*          R4BUFPX=R2BUFPTR-8;       /* BACK UP BUFF PTR TO PREFIX   */ 00009000
         LR    R4BUFPX,R2BUFPTR                                    0022 00010000
         SL    R4BUFPX,@CF00047                                    0022 00011000
*          R5TASKID=R0MASK & ADDRMASK;                             0023 00012000
         LR    R5TASKID,R0MASK                                     0023 00013000
         N     R5TASKID,@CF00091                                   0023 00014000
*          DO WHILE(R4BUFPX¬=0);     /* LOOP TILL END OF BUFF CAHIN  */ 00015000
         B     @DE00024                                            0024 00016000
@DL00024 DS    0H                                                  0025 00017000
*                                    /* SET TASKID IN PREFIX         */ 00018000
*            BFPTSKID=(BFPTSKID & HIGHBYTE) | R5TASKID;            0025 00019000
         L     @15,BFPTSKID(,R4BUFPX)                              0025 00020000
         N     @15,@CF00089                                        0025 00021000
         OR    @15,R5TASKID                                        0025 00022000
         ST    @15,BFPTSKID(,R4BUFPX)                              0025 00023000
*            R6NXCHN=BFPNXCHN;                                     0026 00024000
         L     R6NXCHN,BFPNXCHN(,R4BUFPX)                          0026 00025000
*            IF BFPCBID=ON |         /* THIS A CBID BUFF OR AT       */ 00026000
*               R6NXCHN=0            /*     END OF BUFFER CHAIN      */ 00027000
*            THEN                    /* YES */                     0027 00028000
         TM    BFPCBID(R4BUFPX),B'10000000'                        0027 00029000
         BO    @RT00027                                            0027 00030000
         LTR   R6NXCHN,R6NXCHN                                     0027 00031000
         BNZ   @RF00027                                            0027 00032000
@RT00027 DS    0H                                                  0028 00033000
*              R4BUFPX=0;            /* TERMINATE DO WHILE LOOP      */ 00034000
         SLR   R4BUFPX,R4BUFPX                                     0028 00035000
*            ELSE                    /* NO  */                     0029 00036000
*              R4BUFPX=R6NXCHN-8;    /* POINT TO NEXT PREFIX AREA    */ 00037000
         B     @RC00027                                            0029 00038000
@RF00027 LR    R4BUFPX,R6NXCHN                                     0029 00039000
         SL    R4BUFPX,@CF00047                                    0029 00040000
*          END;                                                    0030 00041000
@RC00027 DS    0H                                                  0030 00042000
@DE00024 LTR   R4BUFPX,R4BUFPX                                     0030 00043000
         BNZ   @DL00024                                            0030 00044000
*          RETURN;                                                 0031 00045000
*                                                                  0031 00046000
@EL00001 DS    0H                                                  0031 00047000
@EF00001 DS    0H                                                  0031 00048000
@ER00001 BR    @14                                                 0031 00049000
* GEN(DC C'END ISTORFID  80.241');                                 0032 00050000
*                                                                  0032 00051000
         DC C'END ISTORFID  80.241'                                     00052000
*           DO; /* TPEPILOG   */                                   0033 00053000
*                                                                  0034 00054000
*           GEN (PRINT OFF);                                       0034 00055000
         PRINT OFF                                                      00056000
*           GEN (PRINT ON);                                        0035 00057000
         PRINT ON                                                       00058000
*           END;/* TPEPILOG */                                     0036 00059000
*          END ISTORFID;                                           0037 00060000
         B     @EL00001                                            0037 00061000
@DATA    DS    0H                                                       00062000
@DATD    DSECT                                                          00063000
         DS    0F                                                       00064000
ISTORFID CSECT                                                          00065000
         DS    0F                                                       00066000
@CF00047 DC    F'8'                                                     00067000
@CF00089 DC    XL4'FF000000'                                            00068000
@CF00091 DC    XL4'00FFFFFF'                                            00069000
@DATD    DSECT                                                          00070000
         DS    0D                                                       00071000
BFPFXPTR DS    A                                                        00072000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00073000
@ENDDATD EQU   *                                                        00074000
ISTORFID CSECT                                                          00075000
         DS    0F                                                       00076000
@SIZDATD DC    AL1(0)                                                   00077000
         DC    AL3(@ENDDATD-@DATD)                                      00078000
         DS    0D                                                       00079000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00080000
@01      EQU   01                                                       00081000
@02      EQU   02                                                       00082000
@03      EQU   03                                                       00083000
@04      EQU   04                                                       00084000
@05      EQU   05                                                       00085000
@06      EQU   06                                                       00086000
@07      EQU   07                                                       00087000
@08      EQU   08                                                       00088000
@09      EQU   09                                                       00089000
@10      EQU   10                                                       00090000
@11      EQU   11                                                       00091000
@12      EQU   12                                                       00092000
@13      EQU   13                                                       00093000
@14      EQU   14                                                       00094000
@15      EQU   15                                                       00095000
R0MASK   EQU   @00                                                      00096000
R1       EQU   @01                                                      00097000
R2BUFPTR EQU   @02                                                      00098000
R3       EQU   @03                                                      00099000
R4BUFPX  EQU   @04                                                      00100000
R5TASKID EQU   @05                                                      00101000
R6NXCHN  EQU   @06                                                      00102000
R9BASE   EQU   @09                                                      00103000
R11      EQU   @11                                                      00104000
R12      EQU   @12                                                      00105000
R13      EQU   @13                                                      00106000
R14      EQU   @14                                                      00107000
ISTBFPFX EQU   0                                                        00108000
BFPTSKID EQU   ISTBFPFX                                                 00109000
BFPFLAG  EQU   BFPTSKID                                                 00110000
BFPPSTID EQU   BFPTSKID+1                                               00111000
BFPPCBA  EQU   ISTBFPFX+4                                               00112000
BFPCBID  EQU   BFPPCBA                                                  00113000
BFPBPCB  EQU   BFPPCBA+1                                                00114000
BFPNXCHN EQU   ISTBFPFX+8                                               00115000
BFPDATA  EQU   ISTBFPFX+16                                              00116000
BFPREGSA EQU   BFPDATA                                                  00117000
BFPR5SA  EQU   BFPREGSA                                                 00118000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00119000
BFPRDSA  EQU   BFPREGSA+32                                              00120000
BFPRCSA  EQU   BFPREGSA+28                                              00121000
BFPRBSA  EQU   BFPREGSA+24                                              00122000
BFPRASA  EQU   BFPREGSA+20                                              00123000
BFPR9SA  EQU   BFPREGSA+16                                              00124000
BFPR8SA  EQU   BFPREGSA+12                                              00125000
BFPR7SA  EQU   BFPREGSA+8                                               00126000
BFPR6SA  EQU   BFPREGSA+4                                               00127000
BFPPMDSB EQU   BFPR5SA                                                  00128000
BFPPMCHN EQU   BFPR5SA                                                  00129000
BFPPMCLR EQU   BFPR5SA                                                  00130000
BFPUSED  EQU   ISTBFPFX+14                                              00131000
BFPSIZE  EQU   ISTBFPFX+12                                              00132000
BFPPXB   EQU   BFPBPCB                                                  00133000
@NM00002 EQU   BFPPCBA                                                  00134000
BFPEXT   EQU   BFPPCBA                                                  00135000
BFPTIK   EQU   BFPPSTID+2                                               00136000
@NM00001 EQU   BFPPSTID                                                 00137000
BFPCBXNO EQU   BFPFLAG                                                  00138000
BFPALLOC EQU   BFPFLAG                                                  00139000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00140000
@ENDDATA EQU   *                                                        00141000
         END   ISTORFID,(C'PLS2250',0702,80241)                         00142000
./  ADD  SSI=02320558,NAME=ISTORFRA
         TITLE 'ISTORARA - CRA FIND ROUTINE - VS1,SVS,MVS'              00001000
ISTORFRA CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTORFRA  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  BALR  @07,0                                               0001 00009000
@PSTART  DS    0H                                                  0001 00010000
         USING @PSTART,@07                                         0001 00011000
         PRINT OFF                                                      00012000
         PRINT ON                                                       00013000
*   R3=R0;                          /* SAVE CALLER'S REG 0   @XM30585*/ 00014000
         LR    R3,R0                                               0058 00015000
*   R4=R1;                          /* SAVE CALLER'S REG 1   @XM30585*/ 00016000
         LR    R4,R1                                               0059 00017000
*   GEN SETS(R0,R1,R5);                                            0060 00018000
*                                   /* GETMAIN AUTODATA AREA @XM30585*/ 00019000
         L     R0,@SIZDATD                                              00020000
         GETMAIN R,LV=(0)                                               00021000
         LR    R5,R1                                                    00022000
         USING @DATD,R5                                                 00023000
*   R0=R3;                          /* RESTORE REG 0         @XM30585*/ 00024000
         LR    R0,R3                                               0061 00025000
*   R1=R4;                          /* RESTORE REG 1         @XM30585*/ 00026000
         LR    R1,R4                                               0062 00027000
*   STM(R8,R1,REGSAVE);             /* SAVE CALLER'S REGS 8-14, 0 AND   00028000
*                                      1                     @XM30585*/ 00029000
         STM   R8,R1,REGSAVE                                       0063 00030000
*   RFY                                                            0064 00031000
*    (R0,                                                          0064 00032000
*     R1,                                                          0064 00033000
*     R8,                                                          0064 00034000
*     R9,                                                          0064 00035000
*     R10,                                                         0064 00036000
*     R11,                                                         0064 00037000
*     R12,                                                         0064 00038000
*     R13,                                                         0064 00039000
*     R14) UNRSTD;                  /* PROTECT CALLER'S REGS @XM30585*/ 00040000
*   DATAREG=R5;                     /* ESTABLISH AUTODATA BASE IN  0065 00041000
*                                      NON-VOLATILE REG      @XM30585*/ 00042000
         LR    DATAREG,R5                                          0065 00043000
*   GEN;                                                           0066 00044000
         DROP  R5                                                       00045000
         USING @DATD,DATAREG                                            00046000
*   R0TASKID=R0TASKID&ADDRMSK;      /* ENSURE CLEAR TOP BYTE @XM30585*/ 00047000
         N     R0TASKID,@CF00798                                   0067 00048000
*   R0MASK=R0TASKID|ALLOCATE|CBICRAM;                              0068 00049000
         LR    @12,R0TASKID                                        0068 00050000
         O     @12,@CF00805                                        0068 00051000
         LR    R0MASK,@12                                          0068 00052000
*   IF R2CRAPTR=0                   /* THIS FIRST CALL FOR CRAFIND   */ 00053000
*     THEN                                                         0069 00054000
         LTR   R2CRAPTR,R2CRAPTR                                   0069 00055000
         BZ    @RT00069                                            0069 00056000
*     ;                             /* YES                           */ 00057000
*   ELSE                            /* NO, ADJUST TO POINT TO PREFIX */ 00058000
*     R2CRAPTR=R2CRAPTR-PREFIX8;                                   0071 00059000
*                                                                  0071 00060000
         SL    R2CRAPTR,@CF00064                                   0071 00061000
*   /*****************************************************************/ 00062000
*   /*                                                               */ 00063000
*   /* GET BPCB ADDRESS OF POOL CONTAINING CRA CONTROL BLOCKS AND    */ 00064000
*   /* INVOKE ISTORABF TO FIND THE NEXT CRA ALLOCATED TO THE         */ 00065000
*   /* SPECIFIED PST                                                 */ 00066000
*   /*                                                               */ 00067000
*   /*****************************************************************/ 00068000
*                                                                  0072 00069000
*   R10BPCB=EVAL(ADDR(BPDCBID)+(CBICRA-1)*8)->CBIDPCB;             0072 00070000
@RT00069 L     @12,ATCLCPTR                                        0072 00071000
         L     @06,ATCBPDA(,@12)                                   0072 00072000
         LA    @06,BPDCBID(,@06)                                   0072 00073000
         AL    @06,@CF00807                                        0072 00074000
         L     R10BPCB,CBIDPCB(,@06)                               0072 00075000
*   R11SAVR7=R7BASE;                /* SAVE BASE REG         @XM30585*/ 00076000
         LR    R11SAVR7,R7BASE                                     0073 00077000
*   CALL ISTORABF;                  /* CALL BUFFER FIND ROUTINE      */ 00078000
         L     @15,ATCSMABF(,@12)                                  0074 00079000
         BALR  @14,@15                                             0074 00080000
*   R7BASE=R11SAVR7;                /* RESTORE BASE REG      @XM30585*/ 00081000
         LR    R7BASE,R11SAVR7                                     0075 00082000
*   IF R2CRAPTR=0                   /* WAS ALLOCATED BUFFER FOUND    */ 00083000
*     THEN                                                         0076 00084000
         LTR   R2CRAPTR,R2CRAPTR                                   0076 00085000
         BZ    @RT00076                                            0076 00086000
*     ;                             /* NO                            */ 00087000
*   ELSE                            /* YES, ADJUST TO PNT PAST PREFX */ 00088000
*     R2CRAPTR=R2CRAPTR+PREFIX8;                                   0078 00089000
*                                                                  0078 00090000
         AL    R2CRAPTR,@CF00064                                   0078 00091000
*   /*****************************************************************/ 00092000
*   /*                                                               */ 00093000
*   /* FREEMAIN THE AUTODATA AREA                                    */ 00094000
*   /*                                                               */ 00095000
*   /*****************************************************************/ 00096000
*                                                                  0079 00097000
*   RFY                                                            0079 00098000
*    (R0,                                                          0079 00099000
*     R1,                                                          0079 00100000
*     R8,                                                          0079 00101000
*     R9,                                                          0079 00102000
*     R10,                                                         0079 00103000
*     R11,                                                         0079 00104000
*     R12,                                                         0079 00105000
*     R13,                                                         0079 00106000
*     R14) RSTD;                    /* PROTECT CALLER'S REGS @XM30585*/ 00107000
@RT00076 DS    0H                                                  0080 00108000
*   R5=DATAREG;                     /* ESTABLISH NEW AUTODATA BASE 0080 00109000
*                                                            @XM30585*/ 00110000
         LR    R5,DATAREG                                          0080 00111000
*   GEN;                                                           0081 00112000
         DROP  DATAREG                                                  00113000
         USING @DATD,R5                                                 00114000
*   LM(R8,R1,REGSAVE);              /* RESTORE CALLER'S REGS 8-14, 0    00115000
*                                      AND 1                 @XM30585*/ 00116000
         LM    R8,R1,REGSAVE                                       0082 00117000
*   R3=R0;                          /* SAVE CALLER'S REG 0   @XM30585*/ 00118000
         LR    R3,R0                                               0083 00119000
*   R4=R1;                          /* SAVE CALLER'S REG 1   @XM30585*/ 00120000
         LR    R4,R1                                               0084 00121000
*   GEN SETS(R0,R1);                                               0085 00122000
*                                   /* FREE AUTODATA AREA    @XM30585*/ 00123000
         L     R0,@SIZDATD                                              00124000
         LR    R1,R5                                                    00125000
         FREEMAIN R,LV=(0),A=(1)                                        00126000
*   R0=R3;                          /* RESTORE REG 0         @XM30585*/ 00127000
         LR    R0,R3                                               0086 00128000
*   R1=R4;                          /* RESTORE REG 1         @XM30585*/ 00129000
         LR    R1,R4                                               0087 00130000
*   DO;                             /* TPEPILOG                      */ 00131000
*     GEN(PRINT OFF);                                              0089 00132000
         PRINT OFF                                                      00133000
*     GEN(PRINT ON);                                               0090 00134000
         PRINT ON                                                       00135000
*   END;                            /* TPEPILOG                      */ 00136000
*   END ISTORFRA                                                   0092 00137000
*                                                                  0092 00138000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00139000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 00140000
*                                                                  0092 00141000
*       ;                                                          0092 00142000
@EL00001 DS    0H                                                  0092 00143000
@EF00001 DS    0H                                                  0092 00144000
@ER00001 BR    @14                                                 0092 00145000
@DATA    DS    0H                                                       00146000
@DATD    DSECT                                                          00147000
         DS    0F                                                       00148000
ISTORFRA CSECT                                                          00149000
         DS    0F                                                       00150000
@CF00064 DC    F'8'                                                     00151000
@CF00807 DC    F'176'                                                   00152000
@CF00805 DC    F'-1761607680'                                           00153000
@CF00798 DC    XL4'00FFFFFF'                                            00154000
@DATD    DSECT                                                          00155000
         DS    0D                                                       00156000
REGSAVE  DS    CL40                                                     00157000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00158000
@ENDDATD EQU   *                                                        00159000
ISTORFRA CSECT                                                          00160000
         DS    0F                                                       00161000
@SIZDATD DC    AL1(0)                                                   00162000
         DC    AL3(@ENDDATD-@DATD)                                      00163000
         DS    0D                                                       00164000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00165000
@01      EQU   01                                                       00166000
@02      EQU   02                                                       00167000
@03      EQU   03                                                       00168000
@04      EQU   04                                                       00169000
@05      EQU   05                                                       00170000
@06      EQU   06                                                       00171000
@07      EQU   07                                                       00172000
@08      EQU   08                                                       00173000
@09      EQU   09                                                       00174000
@10      EQU   10                                                       00175000
@11      EQU   11                                                       00176000
@12      EQU   12                                                       00177000
@13      EQU   13                                                       00178000
@14      EQU   14                                                       00179000
@15      EQU   15                                                       00180000
RPHPTR   EQU   @01                                                      00181000
R0       EQU   @00                                                      00182000
R0MASK   EQU   @00                                                      00183000
R0TASKID EQU   @00                                                      00184000
R1       EQU   @01                                                      00185000
R2CRAPTR EQU   @02                                                      00186000
R3       EQU   @03                                                      00187000
R4       EQU   @04                                                      00188000
R5       EQU   @05                                                      00189000
R7BASE   EQU   @07                                                      00190000
R8       EQU   @08                                                      00191000
R9       EQU   @09                                                      00192000
R10      EQU   @10                                                      00193000
R10BPCB  EQU   @10                                                      00194000
R11      EQU   @11                                                      00195000
R11SAVR7 EQU   @11                                                      00196000
R12      EQU   @12                                                      00197000
R13      EQU   @13                                                      00198000
DATAREG  EQU   @13                                                      00199000
R14      EQU   @14                                                      00200000
ATCLCPTR EQU   1032                                                     00201000
SRBSECT  EQU   0                                                        00202000
SRBFLC   EQU   SRBSECT+12                                               00203000
SRBPTR   EQU   0                                                        00204000
ISTLOK   EQU   0                                                        00205000
LOKCHN   EQU   ISTLOK+1                                                 00206000
LOKCHNG  EQU   LOKCHN                                                   00207000
@NM00004 EQU   LOKCHNG+2                                                00208000
ISTPAB   EQU   0                                                        00209000
PABWQCHN EQU   ISTPAB                                                   00210000
PABWEQA  EQU   PABWQCHN                                                 00211000
PABCHAIN EQU   PABWQCHN+4                                               00212000
PABRPHFG EQU   ISTPAB+12                                                00213000
PABFLAGS EQU   PABRPHFG                                                 00214000
PABEND   EQU   ISTPAB+16                                                00215000
ISTDYPAB EQU   0                                                        00216000
DYPCHAIN EQU   ISTDYPAB+4                                               00217000
DYPPACMD EQU   ISTDYPAB+12                                              00218000
ISTRPH   EQU   0                                                        00219000
RPHCNTL  EQU   ISTRPH                                                   00220000
RPHFLAGS EQU   RPHCNTL+2                                                00221000
RPHFLGB  EQU   RPHCNTL+3                                                00222000
RPHRPHA  EQU   ISTRPH+4                                                 00223000
RPHTSKID EQU   ISTRPH+8                                                 00224000
RPHRESMA EQU   ISTRPH+16                                                00225000
RPHWPFLG EQU   RPHRESMA                                                 00226000
RPHWEA   EQU   ISTRPH+24                                                00227000
RPHSRPRM EQU   ISTRPH+28                                                00228000
RPHWORK  EQU   ISTRPH+36                                                00229000
RPHSAVE1 EQU   RPHWORK                                                  00230000
RPHSBITS EQU   RPHSAVE1+1                                               00231000
ISTATCVT EQU   0                                                        00232000
ATCRPTCH EQU   ISTATCVT                                                 00233000
ATCITFLD EQU   ISTATCVT+8                                               00234000
ATCITPRM EQU   ATCITFLD                                                 00235000
ATCITCDS EQU   ATCITFLD+8                                               00236000
ATCITFLG EQU   ATCITCDS+4                                               00237000
ATCITRA1 EQU   ATCITFLG+2                                               00238000
ATCSMPAB EQU   ISTATCVT+88                                              00239000
ATCLDTIL EQU   ISTATCVT+408                                             00240000
ATCGTSTR EQU   ISTATCVT+644                                             00241000
ATCLUDVT EQU   ISTATCVT+800                                             00242000
ATCANYDT EQU   ISTATCVT+808                                             00243000
@NM00017 EQU   ISTATCVT+812                                             00244000
ATCPODVT EQU   ISTATCVT+832                                             00245000
ATCBPDA  EQU   ISTATCVT+880                                             00246000
ATCSSDVT EQU   ISTATCVT+940                                             00247000
ATCSODVT EQU   ISTATCVT+944                                             00248000
ATCMBDVT EQU   ISTATCVT+952                                             00249000
ATCSTAT  EQU   ISTATCVT+972                                             00250000
ATCSTAT1 EQU   ATCSTAT                                                  00251000
@NM00018 EQU   ATCSTAT+1                                                00252000
ATCPOFLG EQU   ATCSTAT+2                                                00253000
ATCSTAT4 EQU   ATCSTAT+3                                                00254000
ATCBITAN EQU   ISTATCVT+976                                             00255000
ATCFLAG2 EQU   ATCBITAN+1                                               00256000
ATCONID  EQU   ISTATCVT+980                                             00257000
ATCSSCPA EQU   ISTATCVT+984                                             00258000
ATCHPGM  EQU   ISTATCVT+1040                                            00259000
ATCRNO   EQU   ISTATCVT+1044                                            00260000
ATCCPDVT EQU   ISTATCVT+1092                                            00261000
ATCSMSDQ EQU   ISTATCVT+1128                                            00262000
ATCRID   EQU   ISTATCVT+1144                                            00263000
ATCTKFLD EQU   ISTATCVT+1156                                            00264000
ATCIOINT EQU   ISTATCVT+1176                                            00265000
ATCTOD   EQU   ISTATCVT+1220                                            00266000
ATCVRTIL EQU   ISTATCVT+1264                                            00267000
ATCLKSWP EQU   ISTATCVT+1440                                            00268000
ATCWUDYP EQU   ISTATCVT+1448                                            00269000
ATCSQAFR EQU   ISTATCVT+1560                                            00270000
ATCORTCB EQU   ATCSQAFR+4                                               00271000
ATCORSRB EQU   ATCORTCB                                                 00272000
ATCLDAPP EQU   ISTATCVT+1600                                            00273000
ATCDAPVT EQU   ISTATCVT+1620                                            00274000
ATCGSRBQ EQU   ISTATCVT+1672                                            00275000
ATCGSRBG EQU   ATCGSRBQ                                                 00276000
ATCSMABF EQU   ISTATCVT+1716                                            00277000
ATCENFLG EQU   ISTATCVT+1722                                            00278000
ATCCSCB  EQU   ISTATCVT+1724                                            00279000
ATCVTFLG EQU   ISTATCVT+1784                                            00280000
@NM00048 EQU   ISTATCVT+1816                                            00281000
ATCCRA   EQU   ISTATCVT+1840                                            00282000
ATCCRACN EQU   ATCCRA+4                                                 00283000
ATCCRPL  EQU   ISTATCVT+1848                                            00284000
ATCRPLCN EQU   ATCCRPL+4                                                00285000
ISTCBIDT EQU   0                                                        00286000
CBIDATR  EQU   ISTCBIDT                                                 00287000
CBIDFLAG EQU   ISTCBIDT+1                                               00288000
CBIDPCB  EQU   ISTCBIDT+4                                               00289000
ISTBPENT EQU   0                                                        00290000
BPEFLAGS EQU   ISTBPENT+4                                               00291000
BPEPTR   EQU   0                                                        00292000
ISTBPDTY EQU   0                                                        00293000
BPDHDR   EQU   ISTBPDTY                                                 00294000
BPDFLAG  EQU   BPDHDR+40                                                00295000
BPDPARM  EQU   BPDHDR+48                                                00296000
BPDTRACE EQU   BPDHDR+56                                                00297000
BPDCBID  EQU   ISTBPDTY+384                                             00298000
BPDPTR   EQU   0                                                        00299000
ISTORABF EQU   0                                                        00300000
ISTXDYP  EQU   0                                                        00301000
PABXTNSN EQU   PABEND                                                   00302000
SRB      EQU   SRBSECT                                                  00303000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00304000
@NM00009 EQU   PABXTNSN+12                                              00305000
PABNPSSQ EQU   PABXTNSN+8                                               00306000
PABLOCK  EQU   PABXTNSN+4                                               00307000
PABLAST  EQU   PABXTNSN                                                 00308000
BPDENTRY EQU   ISTBPDTY+192                                             00309000
@NM00055 EQU   BPDHDR+188                                               00310000
BPDCRBF  EQU   BPDTRACE+10                                              00311000
BPDMXBF  EQU   BPDTRACE+8                                               00312000
BPDTEXP  EQU   BPDTRACE+6                                               00313000
BPDAVNO  EQU   BPDTRACE+4                                               00314000
BPDMQUE  EQU   BPDTRACE+2                                               00315000
BPDMUSE  EQU   BPDTRACE                                                 00316000
BPDTRADR EQU   BPDPARM+4                                                00317000
BPDTRID  EQU   BPDPARM+3                                                00318000
@NM00054 EQU   BPDPARM+2                                                00319000
BPDTRLEN EQU   BPDPARM                                                  00320000
BPDREQMX EQU   BPDHDR+46                                                00321000
BPDREQCT EQU   BPDHDR+44                                                00322000
BPDRSV01 EQU   BPDFLAG                                                  00323000
BPDGTR   EQU   BPDFLAG                                                  00324000
BPDATCVT EQU   BPDHDR+36                                                00325000
BPDFBPE  EQU   BPDHDR+32                                                00326000
BPDSMPCB EQU   BPDHDR+28                                                00327000
BPDFEXT  EQU   BPDHDR+24                                                00328000
BPDADRS2 EQU   BPDHDR+20                                                00329000
BPDADRS1 EQU   BPDHDR+16                                                00330000
BPDPGPCB EQU   BPDHDR+12                                                00331000
BPDCHPCB EQU   BPDHDR+8                                                 00332000
BPDCHBSZ EQU   BPDHDR+6                                                 00333000
BPDCHBNO EQU   BPDHDR+4                                                 00334000
BPDBPMAX EQU   BPDHDR+2                                                 00335000
BPDBPENT EQU   BPDHDR                                                   00336000
BPERSV03 EQU   ISTBPENT+12                                              00337000
BPEBPCB  EQU   ISTBPENT+8                                               00338000
BPEBFSIZ EQU   ISTBPENT+6                                               00339000
BPERSV02 EQU   BPEFLAGS+1                                               00340000
BPEUSRF  EQU   BPEFLAGS+1                                               00341000
BPERSV01 EQU   BPEFLAGS                                                 00342000
BPENWS   EQU   BPEFLAGS                                                 00343000
BPECBID  EQU   BPEFLAGS                                                 00344000
BPEAL48  EQU   BPEFLAGS                                                 00345000
BPENFCHP EQU   BPEFLAGS                                                 00346000
BPEFIXED EQU   BPEFLAGS                                                 00347000
BPEDISP  EQU   BPEFLAGS                                                 00348000
BPEFM    EQU   BPEFLAGS                                                 00349000
BPEPID   EQU   ISTBPENT                                                 00350000
CBIDLEN  EQU   ISTCBIDT+2                                               00351000
@NM00053 EQU   CBIDFLAG                                                 00352000
CBICLEAN EQU   CBIDFLAG                                                 00353000
@NM00052 EQU   CBIDATR                                                  00354000
CBINWS   EQU   CBIDATR                                                  00355000
CBICBID  EQU   CBIDATR                                                  00356000
CBIDAL48 EQU   CBIDATR                                                  00357000
CBINFCHP EQU   CBIDATR                                                  00358000
CBIFIXED EQU   CBIDATR                                                  00359000
CBIDISP  EQU   CBIDATR                                                  00360000
CBIFM    EQU   CBIDATR                                                  00361000
ATCAOS   EQU   ISTATCVT+2184                                            00362000
@NM00051 EQU   ISTATCVT+1924                                            00363000
ATCINCTV EQU   ISTATCVT+1920                                            00364000
@NM00050 EQU   ISTATCVT+1918                                            00365000
ATCSAF   EQU   ISTATCVT+1916                                            00366000
ATCAPCSX EQU   ISTATCVT+1912                                            00367000
ATCTSC3I EQU   ISTATCVT+1908                                            00368000
ATCHWCSA EQU   ISTATCVT+1904                                            00369000
ATCAPCRM EQU   ISTATCVT+1900                                            00370000
ATCAPCFR EQU   ISTATCVT+1896                                            00371000
ATCCACSA EQU   ISTATCVT+1892                                            00372000
ATCMXCSA EQU   ISTATCVT+1888                                            00373000
ATCTPMPB EQU   ISTATCVT+1856                                            00374000
ATCRPLAC EQU   ATCRPLCN+2                                               00375000
ATCRPLRC EQU   ATCRPLCN                                                 00376000
ATCCRPLQ EQU   ATCCRPL                                                  00377000
ATCCRAAC EQU   ATCCRACN+2                                               00378000
ATCCRARC EQU   ATCCRACN                                                 00379000
ATCCRAQ  EQU   ATCCRA                                                   00380000
ATCITSAV EQU   ISTATCVT+1836                                            00381000
ATCVIOPM EQU   ISTATCVT+1832                                            00382000
ATCTPMMI EQU   ISTATCVT+1828                                            00383000
ATCPXSRB EQU   ISTATCVT+1824                                            00384000
ATCRPLCT EQU   ISTATCVT+1822                                            00385000
ATCCRACT EQU   ISTATCVT+1820                                            00386000
ATCSRBCT EQU   ISTATCVT+1818                                            00387000
ATCSTNSM EQU   ISTATCVT+1817                                            00388000
@NM00049 EQU   @NM00048                                                 00389000
ATCNOSTR EQU   @NM00048                                                 00390000
ATCVTMAB EQU   @NM00048                                                 00391000
ATCTPCP1 EQU   ISTATCVT+1812                                            00392000
ATCTPCP0 EQU   ISTATCVT+1808                                            00393000
ATCZR01  EQU   ISTATCVT+1804                                            00394000
ATCASCB  EQU   ISTATCVT+1800                                            00395000
ATCMPSTQ EQU   ISTATCVT+1796                                            00396000
ATCOCCSM EQU   ISTATCVT+1792                                            00397000
ATCPSTA  EQU   ISTATCVT+1788                                            00398000
@NM00047 EQU   ATCVTFLG                                                 00399000
ATCVTACT EQU   ATCVTFLG                                                 00400000
@NM00046 EQU   ISTATCVT+1732                                            00401000
ATCTRMWA EQU   ISTATCVT+1728                                            00402000
ATCCSCBG EQU   ATCCSCB                                                  00403000
@NM00045 EQU   ISTATCVT+1723                                            00404000
ATCSNUF  EQU   ATCENFLG                                                 00405000
ATCOPKL  EQU   ATCENFLG                                                 00406000
ATCABEN  EQU   ATCENFLG                                                 00407000
ATCSRDN  EQU   ATCENFLG                                                 00408000
ATCDLDN  EQU   ATCENFLG                                                 00409000
ATCACTRM EQU   ISTATCVT+1720                                            00410000
ATCSMAPR EQU   ISTATCVT+1712                                            00411000
ATCSMAID EQU   ISTATCVT+1708                                            00412000
ATCSMARA EQU   ISTATCVT+1704                                            00413000
ATCCACXA EQU   ISTATCVT+1700                                            00414000
ATCATA10 EQU   ISTATCVT+1696                                            00415000
ATCHLTCB EQU   ISTATCVT+1692                                            00416000
ATCCCOOC EQU   ISTATCVT+1688                                            00417000
ATCAIWT  EQU   ISTATCVT+1684                                            00418000
ATCOROBT EQU   ISTATCVT+1680                                            00419000
ATCPXCRA EQU   ISTATCVT+1676                                            00420000
ATCGSRBF EQU   ATCGSRBG                                                 00421000
ATCTSCPC EQU   ISTATCVT+1668                                            00422000
ATCCDTCB EQU   ISTATCVT+1664                                            00423000
ATCORFRL EQU   ISTATCVT+1660                                            00424000
ATCORFPX EQU   ISTATCVT+1656                                            00425000
ATCORFMG EQU   ISTATCVT+1652                                            00426000
ATCSMBQ  EQU   ISTATCVT+1648                                            00427000
ATCINFDD EQU   ISTATCVT+1644                                            00428000
@NM00044 EQU   ATCDAPVT+22                                              00429000
ATCDAPDG EQU   ATCDAPVT+20                                              00430000
ATCDXCEA EQU   ATCDAPVT+16                                              00431000
ATCDCEA  EQU   ATCDAPVT+12                                              00432000
ATCDPCIA EQU   ATCDAPVT+8                                               00433000
ATCDSIOA EQU   ATCDAPVT+4                                               00434000
ATCDEOEA EQU   ATCDAPVT                                                 00435000
ATCZLAEA EQU   ATCLDAPP+16                                              00436000
ATCZLCEA EQU   ATCLDAPP+12                                              00437000
ATCZLPCI EQU   ATCLDAPP+8                                               00438000
ATCSMFRR EQU   ATCLDAPP+4                                               00439000
ATCCDTID EQU   ATCLDAPP                                                 00440000
ATCTRMPB EQU   ISTATCVT+1568                                            00441000
ATCORQG  EQU   ATCORSRB                                                 00442000
ATCORTBF EQU   ATCSQAFR                                                 00443000
@NM00043 EQU   ISTATCVT+1560                                            00444000
@NM00042 EQU   ISTATCVT+1532                                            00445000
ATCCDCNE EQU   ISTATCVT+1528                                            00446000
@NM00041 EQU   ISTATCVT+1526                                            00447000
ATCHASHN EQU   ISTATCVT+1524                                            00448000
ATCNOST  EQU   ISTATCVT+1520                                            00449000
ATCSMMWA EQU   ISTATCVT+1516                                            00450000
ATCSDCFR EQU   ISTATCVT+1512                                            00451000
ATCTSCRA EQU   ISTATCVT+1508                                            00452000
ATCSOCNT EQU   ISTATCVT+1504                                            00453000
ATCSOTHR EQU   ISTATCVT+1502                                            00454000
ATCSOPR2 EQU   ISTATCVT+1501                                            00455000
ATCSOPR1 EQU   ISTATCVT+1500                                            00456000
ATCAPCAT EQU   ISTATCVT+1496                                            00457000
ATCTSCWU EQU   ISTATCVT+1492                                            00458000
ATCMWRDT EQU   ISTATCVT+1488                                            00459000
ATCSTCK  EQU   ISTATCVT+1480                                            00460000
ATCWUPAB EQU   ATCWUDYP+16                                              00461000
@NM00040 EQU   ATCWUDYP                                                 00462000
ATCLKCNT EQU   ATCLKSWP+4                                               00463000
ATCCLOCK EQU   ATCLKSWP                                                 00464000
ATCNCBQ  EQU   ISTATCVT+1436                                            00465000
ATCPUCWC EQU   ISTATCVT+1432                                            00466000
ATCTSCQV EQU   ISTATCVT+1428                                            00467000
ATCTSCQU EQU   ISTATCVT+1424                                            00468000
ATCTSCQM EQU   ISTATCVT+1420                                            00469000
ATCTSCQF EQU   ISTATCVT+1416                                            00470000
ATCAPCVR EQU   ISTATCVT+1412                                            00471000
ATCHSQLK EQU   ISTATCVT+1408                                            00472000
ATCICIDM EQU   ISTATCVT+1406                                            00473000
ATCYRANG EQU   ISTATCVT+1405                                            00474000
ATCDRNUM EQU   ISTATCVT+1404                                            00475000
ATCSACNT EQU   ISTATCVT+1400                                            00476000
ATCTSCFA EQU   ISTATCVT+1396                                            00477000
ATCCDCVR EQU   ISTATCVT+1392                                            00478000
ATCCDCRI EQU   ISTATCVT+1388                                            00479000
ATCCDCRT EQU   ISTATCVT+1384                                            00480000
ATCVRNDX EQU   ISTATCVT+1380                                            00481000
ATCAP31  EQU   ISTATCVT+1376                                            00482000
ATCPSTLK EQU   ISTATCVT+1372                                            00483000
ATCOCAOA EQU   ISTATCVT+1368                                            00484000
ATCPUCEF EQU   ISTATCVT+1364                                            00485000
ATCPUCBM EQU   ISTATCVT+1360                                            00486000
ATCAPCES EQU   ISTATCVT+1356                                            00487000
ATCAPCPC EQU   ISTATCVT+1352                                            00488000
ATCAPCTE EQU   ISTATCVT+1348                                            00489000
ATCAPCIN EQU   ISTATCVT+1344                                            00490000
ATCAPCPD EQU   ISTATCVT+1340                                            00491000
ATCAPCAD EQU   ISTATCVT+1336                                            00492000
ATCAPCSD EQU   ISTATCVT+1332                                            00493000
ATCAPCIE EQU   ISTATCVT+1328                                            00494000
ATCAPCUE EQU   ISTATCVT+1324                                            00495000
ATCAPCRP EQU   ISTATCVT+1320                                            00496000
ATCAPCRS EQU   ISTATCVT+1316                                            00497000
ATCAPCTP EQU   ISTATCVT+1312                                            00498000
ATCAPCTW EQU   ISTATCVT+1308                                            00499000
ATCAPCPS EQU   ISTATCVT+1304                                            00500000
ATCAPCTS EQU   ISTATCVT+1300                                            00501000
ATCAPCTQ EQU   ISTATCVT+1296                                            00502000
ATCAPCTX EQU   ISTATCVT+1292                                            00503000
ATCSDCOS EQU   ISTATCVT+1288                                            00504000
ATCEXCVR EQU   ISTATCVT+1284                                            00505000
ATCCPCSV EQU   ISTATCVT+1280                                            00506000
ATCVRECB EQU   ATCVRTIL+12                                              00507000
ATCVRLCK EQU   ATCVRTIL+8                                               00508000
ATCVRWEL EQU   ATCVRTIL+4                                               00509000
ATCVRWEQ EQU   ATCVRTIL                                                 00510000
ATCMGPAB EQU   ISTATCVT+1248                                            00511000
ATCTSCMS EQU   ISTATCVT+1244                                            00512000
ATCVRATB EQU   ISTATCVT+1240                                            00513000
ATCVRWAP EQU   ISTATCVT+1236                                            00514000
ATCPVRAQ EQU   ISTATCVT+1232                                            00515000
ATCTOWA  EQU   ISTATCVT+1228                                            00516000
ATCTOD2  EQU   ATCTOD+4                                                 00517000
ATCTOD1  EQU   ATCTOD                                                   00518000
ATCERTP  EQU   ISTATCVT+1216                                            00519000
ATCBINDQ EQU   ISTATCVT+1212                                            00520000
ATCTIMER EQU   ISTATCVT+1208                                            00521000
ATCTSCDN EQU   ISTATCVT+1204                                            00522000
ATCTSCCN EQU   ISTATCVT+1200                                            00523000
ATCTSCL0 EQU   ISTATCVT+1196                                            00524000
ATCTSCP2 EQU   ISTATCVT+1192                                            00525000
ATCTSC3S EQU   ISTATCVT+1188                                            00526000
ATCTSC3R EQU   ISTATCVT+1184                                            00527000
ATCTSC3O EQU   ISTATCVT+1180                                            00528000
ATCIOPRG EQU   ATCIOINT                                                 00529000
ATCTSCMI EQU   ISTATCVT+1172                                            00530000
ATCTSCMO EQU   ISTATCVT+1168                                            00531000
ATCTSCP4 EQU   ISTATCVT+1164                                            00532000
ATCPUSCT EQU   ISTATCVT+1160                                            00533000
ATCTKINT EQU   ATCTKFLD+2                                               00534000
ATCTKCNT EQU   ATCTKFLD                                                 00535000
ATCTIMCK EQU   ISTATCVT+1152                                            00536000
@NM00039 EQU   ATCRID+2                                                 00537000
ATCCDRMA EQU   ATCRID                                                   00538000
ATCCPCGD EQU   ISTATCVT+1140                                            00539000
@NM00038 EQU   ATCSMSDQ+8                                               00540000
@NM00037 EQU   ATCSMSDQ+4                                               00541000
@NM00036 EQU   ATCSMSDQ                                                 00542000
ATCSEQNO EQU   ISTATCVT+1124                                            00543000
ATCSMPMD EQU   ISTATCVT+1120                                            00544000
ATCPAREA EQU   ISTATCVT+1116                                            00545000
ATCCPCSM EQU   ISTATCVT+1112                                            00546000
ATCSQCDS EQU   ISTATCVT+1108                                            00547000
ATCUSSVT EQU   ISTATCVT+1104                                            00548000
ATCNOSQ  EQU   ISTATCVT+1100                                            00549000
ATCINCIP EQU   ATCCPDVT+4                                               00550000
ATCTSCNI EQU   ATCCPDVT                                                 00551000
ATCMGCRT EQU   ISTATCVT+1088                                            00552000
ATCMACRT EQU   ISTATCVT+1084                                            00553000
ATCCSMT  EQU   ISTATCVT+1080                                            00554000
ATCINCNO EQU   ISTATCVT+1076                                            00555000
ATCRACON EQU   ISTATCVT+1072                                            00556000
ATCCFCDR EQU   ISTATCVT+1068                                            00557000
ATCONFIG EQU   ISTATCVT+1060                                            00558000
ATCNODEL EQU   ISTATCVT+1052                                            00559000
ATCCDTIM EQU   ISTATCVT+1050                                            00560000
ATCNMCTR EQU   ISTATCVT+1048                                            00561000
ATCPOIA  EQU   ATCRNO+1                                                 00562000
@NM00035 EQU   ATCRNO                                                   00563000
ATCHBSIZ EQU   ATCHPGM+2                                                00564000
ATCHBFNO EQU   ATCHPGM                                                  00565000
ATCMROUT EQU   ISTATCVT+1031                                            00566000
ATCXRANG EQU   ISTATCVT+1030                                            00567000
ATCMAXID EQU   ISTATCVT+1029                                            00568000
ATCMSGSP EQU   ISTATCVT+1028                                            00569000
ATCECTLP EQU   ISTATCVT+1024                                            00570000
ATCECSES EQU   ISTATCVT+1020                                            00571000
ATCECDSP EQU   ISTATCVT+1016                                            00572000
ATCECVRY EQU   ISTATCVT+1012                                            00573000
ATCECHLT EQU   ISTATCVT+1008                                            00574000
ATCECMOD EQU   ISTATCVT+1004                                            00575000
ATCRDTLK EQU   ISTATCVT+1000                                            00576000
ATCVOCLK EQU   ISTATCVT+996                                             00577000
ATCCIDM  EQU   ISTATCVT+994                                             00578000
ATCITLIM EQU   ISTATCVT+992                                             00579000
ATCTMINV EQU   ISTATCVT+990                                             00580000
ATCHOSTA EQU   ISTATCVT+988                                             00581000
ATCPUNSA EQU   ISTATCVT+986                                             00582000
ATCVTMID EQU   ATCSSCPA                                                 00583000
ATCHCNID EQU   ATCONID+2                                                00584000
ATCSCNID EQU   ATCONID                                                  00585000
@NM00034 EQU   ATCBITAN+3                                               00586000
@NM00033 EQU   ATCBITAN+2                                               00587000
@NM00032 EQU   ATCFLAG2                                                 00588000
ATCMSGID EQU   ATCFLAG2                                                 00589000
ATCINACT EQU   ATCFLAG2                                                 00590000
ATCCRYPF EQU   ATCFLAG2                                                 00591000
ATCTUNCL EQU   ATCFLAG2                                                 00592000
ATCTUNRQ EQU   ATCFLAG2                                                 00593000
ATCTUNAC EQU   ATCFLAG2                                                 00594000
ATCCDLRA EQU   ATCFLAG2                                                 00595000
@NM00031 EQU   ATCBITAN                                                 00596000
@NM00030 EQU   ATCSTAT4                                                 00597000
@NM00029 EQU   ATCSTAT4                                                 00598000
@NM00028 EQU   ATCSTAT4                                                 00599000
@NM00027 EQU   ATCSTAT4                                                 00600000
@NM00026 EQU   ATCSTAT4                                                 00601000
ATCPRTAT EQU   ATCSTAT4                                                 00602000
ATCNCSD  EQU   ATCSTAT4                                                 00603000
ATCMTST  EQU   ATCSTAT4                                                 00604000
@NM00025 EQU   ATCPOFLG                                                 00605000
@NM00024 EQU   ATCPOFLG                                                 00606000
@NM00023 EQU   ATCPOFLG                                                 00607000
@NM00022 EQU   ATCPOFLG                                                 00608000
@NM00021 EQU   ATCPOFLG                                                 00609000
@NM00020 EQU   ATCPOFLG                                                 00610000
@NM00019 EQU   ATCPOFLG                                                 00611000
ATCPOUNS EQU   ATCPOFLG                                                 00612000
ATCITEXT EQU   @NM00018                                                 00613000
ATCHIP   EQU   ATCSTAT1                                                 00614000
ATCMDHLT EQU   ATCSTAT1                                                 00615000
ATCINHLT EQU   ATCSTAT1                                                 00616000
ATCNETSL EQU   ATCSTAT1                                                 00617000
ATCQKHLT EQU   ATCSTAT1                                                 00618000
ATCSNHLT EQU   ATCSTAT1                                                 00619000
ATCACTIV EQU   ATCSTAT1                                                 00620000
ATCSTART EQU   ATCSTAT1                                                 00621000
ATCNOP00 EQU   ISTATCVT+968                                             00622000
ATCTSBUF EQU   ISTATCVT+964                                             00623000
ATCSSOQH EQU   ISTATCVT+960                                             00624000
ATCSSIQH EQU   ISTATCVT+956                                             00625000
ATCTSCMB EQU   ATCMBDVT                                                 00626000
ATCSOPAC EQU   ISTATCVT+950                                             00627000
ATCSOTIM EQU   ISTATCVT+948                                             00628000
ATCTSCON EQU   ATCSODVT                                                 00629000
ATCTSCSC EQU   ATCSSDVT                                                 00630000
ATCTSCRO EQU   ISTATCVT+936                                             00631000
ATCTSCRI EQU   ISTATCVT+932                                             00632000
ATCFEPT  EQU   ISTATCVT+928                                             00633000
ATCFDVT  EQU   ISTATCVT+924                                             00634000
ATCCONFT EQU   ISTATCVT+920                                             00635000
ATCSIBQ  EQU   ISTATCVT+916                                             00636000
ATCDSPLQ EQU   ISTATCVT+912                                             00637000
ATCVARYQ EQU   ISTATCVT+908                                             00638000
ATCHALTQ EQU   ISTATCVT+904                                             00639000
ATCMODQ  EQU   ISTATCVT+900                                             00640000
ATCSRT   EQU   ISTATCVT+896                                             00641000
ATCRDT   EQU   ISTATCVT+892                                             00642000
ATCSDVT  EQU   ISTATCVT+888                                             00643000
ATCDLRPT EQU   ISTATCVT+884                                             00644000
ATCACDA  EQU   ISTATCVT+876                                             00645000
ATCMNT   EQU   ISTATCVT+872                                             00646000
ATCNODDS EQU   ISTATCVT+868                                             00647000
ATCITRT  EQU   ISTATCVT+864                                             00648000
ATCTODVT EQU   ISTATCVT+860                                             00649000
ATCTRCPT EQU   ISTATCVT+856                                             00650000
ATCMODTB EQU   ISTATCVT+852                                             00651000
ATCUSSPT EQU   ISTATCVT+848                                             00652000
ATCTUBUF EQU   ISTATCVT+844                                             00653000
ATCTACB  EQU   ISTATCVT+840                                             00654000
ATCDWA   EQU   ISTATCVT+836                                             00655000
ATCCFCR2 EQU   ATCPODVT                                                 00656000
ATCPULQB EQU   @NM00017+16                                              00657000
ATCMCQAB EQU   @NM00017+12                                              00658000
ATCLUSMQ EQU   @NM00017+8                                               00659000
ATCLUIOQ EQU   @NM00017+4                                               00660000
ATCIOLQB EQU   @NM00017                                                 00661000
ATCTSCAP EQU   ATCANYDT                                                 00662000
ATCTSCCO EQU   ATCLUDVT+4                                               00663000
ATCTSCSR EQU   ATCLUDVT                                                 00664000
ATCVTLOD EQU   ISTATCVT+796                                             00665000
ATCTSCLF EQU   ISTATCVT+792                                             00666000
ATCTSCLE EQU   ISTATCVT+788                                             00667000
ATCTSCLB EQU   ISTATCVT+784                                             00668000
ATCTSCLS EQU   ISTATCVT+780                                             00669000
ATCTSCCF EQU   ISTATCVT+776                                             00670000
ATCTSCFV EQU   ISTATCVT+772                                             00671000
ATCTSCCE EQU   ISTATCVT+768                                             00672000
ATCTSCCB EQU   ISTATCVT+764                                             00673000
ATCTSCWS EQU   ISTATCVT+760                                             00674000
ATCTSCEM EQU   ISTATCVT+756                                             00675000
ATCTSCNS EQU   ISTATCVT+752                                             00676000
ATCTSCER EQU   ISTATCVT+748                                             00677000
ATCTSCPR EQU   ISTATCVT+744                                             00678000
ATCTSCGR EQU   ISTATCVT+740                                             00679000
ATCTSCCI EQU   ISTATCVT+736                                             00680000
ATCTSVT  EQU   ISTATCVT+732                                             00681000
ATCDVLOD EQU   ISTATCVT+728                                             00682000
ATCCDCNR EQU   ISTATCVT+724                                             00683000
ATCCDCNF EQU   ISTATCVT+720                                             00684000
ATCCDCND EQU   ISTATCVT+716                                             00685000
ATCCDCNA EQU   ISTATCVT+712                                             00686000
ATCCDCCP EQU   ISTATCVT+708                                             00687000
ATCCDFDN EQU   ISTATCVT+704                                             00688000
ATCCDFIN EQU   ISTATCVT+700                                             00689000
ATCCDFND EQU   ISTATCVT+696                                             00690000
ATCCDDEL EQU   ISTATCVT+692                                             00691000
ATCCDADD EQU   ISTATCVT+688                                             00692000
ATCTCLIM EQU   ISTATCVT+684                                             00693000
ATCRACTR EQU   ISTATCVT+680                                             00694000
ATCRACTI EQU   ISTATCVT+676                                             00695000
ATCREMOV EQU   ISTATCVT+672                                             00696000
ATCRACIO EQU   ISTATCVT+668                                             00697000
ATCADD   EQU   ISTATCVT+664                                             00698000
ATCPUCRT EQU   ISTATCVT+660                                             00699000
ATCSMRS  EQU   ISTATCVT+656                                             00700000
ATCSMRQ  EQU   ISTATCVT+652                                             00701000
ATCORCAF EQU   ISTATCVT+648                                             00702000
ATCFRSTR EQU   ATCGTSTR                                                 00703000
ATCSTMA  EQU   ISTATCVT+640                                             00704000
ATCSRTAD EQU   ISTATCVT+636                                             00705000
ATCOCCFS EQU   ISTATCVT+632                                             00706000
ATCOCCFP EQU   ISTATCVT+628                                             00707000
ATCSRTDF EQU   ISTATCVT+624                                             00708000
ATCLUCRT EQU   ISTATCVT+620                                             00709000
ATCINCY5 EQU   ISTATCVT+616                                             00710000
ATCINCW3 EQU   ISTATCVT+612                                             00711000
ATCINCU6 EQU   ISTATCVT+608                                             00712000
ATCINCTQ EQU   ISTATCVT+604                                             00713000
ATCINCS1 EQU   ISTATCVT+600                                             00714000
ATCSRTAB EQU   ISTATCVT+596                                             00715000
ATCINCRD EQU   ISTATCVT+592                                             00716000
ATCINCPH EQU   ISTATCVT+588                                             00717000
ATCINCLQ EQU   ISTATCVT+584                                             00718000
ATCNOCRT EQU   ISTATCVT+580                                             00719000
ATCINCF1 EQU   ISTATCVT+576                                             00720000
ATCINCCI EQU   ISTATCVT+572                                             00721000
ATCINCCO EQU   ISTATCVT+568                                             00722000
ATCBLDLA EQU   ISTATCVT+564                                             00723000
ATCALOAD EQU   ISTATCVT+560                                             00724000
ATCADEL  EQU   ISTATCVT+556                                             00725000
ATCRACEP EQU   ISTATCVT+552                                             00726000
ATCESC01 EQU   ISTATCVT+548                                             00727000
ATCDEC01 EQU   ISTATCVT+544                                             00728000
ATCDEC00 EQU   ISTATCVT+540                                             00729000
ATCCPCRT EQU   ISTATCVT+536                                             00730000
ATCAP35  EQU   ISTATCVT+532                                             00731000
ATCCPCFR EQU   ISTATCVT+528                                             00732000
ATCCPCGR EQU   ISTATCVT+524                                             00733000
ATCCPCPP EQU   ISTATCVT+520                                             00734000
ATCCPCNT EQU   ISTATCVT+516                                             00735000
ATCAUTHA EQU   ISTATCVT+512                                             00736000
ATCACCTA EQU   ISTATCVT+508                                             00737000
ATCMSGP  EQU   ISTATCVT+504                                             00738000
ATCAP39  EQU   ISTATCVT+500                                             00739000
ATCAP36  EQU   ISTATCVT+496                                             00740000
ATCMSGM  EQU   ISTATCVT+492                                             00741000
ATCAP33  EQU   ISTATCVT+488                                             00742000
ATCAICPT EQU   ISTATCVT+484                                             00743000
ATCAPI   EQU   ISTATCVT+480                                             00744000
ATCACC01 EQU   ISTATCVT+476                                             00745000
ATCACC00 EQU   ISTATCVT+472                                             00746000
ATCMBPAB EQU   ISTATCVT+456                                             00747000
ATCSOPAB EQU   ISTATCVT+440                                             00748000
ATCSSPAB EQU   ISTATCVT+424                                             00749000
ATCLDECB EQU   ATCLDTIL+12                                              00750000
ATCLDLCK EQU   ATCLDTIL+8                                               00751000
ATCLDLST EQU   ATCLDTIL+4                                               00752000
ATCLDNCS EQU   ATCLDTIL                                                 00753000
ATCNOSPB EQU   ISTATCVT+376                                             00754000
ATCNSPAB EQU   ISTATCVT+344                                             00755000
ATCLUSRT EQU   ISTATCVT+312                                             00756000
ATCPUIOP EQU   ISTATCVT+280                                             00757000
ATCPUPAB EQU   ISTATCVT+248                                             00758000
ATCPXPAB EQU   ISTATCVT+216                                             00759000
ATCPOPAB EQU   ISTATCVT+184                                             00760000
ATCVDPAB EQU   ISTATCVT+152                                             00761000
ATCTCIPB EQU   ISTATCVT+120                                             00762000
ATCCSPAB EQU   ATCSMPAB+16                                              00763000
@NM00016 EQU   ATCSMPAB                                                 00764000
ATCTMRPB EQU   ISTATCVT+56                                              00765000
ATCITPAB EQU   ISTATCVT+24                                              00766000
@NM00015 EQU   ATCITRA1                                                 00767000
ATCITSCP EQU   ATCITRA1                                                 00768000
ATCITMSG EQU   ATCITRA1                                                 00769000
ATCITPIU EQU   ATCITRA1                                                 00770000
ATCITSMS EQU   ATCITRA1                                                 00771000
ATCITPSS EQU   ATCITRA1                                                 00772000
ATCITLCK EQU   ATCITRA1                                                 00773000
ATCITAPI EQU   ATCITRA1                                                 00774000
ATCITCNT EQU   ATCITFLG                                                 00775000
ATCITRPH EQU   ATCITCDS                                                 00776000
ATCITTBL EQU   ATCITFLD+4                                               00777000
ATCITMAX EQU   ATCITPRM                                                 00778000
ATCPTCHA EQU   ATCRPTCH+4                                               00779000
ATCVTLVL EQU   ATCRPTCH                                                 00780000
RPHUPSTA EQU   ISTRPH+100                                               00781000
RPHSAV16 EQU   RPHWORK+60                                               00782000
RPHSAV15 EQU   RPHWORK+56                                               00783000
RPHSAV14 EQU   RPHWORK+52                                               00784000
RPHSAV13 EQU   RPHWORK+48                                               00785000
RPHSAV12 EQU   RPHWORK+44                                               00786000
RPHSAV11 EQU   RPHWORK+40                                               00787000
RPHSAV10 EQU   RPHWORK+36                                               00788000
RPHSAVE9 EQU   RPHWORK+32                                               00789000
RPHSAVE8 EQU   RPHWORK+28                                               00790000
RPHSAVE7 EQU   RPHWORK+24                                               00791000
RPHSAVE6 EQU   RPHWORK+20                                               00792000
RPHSAVE5 EQU   RPHWORK+16                                               00793000
RPHSAVE4 EQU   RPHWORK+12                                               00794000
RPHSAVE3 EQU   RPHWORK+8                                                00795000
RPHSAVE2 EQU   RPHWORK+4                                                00796000
RPHSHALF EQU   RPHSAVE1+2                                               00797000
RPHSBIT8 EQU   RPHSBITS                                                 00798000
RPHSBIT7 EQU   RPHSBITS                                                 00799000
RPHSBIT6 EQU   RPHSBITS                                                 00800000
RPHSBIT5 EQU   RPHSBITS                                                 00801000
RPHSBIT4 EQU   RPHSBITS                                                 00802000
RPHSBIT3 EQU   RPHSBITS                                                 00803000
RPHSBIT2 EQU   RPHSBITS                                                 00804000
RPHSBIT1 EQU   RPHSBITS                                                 00805000
RPHSBYTE EQU   RPHSAVE1                                                 00806000
RPHCRR   EQU   ISTRPH+32                                                00807000
RPHSRP34 EQU   RPHSRPRM+2                                               00808000
RPHSRP12 EQU   RPHSRPRM                                                 00809000
RPHWEGT  EQU   RPHWEA                                                   00810000
RPHMAJCB EQU   ISTRPH+21                                                00811000
RPHPABOF EQU   ISTRPH+20                                                00812000
RPHRESUM EQU   RPHRESMA+1                                               00813000
@NM00014 EQU   RPHWPFLG                                                 00814000
RPHPURGE EQU   RPHWPFLG                                                 00815000
RPHPT    EQU   RPHWPFLG                                                 00816000
RPHWT    EQU   RPHWPFLG                                                 00817000
RPHRSKEY EQU   RPHWPFLG                                                 00818000
RPHDVTA  EQU   ISTRPH+12                                                00819000
RPHTIK   EQU   RPHTSKID+3                                               00820000
@NM00013 EQU   RPHTSKID                                                 00821000
RPHRPHAP EQU   RPHRPHA+1                                                00822000
@NM00012 EQU   RPHRPHA                                                  00823000
RPHGATE  EQU   RPHRPHA                                                  00824000
@NM00011 EQU   RPHFLGB                                                  00825000
RPHABEND EQU   RPHFLGB                                                  00826000
RPHUWAIT EQU   RPHFLGB                                                  00827000
RPHRLCRA EQU   RPHFLGB                                                  00828000
RPHSYNCH EQU   RPHFLGB                                                  00829000
RPHPGCMP EQU   RPHFLGB                                                  00830000
RPHLOCK  EQU   RPHFLGB                                                  00831000
@NM00010 EQU   RPHFLAGS                                                 00832000
RPHSMCLR EQU   RPHFLAGS                                                 00833000
RPHSMTYP EQU   RPHFLAGS                                                 00834000
RPHSMQ   EQU   RPHFLAGS                                                 00835000
RPHLNGTH EQU   RPHCNTL+1                                                00836000
RPHTYPE  EQU   RPHCNTL                                                  00837000
DYPPAB   EQU   ISTDYPAB+16                                              00838000
DYPOCRPH EQU   DYPPACMD                                                 00839000
DYPTSKID EQU   ISTDYPAB+8                                               00840000
DYPPACTB EQU   DYPCHAIN                                                 00841000
DYPFLGS  EQU   ISTDYPAB+2                                               00842000
DYPLNGTH EQU   ISTDYPAB+1                                               00843000
DYPTYPE  EQU   ISTDYPAB                                                 00844000
PABRPHA  EQU   PABRPHFG+1                                               00845000
@NM00008 EQU   PABFLAGS                                                 00846000
PABKPRPH EQU   PABFLAGS                                                 00847000
PABNODQ  EQU   PABFLAGS                                                 00848000
PABXTND  EQU   PABFLAGS                                                 00849000
PABSYNCH EQU   PABFLAGS                                                 00850000
PABCDP   EQU   PABFLAGS                                                 00851000
PABUNCON EQU   PABFLAGS                                                 00852000
PABDVTA  EQU   ISTPAB+9                                                 00853000
PABOFFST EQU   ISTPAB+8                                                 00854000
PABCHNGP EQU   PABCHAIN+1                                               00855000
@NM00007 EQU   PABCHAIN                                                 00856000
PABCHNG  EQU   PABCHAIN                                                 00857000
PABWEQP  EQU   PABWEQA+1                                                00858000
@NM00006 EQU   PABWEQA                                                  00859000
PABWEQG  EQU   PABWEQA                                                  00860000
LOKXCL   EQU   @NM00004                                                 00861000
LOKPRY   EQU   @NM00004                                                 00862000
@NM00005 EQU   @NM00004                                                 00863000
@NM00003 EQU   LOKCHNG                                                  00864000
LOKCT    EQU   ISTLOK                                                   00865000
@NM00002 EQU   SRBSECT+40                                               00866000
@NM00001 EQU   SRBSECT+38                                               00867000
SRBPRIOR EQU   SRBSECT+37                                               00868000
SRBPKF   EQU   SRBSECT+36                                               00869000
SRBSAVE  EQU   SRBSECT+32                                               00870000
SRBPARM  EQU   SRBSECT+28                                               00871000
SRBRMTR  EQU   SRBSECT+24                                               00872000
SRBEP    EQU   SRBSECT+20                                               00873000
SRBPTCB  EQU   SRBFLC+4                                                 00874000
SRBPASID EQU   SRBFLC+2                                                 00875000
SRBCPAFF EQU   SRBFLC                                                   00876000
SRBASCB  EQU   SRBSECT+8                                                00877000
SRBFLNK  EQU   SRBSECT+4                                                00878000
SRBID    EQU   SRBSECT                                                  00879000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00880000
@ENDDATA EQU   *                                                        00881000
         END   ISTORFRA,(C'PLS2121',0702,80232)                         00882000
./  ADD  SSI=02320559,NAME=ISTRACCA
         TITLE 'ISTRACCA - RAS ADD PROCEDURE'                           00001000
* 5735-RC2 COPYRIGHT IBM CORP 1977                                      00002000
* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                           00003000
* REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083                 00004000
ISTRACCA CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'ISTRACCA  80.232'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00012000
         BALR  @12,0                                               0002 00013000
@PSTART  DS    0H                                                  0002 00014000
         USING @PSTART,@12                                         0002 00015000
         PRINT OFF                                                      00016000
         PRINT ON                                                       00017000
*   ISTQAPTR=CCAVPQAB;              /* OBTAIN QAB PTR FROM PLIST     */ 00018000
         L     ISTQAPTR,CCAVPQAB(,CCARPLST)                        0024 00019000
*   PFXPTR=CCAVCBAD;                /* OBTAIN CB PTR FROM PLIST      */ 00020000
         L     PFXPTR,CCAVCBAD(,CCARPLST)                          0025 00021000
*   RFY                                                            0026 00022000
*     CCARPLST UNRSTD;                                             0026 00023000
*   IF QABCT=0                      /* IF Q IS EMPTY                 */ 00024000
*/* QUEUE EMPTY CASE                                                 */ 00025000
*                                                                  0027 00026000
*     THEN                                                         0027 00027000
         LH    @07,QABCT(,ISTQAPTR)                                0027 00028000
         LTR   @07,@07                                             0027 00029000
         BNZ   @RF00027                                            0027 00030000
*     DO;                           /* ADD CB AS ONLY CB OF Q        */ 00031000
*       QABFIRST=PFXPTR;            /* QABFIRST PTRS TO INPUT CB     */ 00032000
         ST    PFXPTR,QABFIRST(,ISTQAPTR)                          0029 00033000
*       QABLAST=PFXPTR;             /* QABLAST PTRS TO INPUT CB      */ 00034000
         ST    PFXPTR,QABLAST(,ISTQAPTR)                           0030 00035000
*       CCARBKAD=PFXPTR+QABBCKDS;   /* GET CB BCKPTR LOC             */ 00036000
         LR    CCARBKAD,PFXPTR                                     0031 00037000
         AH    CCARBKAD,QABBCKDS(,ISTQAPTR)                        0031 00038000
*       CCAVBCKP=ISTQAPTR;          /* CB BCKPTR PTS TO QAB          */ 00039000
         STCM  ISTQAPTR,15,CCAVBCKP(CCARBKAD)                      0032 00040000
*       CCARFWAD=PFXPTR+QABFWDDS;   /* GET CB FWDPTR LOC             */ 00041000
         LR    CCARFWAD,PFXPTR                                     0033 00042000
         AH    CCARFWAD,QABFWDDS(,ISTQAPTR)                        0033 00043000
*       CCAVFWDP=ISTQAPTR;          /* CB FWDPTR PTS TO QAB          */ 00044000
         STCM  ISTQAPTR,15,CCAVFWDP(CCARFWAD)                      0034 00045000
*     END;                                                         0035 00046000
*   ELSE                                                           0036 00047000
*CCALQNEM:                                                         0036 00048000
*     DO;                                                          0036 00049000
         B     @RC00027                                            0036 00050000
@RF00027 DS    0H                                                  0036 00051000
CCALQNEM DS    0H                                                  0037 00052000
*       IF QABFIFO='1'B             /* Q ATTRIBUTE =FIFO ?           */ 00053000
*/* FIFO QUEUE CASE                                                  */ 00054000
*                                                                  0037 00055000
*         THEN                                                     0037 00056000
         TM    QABFIFO(ISTQAPTR),B'00010000'                       0037 00057000
         BNO   @RF00037                                            0037 00058000
*         CCARPVCB=QABLAST;         /* SET PREVIOUS CB=LAST Q ELM    */ 00059000
         L     CCARPVCB,QABLAST(,ISTQAPTR)                         0038 00060000
*       ELSE                                                       0039 00061000
*         IF QABLIFO='1'B           /* Q ATTRIBUTE =LIFO ?           */ 00062000
*/* LIFO QUEUE CASE                                                  */ 00063000
*                                                                  0039 00064000
*           THEN                                                   0039 00065000
         B     @RC00037                                            0039 00066000
@RF00037 TM    QABLIFO(ISTQAPTR),B'00100000'                       0039 00067000
         BNO   @RF00039                                            0039 00068000
*           CCARPVCB=ISTQAPTR;      /* SET PREVIOUS CB=QAB           */ 00069000
         LR    CCARPVCB,ISTQAPTR                                   0040 00070000
*/* PRIORITY QUEUE CASE                                              */ 00071000
*                                                                  0041 00072000
*         ELSE                                                     0041 00073000
*CCALPRTQ:                                                         0041 00074000
*           DO;                                                    0041 00075000
         B     @RC00039                                            0041 00076000
@RF00039 DS    0H                                                  0041 00077000
CCALPRTQ DS    0H                                                  0042 00078000
*             CCARQELM=QABFIRST;    /* GET FIRST CB                  */ 00079000
*                                                                  0042 00080000
         L     CCARQELM,QABFIRST(,ISTQAPTR)                        0042 00081000
*             /*******************************************************/ 00082000
*             /*                                                     */ 00083000
*             /* IS INPUT CB PRIORITY GTER EXISTING PRIORITY         */ 00084000
*             /*                                                     */ 00085000
*             /*******************************************************/ 00086000
*                                                                  0043 00087000
*             RFY                                                  0043 00088000
*               PTYDSREG RSTD;                                     0043 00089000
*CCALLOOP:                                                         0044 00090000
*             PTYDSREG=QABPTYDS+1;                                 0044 00091000
CCALLOOP LA    PTYDSREG,1                                          0044 00092000
         AH    PTYDSREG,QABPTYDS(,ISTQAPTR)                        0044 00093000
*             IF CCAVCBPA(PTYDSREG)>CCAVCBPB(PTYDSREG) THEN        0045 00094000
         LR    @09,PFXPTR                                          0045 00095000
         ALR   @09,PTYDSREG                                        0045 00096000
         BCTR  @09,0                                               0045 00097000
         LR    @07,CCARQELM                                        0045 00098000
         ALR   @07,PTYDSREG                                        0045 00099000
         BCTR  @07,0                                               0045 00100000
         CLC   CCAVCBPA(1,@09),CCAVCBPB(@07)                       0045 00101000
         BNH   @RF00045                                            0045 00102000
*               DO;                                                0046 00103000
*                 CCARBKAD=CCARQELM+QABBCKDS;/* GET BCKPTR LOC OF CB    00104000
*                                      COMPARED                      */ 00105000
         LR    CCARBKAD,CCARQELM                                   0047 00106000
         AH    CCARBKAD,QABBCKDS(,ISTQAPTR)                        0047 00107000
*                 CCARPVCB=CCAVBCKP;/* SET PREVIOUS CB=BACKPTR IN CB    00108000
*                                      COMPARED                      */ 00109000
         ICM   CCARPVCB,15,CCAVBCKP(CCARBKAD)                      0048 00110000
*               END;                                               0049 00111000
*             ELSE                                                 0050 00112000
*               DO;                                                0050 00113000
         B     @RC00045                                            0050 00114000
@RF00045 DS    0H                                                  0051 00115000
*                 CCARFWAD=CCARQELM+QABFWDDS;/* GET FWD PTR LOC OF Q    00116000
*                                      ELEMENT                       */ 00117000
*                                                                  0051 00118000
         LR    CCARFWAD,CCARQELM                                   0051 00119000
         AH    CCARFWAD,QABFWDDS(,ISTQAPTR)                        0051 00120000
*                 /***************************************************/ 00121000
*                 /*                                                 */ 00122000
*                 /* END OF Q IF FWDPTR OF Q ELM=QAB ADDR            */ 00123000
*                 /*                                                 */ 00124000
*                 /***************************************************/ 00125000
*                                                                  0052 00126000
*                 IF CCAVFWDP=ISTQAPTR/* END OF Q?                   */ 00127000
*                   THEN                                           0052 00128000
         ICM   @09,15,CCAVFWDP(CCARFWAD)                           0052 00129000
         CR    ISTQAPTR,@09                                        0052 00130000
         BNE   @RF00052                                            0052 00131000
*                   CCARPVCB=CCARQELM;/* YES,PVCB=Q ELM              */ 00132000
*                 ELSE                                             0054 00133000
*                   DO;                                            0054 00134000
         B     @RC00052                                            0054 00135000
@RF00052 DS    0H                                                  0055 00136000
*                     CCARQELM=CCAVFWDP;/* GET NEXT CB               */ 00137000
         ICM   CCARQELM,15,CCAVFWDP(CCARFWAD)                      0055 00138000
*                     GOTO CCALLOOP;/* LOOP TO SEARCH Q              */ 00139000
         B     CCALLOOP                                            0056 00140000
*                   END;                                           0057 00141000
*               END;                                               0058 00142000
@RC00052 DS    0H                                                  0059 00143000
*           END CCALPRTQ;           /* END OF PRTY CASE              */ 00144000
@RC00045 DS    0H                                                  0060 00145000
*       CALL CCAPADCB;              /* CALL CHAIN CB ROUTINE         */ 00146000
@RC00039 DS    0H                                                  0060 00147000
@RC00037 BAL   @14,CCAPADCB                                        0060 00148000
*     END CCALQNEM;                                                0061 00149000
*   QABCT=QABCT+1;                  /* INCREMENT COUNT IN QAB        */ 00150000
@RC00027 LA    @09,1                                               0062 00151000
         AH    @09,QABCT(,ISTQAPTR)                                0062 00152000
         STH   @09,QABCT(,ISTQAPTR)                                0062 00153000
*   RETURN CODE(0);                 /* SET RC FOR SUCCESSFUL ADD     */ 00154000
         SLR   @15,@15                                             0063 00155000
         L     @14,12(,@13)                                        0063 00156000
         LM    @00,@12,20(@13)                                     0063 00157000
         BR    @14                                                 0063 00158000
*CCAPADCB:                                                         0064 00159000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0064 00160000
*                                                                  0064 00161000
CCAPADCB DS    0H                                                  0065 00162000
*/*                                                                  */ 00163000
*/*  FUNCTION : THIS SUBROUTINE CHAINS A CONTROL BLOCK TO THE QUEUE  */ 00164000
*/*                                                                  */ 00165000
*/*  INPUT : R2 - POINTER TO QAB                                     */ 00166000
*/*          R3 - POINTER TO CONTROL BLOCK TO BE ADDED(INPUT CB)     */ 00167000
*/*          R4 - POINTER TO PREVIOUS CONTROL BLOCK                  */ 00168000
*/*                                                                  */ 00169000
*/*  OUTPUT : NONE                                                   */ 00170000
*/*                                                                  */ 00171000
*                                                                  0065 00172000
*   CCARBKAD=PFXPTR+QABBCKDS;       /* GET BCKPTR LOC OF INPUT CB    */ 00173000
         LR    CCARBKAD,PFXPTR                                     0065 00174000
         AH    CCARBKAD,QABBCKDS(,ISTQAPTR)                        0065 00175000
*   CCAVBCKP=CCARPVCB;              /* SET INPUT CB BCKPTR=PREVCB    */ 00176000
         STCM  CCARPVCB,15,CCAVBCKP(CCARBKAD)                      0066 00177000
*/* IF FORWARD PTR OF PREVIOUS CB=QAB PTR,THEN PREVIOUS CB IS LAST   */ 00178000
*/* CONTROL BLOCK OF QUEUE. INPUT CB IS TO BE ADDED AT BOTTOM OF Q   */ 00179000
*                                                                  0067 00180000
*   CCARFWAD=CCARPVCB+QABFWDDS;     /* GET FWDPTR IN PREVIOUS CB     */ 00181000
         LR    CCARFWAD,CCARPVCB                                   0067 00182000
         AH    CCARFWAD,QABFWDDS(,ISTQAPTR)                        0067 00183000
*   IF CCAVFWDP=ISTQAPTR            /* PREVCB FWDPTR=QAB ADDR?       */ 00184000
*     THEN                                                         0068 00185000
         ICM   @09,15,CCAVFWDP(CCARFWAD)                           0068 00186000
         CR    ISTQAPTR,@09                                        0068 00187000
         BNE   @RF00068                                            0068 00188000
*     QABLAST=PFXPTR;               /* YES,ADD CB AS LAST ELM        */ 00189000
         ST    PFXPTR,QABLAST(,ISTQAPTR)                           0069 00190000
*   ELSE                            /* NO,IT IS NOT FIFO             */ 00191000
*     DO;                                                          0070 00192000
         B     @RC00068                                            0070 00193000
@RF00068 DS    0H                                                  0071 00194000
*       CCARNXCB=CCAVFWDP;          /* NEXTCB PTR=PREVCB FWDPTR      */ 00195000
         ICM   CCARNXCB,15,CCAVFWDP(CCARFWAD)                      0071 00196000
*       CCARBKAD=CCARNXCB+QABBCKDS; /* GET NEXT CB BCKPTR LOC        */ 00197000
         LR    CCARBKAD,CCARNXCB                                   0072 00198000
         AH    CCARBKAD,QABBCKDS(,ISTQAPTR)                        0072 00199000
*       CCAVBCKP=PFXPTR;            /* NEXTCB BCKPTR=INPUT CBAD      */ 00200000
         STCM  PFXPTR,15,CCAVBCKP(CCARBKAD)                        0073 00201000
*     END;                                                         0074 00202000
*                                                                  0074 00203000
*/* IF PREVCB IS QAB,THEN INPUT CB IS TO BE ADDED ON TOP OF THE Q    */ 00204000
*                                                                  0075 00205000
*   IF CCARPVCB=ISTQAPTR            /* PREVIOUS CB=QAB ?             */ 00206000
*     THEN                          /* YES,ADD CB AS 1ST BK OF Q     */ 00207000
@RC00068 CR    CCARPVCB,ISTQAPTR                                   0075 00208000
         BNE   @RF00075                                            0075 00209000
*     DO;                                                          0076 00210000
*       CCARFWAD=PFXPTR+QABFWDDS;   /* GET INPUT CB FWDPTR LOC       */ 00211000
         LR    CCARFWAD,PFXPTR                                     0077 00212000
         AH    CCARFWAD,QABFWDDS(,ISTQAPTR)                        0077 00213000
*       CCAVFWDP=QABFIRST;          /* SET FWD PTR OF INPUT CB       */ 00214000
         MVC   CCAVFWDP(4,CCARFWAD),QABFIRST(ISTQAPTR)             0078 00215000
*       QABFIRST=PFXPTR;            /* QABFIRST PTS TO INPUT CB      */ 00216000
         ST    PFXPTR,QABFIRST(,ISTQAPTR)                          0079 00217000
*     END;                                                         0080 00218000
*   ELSE                            /* CB IS NOT ADDED ON TOP OF Q   */ 00219000
*     DO;                                                          0081 00220000
         B     @RC00075                                            0081 00221000
@RF00075 DS    0H                                                  0082 00222000
*       CCARFWAD=CCARPVCB+QABFWDDS; /* GET PREVCB FWDPTR LOC         */ 00223000
         LH    @09,QABFWDDS(,ISTQAPTR)                             0082 00224000
         LR    CCARFWAD,CCARPVCB                                   0082 00225000
         ALR   CCARFWAD,@09                                        0082 00226000
*       CCARNXCB=CCAVFWDP;          /* NEXT CB=PREVCB FWDPTR         */ 00227000
         ICM   CCARNXCB,15,CCAVFWDP(CCARFWAD)                      0083 00228000
*       CCAVFWDP=PFXPTR;            /* PREVCB FWD PTR=INPUT CB       */ 00229000
         STCM  PFXPTR,15,CCAVFWDP(CCARFWAD)                        0084 00230000
*       CCARFWAD=PFXPTR+QABFWDDS;   /* GET INPUT CB FWDPTR LOC       */ 00231000
         ALR   @09,PFXPTR                                          0085 00232000
         LR    CCARFWAD,@09                                        0085 00233000
*       CCAVFWDP=CCARNXCB;          /* NEW CB FWDPTR PTRS TO NEXT    */ 00234000
         STCM  CCARNXCB,15,CCAVFWDP(CCARFWAD)                      0086 00235000
*     END;                          /* CB                            */ 00236000
*   END CCAPADCB;                   /* END OF SUBROUTINE ADDCB       */ 00237000
@EL00002 DS    0H                                                  0088 00238000
@EF00002 DS    0H                                                  0088 00239000
@ER00002 BR    @14                                                 0088 00240000
*   DO;                             /* TPEPILOG                      */ 00241000
*     GEN(PRINT OFF);                                              0090 00242000
         PRINT OFF                                                      00243000
*     GEN(PRINT ON);                                               0091 00244000
         PRINT ON                                                       00245000
*   END;                            /* TPEPILOG                      */ 00246000
*   END ISTRACCA;                   /* END OF ADD PROCEDURE          */ 00247000
@EL00001 DS    0H                                                  0093 00248000
@EF00001 DS    0H                                                  0093 00249000
@ER00001 LM    @14,@12,12(@13)                                     0093 00250000
         BR    @14                                                 0093 00251000
@DATA    DS    0H                                                       00252000
@DATD    DSECT                                                          00253000
         DS    0F                                                       00254000
ISTRACCA CSECT                                                          00255000
         DS    0F                                                       00256000
@DATD    DSECT                                                          00257000
         DS    0D                                                       00258000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00259000
@ENDDATD EQU   *                                                        00260000
ISTRACCA CSECT                                                          00261000
         DS    0F                                                       00262000
@SIZDATD DC    AL1(0)                                                   00263000
         DC    AL3(@ENDDATD-@DATD)                                      00264000
         DS    0D                                                       00265000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00266000
@01      EQU   01                                                       00267000
@02      EQU   02                                                       00268000
@03      EQU   03                                                       00269000
@04      EQU   04                                                       00270000
@05      EQU   05                                                       00271000
@06      EQU   06                                                       00272000
@07      EQU   07                                                       00273000
@08      EQU   08                                                       00274000
@09      EQU   09                                                       00275000
@10      EQU   10                                                       00276000
@11      EQU   11                                                       00277000
@12      EQU   12                                                       00278000
@13      EQU   13                                                       00279000
@14      EQU   14                                                       00280000
@15      EQU   15                                                       00281000
CCARPLST EQU   @01                                                      00282000
ISTQAPTR EQU   @02                                                      00283000
PFXPTR   EQU   @03                                                      00284000
CCARPVCB EQU   @04                                                      00285000
CCARQELM EQU   @04                                                      00286000
PTYDSREG EQU   @08                                                      00287000
CCARBKAD EQU   @06                                                      00288000
CCARFWAD EQU   @06                                                      00289000
CCARNXCB EQU   @05                                                      00290000
ISTPFX   EQU   0                                                        00291000
PFXID    EQU   ISTPFX                                                   00292000
ISTQAB   EQU   0                                                        00293000
QABCT    EQU   ISTQAB+4                                                 00294000
QABFIRST EQU   ISTQAB+8                                                 00295000
QABLAST  EQU   ISTQAB+12                                                00296000
QABATTR  EQU   ISTQAB+16                                                00297000
QABATTR2 EQU   QABATTR+1                                                00298000
QABLIFO  EQU   QABATTR2                                                 00299000
QABFIFO  EQU   QABATTR2                                                 00300000
QABPTYDS EQU   ISTQAB+18                                                00301000
QABFWDDS EQU   ISTQAB+20                                                00302000
QABBCKDS EQU   ISTQAB+22                                                00303000
CCAVPLST EQU   0                                                        00304000
CCAVPQAB EQU   CCAVPLST                                                 00305000
CCAVCBAD EQU   CCAVPLST+4                                               00306000
CCAVCBPA EQU   0                                                        00307000
CCAVCBPB EQU   0                                                        00308000
CCAVFWDP EQU   0                                                        00309000
CCAVBCKP EQU   0                                                        00310000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00311000
@NM00006 EQU   QABATTR2                                                 00312000
@NM00005 EQU   QABATTR2                                                 00313000
@NM00004 EQU   QABATTR2                                                 00314000
@NM00003 EQU   QABATTR2                                                 00315000
QABPRTY  EQU   QABATTR2                                                 00316000
@NM00002 EQU   QABATTR2                                                 00317000
QABATTR1 EQU   QABATTR                                                  00318000
@NM00001 EQU   ISTQAB+6                                                 00319000
QABID    EQU   ISTQAB                                                   00320000
PFXBCK   EQU   ISTPFX+12                                                00321000
PFXFWD   EQU   ISTPFX+8                                                 00322000
PFXLNG   EQU   ISTPFX+5                                                 00323000
PFXPRTY  EQU   ISTPFX+4                                                 00324000
PFXCBID  EQU   PFXID                                                    00325000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00326000
@RC00075 EQU   @EL00002                                                 00327000
@ENDDATA EQU   *                                                        00328000
         END   ISTRACCA,(C'PLS2123',0702,80232)                         00329000
./  ADD  SSI=02320560,NAME=ISTRACCR
         TITLE 'ISTRACCR - CONTROL BLOCK QUEUE REMOVE PROCEDURE'        00001000
* 5735-RC2 COPYRIGHT IBM CORP 1977                                      00002000
* LICENSED MATERIAL - PROGRAM PROPERTY OF IBM                           00003000
* REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083                 00004000
ISTRACCR CSECT ,                                                   0002 00005000
@MAINENT DS    0H                                                  0002 00006000
         USING *,@15                                               0002 00007000
         B     @PROLOG                                             0002 00008000
         DC    AL1(16)                                             0002 00009000
         DC    C'ISTRACCR  80.232'                                 0002 00010000
         DROP  @15                                                      00011000
@PROLOG  STM   @14,@00,12(@13)                                     0002 00012000
         STM   @02,@12,28(@13)                                     0002 00013000
         BALR  @12,0                                               0002 00014000
@PSTART  DS    0H                                                  0002 00015000
         USING @PSTART,@12                                         0002 00016000
         PRINT OFF                                                      00017000
         PRINT ON                                                       00018000
*   ISTQAPTR=PLISTQAB;              /* SET UP QAB                    */ 00019000
         L     ISTQAPTR,PLISTQAB(,PLISTPTR)                        0016 00020000
*   IF QABCT=0 THEN                                                0017 00021000
         LH    @14,QABCT(,ISTQAPTR)                                0017 00022000
         LTR   @14,@14                                             0017 00023000
         BNZ   @RF00017                                            0017 00024000
*     RCREG=16;                     /* IF NO Q ELEMENTS BAD RETURN 0018 00025000
*                                      CODE                          */ 00026000
         LA    RCREG,16                                            0018 00027000
*   ELSE                                                           0019 00028000
*     DO;                                                          0019 00029000
         B     @RC00017                                            0019 00030000
@RF00017 DS    0H                                                  0020 00031000
*       IF PLISTCBA=0 THEN                                         0020 00032000
         L     @14,PLISTCBA(,PLISTPTR)                             0020 00033000
         LTR   @14,@14                                             0020 00034000
         BNZ   @RF00020                                            0020 00035000
*         PFXPTR=QABFIRST;          /* INIT C.B. ADDRESS             */ 00036000
         L     PFXPTR,QABFIRST(,ISTQAPTR)                          0021 00037000
*       ELSE                                                       0022 00038000
*         PFXPTR=PLISTCBA;          /* INIT C.B. ADDRESS             */ 00039000
         B     @RC00020                                            0022 00040000
@RF00020 L     PFXPTR,PLISTCBA(,PLISTPTR)                          0022 00041000
*       NWPFXREG=PFXPTR+QABFWDDS;   /* GET ADDRESS OF FORWARD PTR    */ 00042000
@RC00020 LR    NWPFXREG,PFXPTR                                     0023 00043000
         AH    NWPFXREG,QABFWDDS(,ISTQAPTR)                        0023 00044000
*       NWPFXREG=NWPFXREG->QABID;   /* GET ADDRESS OF NEXT C.B.      */ 00045000
         L     NWPFXREG,QABID(,NWPFXREG)                           0024 00046000
*       BKPFXREG=PFXPTR+QABBCKDS;   /* GET ADDRESS OF BACKWARD PTR   */ 00047000
         LR    BKPFXREG,PFXPTR                                     0025 00048000
         AH    BKPFXREG,QABBCKDS(,ISTQAPTR)                        0025 00049000
*       BKPFXREG=BKPFXREG->QABID;   /* GET ADDRESS OF PREVIOUS C.B.  */ 00050000
         L     BKPFXREG,QABID(,BKPFXREG)                           0026 00051000
*/* IF DEQUING 1ST C.B. POINT QAB FWDPTR TO NEXT.                    */ 00052000
*                                                                  0027 00053000
*       IF BKPFXREG=ISTQAPTR THEN                                  0027 00054000
         CR    BKPFXREG,ISTQAPTR                                   0027 00055000
         BNE   @RF00027                                            0027 00056000
*         QABFIRST=NWPFXREG;                                       0028 00057000
*                                                                  0028 00058000
         ST    NWPFXREG,QABFIRST(,ISTQAPTR)                        0028 00059000
*/* IF NOT, UPDATE FWD POINTER IN PREVIOUS C.B. ON Q.                */ 00060000
*                                                                  0029 00061000
*       ELSE                                                       0029 00062000
*         DO;                                                      0029 00063000
         B     @RC00027                                            0029 00064000
@RF00027 DS    0H                                                  0030 00065000
*           BKPFXREG=BKPFXREG+QABFWDDS;/* NEXT@                      */ 00066000
         LH    @14,QABFWDDS(,ISTQAPTR)                             0030 00067000
         ALR   BKPFXREG,@14                                        0030 00068000
*           BKPFXREG->QABID=NWPFXREG;/* UPDATE PTR                   */ 00069000
         ST    NWPFXREG,QABID(,BKPFXREG)                           0031 00070000
*           BKPFXREG=BKPFXREG-QABFWDDS;/* GET BACK BEGINNING OF CB   */ 00071000
         SLR   BKPFXREG,@14                                        0032 00072000
*         END;                                                     0033 00073000
*                                                                  0033 00074000
*/* IF DEQUEING LAST POINT QAB LAST TO PREVIOUS.                     */ 00075000
*                                                                  0034 00076000
*       IF NWPFXREG=ISTQAPTR THEN                                  0034 00077000
@RC00027 CR    NWPFXREG,ISTQAPTR                                   0034 00078000
         BNE   @RF00034                                            0034 00079000
*         QABLAST=BKPFXREG;                                        0035 00080000
*                                                                  0035 00081000
         ST    BKPFXREG,QABLAST(,ISTQAPTR)                         0035 00082000
*/* IF NOT UPDATE BACK POINTER OF NEXT C.B. ON Q.                    */ 00083000
*                                                                  0036 00084000
*       ELSE                                                       0036 00085000
*         DO;                                                      0036 00086000
         B     @RC00034                                            0036 00087000
@RF00034 DS    0H                                                  0037 00088000
*           NWPFXREG=NWPFXREG+QABBCKDS;/* GET POINTER TO PREVIOUS CB */ 00089000
         AH    NWPFXREG,QABBCKDS(,ISTQAPTR)                        0037 00090000
*           NWPFXREG->QABID=BKPFXREG;/* UPDATE PTR                   */ 00091000
         ST    BKPFXREG,QABID(,NWPFXREG)                           0038 00092000
*         END;                                                     0039 00093000
*                                                                  0039 00094000
*/* IF ONLY ONE ELEMENT ON Q ZERO OUT FIRST AND LAST PTRS.           */ 00095000
*                                                                  0040 00096000
*       IF QABFIRST=ADDR(ISTQAB) THEN                              0040 00097000
@RC00034 C     ISTQAPTR,QABFIRST(,ISTQAPTR)                        0040 00098000
         BNE   @RF00040                                            0040 00099000
*         DO;                                                      0041 00100000
*           QABFIRST=0;                                            0042 00101000
         SLR   @14,@14                                             0042 00102000
         ST    @14,QABFIRST(,ISTQAPTR)                             0042 00103000
*           QABLAST=0;                                             0043 00104000
         ST    @14,QABLAST(,ISTQAPTR)                              0043 00105000
*         END;                                                     0044 00106000
*       ELSE                                                       0045 00107000
*         ;                                                        0045 00108000
@RF00040 DS    0H                                                  0046 00109000
*       PLISTPTR=PFXPTR;            /* PUT C.B. POINTER IN REG1      */ 00110000
         LR    PLISTPTR,PFXPTR                                     0046 00111000
*       RCREG=0;                    /* SET UP SUCCESSFUL R.C.        */ 00112000
         SLR   RCREG,RCREG                                         0047 00113000
*       QABCT=QABCT-1;              /* DECREMENT QAB COUNT           */ 00114000
         LH    @14,QABCT(,ISTQAPTR)                                0048 00115000
         BCTR  @14,0                                               0048 00116000
         STH   @14,QABCT(,ISTQAPTR)                                0048 00117000
*     END;                                                         0049 00118000
*   RETURN CODE(RCREG);             /* RETURN TO CALLER              */ 00119000
@RC00017 L     @14,12(,@13)                                        0050 00120000
         L     @00,20(,@13)                                        0050 00121000
         LM    @02,@12,28(@13)                                     0050 00122000
         BR    @14                                                 0050 00123000
*   END ISTRACCR;                                                  0051 00124000
@DATA    DS    0H                                                       00125000
         DS    0F                                                       00126000
         DS    0F                                                       00127000
         DS    0D                                                       00128000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00129000
@01      EQU   01                                                       00130000
@02      EQU   02                                                       00131000
@03      EQU   03                                                       00132000
@04      EQU   04                                                       00133000
@05      EQU   05                                                       00134000
@06      EQU   06                                                       00135000
@07      EQU   07                                                       00136000
@08      EQU   08                                                       00137000
@09      EQU   09                                                       00138000
@10      EQU   10                                                       00139000
@11      EQU   11                                                       00140000
@12      EQU   12                                                       00141000
@13      EQU   13                                                       00142000
@14      EQU   14                                                       00143000
@15      EQU   15                                                       00144000
PLISTPTR EQU   @01                                                      00145000
ISTQAPTR EQU   @02                                                      00146000
PFXPTR   EQU   @03                                                      00147000
NWPFXREG EQU   @04                                                      00148000
BKPFXREG EQU   @05                                                      00149000
RCREG    EQU   @15                                                      00150000
PLIST    EQU   0                                                        00151000
PLISTQAB EQU   PLIST                                                    00152000
PLISTCBA EQU   PLIST+4                                                  00153000
ISTPFX   EQU   0                                                        00154000
PFXID    EQU   ISTPFX                                                   00155000
ISTQAB   EQU   0                                                        00156000
QABID    EQU   ISTQAB                                                   00157000
QABCT    EQU   ISTQAB+4                                                 00158000
QABFIRST EQU   ISTQAB+8                                                 00159000
QABLAST  EQU   ISTQAB+12                                                00160000
QABATTR  EQU   ISTQAB+16                                                00161000
QABATTR2 EQU   QABATTR+1                                                00162000
QABFWDDS EQU   ISTQAB+20                                                00163000
QABBCKDS EQU   ISTQAB+22                                                00164000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00165000
QABPTYDS EQU   ISTQAB+18                                                00166000
@NM00006 EQU   QABATTR2                                                 00167000
@NM00005 EQU   QABATTR2                                                 00168000
@NM00004 EQU   QABATTR2                                                 00169000
@NM00003 EQU   QABATTR2                                                 00170000
QABFIFO  EQU   QABATTR2                                                 00171000
QABLIFO  EQU   QABATTR2                                                 00172000
QABPRTY  EQU   QABATTR2                                                 00173000
@NM00002 EQU   QABATTR2                                                 00174000
QABATTR1 EQU   QABATTR                                                  00175000
@NM00001 EQU   ISTQAB+6                                                 00176000
PFXBCK   EQU   ISTPFX+12                                                00177000
PFXFWD   EQU   ISTPFX+8                                                 00178000
PFXLNG   EQU   ISTPFX+5                                                 00179000
PFXPRTY  EQU   ISTPFX+4                                                 00180000
PFXCBID  EQU   PFXID                                                    00181000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00182000
@ENDDATA EQU   *                                                        00183000
         END   ISTRACCR,(C'PLS2124',0702,80232)                         00184000
./  ADD  SSI=02320575,NAME=ISTSDCC3
         TITLE 'ISTSDCC3-  MHR'                                         00001000
ISTSDCC3 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTSDCC3  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         PRINT OFF                                                      00013000
         PRINT ON                                                       00014000
         USING @DATD,DATREG                                             00015000
*   DATREG=ADDR(MLCMHDAT);                                         0037 00016000
         LA    DATREG,MLCMHDAT(,MLCAPTR)                           0037 00017000
*   SCANPTR=PARMR;                                                 0038 00018000
         LR    SCANPTR,PARMR                                       0038 00019000
*   PARMSAVE=PARMR;                 /* SAVE PARM REG                 */ 00020000
         LR    PARMSAVE,PARMR                                      0039 00021000
*   TABLEPTR=TABPTR;                                               0040 00022000
         LR    TABLEPTR,TABPTR                                     0040 00023000
*   MLCNAME=BLANK;                  /* BLANK MLCNAME                 */ 00024000
         MVI   MLCNAME+1(MLCAPTR),C' '                             0041 00025000
         MVC   MLCNAME+2(6,MLCAPTR),MLCNAME+1(MLCAPTR)             0041 00026000
         MVI   MLCNAME(MLCAPTR),C' '                               0041 00027000
*   MLCMACRO=BLANK;                 /* BLANK MLCMACRO                */ 00028000
         MVI   MLCMACRO+1(MLCAPTR),C' '                            0042 00029000
         MVC   MLCMACRO+2(6,MLCAPTR),MLCMACRO+1(MLCAPTR)           0042 00030000
         MVI   MLCMACRO(MLCAPTR),C' '                              0042 00031000
*   NAMELEN=0;                      /* SET CTR TO 0                  */ 00032000
         SLR   NAMELEN,NAMELEN                                     0043 00033000
*/********************************************************************/ 00034000
*/* IF THERE IS NO NAME ON THE MACRO SET UP THE MLCNAME AS BLANKS    */ 00035000
*/* OTHERWISE MOVE IN THE NAME FROM THE MACRO. HTIS NAME WILL BE USED*/ 00036000
*/* TO TELL THAT THIS MACRO CAUSED AN ERROR IF ONE IS DETECTED       */ 00037000
*/********************************************************************/ 00038000
*                                                                  0044 00039000
*   IF CHARCOMP¬=BLANK THEN         /* 1ST BUFFER CHAR A BLANK?      */ 00040000
         CLI   CHARCOMP(SCANPTR),C' '                              0044 00041000
         BE    @RF00044                                            0044 00042000
*     DO;                                                          0045 00043000
*       DO WHILE CHARCOMP¬=BLANK;   /* NO,FIND BLANK & COUNT CHAR    */ 00044000
         B     @DE00046                                            0046 00045000
@DL00046 DS    0H                                                  0047 00046000
*         NAMELEN=NAMELEN+1;        /* COUNT CHARACTERS              */ 00047000
         LA    @08,1                                               0047 00048000
         ALR   NAMELEN,@08                                         0047 00049000
*         SCANPTR=SCANPTR+1;        /* STEP UP PTR                   */ 00050000
         ALR   SCANPTR,@08                                         0048 00051000
*       END;                                                       0049 00052000
@DE00046 CLI   CHARCOMP(SCANPTR),C' '                              0049 00053000
         BNE   @DL00046                                            0049 00054000
*       SCANPTR=PARMSAVE;           /* RESTORE POINTER               */ 00055000
         LR    SCANPTR,PARMSAVE                                    0050 00056000
*       IF NAMELEN<=8 THEN          /* NAME LONGER THAN 8            */ 00057000
         CH    NAMELEN,@CH00044                                    0051 00058000
         BH    @RF00051                                            0051 00059000
*         DO;                                                      0052 00060000
*           MLCNAME(1:NAMELEN)=TEXTBUF(1:NAMELEN);/* MOVE IN NAME    */ 00061000
         LR    @07,NAMELEN                                         0053 00062000
         BCTR  @07,0                                               0053 00063000
         EX    @07,@SM00222                                        0053 00064000
*           PARMSAVE=PARMR;         /* SAVE REGS 1 & 2 OVER TRT      */ 00065000
         LR    PARMSAVE,PARMR                                      0054 00066000
*           TWOSAVE=R2;                                            0055 00067000
         LR    TWOSAVE,R2                                          0055 00068000
*           PARMR=0;                /* SET REGS 1 & 2 TO 0           */ 00069000
         SLR   PARMR,PARMR                                         0056 00070000
*           R2=0;                                                  0057 00071000
         SLR   R2,R2                                               0057 00072000
*           TRT(CHARCOMP,TTABLE1);  /* TRT FIRST CHARACTER           */ 00073000
         TRT   CHARCOMP(1,SCANPTR),TTABLE1                         0058 00074000
*           IF PARMR=0 THEN         /* FIRST CHAR VALID?             */ 00075000
         LTR   PARMR,PARMR                                         0059 00076000
         BNZ   @RF00059                                            0059 00077000
*             DO;                                                  0060 00078000
*               SCANPTR=SCANPTR+1;  /* YES, ADVANCE PTR              */ 00079000
         AH    SCANPTR,@CH00063                                    0061 00080000
*               TRT(TEXTBUF,TTABLE2);/* TRT REST OF NAME             */ 00081000
         TRT   TEXTBUF(256,SCANPTR),TTABLE2                        0062 00082000
*               IF R2¬=1 THEN       /* TRT STOPPED BY BLANK?         */ 00083000
         CH    R2,@CH00063                                         0063 00084000
         BE    @RF00063                                            0063 00085000
*                 DO;                                              0064 00086000
*                   RCSAVE=8;       /* NO, ERROR CONDITION           */ 00087000
         LA    RCSAVE,8                                            0065 00088000
*                 END;                                             0066 00089000
*               ELSE                /* R2 = 1, GO ON                 */ 00090000
*                 RCSAVE=0;         /* INDICATE NO ERROR             */ 00091000
         B     @RC00063                                            0067 00092000
@RF00063 SLR   RCSAVE,RCSAVE                                       0067 00093000
*             END;                                                 0068 00094000
*           ELSE                                                   0069 00095000
*             RCSAVE=8;             /* PARMR NOT = 0                 */ 00096000
         B     @RC00059                                            0069 00097000
@RF00059 LA    RCSAVE,8                                            0069 00098000
*         END;                                                     0070 00099000
*       ELSE                        /* NAME > 8                      */ 00100000
*         DO;                                                      0071 00101000
         B     @RC00051                                            0071 00102000
@RF00051 DS    0H                                                  0072 00103000
*           MLCNAME(1:8)=TEXTBUF(1:8);/* MOVE IN 1ST 8 CHAR          */ 00104000
         MVC   MLCNAME(8,MLCAPTR),TEXTBUF(SCANPTR)                 0072 00105000
*           RCSAVE=8;               /* ERROR CONDITION               */ 00106000
         LA    RCSAVE,8                                            0073 00107000
*         END;                                                     0074 00108000
*     END;                                                         0075 00109000
*   ELSE                            /* FIRST CHAR WAS BLANK          */ 00110000
*     DO;                                                          0076 00111000
         B     @RC00044                                            0076 00112000
@RF00044 DS    0H                                                  0077 00113000
*       RCSAVE=0;                   /* SIGNIFY NO ERROR              */ 00114000
         SLR   RCSAVE,RCSAVE                                       0077 00115000
*     END;                                                         0078 00116000
*   IF RCSAVE=0 THEN                                               0079 00117000
@RC00044 LTR   RCSAVE,RCSAVE                                       0079 00118000
         BNZ   @RF00079                                            0079 00119000
*     DO;                                                          0080 00120000
*                                                                  0080 00121000
*/********************************************************************/ 00122000
*/* NOW SCAN THE INPUT FOR A MACRO NAME.  WHEN IT IS FOUND BEGIN A   */ 00123000
*/* SCAN OF THE MACRO NAME TABLE AND COMPARE THE NAME OF THE MACRO   */ 00124000
*/* THAT IS ON THE INPUT TO THE NAME IN THE TABLE IF THE NAMES ARE   */ 00125000
*/* NOT THE SAME CONTINUE. IF THE NAME IS FOUND THEN PICK UP THE     */ 00126000
*/* ADDRESS OF THE ROUTINE ASSOCIATED WITH THE MACRO AND PUT IT IN   */ 00127000
*/* R0 TO RETURN TO THE CALLER                                       */ 00128000
*/********************************************************************/ 00129000
*                                                                  0081 00130000
*       SCANPTR=PARMSAVE+NAMELEN+1; /* RESET PTR                     */ 00131000
         LR    SCANPTR,PARMSAVE                                    0081 00132000
         ALR   SCANPTR,NAMELEN                                     0081 00133000
         AH    SCANPTR,@CH00063                                    0081 00134000
*       IF CHARCOMP¬=BLANK THEN                                    0082 00135000
         CLI   CHARCOMP(SCANPTR),C' '                              0082 00136000
         BE    @RF00082                                            0082 00137000
*         DO;                                                      0083 00138000
*           MACLEN=0;               /* ZERO OUT CTR                  */ 00139000
         SLR   MACLEN,MACLEN                                       0084 00140000
*           DO WHILE CHARCOMP¬=BLANK;/* SCAN FOR BLANKS              */ 00141000
         B     @DE00085                                            0085 00142000
@DL00085 DS    0H                                                  0086 00143000
*             MACLEN=MACLEN+1;      /* KEEP COUNT OF CHAR            */ 00144000
         LA    @10,1                                               0086 00145000
         ALR   MACLEN,@10                                          0086 00146000
*             SCANPTR=SCANPTR+1;    /* ADVANCE PTR                   */ 00147000
         ALR   SCANPTR,@10                                         0087 00148000
*           END;                                                   0088 00149000
@DE00085 CLI   CHARCOMP(SCANPTR),C' '                              0088 00150000
         BNE   @DL00085                                            0088 00151000
*           BACKPTR=SCANPTR-MACLEN; /* GET PTR TO MACRO IN TEXT      */ 00152000
         LR    BACKPTR,SCANPTR                                     0089 00153000
         SLR   BACKPTR,MACLEN                                      0089 00154000
*           IF MACLEN<=EIGHT THEN   /* MACNAME > 8?                  */ 00155000
         CH    MACLEN,@CH00044                                     0090 00156000
         BH    @RF00090                                            0090 00157000
*             DO;                                                  0091 00158000
*               MLCMACRO(1:MACLEN)=MACOP(1:MACLEN);/* MOVE IN MACRO  */ 00159000
         LR    @07,MACLEN                                          0092 00160000
         BCTR  @07,0                                               0092 00161000
         EX    @07,@SM00224                                        0092 00162000
*               ENTCOUNT=COUNT;     /* PUT # OF ENTRIES IN CTR       */ 00163000
         SLR   ENTCOUNT,ENTCOUNT                                   0093 00164000
         ICM   ENTCOUNT,3,COUNT(TABLEPTR)                          0093 00165000
*               MHTEPTR=TABLEPTR+4; /* SET PTR TO FIRST ENTRY        */ 00166000
         LA    @07,4                                               0094 00167000
         LR    MHTEPTR,TABLEPTR                                    0094 00168000
         ALR   MHTEPTR,@07                                         0094 00169000
*               RCSAVE=4;           /* INDICATE ERROR DO TABLE SEARCH*/ 00170000
         LR    RCSAVE,@07                                          0095 00171000
*               DO WHILE ENTCOUNT¬=0&RCSAVE=4;                     0096 00172000
         B     @DE00096                                            0096 00173000
@DL00096 DS    0H                                                  0097 00174000
*                 IF MLCMACRO=MHTMACRO THEN                        0097 00175000
         CLC   MLCMACRO(8,MLCAPTR),MHTMACRO(MHTEPTR)               0097 00176000
         BNE   @RF00097                                            0097 00177000
*                   DO;                                            0098 00178000
*                     TABPTR=MHTVALUE;/* PUT PTR TO MACRO IN R0      */ 00179000
         L     TABPTR,MHTVALUE(,MHTEPTR)                           0099 00180000
*                     RCSAVE=0;     /* INDICATE NO ERROR             */ 00181000
         SLR   RCSAVE,RCSAVE                                       0100 00182000
*                   END;                                           0101 00183000
*                 ELSE              /* MLCMACRO¬=MHTMACRO,GO ON      */ 00184000
*                   DO;                                            0102 00185000
         B     @RC00097                                            0102 00186000
@RF00097 DS    0H                                                  0103 00187000
*                     ENTCOUNT=ENTCOUNT-1;/* STEP DOWN CTR           */ 00188000
         BCTR  ENTCOUNT,0                                          0103 00189000
*                     MHTEPTR=MHTEPTR+12;/* STEP UP PTR              */ 00190000
         AH    MHTEPTR,@CH00194                                    0104 00191000
*                   END;                                           0105 00192000
*               END;                                               0106 00193000
@RC00097 DS    0H                                                  0106 00194000
@DE00096 LTR   ENTCOUNT,ENTCOUNT                                   0106 00195000
         BZ    @DC00096                                            0106 00196000
         CH    RCSAVE,@CH00065                                     0106 00197000
         BE    @DL00096                                            0106 00198000
@DC00096 DS    0H                                                  0107 00199000
*             END;                                                 0107 00200000
*           ELSE                    /* MACLEN > 8                    */ 00201000
*             DO;                                                  0108 00202000
         B     @RC00090                                            0108 00203000
@RF00090 DS    0H                                                  0109 00204000
*               MLCMACRO(1:8)=MACOP(1:8);/* MOVE IN FIRST 8 CHAR     */ 00205000
         MVC   MLCMACRO(8,MLCAPTR),MACOP(BACKPTR)                  0109 00206000
*               RCSAVE=4;           /* ERROR CONDITION               */ 00207000
         LA    RCSAVE,4                                            0110 00208000
*             END;                                                 0111 00209000
*         END;                                                     0112 00210000
*       ELSE                        /* CHARCOMP = BLANK              */ 00211000
*         RCSAVE=4;                 /* INDICATE ERROR                */ 00212000
         B     @RC00082                                            0113 00213000
@RF00082 LA    RCSAVE,4                                            0113 00214000
*     END;                                                         0114 00215000
*   ELSE                                                           0115 00216000
*     ;                             /* RCSAVE ¬= 0                   */ 00217000
@RF00079 DS    0H                                                  0116 00218000
*   PARMR=SCANPTR+1;                /* SET REG 1 FOR RETURN          */ 00219000
@RC00079 LA    PARMR,1                                             0116 00220000
         ALR   PARMR,SCANPTR                                       0116 00221000
*   SVR15=RCSAVE;                   /* REG 15 IN USERS SAVE AREA     */ 00222000
         ST    RCSAVE,SVR15(,SAVREG)                               0117 00223000
*   SVR0=TABPTR;                    /* REG 0 IN USERS SAVE AREA      */ 00224000
         ST    TABPTR,SVR0(,SAVREG)                                0118 00225000
*   SVR1=PARMR;                     /* REG 1 IN USERS SAVE AREA      */ 00226000
         ST    PARMR,SVR1(,SAVREG)                                 0119 00227000
*   DO;                             /* TPEPILOG                      */ 00228000
*     GEN(PRINT OFF);                                              0121 00229000
         PRINT OFF                                                      00230000
*     GEN(PRINT ON);                                               0122 00231000
         PRINT ON                                                       00232000
*   END;                            /* TPEPILOG                      */ 00233000
*   END ISTSDCC3;                                                  0124 00234000
@EL00001 DS    0H                                                  0124 00235000
@EF00001 DS    0H                                                  0124 00236000
@ER00001 LM    @14,@12,12(@13)                                     0124 00237000
         BR    @14                                                 0124 00238000
@DATA    DS    0H                                                       00239000
@CH00063 DC    H'1'                                                     00240000
@CH00065 DC    H'4'                                                     00241000
@CH00044 DC    H'8'                                                     00242000
@CH00194 DC    H'12'                                                    00243000
@SM00222 MVC   MLCNAME(0,MLCAPTR),TEXTBUF(SCANPTR)                      00244000
@SM00224 MVC   MLCMACRO(0,MLCAPTR),MACOP(BACKPTR)                       00245000
@DATD    DSECT                                                          00246000
         DS    0F                                                       00247000
ISTSDCC3 CSECT                                                          00248000
         DS    0F                                                       00249000
@DATD    DSECT                                                          00250000
         DS    0D                                                       00251000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00252000
@ENDDATD EQU   *                                                        00253000
ISTSDCC3 CSECT                                                          00254000
         DS    0F                                                       00255000
@SIZDATD DC    AL1(0)                                                   00256000
         DC    AL3(@ENDDATD-@DATD)                                      00257000
         DS    0D                                                       00258000
TTABLE1  DS    CL256                                                    00259000
         ORG   TTABLE1                                                  00260000
TTAB1    DC    91CL1'X'                                                 00261000
         DC    X'00'                                                    00262000
         DC    31CL1'X'                                                 00263000
         DC    2X'00'                                                   00264000
         DC    68CL1'X'                                                 00265000
         DC    9X'00'                                                   00266000
         DC    7CL1'X'                                                  00267000
         DC    9X'00'                                                   00268000
         DC    8CL1'X'                                                  00269000
         DC    8X'00'                                                   00270000
         DC    22CL1'X'                                                 00271000
         ORG   TTABLE1+256                                              00272000
TTABLE2  DS    CL256                                                    00273000
         ORG   TTABLE2                                                  00274000
TTAB2    DC    64CL1'X'                                                 00275000
         DC    X'01'                                                    00276000
         DC    26CL1'X'                                                 00277000
         DC    X'00'                                                    00278000
         DC    31CL1'X'                                                 00279000
         DC    2X'00'                                                   00280000
         DC    68CL1'X'                                                 00281000
         DC    9X'00'                                                   00282000
         DC    7CL1'X'                                                  00283000
         DC    9X'00'                                                   00284000
         DC    8CL1'X'                                                  00285000
         DC    8X'00'                                                   00286000
         DC    6CL1'X'                                                  00287000
         DC    10X'00'                                                  00288000
         DC    6CL1'x'                                                  00289000
         ORG   TTABLE2+256                                              00290000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00291000
@01      EQU   01                                                       00292000
@02      EQU   02                                                       00293000
@03      EQU   03                                                       00294000
@04      EQU   04                                                       00295000
@05      EQU   05                                                       00296000
@06      EQU   06                                                       00297000
@07      EQU   07                                                       00298000
@08      EQU   08                                                       00299000
@09      EQU   09                                                       00300000
@10      EQU   10                                                       00301000
@11      EQU   11                                                       00302000
@12      EQU   12                                                       00303000
@13      EQU   13                                                       00304000
@14      EQU   14                                                       00305000
@15      EQU   15                                                       00306000
ENTCOUNT EQU   @10                                                      00307000
MHTEPTR  EQU   @09                                                      00308000
BACKPTR  EQU   @09                                                      00309000
MACLEN   EQU   @08                                                      00310000
RCSAVE   EQU   @08                                                      00311000
TWOSAVE  EQU   @08                                                      00312000
PARMSAVE EQU   @10                                                      00313000
NAMELEN  EQU   @09                                                      00314000
SAVREG   EQU   @13                                                      00315000
SCANPTR  EQU   @04                                                      00316000
TABLEPTR EQU   @06                                                      00317000
PARMR    EQU   @01                                                      00318000
MLCAPTR  EQU   @05                                                      00319000
R2       EQU   @02                                                      00320000
TABPTR   EQU   @00                                                      00321000
DATREG   EQU   @11                                                      00322000
ISTTPMPL EQU   0                                                        00323000
ISTMLCA  EQU   0                                                        00324000
MLCSKDCB EQU   ISTMLCA+12                                               00325000
MLCFLAGS EQU   ISTMLCA+16                                               00326000
MLCERBF  EQU   ISTMLCA+28                                               00327000
MLCERBF1 EQU   MLCERBF                                                  00328000
MLCERBF2 EQU   MLCERBF+8                                                00329000
MLCNAME  EQU   MLCERBF2                                                 00330000
MLCMACRO EQU   MLCERBF2+8                                               00331000
MLCERBF3 EQU   MLCERBF+32                                               00332000
MLCPTRS  EQU   ISTMLCA+96                                               00333000
MLCDAT4  EQU   ISTMLCA+596                                              00334000
MLCADSAV EQU   ISTMLCA+652                                              00335000
MLCADDAT EQU   ISTMLCA+724                                              00336000
MLCMHDAT EQU   ISTMLCA+908                                              00337000
MLCWRK1  EQU   ISTMLCA+964                                              00338000
MLCWRK2  EQU   ISTMLCA+1220                                             00339000
MLCOCPRM EQU   MLCWRK2                                                  00340000
MLCWRK3  EQU   ISTMLCA+1284                                             00341000
MLCRDPRM EQU   MLCWRK3                                                  00342000
MLCWRK4  EQU   ISTMLCA+1348                                             00343000
MLCTPMSG EQU   MLCWRK4                                                  00344000
MLCDECB2 EQU   MLCTPMSG+32                                              00345000
MLCAMAP  EQU   ISTMLCA+1412                                             00346000
SVAREA   EQU   0                                                        00347000
SVR15    EQU   SVAREA+16                                                00348000
SVR0     EQU   SVAREA+20                                                00349000
SVR1     EQU   SVAREA+24                                                00350000
CHARCOMP EQU   0                                                        00351000
TEXTBUF  EQU   0                                                        00352000
MACOP    EQU   0                                                        00353000
HEADER   EQU   0                                                        00354000
COUNT    EQU   HEADER                                                   00355000
TABENTRY EQU   0                                                        00356000
MHTMACRO EQU   TABENTRY                                                 00357000
MHTVALUE EQU   TABENTRY+8                                               00358000
MACCHAR  EQU   0                                                        00359000
MACTAB   EQU   0                                                        00360000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00361000
@NM00004 EQU   HEADER+2                                                 00362000
SVR12    EQU   SVAREA+68                                                00363000
SVR11    EQU   SVAREA+64                                                00364000
SVR10    EQU   SVAREA+60                                                00365000
SVR9     EQU   SVAREA+56                                                00366000
SVR8     EQU   SVAREA+52                                                00367000
SVR7     EQU   SVAREA+48                                                00368000
SVR6     EQU   SVAREA+44                                                00369000
SVR5     EQU   SVAREA+40                                                00370000
SVR4     EQU   SVAREA+36                                                00371000
SVR3     EQU   SVAREA+32                                                00372000
SVR2     EQU   SVAREA+28                                                00373000
SVR14    EQU   SVAREA+12                                                00374000
SVLSA    EQU   SVAREA+8                                                 00375000
SVHSA    EQU   SVAREA+4                                                 00376000
SVRSVD   EQU   SVAREA                                                   00377000
@NM00003 EQU   ISTMLCA+1431                                             00378000
MLCBITMP EQU   MLCAMAP                                                  00379000
MLCSTOWL EQU   MLCDECB2                                                 00380000
MLCDECB1 EQU   MLCTPMSG                                                 00381000
MLCLDPRM EQU   MLCRDPRM                                                 00382000
MLCACPRM EQU   MLCOCPRM                                                 00383000
MLCDCB   EQU   MLCWRK1                                                  00384000
MLCERDAT EQU   ISTMLCA+852                                              00385000
MLCERSAV EQU   ISTMLCA+780                                              00386000
MLCARDAT EQU   MLCADDAT                                                 00387000
MLCARSAV EQU   MLCADSAV                                                 00388000
MLCDATRM EQU   MLCDAT4+27                                               00389000
MLCHDRTP EQU   MLCDAT4+26                                               00390000
MLCENTLN EQU   MLCDAT4+24                                               00391000
MLCRLGTH EQU   MLCDAT4+20                                               00392000
MLCKWKTB EQU   MLCDAT4+16                                               00393000
MLCKWDPT EQU   MLCDAT4+12                                               00394000
MLCTBLPT EQU   MLCDAT4+8                                                00395000
MLCRCSAV EQU   MLCDAT4+4                                                00396000
MLCSAV   EQU   MLCDAT4                                                  00397000
MLCSAV4  EQU   ISTMLCA+524                                              00398000
MLCDAT3  EQU   ISTMLCA+468                                              00399000
MLCSAV3  EQU   ISTMLCA+396                                              00400000
MLCDAT2  EQU   ISTMLCA+340                                              00401000
MLCSAV2  EQU   ISTMLCA+268                                              00402000
MLCDAT1  EQU   ISTMLCA+212                                              00403000
MLCSAV1  EQU   ISTMLCA+140                                              00404000
@NM00002 EQU   ISTMLCA+136                                              00405000
MLCNCSPL EQU   MLCPTRS+36                                               00406000
MLCLENT  EQU   MLCPTRS+32                                               00407000
MLCPTR7  EQU   MLCPTRS+28                                               00408000
MLCPTR6  EQU   MLCPTRS+24                                               00409000
MLCPTR5  EQU   MLCPTRS+20                                               00410000
MLCPTR4  EQU   MLCPTRS+16                                               00411000
MLCPTR3  EQU   MLCPTRS+12                                               00412000
MLCPTR2  EQU   MLCPTRS+8                                                00413000
MLCPTR1  EQU   MLCPTRS+4                                                00414000
MLCPTR0  EQU   MLCPTRS                                                  00415000
MLCGETSZ EQU   ISTMLCA+92                                               00416000
MLCFIII  EQU   MLCERBF3+8                                               00417000
MLCCNFG2 EQU   MLCERBF3                                                 00418000
MLCFII   EQU   MLCERBF2+16                                              00419000
MLCCONFG EQU   MLCERBF1                                                 00420000
MLCKWD   EQU   ISTMLCA+24                                               00421000
MLCENT   EQU   ISTMLCA+20                                               00422000
@NM00001 EQU   MLCFLAGS                                                 00423000
MLCSSCFM EQU   MLCFLAGS                                                 00424000
MLCPRE   EQU   MLCFLAGS                                                 00425000
MLCDREOF EQU   MLCFLAGS                                                 00426000
MLCINT   EQU   MLCFLAGS                                                 00427000
MLCVLCON EQU   MLCSKDCB                                                 00428000
MLCSKEL  EQU   ISTMLCA+8                                                00429000
MLCRPH   EQU   ISTMLCA+4                                                00430000
MLCSECCA EQU   ISTMLCA                                                  00431000
TPMPLMOD EQU   ISTTPMPL+28                                              00432000
TPMPLTLN EQU   ISTTPMPL+26                                              00433000
TPMPLRLN EQU   ISTTPMPL+24                                              00434000
TPMPLTPT EQU   ISTTPMPL+20                                              00435000
TPMPLCID EQU   ISTTPMPL+16                                              00436000
TPMPLTXT EQU   ISTTPMPL+12                                              00437000
TPMPLRNF EQU   ISTTPMPL+8                                               00438000
TPMPLRBA EQU   ISTTPMPL+4                                               00439000
TPMPLMID EQU   ISTTPMPL                                                 00440000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00441000
@RC00051 EQU   @RC00044                                                 00442000
@RC00082 EQU   @RC00079                                                 00443000
@RC00059 EQU   @RC00051                                                 00444000
@RC00090 EQU   @RC00082                                                 00445000
@RC00063 EQU   @RC00059                                                 00446000
@ENDDATA EQU   *                                                        00447000
         END   ISTSDCC3,(C'PLS2156',0702,80232)                         00448000
./  ADD  SSI=02320577,NAME=ISTSDCC4
         TITLE 'ISTSDCC4-EBCHEX'                                        00001000
ISTSDCC4 CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTSDCC4  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00009000
         BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         PRINT OFF                                                      00013000
         PRINT ON                                                       00014000
         USING @DATD,DATREG                                             00015000
*   DATREG=ADDR(RNCDAT3);           /* RNCDAT3 TEMPORARY MUST BE   0225 00016000
*                                      CHANGED BEFORE RELEASE        */ 00017000
         LA    DATREG,RNCDAT3(,RNCAREG)                            0225 00018000
*   WORKBUF=BLANK;                  /* BLANK THE WORKBUF             */ 00019000
         MVI   WORKBUF+1,C' '                                      0226 00020000
         MVC   WORKBUF+2(39),WORKBUF+1                             0226 00021000
         MVI   WORKBUF,C' '                                        0226 00022000
*   IF R0>0&R0<41 THEN              /* IS STRING LENGTH >0 & <41     */ 00023000
         LTR   R0,R0                                               0227 00024000
         BNP   @RF00227                                            0227 00025000
         CH    R0,@CH01350                                         0227 00026000
         BNL   @RF00227                                            0227 00027000
*     DO;                                                          0228 00028000
*       RLENGTH=R0;                 /* YES PUT LENGTH IN RLENGTH     */ 00029000
         LR    RLENGTH,R0                                          0229 00030000
*       TOPTR=ADDR(WORKBUF)+40-RLENGTH;/* SET TO PTR FOR MOVE        */ 00031000
         LA    TOPTR,WORKBUF                                       0230 00032000
         AH    TOPTR,@CH00283                                      0230 00033000
         SLR   TOPTR,RLENGTH                                       0230 00034000
*       WRKCHR(1:RLENGTH)=STRING(1:RLENGTH);/* MOVE STRING TO WRKBF  */ 00035000
         LR    @14,RLENGTH                                         0231 00036000
         BCTR  @14,0                                               0231 00037000
         EX    @14,@SM01395                                        0231 00038000
*       PARMSAVE=PARMR;             /* SAVE REG 1 OVER TRT           */ 00039000
         LR    PARMSAVE,PARMR                                      0232 00040000
*       PARMR=0;                    /* ZERO OUT REG 1                */ 00041000
         SLR   PARMR,PARMR                                         0233 00042000
*       TRT(WORKBUF,TTABLE);        /* CHECK VALIDITY                */ 00043000
         TRT   WORKBUF(41),TTABLE                                  0234 00044000
*       IF PARMR=0 THEN             /* TRT WENT O.K.?                */ 00045000
         LTR   PARMR,PARMR                                         0235 00046000
         BNZ   @RF00235                                            0235 00047000
*         DO;                       /* YES, GO ON                    */ 00048000
*           TR(WORKBUF,TTABLE2);    /* TRANSLATE CHARACTERS          */ 00049000
         TR    WORKBUF(41),TTABLE2                                 0237 00050000
*           PACK(WRK3,STR3);        /* PACK STRING                   */ 00051000
         PACK  WRK3(8),STR3(15)                                    0238 00052000
*           PACK(WRK2,STR2);                                       0239 00053000
         PACK  WRK2(8),STR2(15)                                    0239 00054000
*           PACK(WRK1,STR1);                                       0240 00055000
         PACK  WRK1(7),STR1(13)                                    0240 00056000
*           SLIDE2=WRK2(1:7);       /* MOVE PACKED STRING TOGETHER   */ 00057000
         MVC   SLIDE2(7),WRK2                                      0241 00058000
*           SLIDE1=WRK1(1:6);                                      0242 00059000
         MVC   SLIDE1(6),WRK1                                      0242 00060000
*           RLENGTH=(RLENGTH+1)/2;  /* GET LENGTH OF PACKED STRING   */ 00061000
         LA    @02,1                                               0243 00062000
         ALR   @02,RLENGTH                                         0243 00063000
         SRDA  @02,32                                              0243 00064000
         D     @02,@CF00228                                        0243 00065000
         LR    RLENGTH,@03                                         0243 00066000
*           FROMPTR=ADDR(WORKBUF)+40-RLENGTH;/* SET PTR FOR MOVE     */ 00067000
         LA    FROMPTR,WORKBUF                                     0244 00068000
         AH    FROMPTR,@CH00283                                    0244 00069000
         SLR   FROMPTR,RLENGTH                                     0244 00070000
*           PARMR=PARMSAVE;         /* RESTORE REG 1                 */ 00071000
         LR    PARMR,PARMSAVE                                      0245 00072000
*           STRING(1:RLENGTH)=HEXSTRNG(1:RLENGTH);/* MOVE IN STRG    */ 00073000
         LR    @14,RLENGTH                                         0246 00074000
         BCTR  @14,0                                               0246 00075000
         EX    @14,@SM01397                                        0246 00076000
*           R0=RLENGTH;             /* SET R0 FOR RETURN             */ 00077000
         LR    R0,RLENGTH                                          0247 00078000
*           RC=0;                   /* SET RETURN CODE               */ 00079000
         SLR   RC,RC                                               0248 00080000
*         END;                                                     0249 00081000
*       ELSE                        /* PARMR NOT = 0                 */ 00082000
*         DO;                                                      0250 00083000
         B     @RC00235                                            0250 00084000
@RF00235 DS    0H                                                  0251 00085000
*           RC=4;                   /* NOTE ERROR CONDITION          */ 00086000
         LA    RC,4                                                0251 00087000
*         END;                                                     0252 00088000
*     END;                                                         0253 00089000
*   ELSE                            /* STRNG LENGTH 0 OR > 41        */ 00090000
*     DO;                                                          0254 00091000
         B     @RC00227                                            0254 00092000
@RF00227 DS    0H                                                  0255 00093000
*       RC=4;                       /* ERROR CONDITION               */ 00094000
         LA    RC,4                                                0255 00095000
*     END;                                                         0256 00096000
*   SVR0=R0;                        /* PUT R0 IN CALLERS SAVEAREA    */ 00097000
@RC00227 ST    R0,SVR0(,SAVREG)                                    0257 00098000
*   SVR15=RC;                       /* PUT RC IN CALLERS SAVEAREA    */ 00099000
         ST    RC,SVR15(,SAVREG)                                   0258 00100000
*   RETURN;                                                        0259 00101000
@EL00001 DS    0H                                                  0259 00102000
@EF00001 DS    0H                                                  0259 00103000
@ER00001 LM    @14,@12,12(@13)                                     0259 00104000
         BR    @14                                                 0259 00105000
*   DO;                             /* TPEPILOG                      */ 00106000
*     GEN(PRINT OFF);                                              0261 00107000
         PRINT OFF                                                      00108000
*     GEN(PRINT ON);                                               0262 00109000
         PRINT ON                                                       00110000
*   END;                            /* TPEPILOG                      */ 00111000
*   END ISTSDCC4;                                                  0264 00112000
         B     @EL00001                                            0264 00113000
@DATA    DS    0H                                                       00114000
@CH00283 DC    H'40'                                                    00115000
@CH01350 DC    H'41'                                                    00116000
@SM01395 MVC   WRKCHR(0,TOPTR),STRING(PARMR)                            00117000
@SM01397 MVC   STRING(0,PARMR),HEXSTRNG(FROMPTR)                        00118000
@DATD    DSECT                                                          00119000
         DS    0F                                                       00120000
ISTSDCC4 CSECT                                                          00121000
         DS    0F                                                       00122000
@CF00228 DC    F'2'                                                     00123000
@DATD    DSECT                                                          00124000
         DS    0D                                                       00125000
TWOSAVE  DS    F                                                        00126000
I        DS    H                                                        00127000
WORKBUF  DS    CL41                                                     00128000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00129000
@ENDDATD EQU   *                                                        00130000
ISTSDCC4 CSECT                                                          00131000
         DS    0F                                                       00132000
@SIZDATD DC    AL1(0)                                                   00133000
         DC    AL3(@ENDDATD-@DATD)                                      00134000
         DS    0D                                                       00135000
TTABLE   DS    CL256                                                    00136000
         ORG   TTABLE                                                   00137000
TAB      DC    64CL1'X'                                                 00138000
         DC    X'00'                                                    00139000
         DC    128CL1'X'                                                00140000
         DC    6X'00'                                                   00141000
         DC    41CL1'X'                                                 00142000
         DC    10X'00'                                                  00143000
         DC    6CL1'X'                                                  00144000
         ORG   TTABLE+256                                               00145000
TTABLE2  DS    CL256                                                    00146000
         ORG   TTABLE2                                                  00147000
TAB2     DC    64CL1'X'                                                 00148000
         DC    X'40'                                                    00149000
         DC    128CL1'X'                                                00150000
         DC    X'0A'                                                    00151000
         DC    X'0B'                                                    00152000
         DC    X'0C'                                                    00153000
         DC    X'0D'                                                    00154000
         DC    X'0E'                                                    00155000
         DC    X'0F'                                                    00156000
         DC    41CL1'X'                                                 00157000
         DC    X'F0'                                                    00158000
         DC    X'F1'                                                    00159000
         DC    X'F2'                                                    00160000
         DC    X'F3'                                                    00161000
         DC    X'F4'                                                    00162000
         DC    X'F5'                                                    00163000
         DC    X'F6'                                                    00164000
         DC    X'F7'                                                    00165000
         DC    X'F8'                                                    00166000
         DC    X'F9'                                                    00167000
         DC    6CL1'X'                                                  00168000
         ORG   TTABLE2+256                                              00169000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00170000
@01      EQU   01                                                       00171000
@02      EQU   02                                                       00172000
@03      EQU   03                                                       00173000
@04      EQU   04                                                       00174000
@05      EQU   05                                                       00175000
@06      EQU   06                                                       00176000
@07      EQU   07                                                       00177000
@08      EQU   08                                                       00178000
@09      EQU   09                                                       00179000
@10      EQU   10                                                       00180000
@11      EQU   11                                                       00181000
@12      EQU   12                                                       00182000
@13      EQU   13                                                       00183000
@14      EQU   14                                                       00184000
@15      EQU   15                                                       00185000
RLENGTH  EQU   @08                                                      00186000
PARMSAVE EQU   @09                                                      00187000
SAVREG   EQU   @13                                                      00188000
DATREG   EQU   @11                                                      00189000
RC       EQU   @15                                                      00190000
RNCAREG  EQU   @06                                                      00191000
R0       EQU   @00                                                      00192000
TOPTR    EQU   @04                                                      00193000
FROMPTR  EQU   @05                                                      00194000
PARMR    EQU   @01                                                      00195000
ISTDEVCH EQU   0                                                        00196000
DEVSHCH  EQU   ISTDEVCH                                                 00197000
DEVCHAR  EQU   DEVSHCH                                                  00198000
DEVTCODE EQU   ISTDEVCH+1                                               00199000
DEVFLAGS EQU   ISTDEVCH+3                                               00200000
DEVFCCTL EQU   DEVFLAGS                                                 00201000
DEVCHAR3 EQU   DEVFLAGS                                                 00202000
DEVMODE  EQU   ISTDEVCH+5                                               00203000
ISTSRT   EQU   0                                                        00204000
SRTSRTE  EQU   ISTSRT+8                                                 00205000
SRTXTNBS EQU   ISTSRT+13                                                00206000
ISTLOK   EQU   0                                                        00207000
LOKCHN   EQU   ISTLOK+1                                                 00208000
LOKCHNG  EQU   LOKCHN                                                   00209000
@NM00003 EQU   LOKCHNG+2                                                00210000
ISTRPRE  EQU   0                                                        00211000
RPRSRTHD EQU   ISTRPRE                                                  00212000
RPRDAFID EQU   ISTRPRE+16                                               00213000
RPRSTATE EQU   ISTRPRE+56                                               00214000
RPRCURST EQU   RPRSTATE                                                 00215000
RPRDESST EQU   RPRSTATE+2                                               00216000
RPRBITAN EQU   ISTRPRE+61                                               00217000
RPRFLAGS EQU   ISTRPRE+66                                               00218000
ISTRCPRE EQU   0                                                        00219000
RCPSARRY EQU   ISTRCPRE+84                                              00220000
RCPPACE  EQU   ISTRCPRE+108                                             00221000
RCPNCPPC EQU   ISTRCPRE+110                                             00222000
RCPPMODE EQU   ISTRCPRE+113                                             00223000
RCPCYMOD EQU   RCPPMODE                                                 00224000
RCPCYSET EQU   RCPPMODE                                                 00225000
RCPSESSM EQU   ISTRCPRE+115                                             00226000
RCPBITAN EQU   ISTRCPRE+116                                             00227000
ISTRAP   EQU   0                                                        00228000
RAPBITAN EQU   ISTRAP+165                                               00229000
ISTRDT   EQU   0                                                        00230000
RDTPLEN  EQU   ISTRDT+84                                                00231000
RDTPRIOR EQU   RDTPLEN                                                  00232000
RDTBITAN EQU   ISTRDT+113                                               00233000
RDTCRIA  EQU   ISTRDT+116                                               00234000
ISTRLN   EQU   0                                                        00235000
RLNADR   EQU   ISTRLN+84                                                00236000
RLNFLAG  EQU   RLNADR                                                   00237000
RLNUCBAD EQU   RLNADR+1                                                 00238000
RLNCSLRC EQU   ISTRLN+104                                               00239000
RLNBITAN EQU   ISTRLN+112                                               00240000
RLNRACNT EQU   RLNBITAN                                                 00241000
RLNCONCT EQU   RLNBITAN+2                                               00242000
RLNLSCMD EQU   RLNBITAN+3                                               00243000
RLNINBFR EQU   ISTRLN+132                                               00244000
ISTRPU   EQU   0                                                        00245000
RPUSTAID EQU   ISTRPU+92                                                00246000
RPUID48  EQU   RPUSTAID+2                                               00247000
ISTRAPRE EQU   0                                                        00248000
ISTRTR   EQU   0                                                        00249000
RTRADR   EQU   ISTRTR+144                                               00250000
RTRFLAG  EQU   RTRADR                                                   00251000
RTRBITAN EQU   ISTRTR+164                                               00252000
RTRRAALL EQU   RTRBITAN                                                 00253000
RTRBSCID EQU   ISTRTR+171                                               00254000
ISTRSW   EQU   0                                                        00255000
ISTRRN   EQU   0                                                        00256000
RRNADR   EQU   ISTRRN+136                                               00257000
RRNFLAG  EQU   RRNADR                                                   00258000
RRNUCBAD EQU   RRNADR+1                                                 00259000
RRNHPRE  EQU   ISTRRN+196                                               00260000
RRNBITAN EQU   ISTRRN+201                                               00261000
RRNLVL   EQU   ISTRRN+204                                               00262000
RRNNMDPD EQU   ISTRRN+232                                               00263000
RRNLDFSM EQU   ISTRRN+298                                               00264000
ISTRPX   EQU   0                                                        00265000
ISTRPT   EQU   0                                                        00266000
RPTXTCID EQU   ISTRPT+136                                               00267000
RPTLNCID EQU   RPTXTCID                                                 00268000
RPTDITT  EQU   ISTRPT+144                                               00269000
RPTBITAN EQU   ISTRPT+166                                               00270000
ISTRLX   EQU   0                                                        00271000
RLXBITAN EQU   ISTRLX+92                                                00272000
ISTRLU   EQU   0                                                        00273000
RLUBITAN EQU   ISTRLU+146                                               00274000
ISTRLS   EQU   0                                                        00275000
ISTRLC   EQU   0                                                        00276000
RLCADR   EQU   ISTRLC+84                                                00277000
RLCFLAG  EQU   RLCADR                                                   00278000
ISTRIN   EQU   0                                                        00279000
RINDAFID EQU   ISTRIN+124                                               00280000
RINBITAN EQU   ISTRIN+130                                               00281000
RINFLAGS EQU   ISTRIN+149                                               00282000
ISTRGP   EQU   0                                                        00283000
RGPBITAN EQU   ISTRGP+94                                                00284000
ISTRDS   EQU   0                                                        00285000
ISTRDA   EQU   0                                                        00286000
ISTRCL   EQU   0                                                        00287000
RCLADR   EQU   ISTRCL+84                                                00288000
RCLFLAG  EQU   RCLADR                                                   00289000
ISTRCDRS EQU   0                                                        00290000
@NM00109 EQU   ISTRCDRS+166                                             00291000
ISTRCDRM EQU   0                                                        00292000
RCDRMPDN EQU   ISTRCDRM+188                                             00293000
RCDRMRPQ EQU   ISTRCDRM+196                                             00294000
RCDRMFGS EQU   ISTRCDRM+208                                             00295000
ISTRCC   EQU   0                                                        00296000
RCCBITAN EQU   ISTRCC+105                                               00297000
ISTPAT   EQU   0                                                        00298000
PATFLAGA EQU   ISTPAT+7                                                 00299000
ISTGNT   EQU   0                                                        00300000
ISTDOT   EQU   0                                                        00301000
ISTDNT   EQU   0                                                        00302000
DNTTELNO EQU   ISTDNT+1                                                 00303000
ISTRNCA  EQU   0                                                        00304000
RNCLPNM  EQU   ISTRNCA+116                                              00305000
@NM00137 EQU   RNCLPNM+4                                                00306000
RNCDAT3  EQU   ISTRNCA+468                                              00307000
RNCWORK1 EQU   ISTRNCA+524                                              00308000
RNCPHR1  EQU   RNCWORK1                                                 00309000
RNCWORK2 EQU   ISTRNCA+2572                                             00310000
RNCPHR2  EQU   RNCWORK2                                                 00311000
RNCWORK3 EQU   ISTRNCA+4620                                             00312000
RNCRNMDL EQU   ISTRNCA+7564                                             00313000
RNCTRMDL EQU   RNCRNMDL                                                 00314000
RNCLNMDL EQU   RNCTRMDL                                                 00315000
RNCSWMDL EQU   RNCLNMDL                                                 00316000
RNCLSMDL EQU   RNCSWMDL                                                 00317000
RNCDAMDL EQU   RNCLSMDL                                                 00318000
RNCCLMDL EQU   RNCDAMDL                                                 00319000
RNCCMMDL EQU   ISTRNCA+7896                                             00320000
RNCLUMDL EQU   RNCCMMDL                                                 00321000
RNCINMDL EQU   RNCLUMDL                                                 00322000
RNCCCMDL EQU   RNCINMDL                                                 00323000
RNCGPMDL EQU   RNCCCMDL                                                 00324000
RNCPXMDL EQU   RNCGPMDL                                                 00325000
ISTLCST  EQU   0                                                        00326000
LCSTTYPE EQU   ISTLCST+12                                               00327000
LCSTACR  EQU   ISTLCST+18                                               00328000
ISTDITHD EQU   0                                                        00329000
ISTDHDVI EQU   0                                                        00330000
DHDDIVTH EQU   ISTDHDVI+12                                              00331000
ISTDDTVI EQU   0                                                        00332000
ISTRNCDT EQU   0                                                        00333000
ISTRNCGT EQU   0                                                        00334000
ISTRNCPT EQU   0                                                        00335000
SVAREA   EQU   0                                                        00336000
SVR15    EQU   SVAREA+16                                                00337000
SVR0     EQU   SVAREA+20                                                00338000
WRKCHR   EQU   0                                                        00339000
STRING   EQU   0                                                        00340000
HEXSTRNG EQU   0                                                        00341000
SRTXTNSN EQU   SRTXTNBS                                                 00342000
STR1     EQU   WORKBUF                                                  00343000
STR2     EQU   WORKBUF+12                                               00344000
STR3     EQU   WORKBUF+26                                               00345000
WRK1     EQU   WORKBUF+6                                                00346000
WRK2     EQU   WORKBUF+19                                               00347000
WRK3     EQU   WORKBUF+33                                               00348000
SLIDE1   EQU   WORKBUF+20                                               00349000
SLIDE2   EQU   WORKBUF+26                                               00350000
RCPSIBQ  EQU   RCPSARRY                                                 00351000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00352000
SRTDATA  EQU   SRTXTNSN+3                                               00353000
SRTUSELN EQU   SRTXTNSN+1                                               00354000
SRTFLAGS EQU   SRTXTNSN                                                 00355000
SVR12    EQU   SVAREA+68                                                00356000
SVR11    EQU   SVAREA+64                                                00357000
SVR10    EQU   SVAREA+60                                                00358000
SVR9     EQU   SVAREA+56                                                00359000
SVR8     EQU   SVAREA+52                                                00360000
SVR7     EQU   SVAREA+48                                                00361000
SVR6     EQU   SVAREA+44                                                00362000
SVR5     EQU   SVAREA+40                                                00363000
SVR4     EQU   SVAREA+36                                                00364000
SVR3     EQU   SVAREA+32                                                00365000
SVR2     EQU   SVAREA+28                                                00366000
SVR1     EQU   SVAREA+24                                                00367000
SVR14    EQU   SVAREA+12                                                00368000
SVLSA    EQU   SVAREA+8                                                 00369000
SVHSA    EQU   SVAREA+4                                                 00370000
SVRSVD   EQU   SVAREA                                                   00371000
RNCPT    EQU   ISTRNCPT+4                                               00372000
RNCPTLN  EQU   ISTRNCPT                                                 00373000
RNCGT    EQU   ISTRNCGT+4                                               00374000
RNCGTLN  EQU   ISTRNCGT                                                 00375000
RNCDT    EQU   ISTRNCDT+4                                               00376000
RNCDTLN  EQU   ISTRNCDT                                                 00377000
DDTASSOC EQU   ISTDDTVI+40                                              00378000
DDTRDTPT EQU   ISTDDTVI+36                                              00379000
DDTTRNM  EQU   ISTDDTVI+28                                              00380000
DDTBSCLN EQU   ISTDDTVI+27                                              00381000
DDTBSCID EQU   ISTDDTVI+4                                               00382000
DDTFWPTR EQU   ISTDDTVI                                                 00383000
DHDGPPTR EQU   ISTDHDVI+32                                              00384000
DHDDVOFF EQU   ISTDHDVI+28                                              00385000
DHDDTPTR EQU   ISTDHDVI+24                                              00386000
DHDDHPTR EQU   ISTDHDVI+20                                              00387000
DHDRSVD  EQU   DHDDIVTH+6                                               00388000
DHDIDLEN EQU   DHDDIVTH+4                                               00389000
DHDNUMFE EQU   DHDDIVTH+2                                               00390000
DHDNUME  EQU   DHDDIVTH                                                 00391000
DHDHNAME EQU   ISTDHDVI+4                                               00392000
DHDFWPTR EQU   ISTDHDVI                                                 00393000
DITDITT  EQU   ISTDITHD+16                                              00394000
DITLEN   EQU   ISTDITHD+15                                              00395000
DITUNUSD EQU   ISTDITHD+12                                              00396000
DITLSTNM EQU   ISTDITHD+4                                               00397000
DITFWDPT EQU   ISTDITHD                                                 00398000
LCSTRESV EQU   ISTLCST+19                                               00399000
LCSTACR3 EQU   LCSTACR                                                  00400000
LCSTACR2 EQU   LCSTACR                                                  00401000
LCSTACR1 EQU   LCSTACR                                                  00402000
LCSTACR0 EQU   LCSTACR                                                  00403000
LCSTLCCD EQU   LCSTTYPE+5                                               00404000
LCSTLCTP EQU   LCSTTYPE                                                 00405000
LCSTNAME EQU   ISTLCST+4                                                00406000
LCSTFWDP EQU   ISTLCST                                                  00407000
RNCEND   EQU   ISTRNCA+8104                                             00408000
RNCLXMDL EQU   RNCPXMDL                                                 00409000
RNCDSMDL EQU   RNCCLMDL                                                 00410000
RNCLNEO  EQU   ISTRNCA+7560                                             00411000
RNCRRT   EQU   ISTRNCA+7556                                             00412000
RNCRRTNM EQU   ISTRNCA+7552                                             00413000
RNCPTRAL EQU   ISTRNCA+7548                                             00414000
RNCPTRAF EQU   ISTRNCA+7544                                             00415000
RNCCCLU  EQU   ISTRNCA+7392                                             00416000
RNCCLTR  EQU   ISTRNCA+7184                                             00417000
RNCLNLU  EQU   ISTRNCA+7032                                             00418000
RNCLNTR  EQU   ISTRNCA+6824                                             00419000
RNCLNPX  EQU   ISTRNCA+6728                                             00420000
RNCLNCC  EQU   ISTRNCA+6596                                             00421000
RNCLNCL  EQU   ISTRNCA+6496                                             00422000
RNCGPLU  EQU   ISTRNCA+6344                                             00423000
RNCGPTR  EQU   ISTRNCA+6136                                             00424000
RNCGPPX  EQU   ISTRNCA+6040                                             00425000
RNCGPCC  EQU   ISTRNCA+5908                                             00426000
RNCGPCL  EQU   ISTRNCA+5808                                             00427000
RNCGPLN  EQU   ISTRNCA+5632                                             00428000
RNCLUDEF EQU   ISTRNCA+5480                                             00429000
RNCTRDEF EQU   ISTRNCA+5272                                             00430000
RNCPXDEF EQU   ISTRNCA+5176                                             00431000
RNCCCDEF EQU   ISTRNCA+5044                                             00432000
RNCCLDEF EQU   ISTRNCA+4944                                             00433000
RNCLNDEF EQU   ISTRNCA+4768                                             00434000
RNCOWSIF EQU   ISTRNCA+4760                                             00435000
RNCOWNER EQU   ISTRNCA+4752                                             00436000
RNCDRPCT EQU   ISTRNCA+4750                                             00437000
RNCDRLCT EQU   ISTRNCA+4748                                             00438000
RNCWORK4 EQU   ISTRNCA+4684                                             00439000
RNCLDPRM EQU   RNCWORK3                                                 00440000
RNCOCPRM EQU   RNCPHR2                                                  00441000
RNCLMDCB EQU   RNCPHR1                                                  00442000
RNCSAV3  EQU   ISTRNCA+396                                              00443000
RNCDAT2  EQU   ISTRNCA+340                                              00444000
RNCSAV2  EQU   ISTRNCA+268                                              00445000
RNCDAT1  EQU   ISTRNCA+212                                              00446000
RNCSAV1  EQU   ISTRNCA+140                                              00447000
@NM00141 EQU   ISTRNCA+136                                              00448000
@NM00140 EQU   ISTRNCA+132                                              00449000
RNCPFLG  EQU   ISTRNCA+132                                              00450000
RNCREPTO EQU   ISTRNCA+132                                              00451000
RNCACTIV EQU   ISTRNCA+132                                              00452000
RNCGICA  EQU   ISTRNCA+131                                              00453000
RNCNOBSC EQU   ISTRNCA+131                                              00454000
RNCGSYSC EQU   ISTRNCA+131                                              00455000
RNCCAMBH EQU   ISTRNCA+131                                              00456000
RNCENCR  EQU   ISTRNCA+131                                              00457000
RNCBKUP  EQU   ISTRNCA+131                                              00458000
RNCTBFR  EQU   ISTRNCA+131                                              00459000
RNCGPUIN EQU   ISTRNCA+131                                              00460000
RNCGVB   EQU   ISTRNCA+130                                              00461000
RNCGLSBD EQU   ISTRNCA+130                                              00462000
RNCGSWBD EQU   ISTRNCA+130                                              00463000
RNCGRNBD EQU   ISTRNCA+130                                              00464000
RNCGCLPU EQU   ISTRNCA+130                                              00465000
RNCGANS  EQU   ISTRNCA+130                                              00466000
RNCGINOD EQU   ISTRNCA+130                                              00467000
RNCGCUA  EQU   ISTRNCA+130                                              00468000
RNCGRNAM EQU   ISTRNCA+129                                              00469000
RNCGDLLN EQU   ISTRNCA+129                                              00470000
RNCGRGAP EQU   ISTRNCA+129                                              00471000
RNCLNID  EQU   ISTRNCA+129                                              00472000
RNCGPID  EQU   ISTRNCA+129                                              00473000
RNCLNOW  EQU   ISTRNCA+129                                              00474000
RNCGNOW  EQU   ISTRNCA+129                                              00475000
RNCLQUE  EQU   ISTRNCA+129                                              00476000
RNCDTYPE EQU   ISTRNCA+128                                              00477000
RNCGQUE  EQU   ISTRNCA+127                                              00478000
RNCGVSEQ EQU   ISTRNCA+127                                              00479000
RNCGTWX  EQU   ISTRNCA+127                                              00480000
RNCGCTRM EQU   ISTRNCA+127                                              00481000
RNCGSTBH EQU   ISTRNCA+127                                              00482000
RNCGCOMP EQU   ISTRNCA+127                                              00483000
RNCGLU   EQU   ISTRNCA+127                                              00484000
RNCGTERM EQU   ISTRNCA+127                                              00485000
RNCGPA   EQU   ISTRNCA+126                                              00486000
RNCGPU   EQU   ISTRNCA+126                                              00487000
RNCGCLUS EQU   ISTRNCA+126                                              00488000
RNCGLINE EQU   ISTRNCA+126                                              00489000
RNCGGRP  EQU   ISTRNCA+126                                              00490000
RNCGHOST EQU   ISTRNCA+126                                              00491000
RNCGBLD  EQU   ISTRNCA+126                                              00492000
RNCGPCCU EQU   ISTRNCA+126                                              00493000
RNCLPCT  EQU   ISTRNCA+124                                              00494000
RNCNODCT EQU   RNCLPNM+6                                                00495000
@NM00139 EQU   @NM00137+1                                               00496000
@NM00138 EQU   @NM00137+1                                               00497000
RNCGPOLL EQU   @NM00137+1                                               00498000
RNCGRRT  EQU   @NM00137+1                                               00499000
RNCINHIB EQU   @NM00137+1                                               00500000
RNCPULU  EQU   @NM00137+1                                               00501000
RNCCLNS  EQU   @NM00137+1                                               00502000
RNCLNNS  EQU   @NM00137+1                                               00503000
RNCGPNS  EQU   @NM00137                                                 00504000
RNCGBLDR EQU   @NM00137                                                 00505000
RNCPCOWN EQU   @NM00137                                                 00506000
RNCPCSUB EQU   @NM00137                                                 00507000
RNCPCFTP EQU   @NM00137                                                 00508000
RNCSUBAR EQU   @NM00137                                                 00509000
RNCLR    EQU   @NM00137                                                 00510000
RNCSKIP  EQU   @NM00137                                                 00511000
RNCLPNMP EQU   RNCLPNM                                                  00512000
RNCDIVT  EQU   ISTRNCA+112                                              00513000
RNCDITT  EQU   ISTRNCA+108                                              00514000
RNCLCST  EQU   ISTRNCA+104                                              00515000
RNCLWS   EQU   ISTRNCA+100                                              00516000
RNCFWS   EQU   ISTRNCA+96                                               00517000
RNCOFFS2 EQU   ISTRNCA+92                                               00518000
RNCOFFST EQU   ISTRNCA+88                                               00519000
RNCLTBLS EQU   ISTRNCA+84                                               00520000
RNCFTBLS EQU   ISTRNCA+80                                               00521000
RNCLENT  EQU   ISTRNCA+76                                               00522000
RNCFENT  EQU   ISTRNCA+72                                               00523000
RNCLRNLL EQU   ISTRNCA+68                                               00524000
RNCFRNLL EQU   ISTRNCA+64                                               00525000
RNCPX    EQU   ISTRNCA+60                                               00526000
RNCDA    EQU   ISTRNCA+56                                               00527000
RNCLLN   EQU   ISTRNCA+52                                               00528000
RNCCM    EQU   ISTRNCA+48                                               00529000
RNCIN    EQU   ISTRNCA+44                                               00530000
RNCLU    EQU   ISTRNCA+40                                               00531000
RNCTR    EQU   ISTRNCA+36                                               00532000
RNCCC    EQU   ISTRNCA+32                                               00533000
RNCCL    EQU   ISTRNCA+28                                               00534000
RNCLN    EQU   ISTRNCA+24                                               00535000
RNCGP    EQU   ISTRNCA+20                                               00536000
RNCDS    EQU   ISTRNCA+16                                               00537000
RNCSWLS  EQU   ISTRNCA+12                                               00538000
RNCRN    EQU   ISTRNCA+8                                                00539000
RNCTABNM EQU   ISTRNCA+4                                                00540000
RNCSFXCT EQU   ISTRNCA+2                                                00541000
@NM00136 EQU   ISTRNCA+1                                                00542000
RNCID    EQU   ISTRNCA                                                  00543000
DNTNAME  EQU   DNTTELNO                                                 00544000
DNTCTDIG EQU   ISTDNT                                                   00545000
DOTADTRM EQU   ISTDOT                                                   00546000
GNTGRPNM EQU   ISTGNT                                                   00547000
@NM00135 EQU   PATFLAGA                                                 00548000
@NM00134 EQU   PATFLAGA                                                 00549000
@NM00133 EQU   PATFLAGA                                                 00550000
@NM00132 EQU   PATFLAGA                                                 00551000
@NM00131 EQU   PATFLAGA                                                 00552000
@NM00130 EQU   PATFLAGA                                                 00553000
PATDCALL EQU   PATFLAGA                                                 00554000
PATUSEFG EQU   PATFLAGA                                                 00555000
PATRDCNT EQU   ISTPAT+6                                                 00556000
PATGRPID EQU   ISTPAT+5                                                 00557000
PATPTHID EQU   ISTPAT+4                                                 00558000
PATDINDX EQU   ISTPAT+2                                                 00559000
PATGINDX EQU   ISTPAT                                                   00560000
RCCEND   EQU   ISTRCC+132                                               00561000
@NM00129 EQU   ISTRCC+130                                               00562000
RCCSESCT EQU   ISTRCC+129                                               00563000
RCCCNCNT EQU   ISTRCC+128                                               00564000
RCCPUXPT EQU   ISTRCC+124                                               00565000
@NM00128 EQU   ISTRCC+122                                               00566000
RCCINDEX EQU   ISTRCC+120                                               00567000
RCCPATHZ EQU   ISTRCC+118                                               00568000
RCCCTELU EQU   ISTRCC+116                                               00569000
RCCTIMER EQU   ISTRCC+112                                               00570000
RCCPATHT EQU   ISTRCC+108                                               00571000
@NM00127 EQU   ISTRCC+107                                               00572000
@NM00126 EQU   RCCBITAN+1                                               00573000
@NM00125 EQU   RCCBITAN+1                                               00574000
@NM00124 EQU   RCCBITAN+1                                               00575000
@NM00123 EQU   RCCBITAN+1                                               00576000
@NM00122 EQU   RCCBITAN+1                                               00577000
@NM00121 EQU   RCCBITAN+1                                               00578000
RCCANS   EQU   RCCBITAN+1                                               00579000
RCCBNNSP EQU   RCCBITAN+1                                               00580000
RCCIRETR EQU   RCCBITAN                                                 00581000
RCCDSNPR EQU   RCCBITAN                                                 00582000
RCCACTPU EQU   RCCBITAN                                                 00583000
RCCBRKCN EQU   RCCBITAN                                                 00584000
RCCFINAL EQU   RCCBITAN                                                 00585000
RCCDIALP EQU   RCCBITAN                                                 00586000
RCCBRKF  EQU   RCCBITAN                                                 00587000
RCCCTPGD EQU   RCCBITAN                                                 00588000
RCCCDFLG EQU   ISTRCC+104                                               00589000
RCCPRE   EQU   ISTRCC                                                   00590000
RCDRMEND EQU   ISTRCDRM+220                                             00591000
@NM00120 EQU   ISTRCDRM+218                                             00592000
RCDRMSEQ EQU   ISTRCDRM+216                                             00593000
@NM00119 EQU   ISTRCDRM+213                                             00594000
RCDRMSC  EQU   ISTRCDRM+212                                             00595000
@NM00118 EQU   RCDRMFGS+3                                               00596000
@NM00117 EQU   RCDRMFGS+3                                               00597000
@NM00116 EQU   RCDRMFGS+3                                               00598000
@NM00115 EQU   RCDRMFGS+3                                               00599000
@NM00114 EQU   RCDRMFGS+3                                               00600000
@NM00113 EQU   RCDRMFGS+3                                               00601000
@NM00112 EQU   RCDRMFGS+3                                               00602000
RCDRMCD2 EQU   RCDRMFGS+3                                               00603000
RCDRCDRS EQU   RCDRMFGS+2                                               00604000
RCDRMDYN EQU   RCDRMFGS+2                                               00605000
RCDRMRID EQU   RCDRMFGS+2                                               00606000
RCDRMLOQ EQU   RCDRMFGS+2                                               00607000
RCDRMNMP EQU   RCDRMFGS+2                                               00608000
RCDRMPS  EQU   RCDRMFGS+2                                               00609000
RCDRMURC EQU   RCDRMFGS+2                                               00610000
RCDRMNAP EQU   RCDRMFGS+2                                               00611000
RCDRMVL  EQU   RCDRMFGS+1                                               00612000
RCDRMSPC EQU   RCDRMFGS+1                                               00613000
RCDRMINC EQU   RCDRMFGS+1                                               00614000
RCDRMLPS EQU   RCDRMFGS+1                                               00615000
RCDRMTCR EQU   RCDRMFGS+1                                               00616000
RCDRMDTC EQU   RCDRMFGS+1                                               00617000
RCDRMDT  EQU   RCDRMFGS+1                                               00618000
RCDRMCLR EQU   RCDRMFGS+1                                               00619000
RCDRMCLC EQU   RCDRMFGS                                                 00620000
RCDRMDCD EQU   RCDRMFGS                                                 00621000
RCDRMOVR EQU   RCDRMFGS                                                 00622000
RCDRMSDT EQU   RCDRMFGS                                                 00623000
RCDRMACT EQU   RCDRMFGS                                                 00624000
RCDRMSCA EQU   RCDRMFGS                                                 00625000
RCDRMPRI EQU   RCDRMFGS                                                 00626000
RCDRMHST EQU   RCDRMFGS                                                 00627000
RCDRMRP  EQU   ISTRCDRM+204                                             00628000
RCDRMLRP EQU   RCDRMRPQ+4                                               00629000
RCDRMFRP EQU   RCDRMRPQ                                                 00630000
RCDRMARP EQU   ISTRCDRM+192                                             00631000
RCDRMPDT EQU   RCDRMPDN                                                 00632000
RCDRMPR  EQU   ISTRCDRM                                                 00633000
RCDRSEND EQU   ISTRCDRS+168                                             00634000
@NM00111 EQU   ISTRCDRS+167                                             00635000
@NM00110 EQU   @NM00109                                                 00636000
RCDRDYN  EQU   @NM00109                                                 00637000
RCDTKCNT EQU   ISTRCDRS+164                                             00638000
RCDCDRMN EQU   ISTRCDRS+156                                             00639000
RCDRCDRM EQU   ISTRCDRS+148                                             00640000
RCDRSARP EQU   ISTRCDRS+144                                             00641000
RCDRSPR  EQU   ISTRCDRS                                                 00642000
RCLEND   EQU   ISTRCL+100                                               00643000
@NM00108 EQU   ISTRCL+98                                                00644000
RCLCTNGP EQU   ISTRCL+96                                                00645000
RCLCTECM EQU   ISTRCL+94                                                00646000
RCLCTETR EQU   ISTRCL+92                                                00647000
RCLGPOLA EQU   ISTRCL+88                                                00648000
RCLGPADR EQU   RCLADR+1                                                 00649000
@NM00107 EQU   RCLFLAG                                                  00650000
@NM00106 EQU   RCLFLAG                                                  00651000
@NM00105 EQU   RCLFLAG                                                  00652000
@NM00104 EQU   RCLFLAG                                                  00653000
@NM00103 EQU   RCLFLAG                                                  00654000
@NM00102 EQU   RCLFLAG                                                  00655000
@NM00101 EQU   RCLFLAG                                                  00656000
RCLBATCH EQU   RCLFLAG                                                  00657000
RCLPRE   EQU   ISTRCL                                                   00658000
RDAEND   EQU   ISTRDA+136                                               00659000
RDAPRE   EQU   ISTRDA                                                   00660000
RDSEND   EQU   ISTRDS+92                                                00661000
RDSCTATR EQU   ISTRDS+90                                                00662000
RDSCTTRM EQU   ISTRDS+88                                                00663000
RDSADDOT EQU   ISTRDS+84                                                00664000
RDSPRE   EQU   ISTRDS                                                   00665000
RGPEND   EQU   ISTRGP+96                                                00666000
@NM00100 EQU   ISTRGP+95                                                00667000
@NM00099 EQU   RGPBITAN                                                 00668000
@NM00098 EQU   RGPBITAN                                                 00669000
@NM00097 EQU   RGPBITAN                                                 00670000
RGPX21SW EQU   RGPBITAN                                                 00671000
RGPASDLC EQU   RGPBITAN                                                 00672000
RGPABSC  EQU   RGPBITAN                                                 00673000
RGPASS   EQU   RGPBITAN                                                 00674000
RGPADIL  EQU   RGPBITAN                                                 00675000
@NM00096 EQU   ISTRGP+92                                                00676000
@NM00095 EQU   ISTRGP+90                                                00677000
@NM00094 EQU   ISTRGP+88                                                00678000
@NM00093 EQU   ISTRGP+86                                                00679000
@NM00092 EQU   ISTRGP+84                                                00680000
RGPPRE   EQU   ISTRGP                                                   00681000
RINEND   EQU   ISTRIN+152                                               00682000
@NM00091 EQU   ISTRIN+150                                               00683000
@NM00090 EQU   RINFLAGS                                                 00684000
RINCHCON EQU   RINFLAGS                                                 00685000
RINTG    EQU   ISTRIN+148                                               00686000
RINXTRIN EQU   ISTRIN+144                                               00687000
RINNCPPT EQU   ISTRIN+140                                               00688000
RINREAL  EQU   ISTRIN+132                                               00689000
RINDEFTG EQU   ISTRIN+131                                               00690000
RINBCKUP EQU   RINBITAN                                                 00691000
RINCHAN  EQU   RINBITAN                                                 00692000
RINPRSWD EQU   RINBITAN                                                 00693000
RINLOCAL EQU   RINBITAN                                                 00694000
RINPEER  EQU   RINBITAN                                                 00695000
RINLDISC EQU   RINBITAN                                                 00696000
RINNODEF EQU   RINBITAN                                                 00697000
RINREMPO EQU   RINBITAN                                                 00698000
RINCNCNT EQU   ISTRIN+129                                               00699000
RINNODID EQU   ISTRIN+128                                               00700000
RINRLDAF EQU   RINDAFID+2                                               00701000
@NM00089 EQU   RINDAFID                                                 00702000
RINLOCRN EQU   ISTRIN+120                                               00703000
RINCPLVL EQU   ISTRIN+116                                               00704000
RINCTDRU EQU   ISTRIN+112                                               00705000
RINREMOT EQU   ISTRIN+108                                               00706000
RINTRENT EQU   ISTRIN+104                                               00707000
RINCRPRE EQU   ISTRIN                                                   00708000
RLCEND   EQU   ISTRLC+92                                                00709000
@NM00088 EQU   ISTRLC+91                                                00710000
RLCLCCUA EQU   ISTRLC+88                                                00711000
RLCUCBAD EQU   RLCADR+1                                                 00712000
@NM00087 EQU   RLCFLAG                                                  00713000
@NM00086 EQU   RLCFLAG                                                  00714000
@NM00085 EQU   RLCFLAG                                                  00715000
@NM00084 EQU   RLCFLAG                                                  00716000
@NM00083 EQU   RLCFLAG                                                  00717000
@NM00082 EQU   RLCFLAG                                                  00718000
RLCACNT  EQU   RLCFLAG                                                  00719000
RLCALLOC EQU   RLCFLAG                                                  00720000
RLCPRE   EQU   ISTRLC                                                   00721000
RLSEND   EQU   ISTRLS+140                                               00722000
@NM00081 EQU   ISTRLS+138                                               00723000
RLSCTELU EQU   ISTRLS+136                                               00724000
RLSPRE   EQU   ISTRLS                                                   00725000
RLUEND   EQU   ISTRLU+152                                               00726000
RLUSEQNO EQU   ISTRLU+148                                               00727000
@NM00080 EQU   RLUBITAN+1                                               00728000
@NM00079 EQU   RLUBITAN+1                                               00729000
@NM00078 EQU   RLUBITAN+1                                               00730000
@NM00077 EQU   RLUBITAN+1                                               00731000
@NM00076 EQU   RLUBITAN+1                                               00732000
@NM00075 EQU   RLUBITAN+1                                               00733000
@NM00074 EQU   RLUBITAN+1                                               00734000
@NM00073 EQU   RLUBITAN                                                 00735000
@NM00072 EQU   RLUBITAN                                                 00736000
RLULOCSE EQU   RLUBITAN                                                 00737000
RLUCLNUP EQU   RLUBITAN                                                 00738000
RLUACTLU EQU   RLUBITAN                                                 00739000
RLUCDCTL EQU   RLUBITAN                                                 00740000
RLUNDSES EQU   RLUBITAN                                                 00741000
RLUBATCH EQU   RLUBITAN                                                 00742000
RLULOCAD EQU   ISTRLU+145                                               00743000
RLUTYPE  EQU   ISTRLU+144                                               00744000
RLUCRPR  EQU   ISTRLU                                                   00745000
RLXEND   EQU   ISTRLX+96                                                00746000
@NM00071 EQU   ISTRLX+93                                                00747000
@NM00070 EQU   RLXBITAN                                                 00748000
@NM00069 EQU   RLXBITAN                                                 00749000
@NM00068 EQU   RLXBITAN                                                 00750000
@NM00067 EQU   RLXBITAN                                                 00751000
@NM00066 EQU   RLXBITAN                                                 00752000
@NM00065 EQU   RLXBITAN                                                 00753000
@NM00064 EQU   RLXBITAN                                                 00754000
RLXINUSE EQU   RLXBITAN                                                 00755000
RLXLUPTR EQU   ISTRLX+88                                                00756000
RLXNLUX  EQU   ISTRLX+84                                                00757000
RLXPRE   EQU   ISTRLX                                                   00758000
RPTEND   EQU   ISTRPT+176                                               00759000
RPTCTNM  EQU   ISTRPT+168                                               00760000
@NM00063 EQU   RPTBITAN+1                                               00761000
@NM00062 EQU   RPTBITAN+1                                               00762000
@NM00061 EQU   RPTBITAN+1                                               00763000
@NM00060 EQU   RPTBITAN+1                                               00764000
@NM00059 EQU   RPTBITAN+1                                               00765000
@NM00058 EQU   RPTBITAN+1                                               00766000
@NM00057 EQU   RPTBITAN+1                                               00767000
@NM00056 EQU   RPTBITAN+1                                               00768000
RPTISTAT EQU   RPTBITAN                                                 00769000
RPTDYNAM EQU   RPTBITAN                                                 00770000
RPTVYIMM EQU   RPTBITAN                                                 00771000
RPTVIODN EQU   RPTBITAN                                                 00772000
RPTONLIN EQU   RPTBITAN                                                 00773000
RPTHLVPD EQU   RPTBITAN                                                 00774000
RPTVRYPD EQU   RPTBITAN                                                 00775000
RPTASLEP EQU   RPTBITAN                                                 00776000
RPTDAFSV EQU   ISTRPT+164                                               00777000
RPTPTHCT EQU   ISTRPT+162                                               00778000
RPTPEPCT EQU   ISTRPT+160                                               00779000
RPTNSNSV EQU   ISTRPT+156                                               00780000
RPTUTERM EQU   ISTRPT+152                                               00781000
RPTATERM EQU   ISTRPT+148                                               00782000
RPTDIVT  EQU   RPTDITT                                                  00783000
@NM00055 EQU   RPTXTCID+4                                               00784000
RPTLNDAF EQU   RPTLNCID+2                                               00785000
RPTLNSAF EQU   RPTLNCID                                                 00786000
RPTLN    EQU   ISTRPT                                                   00787000
RPXEND   EQU   ISTRPX+96                                                00788000
@NM00054 EQU   ISTRPX+93                                                00789000
RPXMAXLU EQU   ISTRPX+92                                                00790000
RPXPUPTR EQU   ISTRPX+88                                                00791000
RPXFLUX  EQU   ISTRPX+84                                                00792000
RPXPRE   EQU   ISTRPX                                                   00793000
RRNEND   EQU   ISTRRN+332                                               00794000
RRNLDRID EQU   ISTRRN+324                                               00795000
RRNCLDST EQU   ISTRRN+316                                               00796000
RRNGDSTA EQU   ISTRRN+308                                               00797000
RRNGLSTA EQU   ISTRRN+300                                               00798000
RRNLDCAT EQU   RRNLDFSM                                                 00799000
RRNVRID  EQU   ISTRRN+296                                               00800000
RRNPUXTN EQU   ISTRRN+292                                               00801000
RRNLUCT  EQU   ISTRRN+290                                               00802000
RRNPUCT  EQU   ISTRRN+288                                               00803000
RRNLPPTR EQU   ISTRRN+284                                               00804000
RRNTPPTR EQU   ISTRRN+280                                               00805000
RRNFNAEQ EQU   ISTRRN+276                                               00806000
@NM00053 EQU   ISTRRN+264                                               00807000
@NM00052 EQU   ISTRRN+260                                               00808000
RRNNMNCP EQU   ISTRRN+252                                               00809000
@NM00051 EQU   ISTRRN+249                                               00810000
RRNAMNUM EQU   ISTRRN+248                                               00811000
RRNAMLST EQU   ISTRRN+244                                               00812000
RRNCDPWE EQU   ISTRRN+240                                               00813000
RRNPUBI  EQU   RRNNMDPD+6                                               00814000
RRNDPLUB EQU   RRNNMDPD                                                 00815000
RRNINBFR EQU   ISTRRN+231                                               00816000
RRNDEFLV EQU   ISTRRN+230                                               00817000
RRNRNCUA EQU   ISTRRN+227                                               00818000
RRNRDCUA EQU   ISTRRN+224                                               00819000
RRNNCPNM EQU   ISTRRN+217                                               00820000
RRNCTPCC EQU   ISTRRN+216                                               00821000
RRNCPLUB EQU   ISTRRN+210                                               00822000
RRNDELAY EQU   ISTRRN+208                                               00823000
RRNMODL  EQU   RRNLVL+2                                                 00824000
RRNRELL  EQU   RRNLVL                                                   00825000
@NM00050 EQU   RRNBITAN+2                                               00826000
@NM00049 EQU   RRNBITAN+2                                               00827000
RRNAMLDA EQU   RRNBITAN+2                                               00828000
RRNLODNO EQU   RRNBITAN+2                                               00829000
RRNLODYS EQU   RRNBITAN+2                                               00830000
RRNRBMDL EQU   RRNBITAN+2                                               00831000
RRNALLOC EQU   RRNBITAN+2                                               00832000
RRNACQRD EQU   RRNBITAN+2                                               00833000
RRNREMPO EQU   RRNBITAN+1                                               00834000
RRNRBBUP EQU   RRNBITAN+1                                               00835000
RRNRBCT2 EQU   RRNBITAN+1                                               00836000
RRNRBCT1 EQU   RRNBITAN+1                                               00837000
RRNRBSEC EQU   RRNBITAN+1                                               00838000
RRNRBCCT EQU   RRNBITAN+1                                               00839000
RRNRBCCL EQU   RRNBITAN+1                                               00840000
RRNRBREM EQU   RRNBITAN+1                                               00841000
RRNRSYN  EQU   RRNBITAN                                                 00842000
RRNRAPEP EQU   RRNBITAN                                                 00843000
RRNRANCP EQU   RRNBITAN                                                 00844000
RRNRAOLT EQU   RRNBITAN                                                 00845000
RRNRASYN EQU   RRNBITAN                                                 00846000
RRNRADMP EQU   RRNBITAN                                                 00847000
RRNRAIPL EQU   RRNBITAN                                                 00848000
RRNRASHT EQU   RRNBITAN                                                 00849000
RRNHSTID EQU   ISTRRN+200                                               00850000
RRNHBUFS EQU   ISTRRN+198                                               00851000
RRNHLENT EQU   RRNHPRE+1                                                00852000
RRNHLENH EQU   RRNHPRE                                                  00853000
RRNNODCT EQU   ISTRRN+194                                               00854000
RRNEPADR EQU   ISTRRN+192                                               00855000
RRNCTENT EQU   ISTRRN+190                                               00856000
RRNCTECM EQU   ISTRRN+188                                               00857000
RRNCTEIN EQU   ISTRRN+186                                               00858000
RRNCTETR EQU   ISTRRN+184                                               00859000
RRNCTECL EQU   ISTRRN+182                                               00860000
RRNCTELI EQU   ISTRRN+180                                               00861000
RRNCTEGP EQU   ISTRRN+178                                               00862000
RRNCTBHS EQU   ISTRRN+176                                               00863000
RRNTABCT EQU   ISTRRN+172                                               00864000
RRNLASTE EQU   ISTRRN+168                                               00865000
RRNNCSPL EQU   ISTRRN+164                                               00866000
RRNRPLPT EQU   ISTRRN+160                                               00867000
RRNMSIZE EQU   ISTRRN+156                                               00868000
RRNFLUX  EQU   ISTRRN+152                                               00869000
RRNBHSET EQU   ISTRRN+148                                               00870000
RRNRINQP EQU   ISTRRN+144                                               00871000
RRNGRPA  EQU   ISTRRN+140                                               00872000
RRNLUBA  EQU   RRNUCBAD+1                                               00873000
RRNCHQI  EQU   RRNUCBAD                                                 00874000
@NM00048 EQU   RRNFLAG                                                  00875000
RRNACBAQ EQU   RRNFLAG                                                  00876000
RRNCHCON EQU   RRNFLAG                                                  00877000
RRNVFYLM EQU   RRNFLAG                                                  00878000
RRNLDET  EQU   RRNFLAG                                                  00879000
RRNRIMIP EQU   RRNFLAG                                                  00880000
RRNLCDIE EQU   RRNFLAG                                                  00881000
RRNLCSIP EQU   RRNFLAG                                                  00882000
RRNPRE   EQU   ISTRRN                                                   00883000
RSWEND   EQU   ISTRSW+152                                               00884000
@NM00047 EQU   ISTRSW+150                                               00885000
RSWCTELU EQU   ISTRSW+148                                               00886000
RSWGRUPZ EQU   ISTRSW+146                                               00887000
RSWDIALZ EQU   ISTRSW+144                                               00888000
RSWGRUPT EQU   ISTRSW+140                                               00889000
RSWDIALT EQU   ISTRSW+136                                               00890000
RSWPRE   EQU   ISTRSW                                                   00891000
RTREND   EQU   ISTRTR+208                                               00892000
RTRCADDR EQU   ISTRTR+200                                               00893000
RTRBHSN1 EQU   ISTRTR+192                                               00894000
RTRIDCAS EQU   RTRBSCID+1                                               00895000
RTRIDLEN EQU   RTRBSCID                                                 00896000
RTRLCTI  EQU   ISTRTR+170                                               00897000
RTRTRMAX EQU   ISTRTR+169                                               00898000
@NM00046 EQU   RTRBITAN+4                                               00899000
@NM00045 EQU   RTRBITAN+4                                               00900000
@NM00044 EQU   RTRBITAN+4                                               00901000
@NM00043 EQU   RTRBITAN+4                                               00902000
@NM00042 EQU   RTRBITAN+4                                               00903000
@NM00041 EQU   RTRBITAN+4                                               00904000
@NM00040 EQU   RTRBITAN+4                                               00905000
@NM00039 EQU   RTRBITAN+4                                               00906000
@NM00038 EQU   RTRBITAN+3                                               00907000
RTRDTRLM EQU   RTRBITAN+3                                               00908000
RTRRAATN EQU   RTRBITAN+3                                               00909000
RTRLSCMD EQU   RTRBITAN+3                                               00910000
RTRRFDEK EQU   RTRBITAN+3                                               00911000
RTRRFANK EQU   RTRBITAN+3                                               00912000
RTRRFPFK EQU   RTRBITAN+3                                               00913000
RTRRFPEN EQU   RTRBITAN+3                                               00914000
RTRRFXCT EQU   RTRBITAN+2                                               00915000
RTRRESCT EQU   RTRBITAN+2                                               00916000
RTRRESUP EQU   RTRBITAN+2                                               00917000
RTRREATT EQU   RTRBITAN+2                                               00918000
RTRRECHK EQU   RTRBITAN+2                                               00919000
RTRREACR EQU   RTRBITAN+2                                               00920000
@NM00037 EQU   RTRBITAN+2                                               00921000
RTRREBRK EQU   RTRBITAN+2                                               00922000
RTRRDBHI EQU   RTRBITAN+1                                               00923000
RTRRDBHD EQU   RTRBITAN+1                                               00924000
RTRRDBHN EQU   RTRBITAN+1                                               00925000
RTRRCXMS EQU   RTRBITAN+1                                               00926000
RTRRCMSG EQU   RTRBITAN+1                                               00927000
RTRRCBLK EQU   RTRBITAN+1                                               00928000
RTRRCPT3 EQU   RTRBITAN+1                                               00929000
RTRRCIT2 EQU   RTRBITAN+1                                               00930000
RTRRCIT1 EQU   RTRBITAN                                                 00931000
RTRRBEND EQU   RTRBITAN                                                 00932000
RTRRBECT EQU   RTRBITAN                                                 00933000
RTRRACTR EQU   RTRBITAN                                                 00934000
RTRRACDT EQU   RTRBITAN                                                 00935000
RTRRAPT3 EQU   RTRRAALL                                                 00936000
RTRRAPT2 EQU   RTRRAALL                                                 00937000
RTRRAPT1 EQU   RTRRAALL                                                 00938000
RTRCTADR EQU   ISTRTR+162                                               00939000
RTRCTPOL EQU   ISTRTR+160                                               00940000
RTRCTDIA EQU   ISTRTR+158                                               00941000
RTRCTECM EQU   ISTRTR+156                                               00942000
RTRDIAA  EQU   ISTRTR+152                                               00943000
RTRPOLA  EQU   ISTRTR+148                                               00944000
RTRADRPT EQU   RTRADR+1                                                 00945000
@NM00036 EQU   RTRFLAG                                                  00946000
@NM00035 EQU   RTRFLAG                                                  00947000
@NM00034 EQU   RTRFLAG                                                  00948000
@NM00033 EQU   RTRFLAG                                                  00949000
@NM00032 EQU   RTRFLAG                                                  00950000
@NM00031 EQU   RTRFLAG                                                  00951000
@NM00030 EQU   RTRFLAG                                                  00952000
RTRVTERM EQU   RTRFLAG                                                  00953000
RTRCRPR  EQU   ISTRTR                                                   00954000
RAPREND  EQU   ISTRAPRE+144                                             00955000
RAPHPRE  EQU   ISTRAPRE                                                 00956000
RPUEND   EQU   ISTRPU+104                                               00957000
RPUENTAD EQU   ISTRPU+100                                               00958000
RPUIDNUM EQU   RPUID48+3                                                00959000
RPUIDBLK EQU   RPUID48+2                                                00960000
RPUIDPA2 EQU   RPUID48+1                                                00961000
RPUIDPUT EQU   RPUID48                                                  00962000
RPUIDPA1 EQU   RPUSTAID                                                 00963000
RPUPASSL EQU   ISTRPU+91                                                00964000
RPUMXOUT EQU   ISTRPU+90                                                00965000
RPUMXDAT EQU   ISTRPU+88                                                00966000
RPURSV01 EQU   ISTRPU+87                                                00967000
RPURETYM EQU   ISTRPU+86                                                00968000
RPUADDR  EQU   ISTRPU+85                                                00969000
RPUTYPE  EQU   ISTRPU+84                                                00970000
RPUPRE   EQU   ISTRPU                                                   00971000
RLNEND   EQU   ISTRLN+136                                               00972000
RLNTGCS  EQU   ISTRLN+135                                               00973000
RLNCURTR EQU   ISTRLN+134                                               00974000
RLNINBMX EQU   RLNINBFR+1                                               00975000
RLNINBN  EQU   RLNINBFR                                                 00976000
RLNRTYM  EQU   ISTRLN+131                                               00977000
RLNSERVL EQU   ISTRLN+130                                               00978000
RLNREPTO EQU   ISTRLN+129                                               00979000
RLNACTTO EQU   ISTRLN+128                                               00980000
RLNCTPCC EQU   ISTRLN+127                                               00981000
RLNPUBI  EQU   ISTRLN+126                                               00982000
RLNDCUA  EQU   ISTRLN+123                                               00983000
RLNCUA   EQU   ISTRLN+120                                               00984000
RLNPAUSE EQU   ISTRLN+119                                               00985000
RLNPOLMT EQU   ISTRLN+118                                               00986000
RLNCTSES EQU   ISTRLN+117                                               00987000
@NM00029 EQU   ISTRLN+116                                               00988000
@NM00028 EQU   RLNBITAN+3                                               00989000
@NM00027 EQU   RLNBITAN+3                                               00990000
RLNSWEP  EQU   RLNBITAN+3                                               00991000
RLNSVSKP EQU   RLNLSCMD                                                 00992000
RLNSESLM EQU   RLNLSCMD                                                 00993000
RLNNPRLM EQU   RLNLSCMD                                                 00994000
RLNSWNCP EQU   RLNBITAN+3                                               00995000
RLNACTLN EQU   RLNBITAN+2                                               00996000
@NM00026 EQU   RLNBITAN+2                                               00997000
@NM00025 EQU   RLNBITAN+2                                               00998000
@NM00024 EQU   RLNBITAN+2                                               00999000
@NM00023 EQU   RLNBITAN+2                                               01000000
RLNDCALL EQU   RLNCONCT                                                 01001000
RLNAUTO  EQU   RLNCONCT                                                 01002000
RLNMANUL EQU   RLNCONCT                                                 01003000
@NM00022 EQU   RLNBITAN+1                                               01004000
RLNWANSW EQU   RLNBITAN+1                                               01005000
RLNINUSE EQU   RLNBITAN+1                                               01006000
RLNMULTP EQU   RLNBITAN+1                                               01007000
RLNIDV   EQU   RLNBITAN+1                                               01008000
RLNTTV   EQU   RLNBITAN+1                                               01009000
@NM00021 EQU   RLNBITAN+1                                               01010000
RLNRBUSE EQU   RLNBITAN+1                                               01011000
RLNRAPEP EQU   RLNBITAN                                                 01012000
RLNRANCP EQU   RLNBITAN                                                 01013000
RLNRAEP  EQU   RLNBITAN                                                 01014000
RLNRAPOL EQU   RLNBITAN                                                 01015000
RLNRATRN EQU   RLNBITAN                                                 01016000
RLNGANSW EQU   RLNBITAN                                                 01017000
RLNRACAN EQU   RLNRACNT                                                 01018000
RLNRACAT EQU   RLNRACNT                                                 01019000
@NM00020 EQU   ISTRLN+111                                               01020000
RLNMAXLA EQU   ISTRLN+110                                               01021000
RLNDESAM EQU   ISTRLN+109                                               01022000
RLNCURAM EQU   ISTRLN+108                                               01023000
RLNACTSN EQU   RLNCSLRC+2                                               01024000
RLNACTRM EQU   RLNCSLRC+1                                               01025000
RLNLRC   EQU   RLNCSLRC                                                 01026000
RLNAUTOA EQU   ISTRLN+102                                               01027000
RLNACTCT EQU   ISTRLN+100                                               01028000
RLNCTECM EQU   ISTRLN+98                                                01029000
RLNCTEIN EQU   ISTRLN+96                                                01030000
RLNCTETR EQU   ISTRLN+94                                                01031000
RLNCTECL EQU   ISTRLN+92                                                01032000
RLNENTAD EQU   ISTRLN+88                                                01033000
RLNLUBA  EQU   RLNUCBAD+1                                               01034000
RLNCHQI  EQU   RLNUCBAD                                                 01035000
@NM00019 EQU   RLNFLAG                                                  01036000
@NM00018 EQU   RLNFLAG                                                  01037000
RLNIDACT EQU   RLNFLAG                                                  01038000
RLNCHAN  EQU   RLNFLAG                                                  01039000
RLNACLNK EQU   RLNFLAG                                                  01040000
RLNBKDUP EQU   RLNFLAG                                                  01041000
RLNBCKUP EQU   RLNFLAG                                                  01042000
RLNCDLNK EQU   RLNFLAG                                                  01043000
RLNPRE   EQU   ISTRLN                                                   01044000
RDTEND   EQU   ISTRDT+136                                               01045000
RDTVSRPL EQU   RDTCRIA+16                                               01046000
RDTCRSPW EQU   RDTCRIA+8                                                01047000
RDTCRSDS EQU   RDTCRIA                                                  01048000
@NM00017 EQU   ISTRDT+114                                               01049000
@NM00016 EQU   RDTBITAN                                                 01050000
@NM00015 EQU   RDTBITAN                                                 01051000
@NM00014 EQU   RDTBITAN                                                 01052000
RDTSSFLG EQU   RDTBITAN                                                 01053000
RDTHCDRM EQU   RDTBITAN                                                 01054000
RDTBHSET EQU   RDTBITAN                                                 01055000
RDTCDCTL EQU   RDTBITAN                                                 01056000
RDTCTPGD EQU   RDTBITAN                                                 01057000
RDTLGCT  EQU   ISTRDT+112                                               01058000
RDTNODID EQU   ISTRDT+111                                               01059000
RDTMAXID EQU   ISTRDT+110                                               01060000
@NM00013 EQU   ISTRDT+108                                               01061000
RDTVYRPH EQU   ISTRDT+104                                               01062000
RDTBACK  EQU   ISTRDT+100                                               01063000
RDTFORW  EQU   ISTRDT+96                                                01064000
RDTNAMTB EQU   ISTRDT+92                                                01065000
RDTENTAD EQU   ISTRDT+88                                                01066000
RDTLEN   EQU   RDTPLEN+1                                                01067000
RDTPRICA EQU   RDTPRIOR                                                 01068000
RDTPRILS EQU   RDTPRIOR                                                 01069000
RDTPRISW EQU   RDTPRIOR                                                 01070000
RDTPRIRN EQU   RDTPRIOR                                                 01071000
RDTPRILC EQU   RDTPRIOR                                                 01072000
RDTPRIAP EQU   RDTPRIOR                                                 01073000
RDTCDRSC EQU   RDTPRIOR                                                 01074000
RDTCDRM  EQU   RDTPRIOR                                                 01075000
RDTPRE   EQU   ISTRDT                                                   01076000
RAPEND   EQU   ISTRAP+188                                               01077000
RAPMAXPV EQU   ISTRAP+184                                               01078000
RAPAPPWD EQU   ISTRAP+176                                               01079000
RAPACBN  EQU   ISTRAP+168                                               01080000
@NM00012 EQU   RAPBITAN+2                                               01081000
@NM00011 EQU   RAPBITAN+2                                               01082000
RAPSRTLN EQU   RAPBITAN+2                                               01083000
RAPSONSC EQU   RAPBITAN+2                                               01084000
RAPVFRR  EQU   RAPBITAN+2                                               01085000
RAPSRBX  EQU   RAPBITAN+2                                               01086000
@NM00010 EQU   RAPBITAN+2                                               01087000
RAPCSMA  EQU   RAPBITAN+2                                               01088000
RAPTSO   EQU   RAPBITAN+1                                               01089000
RAPAUTHE EQU   RAPBITAN+1                                               01090000
RAPANVPC EQU   RAPBITAN+1                                               01091000
RAPASPO  EQU   RAPBITAN+1                                               01092000
RAPAPPO  EQU   RAPBITAN+1                                               01093000
RAPAACQ  EQU   RAPBITAN+1                                               01094000
RAPAPRMT EQU   RAPBITAN+1                                               01095000
RAPAPASS EQU   RAPBITAN+1                                               01096000
RAPABLCK EQU   RAPBITAN                                                 01097000
RAPALLF  EQU   RAPBITAN                                                 01098000
RAPPARS  EQU   RAPBITAN                                                 01099000
RAPLSIZ  EQU   RAPBITAN                                                 01100000
RAPATLGN EQU   RAPBITAN                                                 01101000
RAPASLGI EQU   RAPBITAN                                                 01102000
RAPAQUI  EQU   RAPBITAN                                                 01103000
RAPABLGN EQU   RAPBITAN                                                 01104000
RAPBFACT EQU   ISTRAP+164                                               01105000
RAPBNA   EQU   ISTRAP+162                                               01106000
RAPEAS   EQU   ISTRAP+160                                               01107000
RAPACDEB EQU   ISTRAP+156                                               01108000
RAPACBA  EQU   ISTRAP+152                                               01109000
RAPENTAD EQU   ISTRAP+148                                               01110000
@NM00009 EQU   ISTRAP+146                                               01111000
RAPTRPRE EQU   ISTRAP+144                                               01112000
RAPPRE   EQU   ISTRAP                                                   01113000
RCPEND   EQU   ISTRCPRE+144                                             01114000
RCPLGMOD EQU   ISTRCPRE+136                                             01115000
RCPDLGMD EQU   ISTRCPRE+128                                             01116000
RCPLGNAP EQU   ISTRCPRE+120                                             01117000
RCPQCNT  EQU   ISTRCPRE+118                                             01118000
@NM00008 EQU   ISTRCPRE+117                                             01119000
RCPOSAIP EQU   RCPBITAN                                                 01120000
RCPVLMSG EQU   RCPBITAN                                                 01121000
RCPCSM   EQU   RCPBITAN                                                 01122000
RCPALLOC EQU   RCPBITAN                                                 01123000
RCPSEC   EQU   RCPBITAN                                                 01124000
RCPSESSC EQU   RCPSESSM                                                 01125000
RCPSESPR EQU   RCPSESSM                                                 01126000
RCPSSCFM EQU   ISTRCPRE+114                                             01127000
RCPSTCAP EQU   RCPCYSET                                                 01128000
RCPSTRQD EQU   RCPCYSET                                                 01129000
RCPMDCAP EQU   RCPCYMOD                                                 01130000
RCPMDRQD EQU   RCPCYMOD                                                 01131000
RCPPRIM  EQU   RCPPMODE                                                 01132000
RCPCROSS EQU   RCPPMODE                                                 01133000
RCPRRECD EQU   RCPPMODE                                                 01134000
RCPRBASC EQU   RCPPMODE                                                 01135000
RCPBFLIM EQU   ISTRCPRE+112                                             01136000
RCPNCPPM EQU   RCPNCPPC+1                                               01137000
RCPNCPPN EQU   RCPNCPPC                                                 01138000
RCPPACEM EQU   RCPPACE+1                                                01139000
RCPPACEN EQU   RCPPACE                                                  01140000
RCPBHSI2 EQU   ISTRCPRE+107                                             01141000
RCPBHSI1 EQU   ISTRCPRE+106                                             01142000
RCPSESLM EQU   ISTRCPRE+104                                             01143000
RCPSESCT EQU   ISTRCPRE+102                                             01144000
RCPINTTI EQU   ISTRCPRE+100                                             01145000
RCPUSSTI EQU   ISTRCPRE+98                                              01146000
RCPMODTI EQU   ISTRCPRE+96                                              01147000
RCPLNAPA EQU   ISTRCPRE+92                                              01148000
RCPSIBS  EQU   RCPSARRY+4                                               01149000
RCPSIBP  EQU   RCPSARRY                                                 01150000
RCPPRE   EQU   ISTRCPRE                                                 01151000
RPREND   EQU   ISTRPRE+84                                               01152000
RPRDEVCH EQU   ISTRPRE+76                                               01153000
RPRCONID EQU   ISTRPRE+67                                               01154000
@NM00007 EQU   RPRFLAGS                                                 01155000
RPRDYNAM EQU   RPRFLAGS                                                 01156000
RPRNOACT EQU   RPRFLAGS                                                 01157000
RPRDAFAD EQU   RPRBITAN+4                                               01158000
RPRENTVA EQU   RPRBITAN+4                                               01159000
RPRDUMMY EQU   RPRBITAN+4                                               01160000
RPRIMPCH EQU   RPRBITAN+4                                               01161000
RPRIMPAC EQU   RPRBITAN+4                                               01162000
RPRNEO   EQU   RPRBITAN+4                                               01163000
RPRRNAA  EQU   RPRBITAN+4                                               01164000
RPRDRADD EQU   RPRBITAN+4                                               01165000
RPRFADD  EQU   RPRBITAN+3                                               01166000
RPRINTST EQU   RPRBITAN+3                                               01167000
RPRCLVPD EQU   RPRBITAN+3                                               01168000
RPRSHAD  EQU   RPRBITAN+3                                               01169000
RPRGIST  EQU   RPRBITAN+3                                               01170000
RPRRBISA EQU   RPRBITAN+3                                               01171000
RPRENTVT EQU   RPRBITAN+3                                               01172000
RPRDINOP EQU   RPRBITAN+3                                               01173000
RPRDINUS EQU   RPRBITAN+2                                               01174000
RPRCRCPT EQU   RPRBITAN+2                                               01175000
RPRNOSRT EQU   RPRBITAN+2                                               01176000
RPRDOM   EQU   RPRBITAN+2                                               01177000
RPRNOUSE EQU   RPRBITAN+2                                               01178000
RPRNOSNA EQU   RPRBITAN+2                                               01179000
RPRCLNUP EQU   RPRBITAN+2                                               01180000
RPRCONLD EQU   RPRBITAN+2                                               01181000
RPRCONP  EQU   RPRBITAN+1                                               01182000
RPRACTP  EQU   RPRBITAN+1                                               01183000
RPRINTIO EQU   RPRBITAN+1                                               01184000
RPRCONCT EQU   RPRBITAN+1                                               01185000
RPRHLVPD EQU   RPRBITAN+1                                               01186000
RPRHLACT EQU   RPRBITAN+1                                               01187000
RPRONLIN EQU   RPRBITAN+1                                               01188000
RPRRINOP EQU   RPRBITAN+1                                               01189000
RPRAOPN  EQU   RPRBITAN                                                 01190000
RPRENTVH EQU   RPRBITAN                                                 01191000
RPRLIVE  EQU   RPRBITAN                                                 01192000
RPRENTED EQU   RPRBITAN                                                 01193000
RPRLTASN EQU   RPRBITAN                                                 01194000
RPRENTIO EQU   RPRBITAN                                                 01195000
RPRENTBF EQU   RPRBITAN                                                 01196000
RPRINV   EQU   RPRBITAN                                                 01197000
RPRDEFLV EQU   RPRSTATE+4                                               01198000
RPRDESS1 EQU   RPRDESST                                                 01199000
RPRCURS1 EQU   RPRCURST                                                 01200000
RPRCMDWE EQU   ISTRPRE+52                                               01201000
RPRTNTQP EQU   ISTRPRE+48                                               01202000
RPRNSNEA EQU   ISTRPRE+44                                               01203000
RPRNCBA  EQU   ISTRPRE+40                                               01204000
RPRPELEN EQU   ISTRPRE+36                                               01205000
RPRELEN  EQU   ISTRPRE+32                                               01206000
RPRALPAD EQU   ISTRPRE+28                                               01207000
RPRENTAD EQU   ISTRPRE+24                                               01208000
RPRREQCT EQU   ISTRPRE+22                                               01209000
RPRINDEX EQU   ISTRPRE+20                                               01210000
RPRDAF   EQU   RPRDAFID+2                                               01211000
@NM00006 EQU   RPRDAFID                                                 01212000
@NM00005 EQU   ISTRPRE+15                                               01213000
RPRHDTYP EQU   ISTRPRE+14                                               01214000
RPRENTRY EQU   ISTRPRE+13                                               01215000
RPRNAME  EQU   RPRSRTHD                                                 01216000
LOKXCL   EQU   @NM00003                                                 01217000
LOKPRY   EQU   @NM00003                                                 01218000
@NM00004 EQU   @NM00003                                                 01219000
@NM00002 EQU   LOKCHNG                                                  01220000
LOKCT    EQU   ISTLOK                                                   01221000
SRTTYPE  EQU   ISTSRT+12                                                01222000
SRTSPECE EQU   SRTSRTE                                                  01223000
SRTSYMNM EQU   ISTSRT                                                   01224000
DEVRSV01 EQU   ISTDEVCH+7                                               01225000
DEVAUXTP EQU   ISTDEVCH+6                                               01226000
DEVADVFE EQU   DEVMODE                                                  01227000
@NM00001 EQU   DEVMODE                                                  01228000
DEVBASIC EQU   DEVMODE                                                  01229000
DEVREC   EQU   DEVMODE                                                  01230000
DEVPHYSA EQU   ISTDEVCH+4                                               01231000
DEVCSLPN EQU   DEVCHAR3                                                 01232000
DEVCSTCL EQU   DEVCHAR3                                                 01233000
DEVCCHEK EQU   DEVCHAR3                                                 01234000
DEVCATTN EQU   DEVCHAR3                                                 01235000
DEVCSWL  EQU   DEVFCCTL                                                 01236000
DEVCRVB  EQU   DEVFCCTL                                                 01237000
DEVCSSL  EQU   DEVFCCTL                                                 01238000
DEVCBSC  EQU   DEVFCCTL                                                 01239000
DEVMCODE EQU   ISTDEVCH+2                                               01240000
DEVCHAR2 EQU   DEVTCODE                                                 01241000
DEVSPOLL EQU   DEVCHAR                                                  01242000
DEVCCTL  EQU   DEVCHAR                                                  01243000
DEVNNSPT EQU   DEVCHAR                                                  01244000
DEVSPS   EQU   DEVCHAR                                                  01245000
DEVSUBND EQU   DEVCHAR                                                  01246000
DEVCONVR EQU   DEVCHAR                                                  01247000
DEVOTPUT EQU   DEVCHAR                                                  01248000
DEVINPUT EQU   DEVCHAR                                                  01249000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01250000
@RC00235 EQU   @RC00227                                                 01251000
@ENDDATA EQU   *                                                        01252000
         END   ISTSDCC4,(C'PLS2157',0702,80232)                         01253000
./  ADD  SSI=02320578,NAME=ISTSDCOD
         TITLE 'ISTSDCOD  DEVICE TYPE CHAR STRING TABLE'                00001000
ISTSDCOD CSECT                                                          00002000
@DATA    DS    0H                                                       00003000
         DS    0F                                                       00004000
         DS    0F                                                       00005000
         DS    0D                                                       00006000
@NM00001 DC    F'129'                                                   00007000
@NM00002 DC    CL4'2740'                                                00008000
         DC    CL4'2741'                                                00009000
         DC    CL4'1050'                                                00010000
         DC    CL4'TWX '                                                00011000
         DC    CL4'WTTY'                                                00012000
         DC    CL4'115A'                                                00013000
         DC    CL4'83B3'                                                00014000
         DC    CL4'2715'                                                00015000
         DC    CL4'2770'                                                00016000
         DC    CL4'2780'                                                00017000
         DC    CL4'3735'                                                00018000
         DC    CL4'3780'                                                00019000
         DC    CL4'1130'                                                00020000
         DC    CL4'1800'                                                00021000
         DC    CL4'2020'                                                00022000
         DC    CL4'2025'                                                00023000
         DC    CL4'3125'                                                00024000
         DC    CL4'3135'                                                00025000
         DC    CL4'SYS3'                                                00026000
         DC    CL4'2701'                                                00027000
         DC    CL4'2703'                                                00028000
         DC    CL4'3704'                                                00029000
         DC    CL4'3705'                                                00030000
         DC    CL4'2980'                                                00031000
         DC    CL4'3277'                                                00032000
         DC    CL4'3284'                                                00033000
         DC    CL4'3286'                                                00034000
         DC    CL4'3275'                                                00035000
         DC    CL4'3741'                                                00036000
         DC    CL4'3747'                                                00037000
         DC    9X'00000000'                                             00038000
         DC    CL4'MTA '                                                00039000
         DC    10X'00000000'                                            00040000
         DC    CL4'2972'                                                00041000
         DC    CL4'3271'                                                00042000
         DC    CL4'CC01'                                                00043000
         DC    CL4'3272'                                                00044000
         DC    45X'00000000'                                            00045000
         DC    CL4'1052'                                                00046000
         DC    CL4'1053'                                                00047000
         DC    CL4'1054'                                                00048000
         DC    CL4'1055'                                                00049000
         DC    CL4'1056'                                                00050000
         DC    CL4'1057'                                                00051000
         DC    CL4'1058'                                                00052000
         DC    CL4'1092'                                                00053000
         DC    CL4'1093'                                                00054000
         DC    CL4'LU01'                                                00055000
         DC    10X'00000000'                                            00056000
         DC    CL4'545 '                                                00057000
         DC    CL4'1017'                                                00058000
         DC    CL4'1018'                                                00059000
         DC    CL4'2203'                                                00060000
         DC    CL4'2213'                                                00061000
         DC    CL4'2265'                                                00062000
         DC    CL4'2502'                                                00063000
         DC    CL4'50  '                                                00064000
         DC    CL4'1255'                                                00065000
         DC    CL4'5496'                                                00066000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00067000
@01      EQU   01                                                       00068000
@02      EQU   02                                                       00069000
@03      EQU   03                                                       00070000
@04      EQU   04                                                       00071000
@05      EQU   05                                                       00072000
@06      EQU   06                                                       00073000
@07      EQU   07                                                       00074000
@08      EQU   08                                                       00075000
@09      EQU   09                                                       00076000
@10      EQU   10                                                       00077000
@11      EQU   11                                                       00078000
@12      EQU   12                                                       00079000
@13      EQU   13                                                       00080000
@14      EQU   14                                                       00081000
@15      EQU   15                                                       00082000
@ENDDATA EQU   *                                                        00083000
         END   ISTSDCOD,(C'PLS2159',0702,80232)                         00084000
./  ADD  SSI=02320579,NAME=ISTSDCSB
         TITLE 'ISTSDCSB   STARTBH MACRO HANDLER'                       00001000
ISTSDCSB CSECT ,                                                   0001 00002000
@MAINENT DS    0H                                                  0001 00003000
         USING *,@15                                               0001 00004000
         B     @PROLOG                                             0001 00005000
         DC    AL1(16)                                             0001 00006000
         DC    C'ISTSDCSB  80.232'                                 0001 00007000
         DROP  @15                                                      00008000
@PROLOG  DS    0H                                                  0002 00009000
         PRINT OFF                                                      00010000
         PRINT ON                                                       00011000
*/********************************************************************/ 00012000
*/*                        START PROCESSING                          */ 00013000
*/********************************************************************/ 00014000
*                                                                  0198 00015000
*   RNCGSTBH='1'B;                  /* SET STARTBH GLOBAL FOOTPRINT  */ 00016000
         OI    RNCGSTBH(RNCAREG),B'00010000'                       0198 00017000
*   RCREG=0;                        /* RETURN W/ CODE=0              */ 00018000
         SLR   RCREG,RCREG                                         0199 00019000
*   DO;                             /* TPEPILOG                      */ 00020000
*     GEN(PRINT OFF);                                              0201 00021000
         PRINT OFF                                                      00022000
*     GEN(PRINT ON);                                               0202 00023000
         PRINT ON                                                       00024000
*   END;                            /* TPEPILOG                      */ 00025000
*   END ISTSDCSB;                                                  0204 00026000
@EL00001 DS    0H                                                  0204 00027000
@EF00001 DS    0H                                                  0204 00028000
@ER00001 BR    @14                                                 0204 00029000
@DATA    DS    0H                                                       00030000
@DATD    DSECT                                                          00031000
         DS    0F                                                       00032000
ISTSDCSB CSECT                                                          00033000
         DS    0F                                                       00034000
@DATD    DSECT                                                          00035000
         DS    0D                                                       00036000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00037000
@ENDDATD EQU   *                                                        00038000
ISTSDCSB CSECT                                                          00039000
         DS    0F                                                       00040000
@SIZDATD DC    AL1(0)                                                   00041000
         DC    AL3(@ENDDATD-@DATD)                                      00042000
         DS    0D                                                       00043000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00044000
@01      EQU   01                                                       00045000
@02      EQU   02                                                       00046000
@03      EQU   03                                                       00047000
@04      EQU   04                                                       00048000
@05      EQU   05                                                       00049000
@06      EQU   06                                                       00050000
@07      EQU   07                                                       00051000
@08      EQU   08                                                       00052000
@09      EQU   09                                                       00053000
@10      EQU   10                                                       00054000
@11      EQU   11                                                       00055000
@12      EQU   12                                                       00056000
@13      EQU   13                                                       00057000
@14      EQU   14                                                       00058000
@15      EQU   15                                                       00059000
RNCAREG  EQU   @06                                                      00060000
RCREG    EQU   @15                                                      00061000
ISTDEVCH EQU   0                                                        00062000
DEVSHCH  EQU   ISTDEVCH                                                 00063000
DEVCHAR  EQU   DEVSHCH                                                  00064000
DEVTCODE EQU   ISTDEVCH+1                                               00065000
DEVFLAGS EQU   ISTDEVCH+3                                               00066000
DEVFCCTL EQU   DEVFLAGS                                                 00067000
DEVCHAR3 EQU   DEVFLAGS                                                 00068000
DEVMODE  EQU   ISTDEVCH+5                                               00069000
ISTSRT   EQU   0                                                        00070000
SRTSRTE  EQU   ISTSRT+8                                                 00071000
SRTXTNBS EQU   ISTSRT+13                                                00072000
ISTLOK   EQU   0                                                        00073000
LOKCHN   EQU   ISTLOK+1                                                 00074000
LOKCHNG  EQU   LOKCHN                                                   00075000
@NM00003 EQU   LOKCHNG+2                                                00076000
ISTRPRE  EQU   0                                                        00077000
RPRSRTHD EQU   ISTRPRE                                                  00078000
RPRDAFID EQU   ISTRPRE+16                                               00079000
RPRSTATE EQU   ISTRPRE+56                                               00080000
RPRCURST EQU   RPRSTATE                                                 00081000
RPRDESST EQU   RPRSTATE+2                                               00082000
RPRBITAN EQU   ISTRPRE+61                                               00083000
RPRFLAGS EQU   ISTRPRE+66                                               00084000
ISTRCPRE EQU   0                                                        00085000
RCPSARRY EQU   ISTRCPRE+84                                              00086000
RCPPACE  EQU   ISTRCPRE+108                                             00087000
RCPNCPPC EQU   ISTRCPRE+110                                             00088000
RCPPMODE EQU   ISTRCPRE+113                                             00089000
RCPCYMOD EQU   RCPPMODE                                                 00090000
RCPCYSET EQU   RCPPMODE                                                 00091000
RCPSESSM EQU   ISTRCPRE+115                                             00092000
RCPBITAN EQU   ISTRCPRE+116                                             00093000
ISTRAP   EQU   0                                                        00094000
RAPBITAN EQU   ISTRAP+165                                               00095000
ISTRDT   EQU   0                                                        00096000
RDTPLEN  EQU   ISTRDT+84                                                00097000
RDTPRIOR EQU   RDTPLEN                                                  00098000
RDTBITAN EQU   ISTRDT+113                                               00099000
RDTCRIA  EQU   ISTRDT+116                                               00100000
ISTRLN   EQU   0                                                        00101000
RLNADR   EQU   ISTRLN+84                                                00102000
RLNFLAG  EQU   RLNADR                                                   00103000
RLNUCBAD EQU   RLNADR+1                                                 00104000
RLNCSLRC EQU   ISTRLN+104                                               00105000
RLNBITAN EQU   ISTRLN+112                                               00106000
RLNRACNT EQU   RLNBITAN                                                 00107000
RLNCONCT EQU   RLNBITAN+2                                               00108000
RLNLSCMD EQU   RLNBITAN+3                                               00109000
RLNINBFR EQU   ISTRLN+132                                               00110000
ISTRPU   EQU   0                                                        00111000
RPUSTAID EQU   ISTRPU+92                                                00112000
RPUID48  EQU   RPUSTAID+2                                               00113000
ISTRAPRE EQU   0                                                        00114000
ISTRTR   EQU   0                                                        00115000
RTRADR   EQU   ISTRTR+144                                               00116000
RTRFLAG  EQU   RTRADR                                                   00117000
RTRBITAN EQU   ISTRTR+164                                               00118000
RTRRAALL EQU   RTRBITAN                                                 00119000
RTRBSCID EQU   ISTRTR+171                                               00120000
ISTRSW   EQU   0                                                        00121000
ISTRRN   EQU   0                                                        00122000
RRNADR   EQU   ISTRRN+136                                               00123000
RRNFLAG  EQU   RRNADR                                                   00124000
RRNUCBAD EQU   RRNADR+1                                                 00125000
RRNHPRE  EQU   ISTRRN+196                                               00126000
RRNBITAN EQU   ISTRRN+201                                               00127000
RRNLVL   EQU   ISTRRN+204                                               00128000
RRNNMDPD EQU   ISTRRN+232                                               00129000
RRNLDFSM EQU   ISTRRN+298                                               00130000
ISTRPX   EQU   0                                                        00131000
ISTRPT   EQU   0                                                        00132000
RPTXTCID EQU   ISTRPT+136                                               00133000
RPTLNCID EQU   RPTXTCID                                                 00134000
RPTDITT  EQU   ISTRPT+144                                               00135000
RPTBITAN EQU   ISTRPT+166                                               00136000
ISTRLX   EQU   0                                                        00137000
RLXBITAN EQU   ISTRLX+92                                                00138000
ISTRLU   EQU   0                                                        00139000
RLUBITAN EQU   ISTRLU+146                                               00140000
ISTRLS   EQU   0                                                        00141000
ISTRLC   EQU   0                                                        00142000
RLCADR   EQU   ISTRLC+84                                                00143000
RLCFLAG  EQU   RLCADR                                                   00144000
ISTRIN   EQU   0                                                        00145000
RINDAFID EQU   ISTRIN+124                                               00146000
RINBITAN EQU   ISTRIN+130                                               00147000
RINFLAGS EQU   ISTRIN+149                                               00148000
ISTRGP   EQU   0                                                        00149000
RGPBITAN EQU   ISTRGP+94                                                00150000
ISTRDS   EQU   0                                                        00151000
ISTRDA   EQU   0                                                        00152000
ISTRCL   EQU   0                                                        00153000
RCLADR   EQU   ISTRCL+84                                                00154000
RCLFLAG  EQU   RCLADR                                                   00155000
ISTRCDRS EQU   0                                                        00156000
@NM00109 EQU   ISTRCDRS+166                                             00157000
ISTRCDRM EQU   0                                                        00158000
RCDRMPDN EQU   ISTRCDRM+188                                             00159000
RCDRMRPQ EQU   ISTRCDRM+196                                             00160000
RCDRMFGS EQU   ISTRCDRM+208                                             00161000
ISTRCC   EQU   0                                                        00162000
RCCBITAN EQU   ISTRCC+105                                               00163000
ISTPAT   EQU   0                                                        00164000
PATFLAGA EQU   ISTPAT+7                                                 00165000
ISTGNT   EQU   0                                                        00166000
ISTDOT   EQU   0                                                        00167000
ISTDNT   EQU   0                                                        00168000
DNTTELNO EQU   ISTDNT+1                                                 00169000
ISTRNCA  EQU   0                                                        00170000
RNCLPNM  EQU   ISTRNCA+116                                              00171000
@NM00137 EQU   RNCLPNM+4                                                00172000
RNCGSTBH EQU   ISTRNCA+127                                              00173000
RNCWORK1 EQU   ISTRNCA+524                                              00174000
RNCPHR1  EQU   RNCWORK1                                                 00175000
RNCWORK2 EQU   ISTRNCA+2572                                             00176000
RNCPHR2  EQU   RNCWORK2                                                 00177000
RNCWORK3 EQU   ISTRNCA+4620                                             00178000
RNCRNMDL EQU   ISTRNCA+7564                                             00179000
RNCTRMDL EQU   RNCRNMDL                                                 00180000
RNCLNMDL EQU   RNCTRMDL                                                 00181000
RNCSWMDL EQU   RNCLNMDL                                                 00182000
RNCLSMDL EQU   RNCSWMDL                                                 00183000
RNCDAMDL EQU   RNCLSMDL                                                 00184000
RNCCLMDL EQU   RNCDAMDL                                                 00185000
RNCCMMDL EQU   ISTRNCA+7896                                             00186000
RNCLUMDL EQU   RNCCMMDL                                                 00187000
RNCINMDL EQU   RNCLUMDL                                                 00188000
RNCCCMDL EQU   RNCINMDL                                                 00189000
RNCGPMDL EQU   RNCCCMDL                                                 00190000
RNCPXMDL EQU   RNCGPMDL                                                 00191000
ISTLCST  EQU   0                                                        00192000
LCSTTYPE EQU   ISTLCST+12                                               00193000
LCSTACR  EQU   ISTLCST+18                                               00194000
ISTDITHD EQU   0                                                        00195000
ISTDHDVI EQU   0                                                        00196000
DHDDIVTH EQU   ISTDHDVI+12                                              00197000
ISTDDTVI EQU   0                                                        00198000
ISTRNCDT EQU   0                                                        00199000
ISTRNCGT EQU   0                                                        00200000
ISTRNCPT EQU   0                                                        00201000
SRTXTNSN EQU   SRTXTNBS                                                 00202000
RCPSIBQ  EQU   RCPSARRY                                                 00203000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00204000
SRTDATA  EQU   SRTXTNSN+3                                               00205000
SRTUSELN EQU   SRTXTNSN+1                                               00206000
SRTFLAGS EQU   SRTXTNSN                                                 00207000
RNCPT    EQU   ISTRNCPT+4                                               00208000
RNCPTLN  EQU   ISTRNCPT                                                 00209000
RNCGT    EQU   ISTRNCGT+4                                               00210000
RNCGTLN  EQU   ISTRNCGT                                                 00211000
RNCDT    EQU   ISTRNCDT+4                                               00212000
RNCDTLN  EQU   ISTRNCDT                                                 00213000
DDTASSOC EQU   ISTDDTVI+40                                              00214000
DDTRDTPT EQU   ISTDDTVI+36                                              00215000
DDTTRNM  EQU   ISTDDTVI+28                                              00216000
DDTBSCLN EQU   ISTDDTVI+27                                              00217000
DDTBSCID EQU   ISTDDTVI+4                                               00218000
DDTFWPTR EQU   ISTDDTVI                                                 00219000
DHDGPPTR EQU   ISTDHDVI+32                                              00220000
DHDDVOFF EQU   ISTDHDVI+28                                              00221000
DHDDTPTR EQU   ISTDHDVI+24                                              00222000
DHDDHPTR EQU   ISTDHDVI+20                                              00223000
DHDRSVD  EQU   DHDDIVTH+6                                               00224000
DHDIDLEN EQU   DHDDIVTH+4                                               00225000
DHDNUMFE EQU   DHDDIVTH+2                                               00226000
DHDNUME  EQU   DHDDIVTH                                                 00227000
DHDHNAME EQU   ISTDHDVI+4                                               00228000
DHDFWPTR EQU   ISTDHDVI                                                 00229000
DITDITT  EQU   ISTDITHD+16                                              00230000
DITLEN   EQU   ISTDITHD+15                                              00231000
DITUNUSD EQU   ISTDITHD+12                                              00232000
DITLSTNM EQU   ISTDITHD+4                                               00233000
DITFWDPT EQU   ISTDITHD                                                 00234000
LCSTRESV EQU   ISTLCST+19                                               00235000
LCSTACR3 EQU   LCSTACR                                                  00236000
LCSTACR2 EQU   LCSTACR                                                  00237000
LCSTACR1 EQU   LCSTACR                                                  00238000
LCSTACR0 EQU   LCSTACR                                                  00239000
LCSTLCCD EQU   LCSTTYPE+5                                               00240000
LCSTLCTP EQU   LCSTTYPE                                                 00241000
LCSTNAME EQU   ISTLCST+4                                                00242000
LCSTFWDP EQU   ISTLCST                                                  00243000
RNCEND   EQU   ISTRNCA+8104                                             00244000
RNCLXMDL EQU   RNCPXMDL                                                 00245000
RNCDSMDL EQU   RNCCLMDL                                                 00246000
RNCLNEO  EQU   ISTRNCA+7560                                             00247000
RNCRRT   EQU   ISTRNCA+7556                                             00248000
RNCRRTNM EQU   ISTRNCA+7552                                             00249000
RNCPTRAL EQU   ISTRNCA+7548                                             00250000
RNCPTRAF EQU   ISTRNCA+7544                                             00251000
RNCCCLU  EQU   ISTRNCA+7392                                             00252000
RNCCLTR  EQU   ISTRNCA+7184                                             00253000
RNCLNLU  EQU   ISTRNCA+7032                                             00254000
RNCLNTR  EQU   ISTRNCA+6824                                             00255000
RNCLNPX  EQU   ISTRNCA+6728                                             00256000
RNCLNCC  EQU   ISTRNCA+6596                                             00257000
RNCLNCL  EQU   ISTRNCA+6496                                             00258000
RNCGPLU  EQU   ISTRNCA+6344                                             00259000
RNCGPTR  EQU   ISTRNCA+6136                                             00260000
RNCGPPX  EQU   ISTRNCA+6040                                             00261000
RNCGPCC  EQU   ISTRNCA+5908                                             00262000
RNCGPCL  EQU   ISTRNCA+5808                                             00263000
RNCGPLN  EQU   ISTRNCA+5632                                             00264000
RNCLUDEF EQU   ISTRNCA+5480                                             00265000
RNCTRDEF EQU   ISTRNCA+5272                                             00266000
RNCPXDEF EQU   ISTRNCA+5176                                             00267000
RNCCCDEF EQU   ISTRNCA+5044                                             00268000
RNCCLDEF EQU   ISTRNCA+4944                                             00269000
RNCLNDEF EQU   ISTRNCA+4768                                             00270000
RNCOWSIF EQU   ISTRNCA+4760                                             00271000
RNCOWNER EQU   ISTRNCA+4752                                             00272000
RNCDRPCT EQU   ISTRNCA+4750                                             00273000
RNCDRLCT EQU   ISTRNCA+4748                                             00274000
RNCWORK4 EQU   ISTRNCA+4684                                             00275000
RNCLDPRM EQU   RNCWORK3                                                 00276000
RNCOCPRM EQU   RNCPHR2                                                  00277000
RNCLMDCB EQU   RNCPHR1                                                  00278000
RNCDAT3  EQU   ISTRNCA+468                                              00279000
RNCSAV3  EQU   ISTRNCA+396                                              00280000
RNCDAT2  EQU   ISTRNCA+340                                              00281000
RNCSAV2  EQU   ISTRNCA+268                                              00282000
RNCDAT1  EQU   ISTRNCA+212                                              00283000
RNCSAV1  EQU   ISTRNCA+140                                              00284000
@NM00141 EQU   ISTRNCA+136                                              00285000
@NM00140 EQU   ISTRNCA+132                                              00286000
RNCPFLG  EQU   ISTRNCA+132                                              00287000
RNCREPTO EQU   ISTRNCA+132                                              00288000
RNCACTIV EQU   ISTRNCA+132                                              00289000
RNCGICA  EQU   ISTRNCA+131                                              00290000
RNCNOBSC EQU   ISTRNCA+131                                              00291000
RNCGSYSC EQU   ISTRNCA+131                                              00292000
RNCCAMBH EQU   ISTRNCA+131                                              00293000
RNCENCR  EQU   ISTRNCA+131                                              00294000
RNCBKUP  EQU   ISTRNCA+131                                              00295000
RNCTBFR  EQU   ISTRNCA+131                                              00296000
RNCGPUIN EQU   ISTRNCA+131                                              00297000
RNCGVB   EQU   ISTRNCA+130                                              00298000
RNCGLSBD EQU   ISTRNCA+130                                              00299000
RNCGSWBD EQU   ISTRNCA+130                                              00300000
RNCGRNBD EQU   ISTRNCA+130                                              00301000
RNCGCLPU EQU   ISTRNCA+130                                              00302000
RNCGANS  EQU   ISTRNCA+130                                              00303000
RNCGINOD EQU   ISTRNCA+130                                              00304000
RNCGCUA  EQU   ISTRNCA+130                                              00305000
RNCGRNAM EQU   ISTRNCA+129                                              00306000
RNCGDLLN EQU   ISTRNCA+129                                              00307000
RNCGRGAP EQU   ISTRNCA+129                                              00308000
RNCLNID  EQU   ISTRNCA+129                                              00309000
RNCGPID  EQU   ISTRNCA+129                                              00310000
RNCLNOW  EQU   ISTRNCA+129                                              00311000
RNCGNOW  EQU   ISTRNCA+129                                              00312000
RNCLQUE  EQU   ISTRNCA+129                                              00313000
RNCDTYPE EQU   ISTRNCA+128                                              00314000
RNCGQUE  EQU   ISTRNCA+127                                              00315000
RNCGVSEQ EQU   ISTRNCA+127                                              00316000
RNCGTWX  EQU   ISTRNCA+127                                              00317000
RNCGCTRM EQU   ISTRNCA+127                                              00318000
RNCGCOMP EQU   ISTRNCA+127                                              00319000
RNCGLU   EQU   ISTRNCA+127                                              00320000
RNCGTERM EQU   ISTRNCA+127                                              00321000
RNCGPA   EQU   ISTRNCA+126                                              00322000
RNCGPU   EQU   ISTRNCA+126                                              00323000
RNCGCLUS EQU   ISTRNCA+126                                              00324000
RNCGLINE EQU   ISTRNCA+126                                              00325000
RNCGGRP  EQU   ISTRNCA+126                                              00326000
RNCGHOST EQU   ISTRNCA+126                                              00327000
RNCGBLD  EQU   ISTRNCA+126                                              00328000
RNCGPCCU EQU   ISTRNCA+126                                              00329000
RNCLPCT  EQU   ISTRNCA+124                                              00330000
RNCNODCT EQU   RNCLPNM+6                                                00331000
@NM00139 EQU   @NM00137+1                                               00332000
@NM00138 EQU   @NM00137+1                                               00333000
RNCGPOLL EQU   @NM00137+1                                               00334000
RNCGRRT  EQU   @NM00137+1                                               00335000
RNCINHIB EQU   @NM00137+1                                               00336000
RNCPULU  EQU   @NM00137+1                                               00337000
RNCCLNS  EQU   @NM00137+1                                               00338000
RNCLNNS  EQU   @NM00137+1                                               00339000
RNCGPNS  EQU   @NM00137                                                 00340000
RNCGBLDR EQU   @NM00137                                                 00341000
RNCPCOWN EQU   @NM00137                                                 00342000
RNCPCSUB EQU   @NM00137                                                 00343000
RNCPCFTP EQU   @NM00137                                                 00344000
RNCSUBAR EQU   @NM00137                                                 00345000
RNCLR    EQU   @NM00137                                                 00346000
RNCSKIP  EQU   @NM00137                                                 00347000
RNCLPNMP EQU   RNCLPNM                                                  00348000
RNCDIVT  EQU   ISTRNCA+112                                              00349000
RNCDITT  EQU   ISTRNCA+108                                              00350000
RNCLCST  EQU   ISTRNCA+104                                              00351000
RNCLWS   EQU   ISTRNCA+100                                              00352000
RNCFWS   EQU   ISTRNCA+96                                               00353000
RNCOFFS2 EQU   ISTRNCA+92                                               00354000
RNCOFFST EQU   ISTRNCA+88                                               00355000
RNCLTBLS EQU   ISTRNCA+84                                               00356000
RNCFTBLS EQU   ISTRNCA+80                                               00357000
RNCLENT  EQU   ISTRNCA+76                                               00358000
RNCFENT  EQU   ISTRNCA+72                                               00359000
RNCLRNLL EQU   ISTRNCA+68                                               00360000
RNCFRNLL EQU   ISTRNCA+64                                               00361000
RNCPX    EQU   ISTRNCA+60                                               00362000
RNCDA    EQU   ISTRNCA+56                                               00363000
RNCLLN   EQU   ISTRNCA+52                                               00364000
RNCCM    EQU   ISTRNCA+48                                               00365000
RNCIN    EQU   ISTRNCA+44                                               00366000
RNCLU    EQU   ISTRNCA+40                                               00367000
RNCTR    EQU   ISTRNCA+36                                               00368000
RNCCC    EQU   ISTRNCA+32                                               00369000
RNCCL    EQU   ISTRNCA+28                                               00370000
RNCLN    EQU   ISTRNCA+24                                               00371000
RNCGP    EQU   ISTRNCA+20                                               00372000
RNCDS    EQU   ISTRNCA+16                                               00373000
RNCSWLS  EQU   ISTRNCA+12                                               00374000
RNCRN    EQU   ISTRNCA+8                                                00375000
RNCTABNM EQU   ISTRNCA+4                                                00376000
RNCSFXCT EQU   ISTRNCA+2                                                00377000
@NM00136 EQU   ISTRNCA+1                                                00378000
RNCID    EQU   ISTRNCA                                                  00379000
DNTNAME  EQU   DNTTELNO                                                 00380000
DNTCTDIG EQU   ISTDNT                                                   00381000
DOTADTRM EQU   ISTDOT                                                   00382000
GNTGRPNM EQU   ISTGNT                                                   00383000
@NM00135 EQU   PATFLAGA                                                 00384000
@NM00134 EQU   PATFLAGA                                                 00385000
@NM00133 EQU   PATFLAGA                                                 00386000
@NM00132 EQU   PATFLAGA                                                 00387000
@NM00131 EQU   PATFLAGA                                                 00388000
@NM00130 EQU   PATFLAGA                                                 00389000
PATDCALL EQU   PATFLAGA                                                 00390000
PATUSEFG EQU   PATFLAGA                                                 00391000
PATRDCNT EQU   ISTPAT+6                                                 00392000
PATGRPID EQU   ISTPAT+5                                                 00393000
PATPTHID EQU   ISTPAT+4                                                 00394000
PATDINDX EQU   ISTPAT+2                                                 00395000
PATGINDX EQU   ISTPAT                                                   00396000
RCCEND   EQU   ISTRCC+132                                               00397000
@NM00129 EQU   ISTRCC+130                                               00398000
RCCSESCT EQU   ISTRCC+129                                               00399000
RCCCNCNT EQU   ISTRCC+128                                               00400000
RCCPUXPT EQU   ISTRCC+124                                               00401000
@NM00128 EQU   ISTRCC+122                                               00402000
RCCINDEX EQU   ISTRCC+120                                               00403000
RCCPATHZ EQU   ISTRCC+118                                               00404000
RCCCTELU EQU   ISTRCC+116                                               00405000
RCCTIMER EQU   ISTRCC+112                                               00406000
RCCPATHT EQU   ISTRCC+108                                               00407000
@NM00127 EQU   ISTRCC+107                                               00408000
@NM00126 EQU   RCCBITAN+1                                               00409000
@NM00125 EQU   RCCBITAN+1                                               00410000
@NM00124 EQU   RCCBITAN+1                                               00411000
@NM00123 EQU   RCCBITAN+1                                               00412000
@NM00122 EQU   RCCBITAN+1                                               00413000
@NM00121 EQU   RCCBITAN+1                                               00414000
RCCANS   EQU   RCCBITAN+1                                               00415000
RCCBNNSP EQU   RCCBITAN+1                                               00416000
RCCIRETR EQU   RCCBITAN                                                 00417000
RCCDSNPR EQU   RCCBITAN                                                 00418000
RCCACTPU EQU   RCCBITAN                                                 00419000
RCCBRKCN EQU   RCCBITAN                                                 00420000
RCCFINAL EQU   RCCBITAN                                                 00421000
RCCDIALP EQU   RCCBITAN                                                 00422000
RCCBRKF  EQU   RCCBITAN                                                 00423000
RCCCTPGD EQU   RCCBITAN                                                 00424000
RCCCDFLG EQU   ISTRCC+104                                               00425000
RCCPRE   EQU   ISTRCC                                                   00426000
RCDRMEND EQU   ISTRCDRM+220                                             00427000
@NM00120 EQU   ISTRCDRM+218                                             00428000
RCDRMSEQ EQU   ISTRCDRM+216                                             00429000
@NM00119 EQU   ISTRCDRM+213                                             00430000
RCDRMSC  EQU   ISTRCDRM+212                                             00431000
@NM00118 EQU   RCDRMFGS+3                                               00432000
@NM00117 EQU   RCDRMFGS+3                                               00433000
@NM00116 EQU   RCDRMFGS+3                                               00434000
@NM00115 EQU   RCDRMFGS+3                                               00435000
@NM00114 EQU   RCDRMFGS+3                                               00436000
@NM00113 EQU   RCDRMFGS+3                                               00437000
@NM00112 EQU   RCDRMFGS+3                                               00438000
RCDRMCD2 EQU   RCDRMFGS+3                                               00439000
RCDRCDRS EQU   RCDRMFGS+2                                               00440000
RCDRMDYN EQU   RCDRMFGS+2                                               00441000
RCDRMRID EQU   RCDRMFGS+2                                               00442000
RCDRMLOQ EQU   RCDRMFGS+2                                               00443000
RCDRMNMP EQU   RCDRMFGS+2                                               00444000
RCDRMPS  EQU   RCDRMFGS+2                                               00445000
RCDRMURC EQU   RCDRMFGS+2                                               00446000
RCDRMNAP EQU   RCDRMFGS+2                                               00447000
RCDRMVL  EQU   RCDRMFGS+1                                               00448000
RCDRMSPC EQU   RCDRMFGS+1                                               00449000
RCDRMINC EQU   RCDRMFGS+1                                               00450000
RCDRMLPS EQU   RCDRMFGS+1                                               00451000
RCDRMTCR EQU   RCDRMFGS+1                                               00452000
RCDRMDTC EQU   RCDRMFGS+1                                               00453000
RCDRMDT  EQU   RCDRMFGS+1                                               00454000
RCDRMCLR EQU   RCDRMFGS+1                                               00455000
RCDRMCLC EQU   RCDRMFGS                                                 00456000
RCDRMDCD EQU   RCDRMFGS                                                 00457000
RCDRMOVR EQU   RCDRMFGS                                                 00458000
RCDRMSDT EQU   RCDRMFGS                                                 00459000
RCDRMACT EQU   RCDRMFGS                                                 00460000
RCDRMSCA EQU   RCDRMFGS                                                 00461000
RCDRMPRI EQU   RCDRMFGS                                                 00462000
RCDRMHST EQU   RCDRMFGS                                                 00463000
RCDRMRP  EQU   ISTRCDRM+204                                             00464000
RCDRMLRP EQU   RCDRMRPQ+4                                               00465000
RCDRMFRP EQU   RCDRMRPQ                                                 00466000
RCDRMARP EQU   ISTRCDRM+192                                             00467000
RCDRMPDT EQU   RCDRMPDN                                                 00468000
RCDRMPR  EQU   ISTRCDRM                                                 00469000
RCDRSEND EQU   ISTRCDRS+168                                             00470000
@NM00111 EQU   ISTRCDRS+167                                             00471000
@NM00110 EQU   @NM00109                                                 00472000
RCDRDYN  EQU   @NM00109                                                 00473000
RCDTKCNT EQU   ISTRCDRS+164                                             00474000
RCDCDRMN EQU   ISTRCDRS+156                                             00475000
RCDRCDRM EQU   ISTRCDRS+148                                             00476000
RCDRSARP EQU   ISTRCDRS+144                                             00477000
RCDRSPR  EQU   ISTRCDRS                                                 00478000
RCLEND   EQU   ISTRCL+100                                               00479000
@NM00108 EQU   ISTRCL+98                                                00480000
RCLCTNGP EQU   ISTRCL+96                                                00481000
RCLCTECM EQU   ISTRCL+94                                                00482000
RCLCTETR EQU   ISTRCL+92                                                00483000
RCLGPOLA EQU   ISTRCL+88                                                00484000
RCLGPADR EQU   RCLADR+1                                                 00485000
@NM00107 EQU   RCLFLAG                                                  00486000
@NM00106 EQU   RCLFLAG                                                  00487000
@NM00105 EQU   RCLFLAG                                                  00488000
@NM00104 EQU   RCLFLAG                                                  00489000
@NM00103 EQU   RCLFLAG                                                  00490000
@NM00102 EQU   RCLFLAG                                                  00491000
@NM00101 EQU   RCLFLAG                                                  00492000
RCLBATCH EQU   RCLFLAG                                                  00493000
RCLPRE   EQU   ISTRCL                                                   00494000
RDAEND   EQU   ISTRDA+136                                               00495000
RDAPRE   EQU   ISTRDA                                                   00496000
RDSEND   EQU   ISTRDS+92                                                00497000
RDSCTATR EQU   ISTRDS+90                                                00498000
RDSCTTRM EQU   ISTRDS+88                                                00499000
RDSADDOT EQU   ISTRDS+84                                                00500000
RDSPRE   EQU   ISTRDS                                                   00501000
RGPEND   EQU   ISTRGP+96                                                00502000
@NM00100 EQU   ISTRGP+95                                                00503000
@NM00099 EQU   RGPBITAN                                                 00504000
@NM00098 EQU   RGPBITAN                                                 00505000
@NM00097 EQU   RGPBITAN                                                 00506000
RGPX21SW EQU   RGPBITAN                                                 00507000
RGPASDLC EQU   RGPBITAN                                                 00508000
RGPABSC  EQU   RGPBITAN                                                 00509000
RGPASS   EQU   RGPBITAN                                                 00510000
RGPADIL  EQU   RGPBITAN                                                 00511000
@NM00096 EQU   ISTRGP+92                                                00512000
@NM00095 EQU   ISTRGP+90                                                00513000
@NM00094 EQU   ISTRGP+88                                                00514000
@NM00093 EQU   ISTRGP+86                                                00515000
@NM00092 EQU   ISTRGP+84                                                00516000
RGPPRE   EQU   ISTRGP                                                   00517000
RINEND   EQU   ISTRIN+152                                               00518000
@NM00091 EQU   ISTRIN+150                                               00519000
@NM00090 EQU   RINFLAGS                                                 00520000
RINCHCON EQU   RINFLAGS                                                 00521000
RINTG    EQU   ISTRIN+148                                               00522000
RINXTRIN EQU   ISTRIN+144                                               00523000
RINNCPPT EQU   ISTRIN+140                                               00524000
RINREAL  EQU   ISTRIN+132                                               00525000
RINDEFTG EQU   ISTRIN+131                                               00526000
RINBCKUP EQU   RINBITAN                                                 00527000
RINCHAN  EQU   RINBITAN                                                 00528000
RINPRSWD EQU   RINBITAN                                                 00529000
RINLOCAL EQU   RINBITAN                                                 00530000
RINPEER  EQU   RINBITAN                                                 00531000
RINLDISC EQU   RINBITAN                                                 00532000
RINNODEF EQU   RINBITAN                                                 00533000
RINREMPO EQU   RINBITAN                                                 00534000
RINCNCNT EQU   ISTRIN+129                                               00535000
RINNODID EQU   ISTRIN+128                                               00536000
RINRLDAF EQU   RINDAFID+2                                               00537000
@NM00089 EQU   RINDAFID                                                 00538000
RINLOCRN EQU   ISTRIN+120                                               00539000
RINCPLVL EQU   ISTRIN+116                                               00540000
RINCTDRU EQU   ISTRIN+112                                               00541000
RINREMOT EQU   ISTRIN+108                                               00542000
RINTRENT EQU   ISTRIN+104                                               00543000
RINCRPRE EQU   ISTRIN                                                   00544000
RLCEND   EQU   ISTRLC+92                                                00545000
@NM00088 EQU   ISTRLC+91                                                00546000
RLCLCCUA EQU   ISTRLC+88                                                00547000
RLCUCBAD EQU   RLCADR+1                                                 00548000
@NM00087 EQU   RLCFLAG                                                  00549000
@NM00086 EQU   RLCFLAG                                                  00550000
@NM00085 EQU   RLCFLAG                                                  00551000
@NM00084 EQU   RLCFLAG                                                  00552000
@NM00083 EQU   RLCFLAG                                                  00553000
@NM00082 EQU   RLCFLAG                                                  00554000
RLCACNT  EQU   RLCFLAG                                                  00555000
RLCALLOC EQU   RLCFLAG                                                  00556000
RLCPRE   EQU   ISTRLC                                                   00557000
RLSEND   EQU   ISTRLS+140                                               00558000
@NM00081 EQU   ISTRLS+138                                               00559000
RLSCTELU EQU   ISTRLS+136                                               00560000
RLSPRE   EQU   ISTRLS                                                   00561000
RLUEND   EQU   ISTRLU+152                                               00562000
RLUSEQNO EQU   ISTRLU+148                                               00563000
@NM00080 EQU   RLUBITAN+1                                               00564000
@NM00079 EQU   RLUBITAN+1                                               00565000
@NM00078 EQU   RLUBITAN+1                                               00566000
@NM00077 EQU   RLUBITAN+1                                               00567000
@NM00076 EQU   RLUBITAN+1                                               00568000
@NM00075 EQU   RLUBITAN+1                                               00569000
@NM00074 EQU   RLUBITAN+1                                               00570000
@NM00073 EQU   RLUBITAN                                                 00571000
@NM00072 EQU   RLUBITAN                                                 00572000
RLULOCSE EQU   RLUBITAN                                                 00573000
RLUCLNUP EQU   RLUBITAN                                                 00574000
RLUACTLU EQU   RLUBITAN                                                 00575000
RLUCDCTL EQU   RLUBITAN                                                 00576000
RLUNDSES EQU   RLUBITAN                                                 00577000
RLUBATCH EQU   RLUBITAN                                                 00578000
RLULOCAD EQU   ISTRLU+145                                               00579000
RLUTYPE  EQU   ISTRLU+144                                               00580000
RLUCRPR  EQU   ISTRLU                                                   00581000
RLXEND   EQU   ISTRLX+96                                                00582000
@NM00071 EQU   ISTRLX+93                                                00583000
@NM00070 EQU   RLXBITAN                                                 00584000
@NM00069 EQU   RLXBITAN                                                 00585000
@NM00068 EQU   RLXBITAN                                                 00586000
@NM00067 EQU   RLXBITAN                                                 00587000
@NM00066 EQU   RLXBITAN                                                 00588000
@NM00065 EQU   RLXBITAN                                                 00589000
@NM00064 EQU   RLXBITAN                                                 00590000
RLXINUSE EQU   RLXBITAN                                                 00591000
RLXLUPTR EQU   ISTRLX+88                                                00592000
RLXNLUX  EQU   ISTRLX+84                                                00593000
RLXPRE   EQU   ISTRLX                                                   00594000
RPTEND   EQU   ISTRPT+176                                               00595000
RPTCTNM  EQU   ISTRPT+168                                               00596000
@NM00063 EQU   RPTBITAN+1                                               00597000
@NM00062 EQU   RPTBITAN+1                                               00598000
@NM00061 EQU   RPTBITAN+1                                               00599000
@NM00060 EQU   RPTBITAN+1                                               00600000
@NM00059 EQU   RPTBITAN+1                                               00601000
@NM00058 EQU   RPTBITAN+1                                               00602000
@NM00057 EQU   RPTBITAN+1                                               00603000
@NM00056 EQU   RPTBITAN+1                                               00604000
RPTISTAT EQU   RPTBITAN                                                 00605000
RPTDYNAM EQU   RPTBITAN                                                 00606000
RPTVYIMM EQU   RPTBITAN                                                 00607000
RPTVIODN EQU   RPTBITAN                                                 00608000
RPTONLIN EQU   RPTBITAN                                                 00609000
RPTHLVPD EQU   RPTBITAN                                                 00610000
RPTVRYPD EQU   RPTBITAN                                                 00611000
RPTASLEP EQU   RPTBITAN                                                 00612000
RPTDAFSV EQU   ISTRPT+164                                               00613000
RPTPTHCT EQU   ISTRPT+162                                               00614000
RPTPEPCT EQU   ISTRPT+160                                               00615000
RPTNSNSV EQU   ISTRPT+156                                               00616000
RPTUTERM EQU   ISTRPT+152                                               00617000
RPTATERM EQU   ISTRPT+148                                               00618000
RPTDIVT  EQU   RPTDITT                                                  00619000
@NM00055 EQU   RPTXTCID+4                                               00620000
RPTLNDAF EQU   RPTLNCID+2                                               00621000
RPTLNSAF EQU   RPTLNCID                                                 00622000
RPTLN    EQU   ISTRPT                                                   00623000
RPXEND   EQU   ISTRPX+96                                                00624000
@NM00054 EQU   ISTRPX+93                                                00625000
RPXMAXLU EQU   ISTRPX+92                                                00626000
RPXPUPTR EQU   ISTRPX+88                                                00627000
RPXFLUX  EQU   ISTRPX+84                                                00628000
RPXPRE   EQU   ISTRPX                                                   00629000
RRNEND   EQU   ISTRRN+332                                               00630000
RRNLDRID EQU   ISTRRN+324                                               00631000
RRNCLDST EQU   ISTRRN+316                                               00632000
RRNGDSTA EQU   ISTRRN+308                                               00633000
RRNGLSTA EQU   ISTRRN+300                                               00634000
RRNLDCAT EQU   RRNLDFSM                                                 00635000
RRNVRID  EQU   ISTRRN+296                                               00636000
RRNPUXTN EQU   ISTRRN+292                                               00637000
RRNLUCT  EQU   ISTRRN+290                                               00638000
RRNPUCT  EQU   ISTRRN+288                                               00639000
RRNLPPTR EQU   ISTRRN+284                                               00640000
RRNTPPTR EQU   ISTRRN+280                                               00641000
RRNFNAEQ EQU   ISTRRN+276                                               00642000
@NM00053 EQU   ISTRRN+264                                               00643000
@NM00052 EQU   ISTRRN+260                                               00644000
RRNNMNCP EQU   ISTRRN+252                                               00645000
@NM00051 EQU   ISTRRN+249                                               00646000
RRNAMNUM EQU   ISTRRN+248                                               00647000
RRNAMLST EQU   ISTRRN+244                                               00648000
RRNCDPWE EQU   ISTRRN+240                                               00649000
RRNPUBI  EQU   RRNNMDPD+6                                               00650000
RRNDPLUB EQU   RRNNMDPD                                                 00651000
RRNINBFR EQU   ISTRRN+231                                               00652000
RRNDEFLV EQU   ISTRRN+230                                               00653000
RRNRNCUA EQU   ISTRRN+227                                               00654000
RRNRDCUA EQU   ISTRRN+224                                               00655000
RRNNCPNM EQU   ISTRRN+217                                               00656000
RRNCTPCC EQU   ISTRRN+216                                               00657000
RRNCPLUB EQU   ISTRRN+210                                               00658000
RRNDELAY EQU   ISTRRN+208                                               00659000
RRNMODL  EQU   RRNLVL+2                                                 00660000
RRNRELL  EQU   RRNLVL                                                   00661000
@NM00050 EQU   RRNBITAN+2                                               00662000
@NM00049 EQU   RRNBITAN+2                                               00663000
RRNAMLDA EQU   RRNBITAN+2                                               00664000
RRNLODNO EQU   RRNBITAN+2                                               00665000
RRNLODYS EQU   RRNBITAN+2                                               00666000
RRNRBMDL EQU   RRNBITAN+2                                               00667000
RRNALLOC EQU   RRNBITAN+2                                               00668000
RRNACQRD EQU   RRNBITAN+2                                               00669000
RRNREMPO EQU   RRNBITAN+1                                               00670000
RRNRBBUP EQU   RRNBITAN+1                                               00671000
RRNRBCT2 EQU   RRNBITAN+1                                               00672000
RRNRBCT1 EQU   RRNBITAN+1                                               00673000
RRNRBSEC EQU   RRNBITAN+1                                               00674000
RRNRBCCT EQU   RRNBITAN+1                                               00675000
RRNRBCCL EQU   RRNBITAN+1                                               00676000
RRNRBREM EQU   RRNBITAN+1                                               00677000
RRNRSYN  EQU   RRNBITAN                                                 00678000
RRNRAPEP EQU   RRNBITAN                                                 00679000
RRNRANCP EQU   RRNBITAN                                                 00680000
RRNRAOLT EQU   RRNBITAN                                                 00681000
RRNRASYN EQU   RRNBITAN                                                 00682000
RRNRADMP EQU   RRNBITAN                                                 00683000
RRNRAIPL EQU   RRNBITAN                                                 00684000
RRNRASHT EQU   RRNBITAN                                                 00685000
RRNHSTID EQU   ISTRRN+200                                               00686000
RRNHBUFS EQU   ISTRRN+198                                               00687000
RRNHLENT EQU   RRNHPRE+1                                                00688000
RRNHLENH EQU   RRNHPRE                                                  00689000
RRNNODCT EQU   ISTRRN+194                                               00690000
RRNEPADR EQU   ISTRRN+192                                               00691000
RRNCTENT EQU   ISTRRN+190                                               00692000
RRNCTECM EQU   ISTRRN+188                                               00693000
RRNCTEIN EQU   ISTRRN+186                                               00694000
RRNCTETR EQU   ISTRRN+184                                               00695000
RRNCTECL EQU   ISTRRN+182                                               00696000
RRNCTELI EQU   ISTRRN+180                                               00697000
RRNCTEGP EQU   ISTRRN+178                                               00698000
RRNCTBHS EQU   ISTRRN+176                                               00699000
RRNTABCT EQU   ISTRRN+172                                               00700000
RRNLASTE EQU   ISTRRN+168                                               00701000
RRNNCSPL EQU   ISTRRN+164                                               00702000
RRNRPLPT EQU   ISTRRN+160                                               00703000
RRNMSIZE EQU   ISTRRN+156                                               00704000
RRNFLUX  EQU   ISTRRN+152                                               00705000
RRNBHSET EQU   ISTRRN+148                                               00706000
RRNRINQP EQU   ISTRRN+144                                               00707000
RRNGRPA  EQU   ISTRRN+140                                               00708000
RRNLUBA  EQU   RRNUCBAD+1                                               00709000
RRNCHQI  EQU   RRNUCBAD                                                 00710000
@NM00048 EQU   RRNFLAG                                                  00711000
RRNACBAQ EQU   RRNFLAG                                                  00712000
RRNCHCON EQU   RRNFLAG                                                  00713000
RRNVFYLM EQU   RRNFLAG                                                  00714000
RRNLDET  EQU   RRNFLAG                                                  00715000
RRNRIMIP EQU   RRNFLAG                                                  00716000
RRNLCDIE EQU   RRNFLAG                                                  00717000
RRNLCSIP EQU   RRNFLAG                                                  00718000
RRNPRE   EQU   ISTRRN                                                   00719000
RSWEND   EQU   ISTRSW+152                                               00720000
@NM00047 EQU   ISTRSW+150                                               00721000
RSWCTELU EQU   ISTRSW+148                                               00722000
RSWGRUPZ EQU   ISTRSW+146                                               00723000
RSWDIALZ EQU   ISTRSW+144                                               00724000
RSWGRUPT EQU   ISTRSW+140                                               00725000
RSWDIALT EQU   ISTRSW+136                                               00726000
RSWPRE   EQU   ISTRSW                                                   00727000
RTREND   EQU   ISTRTR+208                                               00728000
RTRCADDR EQU   ISTRTR+200                                               00729000
RTRBHSN1 EQU   ISTRTR+192                                               00730000
RTRIDCAS EQU   RTRBSCID+1                                               00731000
RTRIDLEN EQU   RTRBSCID                                                 00732000
RTRLCTI  EQU   ISTRTR+170                                               00733000
RTRTRMAX EQU   ISTRTR+169                                               00734000
@NM00046 EQU   RTRBITAN+4                                               00735000
@NM00045 EQU   RTRBITAN+4                                               00736000
@NM00044 EQU   RTRBITAN+4                                               00737000
@NM00043 EQU   RTRBITAN+4                                               00738000
@NM00042 EQU   RTRBITAN+4                                               00739000
@NM00041 EQU   RTRBITAN+4                                               00740000
@NM00040 EQU   RTRBITAN+4                                               00741000
@NM00039 EQU   RTRBITAN+4                                               00742000
@NM00038 EQU   RTRBITAN+3                                               00743000
RTRDTRLM EQU   RTRBITAN+3                                               00744000
RTRRAATN EQU   RTRBITAN+3                                               00745000
RTRLSCMD EQU   RTRBITAN+3                                               00746000
RTRRFDEK EQU   RTRBITAN+3                                               00747000
RTRRFANK EQU   RTRBITAN+3                                               00748000
RTRRFPFK EQU   RTRBITAN+3                                               00749000
RTRRFPEN EQU   RTRBITAN+3                                               00750000
RTRRFXCT EQU   RTRBITAN+2                                               00751000
RTRRESCT EQU   RTRBITAN+2                                               00752000
RTRRESUP EQU   RTRBITAN+2                                               00753000
RTRREATT EQU   RTRBITAN+2                                               00754000
RTRRECHK EQU   RTRBITAN+2                                               00755000
RTRREACR EQU   RTRBITAN+2                                               00756000
@NM00037 EQU   RTRBITAN+2                                               00757000
RTRREBRK EQU   RTRBITAN+2                                               00758000
RTRRDBHI EQU   RTRBITAN+1                                               00759000
RTRRDBHD EQU   RTRBITAN+1                                               00760000
RTRRDBHN EQU   RTRBITAN+1                                               00761000
RTRRCXMS EQU   RTRBITAN+1                                               00762000
RTRRCMSG EQU   RTRBITAN+1                                               00763000
RTRRCBLK EQU   RTRBITAN+1                                               00764000
RTRRCPT3 EQU   RTRBITAN+1                                               00765000
RTRRCIT2 EQU   RTRBITAN+1                                               00766000
RTRRCIT1 EQU   RTRBITAN                                                 00767000
RTRRBEND EQU   RTRBITAN                                                 00768000
RTRRBECT EQU   RTRBITAN                                                 00769000
RTRRACTR EQU   RTRBITAN                                                 00770000
RTRRACDT EQU   RTRBITAN                                                 00771000
RTRRAPT3 EQU   RTRRAALL                                                 00772000
RTRRAPT2 EQU   RTRRAALL                                                 00773000
RTRRAPT1 EQU   RTRRAALL                                                 00774000
RTRCTADR EQU   ISTRTR+162                                               00775000
RTRCTPOL EQU   ISTRTR+160                                               00776000
RTRCTDIA EQU   ISTRTR+158                                               00777000
RTRCTECM EQU   ISTRTR+156                                               00778000
RTRDIAA  EQU   ISTRTR+152                                               00779000
RTRPOLA  EQU   ISTRTR+148                                               00780000
RTRADRPT EQU   RTRADR+1                                                 00781000
@NM00036 EQU   RTRFLAG                                                  00782000
@NM00035 EQU   RTRFLAG                                                  00783000
@NM00034 EQU   RTRFLAG                                                  00784000
@NM00033 EQU   RTRFLAG                                                  00785000
@NM00032 EQU   RTRFLAG                                                  00786000
@NM00031 EQU   RTRFLAG                                                  00787000
@NM00030 EQU   RTRFLAG                                                  00788000
RTRVTERM EQU   RTRFLAG                                                  00789000
RTRCRPR  EQU   ISTRTR                                                   00790000
RAPREND  EQU   ISTRAPRE+144                                             00791000
RAPHPRE  EQU   ISTRAPRE                                                 00792000
RPUEND   EQU   ISTRPU+104                                               00793000
RPUENTAD EQU   ISTRPU+100                                               00794000
RPUIDNUM EQU   RPUID48+3                                                00795000
RPUIDBLK EQU   RPUID48+2                                                00796000
RPUIDPA2 EQU   RPUID48+1                                                00797000
RPUIDPUT EQU   RPUID48                                                  00798000
RPUIDPA1 EQU   RPUSTAID                                                 00799000
RPUPASSL EQU   ISTRPU+91                                                00800000
RPUMXOUT EQU   ISTRPU+90                                                00801000
RPUMXDAT EQU   ISTRPU+88                                                00802000
RPURSV01 EQU   ISTRPU+87                                                00803000
RPURETYM EQU   ISTRPU+86                                                00804000
RPUADDR  EQU   ISTRPU+85                                                00805000
RPUTYPE  EQU   ISTRPU+84                                                00806000
RPUPRE   EQU   ISTRPU                                                   00807000
RLNEND   EQU   ISTRLN+136                                               00808000
RLNTGCS  EQU   ISTRLN+135                                               00809000
RLNCURTR EQU   ISTRLN+134                                               00810000
RLNINBMX EQU   RLNINBFR+1                                               00811000
RLNINBN  EQU   RLNINBFR                                                 00812000
RLNRTYM  EQU   ISTRLN+131                                               00813000
RLNSERVL EQU   ISTRLN+130                                               00814000
RLNREPTO EQU   ISTRLN+129                                               00815000
RLNACTTO EQU   ISTRLN+128                                               00816000
RLNCTPCC EQU   ISTRLN+127                                               00817000
RLNPUBI  EQU   ISTRLN+126                                               00818000
RLNDCUA  EQU   ISTRLN+123                                               00819000
RLNCUA   EQU   ISTRLN+120                                               00820000
RLNPAUSE EQU   ISTRLN+119                                               00821000
RLNPOLMT EQU   ISTRLN+118                                               00822000
RLNCTSES EQU   ISTRLN+117                                               00823000
@NM00029 EQU   ISTRLN+116                                               00824000
@NM00028 EQU   RLNBITAN+3                                               00825000
@NM00027 EQU   RLNBITAN+3                                               00826000
RLNSWEP  EQU   RLNBITAN+3                                               00827000
RLNSVSKP EQU   RLNLSCMD                                                 00828000
RLNSESLM EQU   RLNLSCMD                                                 00829000
RLNNPRLM EQU   RLNLSCMD                                                 00830000
RLNSWNCP EQU   RLNBITAN+3                                               00831000
RLNACTLN EQU   RLNBITAN+2                                               00832000
@NM00026 EQU   RLNBITAN+2                                               00833000
@NM00025 EQU   RLNBITAN+2                                               00834000
@NM00024 EQU   RLNBITAN+2                                               00835000
@NM00023 EQU   RLNBITAN+2                                               00836000
RLNDCALL EQU   RLNCONCT                                                 00837000
RLNAUTO  EQU   RLNCONCT                                                 00838000
RLNMANUL EQU   RLNCONCT                                                 00839000
@NM00022 EQU   RLNBITAN+1                                               00840000
RLNWANSW EQU   RLNBITAN+1                                               00841000
RLNINUSE EQU   RLNBITAN+1                                               00842000
RLNMULTP EQU   RLNBITAN+1                                               00843000
RLNIDV   EQU   RLNBITAN+1                                               00844000
RLNTTV   EQU   RLNBITAN+1                                               00845000
@NM00021 EQU   RLNBITAN+1                                               00846000
RLNRBUSE EQU   RLNBITAN+1                                               00847000
RLNRAPEP EQU   RLNBITAN                                                 00848000
RLNRANCP EQU   RLNBITAN                                                 00849000
RLNRAEP  EQU   RLNBITAN                                                 00850000
RLNRAPOL EQU   RLNBITAN                                                 00851000
RLNRATRN EQU   RLNBITAN                                                 00852000
RLNGANSW EQU   RLNBITAN                                                 00853000
RLNRACAN EQU   RLNRACNT                                                 00854000
RLNRACAT EQU   RLNRACNT                                                 00855000
@NM00020 EQU   ISTRLN+111                                               00856000
RLNMAXLA EQU   ISTRLN+110                                               00857000
RLNDESAM EQU   ISTRLN+109                                               00858000
RLNCURAM EQU   ISTRLN+108                                               00859000
RLNACTSN EQU   RLNCSLRC+2                                               00860000
RLNACTRM EQU   RLNCSLRC+1                                               00861000
RLNLRC   EQU   RLNCSLRC                                                 00862000
RLNAUTOA EQU   ISTRLN+102                                               00863000
RLNACTCT EQU   ISTRLN+100                                               00864000
RLNCTECM EQU   ISTRLN+98                                                00865000
RLNCTEIN EQU   ISTRLN+96                                                00866000
RLNCTETR EQU   ISTRLN+94                                                00867000
RLNCTECL EQU   ISTRLN+92                                                00868000
RLNENTAD EQU   ISTRLN+88                                                00869000
RLNLUBA  EQU   RLNUCBAD+1                                               00870000
RLNCHQI  EQU   RLNUCBAD                                                 00871000
@NM00019 EQU   RLNFLAG                                                  00872000
@NM00018 EQU   RLNFLAG                                                  00873000
RLNIDACT EQU   RLNFLAG                                                  00874000
RLNCHAN  EQU   RLNFLAG                                                  00875000
RLNACLNK EQU   RLNFLAG                                                  00876000
RLNBKDUP EQU   RLNFLAG                                                  00877000
RLNBCKUP EQU   RLNFLAG                                                  00878000
RLNCDLNK EQU   RLNFLAG                                                  00879000
RLNPRE   EQU   ISTRLN                                                   00880000
RDTEND   EQU   ISTRDT+136                                               00881000
RDTVSRPL EQU   RDTCRIA+16                                               00882000
RDTCRSPW EQU   RDTCRIA+8                                                00883000
RDTCRSDS EQU   RDTCRIA                                                  00884000
@NM00017 EQU   ISTRDT+114                                               00885000
@NM00016 EQU   RDTBITAN                                                 00886000
@NM00015 EQU   RDTBITAN                                                 00887000
@NM00014 EQU   RDTBITAN                                                 00888000
RDTSSFLG EQU   RDTBITAN                                                 00889000
RDTHCDRM EQU   RDTBITAN                                                 00890000
RDTBHSET EQU   RDTBITAN                                                 00891000
RDTCDCTL EQU   RDTBITAN                                                 00892000
RDTCTPGD EQU   RDTBITAN                                                 00893000
RDTLGCT  EQU   ISTRDT+112                                               00894000
RDTNODID EQU   ISTRDT+111                                               00895000
RDTMAXID EQU   ISTRDT+110                                               00896000
@NM00013 EQU   ISTRDT+108                                               00897000
RDTVYRPH EQU   ISTRDT+104                                               00898000
RDTBACK  EQU   ISTRDT+100                                               00899000
RDTFORW  EQU   ISTRDT+96                                                00900000
RDTNAMTB EQU   ISTRDT+92                                                00901000
RDTENTAD EQU   ISTRDT+88                                                00902000
RDTLEN   EQU   RDTPLEN+1                                                00903000
RDTPRICA EQU   RDTPRIOR                                                 00904000
RDTPRILS EQU   RDTPRIOR                                                 00905000
RDTPRISW EQU   RDTPRIOR                                                 00906000
RDTPRIRN EQU   RDTPRIOR                                                 00907000
RDTPRILC EQU   RDTPRIOR                                                 00908000
RDTPRIAP EQU   RDTPRIOR                                                 00909000
RDTCDRSC EQU   RDTPRIOR                                                 00910000
RDTCDRM  EQU   RDTPRIOR                                                 00911000
RDTPRE   EQU   ISTRDT                                                   00912000
RAPEND   EQU   ISTRAP+188                                               00913000
RAPMAXPV EQU   ISTRAP+184                                               00914000
RAPAPPWD EQU   ISTRAP+176                                               00915000
RAPACBN  EQU   ISTRAP+168                                               00916000
@NM00012 EQU   RAPBITAN+2                                               00917000
@NM00011 EQU   RAPBITAN+2                                               00918000
RAPSRTLN EQU   RAPBITAN+2                                               00919000
RAPSONSC EQU   RAPBITAN+2                                               00920000
RAPVFRR  EQU   RAPBITAN+2                                               00921000
RAPSRBX  EQU   RAPBITAN+2                                               00922000
@NM00010 EQU   RAPBITAN+2                                               00923000
RAPCSMA  EQU   RAPBITAN+2                                               00924000
RAPTSO   EQU   RAPBITAN+1                                               00925000
RAPAUTHE EQU   RAPBITAN+1                                               00926000
RAPANVPC EQU   RAPBITAN+1                                               00927000
RAPASPO  EQU   RAPBITAN+1                                               00928000
RAPAPPO  EQU   RAPBITAN+1                                               00929000
RAPAACQ  EQU   RAPBITAN+1                                               00930000
RAPAPRMT EQU   RAPBITAN+1                                               00931000
RAPAPASS EQU   RAPBITAN+1                                               00932000
RAPABLCK EQU   RAPBITAN                                                 00933000
RAPALLF  EQU   RAPBITAN                                                 00934000
RAPPARS  EQU   RAPBITAN                                                 00935000
RAPLSIZ  EQU   RAPBITAN                                                 00936000
RAPATLGN EQU   RAPBITAN                                                 00937000
RAPASLGI EQU   RAPBITAN                                                 00938000
RAPAQUI  EQU   RAPBITAN                                                 00939000
RAPABLGN EQU   RAPBITAN                                                 00940000
RAPBFACT EQU   ISTRAP+164                                               00941000
RAPBNA   EQU   ISTRAP+162                                               00942000
RAPEAS   EQU   ISTRAP+160                                               00943000
RAPACDEB EQU   ISTRAP+156                                               00944000
RAPACBA  EQU   ISTRAP+152                                               00945000
RAPENTAD EQU   ISTRAP+148                                               00946000
@NM00009 EQU   ISTRAP+146                                               00947000
RAPTRPRE EQU   ISTRAP+144                                               00948000
RAPPRE   EQU   ISTRAP                                                   00949000
RCPEND   EQU   ISTRCPRE+144                                             00950000
RCPLGMOD EQU   ISTRCPRE+136                                             00951000
RCPDLGMD EQU   ISTRCPRE+128                                             00952000
RCPLGNAP EQU   ISTRCPRE+120                                             00953000
RCPQCNT  EQU   ISTRCPRE+118                                             00954000
@NM00008 EQU   ISTRCPRE+117                                             00955000
RCPOSAIP EQU   RCPBITAN                                                 00956000
RCPVLMSG EQU   RCPBITAN                                                 00957000
RCPCSM   EQU   RCPBITAN                                                 00958000
RCPALLOC EQU   RCPBITAN                                                 00959000
RCPSEC   EQU   RCPBITAN                                                 00960000
RCPSESSC EQU   RCPSESSM                                                 00961000
RCPSESPR EQU   RCPSESSM                                                 00962000
RCPSSCFM EQU   ISTRCPRE+114                                             00963000
RCPSTCAP EQU   RCPCYSET                                                 00964000
RCPSTRQD EQU   RCPCYSET                                                 00965000
RCPMDCAP EQU   RCPCYMOD                                                 00966000
RCPMDRQD EQU   RCPCYMOD                                                 00967000
RCPPRIM  EQU   RCPPMODE                                                 00968000
RCPCROSS EQU   RCPPMODE                                                 00969000
RCPRRECD EQU   RCPPMODE                                                 00970000
RCPRBASC EQU   RCPPMODE                                                 00971000
RCPBFLIM EQU   ISTRCPRE+112                                             00972000
RCPNCPPM EQU   RCPNCPPC+1                                               00973000
RCPNCPPN EQU   RCPNCPPC                                                 00974000
RCPPACEM EQU   RCPPACE+1                                                00975000
RCPPACEN EQU   RCPPACE                                                  00976000
RCPBHSI2 EQU   ISTRCPRE+107                                             00977000
RCPBHSI1 EQU   ISTRCPRE+106                                             00978000
RCPSESLM EQU   ISTRCPRE+104                                             00979000
RCPSESCT EQU   ISTRCPRE+102                                             00980000
RCPINTTI EQU   ISTRCPRE+100                                             00981000
RCPUSSTI EQU   ISTRCPRE+98                                              00982000
RCPMODTI EQU   ISTRCPRE+96                                              00983000
RCPLNAPA EQU   ISTRCPRE+92                                              00984000
RCPSIBS  EQU   RCPSARRY+4                                               00985000
RCPSIBP  EQU   RCPSARRY                                                 00986000
RCPPRE   EQU   ISTRCPRE                                                 00987000
RPREND   EQU   ISTRPRE+84                                               00988000
RPRDEVCH EQU   ISTRPRE+76                                               00989000
RPRCONID EQU   ISTRPRE+67                                               00990000
@NM00007 EQU   RPRFLAGS                                                 00991000
RPRDYNAM EQU   RPRFLAGS                                                 00992000
RPRNOACT EQU   RPRFLAGS                                                 00993000
RPRDAFAD EQU   RPRBITAN+4                                               00994000
RPRENTVA EQU   RPRBITAN+4                                               00995000
RPRDUMMY EQU   RPRBITAN+4                                               00996000
RPRIMPCH EQU   RPRBITAN+4                                               00997000
RPRIMPAC EQU   RPRBITAN+4                                               00998000
RPRNEO   EQU   RPRBITAN+4                                               00999000
RPRRNAA  EQU   RPRBITAN+4                                               01000000
RPRDRADD EQU   RPRBITAN+4                                               01001000
RPRFADD  EQU   RPRBITAN+3                                               01002000
RPRINTST EQU   RPRBITAN+3                                               01003000
RPRCLVPD EQU   RPRBITAN+3                                               01004000
RPRSHAD  EQU   RPRBITAN+3                                               01005000
RPRGIST  EQU   RPRBITAN+3                                               01006000
RPRRBISA EQU   RPRBITAN+3                                               01007000
RPRENTVT EQU   RPRBITAN+3                                               01008000
RPRDINOP EQU   RPRBITAN+3                                               01009000
RPRDINUS EQU   RPRBITAN+2                                               01010000
RPRCRCPT EQU   RPRBITAN+2                                               01011000
RPRNOSRT EQU   RPRBITAN+2                                               01012000
RPRDOM   EQU   RPRBITAN+2                                               01013000
RPRNOUSE EQU   RPRBITAN+2                                               01014000
RPRNOSNA EQU   RPRBITAN+2                                               01015000
RPRCLNUP EQU   RPRBITAN+2                                               01016000
RPRCONLD EQU   RPRBITAN+2                                               01017000
RPRCONP  EQU   RPRBITAN+1                                               01018000
RPRACTP  EQU   RPRBITAN+1                                               01019000
RPRINTIO EQU   RPRBITAN+1                                               01020000
RPRCONCT EQU   RPRBITAN+1                                               01021000
RPRHLVPD EQU   RPRBITAN+1                                               01022000
RPRHLACT EQU   RPRBITAN+1                                               01023000
RPRONLIN EQU   RPRBITAN+1                                               01024000
RPRRINOP EQU   RPRBITAN+1                                               01025000
RPRAOPN  EQU   RPRBITAN                                                 01026000
RPRENTVH EQU   RPRBITAN                                                 01027000
RPRLIVE  EQU   RPRBITAN                                                 01028000
RPRENTED EQU   RPRBITAN                                                 01029000
RPRLTASN EQU   RPRBITAN                                                 01030000
RPRENTIO EQU   RPRBITAN                                                 01031000
RPRENTBF EQU   RPRBITAN                                                 01032000
RPRINV   EQU   RPRBITAN                                                 01033000
RPRDEFLV EQU   RPRSTATE+4                                               01034000
RPRDESS1 EQU   RPRDESST                                                 01035000
RPRCURS1 EQU   RPRCURST                                                 01036000
RPRCMDWE EQU   ISTRPRE+52                                               01037000
RPRTNTQP EQU   ISTRPRE+48                                               01038000
RPRNSNEA EQU   ISTRPRE+44                                               01039000
RPRNCBA  EQU   ISTRPRE+40                                               01040000
RPRPELEN EQU   ISTRPRE+36                                               01041000
RPRELEN  EQU   ISTRPRE+32                                               01042000
RPRALPAD EQU   ISTRPRE+28                                               01043000
RPRENTAD EQU   ISTRPRE+24                                               01044000
RPRREQCT EQU   ISTRPRE+22                                               01045000
RPRINDEX EQU   ISTRPRE+20                                               01046000
RPRDAF   EQU   RPRDAFID+2                                               01047000
@NM00006 EQU   RPRDAFID                                                 01048000
@NM00005 EQU   ISTRPRE+15                                               01049000
RPRHDTYP EQU   ISTRPRE+14                                               01050000
RPRENTRY EQU   ISTRPRE+13                                               01051000
RPRNAME  EQU   RPRSRTHD                                                 01052000
LOKXCL   EQU   @NM00003                                                 01053000
LOKPRY   EQU   @NM00003                                                 01054000
@NM00004 EQU   @NM00003                                                 01055000
@NM00002 EQU   LOKCHNG                                                  01056000
LOKCT    EQU   ISTLOK                                                   01057000
SRTTYPE  EQU   ISTSRT+12                                                01058000
SRTSPECE EQU   SRTSRTE                                                  01059000
SRTSYMNM EQU   ISTSRT                                                   01060000
DEVRSV01 EQU   ISTDEVCH+7                                               01061000
DEVAUXTP EQU   ISTDEVCH+6                                               01062000
DEVADVFE EQU   DEVMODE                                                  01063000
@NM00001 EQU   DEVMODE                                                  01064000
DEVBASIC EQU   DEVMODE                                                  01065000
DEVREC   EQU   DEVMODE                                                  01066000
DEVPHYSA EQU   ISTDEVCH+4                                               01067000
DEVCSLPN EQU   DEVCHAR3                                                 01068000
DEVCSTCL EQU   DEVCHAR3                                                 01069000
DEVCCHEK EQU   DEVCHAR3                                                 01070000
DEVCATTN EQU   DEVCHAR3                                                 01071000
DEVCSWL  EQU   DEVFCCTL                                                 01072000
DEVCRVB  EQU   DEVFCCTL                                                 01073000
DEVCSSL  EQU   DEVFCCTL                                                 01074000
DEVCBSC  EQU   DEVFCCTL                                                 01075000
DEVMCODE EQU   ISTDEVCH+2                                               01076000
DEVCHAR2 EQU   DEVTCODE                                                 01077000
DEVSPOLL EQU   DEVCHAR                                                  01078000
DEVCCTL  EQU   DEVCHAR                                                  01079000
DEVNNSPT EQU   DEVCHAR                                                  01080000
DEVSPS   EQU   DEVCHAR                                                  01081000
DEVSUBND EQU   DEVCHAR                                                  01082000
DEVCONVR EQU   DEVCHAR                                                  01083000
DEVOTPUT EQU   DEVCHAR                                                  01084000
DEVINPUT EQU   DEVCHAR                                                  01085000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01086000
@ENDDATA EQU   *                                                        01087000
         END   ISTSDCSB,(C'PLS2200',0702,80232)                         01088000
