./  ADD  SSI=81570003,NAME=IEECB910
B910     TITLE 'IEECB910  DISPLAY DUMP COMMAND PROCESSOR               *00001000
                        '                                               00002000
IEECB910 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(22)                                             0001 00007000
         DC    C'IEECB910 UZ19365 78157'                           0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  DS    0H                                                  0001 00011000
         USING @PSTART,@12                                         0001 00012000
         LR    @10,@01                                             0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @11,@01                                             0001 00016000
         USING @DATD,@11                                           0001 00017000
         LR    @01,@10                                             0001 00018000
         ST    @13,@SA00001+4                                      0001 00019000
         LR    @13,@11                                             0001 00020000
         MVC   @PC00001(4),0(@01)                                  0001 00021000
*                                                                  0092 00022000
*   /*****************************************************************/ 00023000
*   /*                                                               */ 00024000
*   /* INIT                                                          */ 00025000
*   /*                                                               */ 00026000
*   /*****************************************************************/ 00027000
*                                                                  0092 00028000
*   CSCBPTR=R1;                     /* SAVE ADDR OF THE ENTRY      0092 00029000
*                                      PARMLIST                      */ 00030000
         ST    R1,CSCBPTR                                          0092 00031000
*   R14SAVE=R14;                    /* SAVE THIS TO RETURN WITH      */ 00032000
         ST    R14,R14SAVE                                         0093 00033000
*   RFY                                                            0094 00034000
*    (R1,                                                          0094 00035000
*     R14) UNRSTD;                                                 0094 00036000
*                                                                  0094 00037000
*   /*****************************************************************/ 00038000
*   /*                                                               */ 00039000
*   /* USE IEECB860 TO PROVIDE ESTAE COVERAGE. THE ESTAE AND SYSTEM  */ 00040000
*   /* RESOURCES OBTAINED BY IEECB860 WILL BE CLEANED UP BY TASK     */ 00041000
*   /* TERMINATION                                                   */ 00042000
*   /*                                                               */ 00043000
*   /*****************************************************************/ 00044000
*                                                                  0095 00045000
*   RFY                                                            0095 00046000
*    (R0,                                                          0095 00047000
*     R13) RSTD;                    /*                       @ZA25262*/ 00048000
*   STM(R0,R14,SAVEAREA);           /* SAVE REGS                     */ 00049000
         STM   R0,R14,SAVEAREA(R13)                                0096 00050000
*   DO;                             /* LOAD DCB(0) EP(NAME860)       */ 00051000
*     RESPECIFY                                                    0098 00052000
*      (GPR00P,                                                    0098 00053000
*       GPR01P) RESTRICTED;                                        0098 00054000
*     GPR00P=ADDR(NAME860);         /* LOAD ENTRY POINT NAME ADDRESS */ 00055000
         LA    GPR00P,NAME860                                      0099 00056000
*     GPR01P=0;                     /* JOBLIB OR LINKLIB DCB         */ 00057000
         SLR   GPR01P,GPR01P                                       0100 00058000
*     SVC(8);                       /* ISSUE LOAD SVC                */ 00059000
         SVC   8                                                   0101 00060000
*     RESPECIFY                                                    0102 00061000
*      (GPR00P,                                                    0102 00062000
*       GPR01P) UNRESTRICTED;                                      0102 00063000
*   END;                            /* LOAD DCB(0) EP(NAME860)       */ 00064000
*/*@ZA25262                                                          */ 00065000
*                                                                  0104 00066000
*   RFY                                                            0104 00067000
*     RETCODE RSTD;                                                0104 00068000
*   CALL IEECB860(CHAIN,CB860CMD);  /*                       @ZA25262*/ 00069000
         L     @14,CSCBPTR                                         0105 00070000
         ST    @14,@AL00001                                        0105 00071000
         LA    @14,CB860CMD                                        0105 00072000
         ST    @14,@AL00001+4                                      0105 00073000
         LR    @15,R0                                              0105 00074000
         LA    @01,@AL00001                                        0105 00075000
         BALR  @14,@15                                             0105 00076000
*   LM(R0,R14,SAVEAREA);            /* RESTORE REGS                  */ 00077000
         LM    R0,R14,SAVEAREA(R13)                                0106 00078000
*   RFY                                                            0107 00079000
*    (R0,                                                          0107 00080000
*     R13) UNRSTD;                  /*                       @ZA25262*/ 00081000
*   IF RETCODE=0                    /* CHECK THE RETURN CODE FROM  0108 00082000
*                                      IEECB860                      */ 00083000
*     THEN                          /* IF IT IS OK GO AHEAD          */ 00084000
         LTR   RETCODE,RETCODE                                     0108 00085000
         BNZ   @RF00108                                            0108 00086000
*     DO;                                                          0109 00087000
*       RFY                                                        0110 00088000
*         RETCODE UNRSTD;                                          0110 00089000
*                                                                  0111 00090000
*       /*************************************************************/ 00091000
*       /*                                                           */ 00092000
*       /* PARSE THE DISPLAY COMMAND OPERAND                         */ 00093000
*       /*                                                           */ 00094000
*       /*************************************************************/ 00095000
*                                                                  0111 00096000
*       FCFLAGS=''B;                /* INIT                          */ 00097000
         MVI   FCFLAGS,X'00'                                       0111 00098000
*       RFY                                                        0112 00099000
*         OPTPTR RSTD;                                             0112 00100000
*       OPTPTR=ADDR(CHBUF);         /* BEGIN PARSE AT THE BEGINNING     00101000
*                                      OF THE OPERAND FIELD PASSED IN   00102000
*                                      THE CSCB                      */ 00103000
*                                                                  0113 00104000
         L     OPTPTR,CSCBPTR                                      0113 00105000
         LA    OPTPTR,CHBUF(,OPTPTR)                               0113 00106000
*       /*************************************************************/ 00107000
*       /*                                                           */ 00108000
*       /* THE FIRST PARM MUST HAVE BEEN ONE OF THE VALID FORMS OF   */ 00109000
*       /* DUMP OR THIS RTN WOULD NOT BE ATTACHED                    */ 00110000
*       /*                                                           */ 00111000
*       /*************************************************************/ 00112000
*                                                                  0114 00113000
*       IF OPERAND(1:5)='DUMP '|OPERAND(1:2)='D '/* CHECK FOR JUST 0114 00114000
*                                      THE FIRST POSITIONAL WITH THE    00115000
*                                      SECOND PARM DEFAULTED         */ 00116000
*         THEN                                                     0114 00117000
         CLC   OPERAND(5,OPTPTR),@CC02196                          0114 00118000
         BE    @RT00114                                            0114 00119000
         CLC   OPERAND(2,OPTPTR),@CC02197                          0114 00120000
         BNE   @RF00114                                            0114 00121000
@RT00114 DS    0H                                                  0115 00122000
*         STATUS=YES;                                              0115 00123000
         OI    STATUS,B'10000000'                                  0115 00124000
*       ELSE                        /* IF IT WASN'T DUMP WITH A    0116 00125000
*                                      DEFAULT THEN IT MUST BE     0116 00126000
*                                      FOLLOWED BY A 2ND PARM        */ 00127000
*         DO;                                                      0116 00128000
         B     @RC00114                                            0116 00129000
@RF00114 DS    0H                                                  0117 00130000
*           IF OPERAND(1:5)='DUMP,' /* DETERMINE WHICH OF THE ONLY 0117 00131000
*                                      TWO OTHER POSSIBLITIES IT IS,    00132000
*                                      SO THAT THE BEGINNING OF THE     00133000
*                                      SECOND PARM CAN BE FOUND      */ 00134000
*             THEN                                                 0117 00135000
         CLC   OPERAND(5,OPTPTR),@CC02198                          0117 00136000
         BNE   @RF00117                                            0117 00137000
*             OPTPTR=OPTPTR+5;                                     0118 00138000
         AH    OPTPTR,@CH01013                                     0118 00139000
*           ELSE                                                   0119 00140000
*             OPTPTR=OPTPTR+2;      /* ASSUME ABBR D,                */ 00141000
         B     @RC00117                                            0119 00142000
@RF00117 AH    OPTPTR,@CH00272                                     0119 00143000
*           IF OPERAND(1:2)='S '    /* STATUS                        */ 00144000
*             THEN                                                 0120 00145000
@RC00117 CLC   OPERAND(2,OPTPTR),@CC02199                          0120 00146000
         BNE   @RF00120                                            0120 00147000
*             STATUS=YES;                                          0121 00148000
         OI    STATUS,B'10000000'                                  0121 00149000
*           ELSE                                                   0122 00150000
*             IF OPERAND(1:2)='O '  /* OPTIONS                       */ 00151000
*               THEN                                               0122 00152000
         B     @RC00120                                            0122 00153000
@RF00120 CLC   OPERAND(2,OPTPTR),@CC02200                          0122 00154000
         BNE   @RF00122                                            0122 00155000
*               OPTIONS=YES;                                       0123 00156000
         OI    OPTIONS,B'01000000'                                 0123 00157000
*             ELSE                                                 0124 00158000
*               IF OPERAND(1:7)='STATUS ' THEN                     0124 00159000
         B     @RC00122                                            0124 00160000
@RF00122 CLC   OPERAND(7,OPTPTR),@CC02201                          0124 00161000
         BNE   @RF00124                                            0124 00162000
*                 STATUS=YES;                                      0125 00163000
         OI    STATUS,B'10000000'                                  0125 00164000
*               ELSE                                               0126 00165000
*                 IF OPERAND(1:8)='OPTIONS ' THEN                  0126 00166000
         B     @RC00124                                            0126 00167000
@RF00124 CLC   OPERAND(8,OPTPTR),@CC02202                          0126 00168000
         BNE   @RF00126                                            0126 00169000
*                   OPTIONS=YES;                                   0127 00170000
         OI    OPTIONS,B'01000000'                                 0127 00171000
*                                                                  0128 00172000
*           /*********************************************************/ 00173000
*           /*                                                       */ 00174000
*           /* TERMINATE WITH ERROR MSG IEE708I BECAUSE NO VALID     */ 00175000
*           /* COMMAND TEXT COULD BE FOUND                           */ 00176000
*           /*                                                       */ 00177000
*           /*********************************************************/ 00178000
*                                                                  0128 00179000
*                 ELSE                                             0128 00180000
*                   PARSERR=ON;     /* TERMINATE WITH AN ERROR       */ 00181000
         B     @RC00126                                            0128 00182000
@RF00126 OI    PARSERR,B'00100000'                                 0128 00183000
*         END;                      /* OF OPERAND NOT D OR DUMP      */ 00184000
@RC00126 DS    0H                                                  0129 00185000
@RC00124 DS    0H                                                  0129 00186000
@RC00122 DS    0H                                                  0129 00187000
@RC00120 DS    0H                                                  0130 00188000
*       IF PARSERR=ON               /* CHECK FOR A PARSE ERROR       */ 00189000
*         THEN                      /* IF THERE WAS ONE              */ 00190000
@RC00114 TM    PARSERR,B'00100000'                                 0130 00191000
         BNO   @RF00130                                            0130 00192000
*         DO;                                                      0131 00193000
*           RFY                                                    0132 00194000
*             R13 RSTD;                                            0132 00195000
*           STM(R0,R15,SAVEAREA);   /* SAVE REGS                     */ 00196000
         STM   R0,R15,SAVEAREA(R13)                                0133 00197000
*           RFY                                                    0134 00198000
*             XSAPTR RSTD;                                         0134 00199000
*           XSAPTR=ADDR(BLDAREA);   /* USE THE BUILD AREA TO SET UP A   00200000
*                                      TEMP XSA AS A PARM LIST TO  0135 00201000
*                                      IEE0503D                      */ 00202000
         LA    XSAPTR,BLDAREA                                      0135 00203000
*           XSAMAP=''B;             /* INIT                          */ 00204000
         XC    XSAMAP(184,XSAPTR),XSAMAP(XSAPTR)                   0136 00205000
*           XAE=IEE708;             /* GIVE MSG ID                   */ 00206000
         MVI   XAE(XSAPTR),X'3D'                                   0137 00207000
*           XAV=OPERAND(1:8);       /* SUPPLY THE VARIABLE PART OF 0138 00208000
*                                      THE MSG                       */ 00209000
         MVC   XAV(8,XSAPTR),OPERAND(OPTPTR)                       0138 00210000
*           XAU=CHUCMP;             /* FILL IN MSG DESTINATION WHICH    00211000
*                                      IN THIS CASE IS THE ISSUING 0139 00212000
*                                      CONSOLE                       */ 00213000
         L     @10,CSCBPTR                                         0139 00214000
         MVC   XAU(1,XSAPTR),CHUCMP(@10)                           0139 00215000
*           LNKEXC=LNKLST;          /* COPY LIST FORM LINK INTO    0140 00216000
*                                      DYNAMIC LIST AREA             */ 00217000
         MVC   LNKEXC(8),LNKLST                                    0140 00218000
*           DO;                     /* LINK MF(E,LNKEXC) EP(NAME503D)*/ 00219000
*             LNKEXC01='00'X;       /* EP/DE FLAG                    */ 00220000
         MVI   LNKEXC01,X'00'                                      0142 00221000
*             LNKEXC02=ADDR(NAME503D);/* ADDR OF EP/DE               */ 00222000
         LA    @10,NAME503D                                        0143 00223000
         STCM  @10,7,LNKEXC02                                      0143 00224000
*             RESPECIFY                                            0144 00225000
*              (GPR15P) RESTRICTED;                                0144 00226000
*             GPR15P=ADDR(LNKEXC);  /* ADDR OF LINK LIST             */ 00227000
         LA    GPR15P,LNKEXC                                       0145 00228000
*             SVC(6);               /* ISSUE LINK SVC                */ 00229000
         SVC   6                                                   0146 00230000
*             RESPECIFY                                            0147 00231000
*              (GPR15P) UNRESTRICTED;                              0147 00232000
*           END;                    /* LINK MF(E,LNKEXC) EP(NAME503D)*/ 00233000
*           LM(R0,R15,SAVEAREA);    /* RESTORE REGS                  */ 00234000
         LM    R0,R15,SAVEAREA(R13)                                0149 00235000
*           RFY                                                    0150 00236000
*             R13 UNRSTD;                                          0150 00237000
*           RFY                                                    0151 00238000
*            (XSAPTR,                                              0151 00239000
*             OPTPTR) UNRSTD;                                      0151 00240000
*         END;                      /* OF PUTTING OUT PARSE ERROR MSG*/ 00241000
*       ELSE                        /* IF THERE WAS NO PARSE ERROR   */ 00242000
*         DO;                       /* GENERATE THE REQUESTED MSG    */ 00243000
         B     @RC00130                                            0153 00244000
@RF00130 DS    0H                                                  0154 00245000
*                                                                  0154 00246000
*           /*********************************************************/ 00247000
*           /*                                                       */ 00248000
*           /* IF STATUS WAS REQUESTED, FIRST GATHER THE SYS1.DUMP   */ 00249000
*           /* DATASET INFORMATION TO AVOID HAVING AN ERROR OCCURR   */ 00250000
*           /* BETWEEN THE LINES OF AN MLWTO                         */ 00251000
*           /*                                                       */ 00252000
*           /*********************************************************/ 00253000
*                                                                  0154 00254000
*           IF STATUS=YES           /* CHECK FOR MSG IEE865I         */ 00255000
*             THEN                  /* IF STATUS WAS REQUESTED       */ 00256000
         TM    STATUS,B'10000000'                                  0154 00257000
         BNO   @RF00154                                            0154 00258000
*             DO;                   /* GATHER STATUS DATA            */ 00259000
*               FULLCNT=0;          /* INIT COUNT OF FULL DUMP     0156 00260000
*                                      DATASETS                      */ 00261000
         SLR   @10,@10                                             0156 00262000
         ST    @10,FULLCNT                                         0156 00263000
*               DO ENT=1 BY 1       /* GATHER THE DATA FOR DSTABLE   */ 00264000
*                     WHILE(ENT<=DIM(RTCTSDDS)&RTCTDSNM(ENT)¬=0);/*     00265000
*                                      CHECK TO SEE IF THIS ENTRY IN    00266000
*                                      THE RTCT DEFINES AN ACTIVE  0157 00267000
*                                      DUMP DATASET                  */ 00268000
         LA    ENT,1                                               0157 00269000
         B     @DE00157                                            0157 00270000
@DL00157 DS    0H                                                  0158 00271000
*                 DSTABLE(ENT)=''B; /* INIT                          */ 00272000
         LR    @10,ENT                                             0158 00273000
         MH    @10,@CH02234                                        0158 00274000
         LA    @05,DSTABLE-105(@10)                                0158 00275000
         XC    0(105,@05),0(@05)                                   0158 00276000
*                 NAME(ENT)=RTCTDSNM(ENT);/* SAVE THE DATASET      0159 00277000
*                                      SYMBOLIC NAME                 */ 00278000
         LA    @05,NAME-105(@10)                                   0159 00279000
         LR    @15,ENT                                             0159 00280000
         MH    @15,@CH01394                                        0159 00281000
         L     @01,CVTPTR                                          0159 00282000
         L     @14,CVTRTMCT(,@01)                                  0159 00283000
         ST    @15,@TF00001                                        0159 00284000
         ALR   @15,@14                                             0159 00285000
         MVC   0(3,@05),RTCTDSNM-12(@15)                           0159 00286000
*                 IF RTCTDETP(ENT)=OFF/* CHECK THE DUMP DATASET TYPE */ 00287000
*                   THEN            /* FOR TAPE TYPES                */ 00288000
         AL    @14,@TF00001                                        0160 00289000
         TM    RTCTDETP-12(@14),B'00100000'                        0160 00290000
         BNZ   @RF00160                                            0160 00291000
*                   DO;                                            0161 00292000
*                     TAPE(ENT)=ON; /* INDICATE TAPE TYPE IN TABLE   */ 00293000
*                     AVAIL(ENT)=ON;/* TAPES ARE ALWAYS CONSIDERED TO   00294000
*                                      BE AVAILABLE                  */ 00295000
         LA    @05,TAPE-105(@10)                                   0163 00296000
         OI    0(@05),B'10100000'                                  0163 00297000
*                   END;                                           0164 00298000
*                 ELSE              /* IF IT IS A DASD TYPE DATASET  */ 00299000
*                   DO;                                            0165 00300000
         B     @RC00160                                            0165 00301000
@RF00160 DS    0H                                                  0166 00302000
*                     DASD(ENT)=ON; /* INDICATE DASD TYPE IN TABLE   */ 00303000
         LR    @10,ENT                                             0166 00304000
         MH    @10,@CH02234                                        0166 00305000
         LA    @05,DASD-105(@10)                                   0166 00306000
         OI    0(@05),B'00010000'                                  0166 00307000
*                     IF RTCTDSUS(ENT)=OFF/* CHECK THE DATASET USED  */ 00308000
*                         &RTCTDSST(ENT)=OFF/* AND FULL FLAGS        */ 00309000
*                       THEN        /* IF BOTH ARE OFF THE DATASET IS   00310000
*                                      AVAILABLE                     */ 00311000
         LR    @05,ENT                                             0167 00312000
         MH    @05,@CH01394                                        0167 00313000
         L     @01,CVTPTR                                          0167 00314000
         L     @01,CVTRTMCT(,@01)                                  0167 00315000
         ALR   @01,@05                                             0167 00316000
         TM    RTCTDSUS-12(@01),B'11000000'                        0167 00317000
         BNZ   @RF00167                                            0167 00318000
*                       AVAIL(ENT)=ON;/* INDICATE AVAILABLE IN THE 0168 00319000
*                                      TABLE                         */ 00320000
         LA    @05,AVAIL-105(@10)                                  0168 00321000
         OI    0(@05),B'10000000'                                  0168 00322000
*                     ELSE          /* IF THE RTCT DOES NOT SHOW THE    00323000
*                                      DATASET AVAILABLE             */ 00324000
*                       DO;         /* CHECK IT OUT DIRECTLY         */ 00325000
         B     @RC00167                                            0169 00326000
@RF00167 DS    0H                                                  0170 00327000
*                                                                  0170 00328000
*                         /*******************************************/ 00329000
*                         /*                                         */ 00330000
*                         /* DYNAMIC ALLOC OF THE SYS1.DUMP DATASET  */ 00331000
*                         /*                                         */ 00332000
*                         /*******************************************/ 00333000
*                                                                  0170 00334000
*                         S99RBPTR=ADDR(S99RB);/* INIT THE PARMLIST     00335000
*                                      TO POINT TO THE REQUEST BLOCK */ 00336000
         LA    @10,S99RB                                           0170 00337000
         ST    @10,S99RBPTR                                        0170 00338000
*                         S99RBPND=ON;/* SET THE VARIABLE LENGTH   0171 00339000
*                                      PARMLIST END FLAG             */ 00340000
         OI    S99RBPND,B'10000000'                                0171 00341000
*                         S99RB=''B;/* INIT THE REQUEST BLOCK TO   0172 00342000
*                                      ZEROS                         */ 00343000
         XC    S99RB(20),S99RB                                     0172 00344000
*                         S99RBLN=LENGTH(S99RB);/* INIT THE LENGTH 0173 00345000
*                                      FIELD                         */ 00346000
         MVI   S99RBLN,X'14'                                       0173 00347000
*                         S99VERB=S99VRBAL;/* SET THE VERB CODE TO 0174 00348000
*                                      ALLOCATE                      */ 00349000
         MVI   S99VERB,X'01'                                       0174 00350000
*                         S99TXTPP=ADDR(TEXTLIST);/* POINT TO THE  0175 00351000
*                                      TEXT UNITS PARMLIST           */ 00352000
         LA    @10,TEXTLIST                                        0175 00353000
         ST    @10,S99TXTPP                                        0175 00354000
*                         TUP1=ADDR(TU1);/* INIT THE TEXT UNITS    0176 00355000
*                                      PARMLIST                      */ 00356000
         LA    @10,TU1                                             0176 00357000
         ST    @10,TUP1                                            0176 00358000
*                         TUP2=ADDR(TU2);                          0177 00359000
         LA    @10,TU2                                             0177 00360000
         ST    @10,TUP2                                            0177 00361000
*                         TUP3=ADDR(TU3);                          0178 00362000
         LA    @10,TU3                                             0178 00363000
         ST    @10,TUP3                                            0178 00364000
*                         TULSTEND=ON;                             0179 00365000
         OI    TULSTEND,B'10000000'                                0179 00366000
*                         TU1=TU1LIST;/* INIT THE TEXT UNITS         */ 00367000
         MVC   TU1(17),TU1LIST                                     0180 00368000
*                         TU1DSN(LENGTH(TU1DSN)-1:LENGTH(TU1DSN))= 0181 00369000
*                             DSNNAME(ENT);/* AMEND THE DATASET NAME    00370000
*                                      WITH THE SUFFIX FROM THE RTCT */ 00371000
         LR    @10,ENT                                             0181 00372000
         MH    @10,@CH02234                                        0181 00373000
         LA    @05,DSNNAME-105(@10)                                0181 00374000
         MVC   TU1DSN+9(2),0(@05)                                  0181 00375000
*                         TU2=TU2LIST;/* INIT THE TU2 AS IEFDB400  0182 00376000
*                                      WILL STORE INTO THE TEXT UNIT    00377000
*                                                            @ZA32470*/ 00378000
         MVC   TU2(7),TU2LIST                                      0182 00379000
*                         TU3=TU3LIST;/* INIT THE TU3 WHICH WILL BE     00380000
*                                      FILLED IN BY DYNAM ALLOC WITH    00381000
*                                      THE DDNAME                    */ 00382000
         MVC   TU3(14),TU3LIST                                     0183 00383000
*                         S99NOMNT=ON;/* INDICATE VOLUMES ARE NOT TO    00384000
*                                      BE MOUNTED TO SATISFY THIS  0184 00385000
*                                      REQUEST                       */ 00386000
         OI    S99NOMNT,B'00100000'                                0184 00387000
*                         RFY                                      0185 00388000
*                          (R1,                                    0185 00389000
*                           RETCODE) RSTD;                         0185 00390000
*                         R1=ADDR(S99RBPTR);/* SET UP THE PARM REG 0186 00391000
*                                      FOR SVC99                     */ 00392000
         LA    R1,S99RBPTR                                         0186 00393000
*/* MACDATE Y-2 73082                                                */ 00394000
*                                                                  0187 00395000
*                         SVC(99);                                 0187 00396000
         SVC   99                                                  0187 00397000
*                         RFY                                      0188 00398000
*                           R1 UNRSTD;                             0188 00399000
*                         IF RETCODE¬=0/* CHECK FOR DYNAM ALLOC    0189 00400000
*                                      FAILURE                       */ 00401000
*                           THEN    /* IF IT DIDN'T GO               */ 00402000
         LTR   RETCODE,RETCODE                                     0189 00403000
         BZ    @RF00189                                            0189 00404000
*                           DO;                                    0190 00405000
*                             RFY                                  0191 00406000
*                               RETCODE UNRSTD;                    0191 00407000
*                             FULL(ENT)=ON;/* IF THE DATASET CANNOT     00408000
*                                      BE ALLOC TO SEE IF IT IS FULL    00409000
*                                      ASSUME THE RTCT FLAGS ARE   0192 00410000
*                                      CORRECT                       */ 00411000
         LR    @10,ENT                                             0192 00412000
         MH    @10,@CH02234                                        0192 00413000
         LA    @05,FULL-105(@10)                                   0192 00414000
         OI    0(@05),B'01000000'                                  0192 00415000
*                             FULLCNT=FULLCNT+1;/* KEEP A COUNT OF 0193 00416000
*                                      THE FULL DATASETS             */ 00417000
         LA    @05,1                                               0193 00418000
         AL    @05,FULLCNT                                         0193 00419000
         ST    @05,FULLCNT                                         0193 00420000
*                             DYNALERR(ENT)=ON;/* INDICATE THE     0194 00421000
*                                      DYNAMIC ALLOCATION ERROR TEXT    00422000
*                                      IS TO BE PUT OUT FOR THIS LINE*/ 00423000
         LA    @05,DYNALERR-105(@10)                               0194 00424000
         OI    0(@05),B'00001000'                                  0194 00425000
*                           END;                                   0195 00426000
*                                                                  0196 00427000
*                         /*******************************************/ 00428000
*                         /*                                         */ 00429000
*                         /* ONCE THE DYNAM ALLOC IS DONE OPEN THE   */ 00430000
*                         /* DCB AND READ THE FIRST RECORD           */ 00431000
*                         /*                                         */ 00432000
*                         /*******************************************/ 00433000
*                                                                  0196 00434000
*                         ELSE      /* IF DYNAM ALLOC WAS OK         */ 00435000
*                           DO;     /* OPEN THE DCB, READ THE FIRST     00436000
*                                      LOGICAL RECORD, AND CLOSE THE    00437000
*                                      DCB                           */ 00438000
         B     @RC00189                                            0196 00439000
@RF00189 DS    0H                                                  0197 00440000
*                             DCBEXEC(1:DCBLEN)=DCBLIST(1:DCBLEN);/*    00441000
*                                      COPY LIST FORMS INTO DYNAMIC     00442000
*                                      STORAGE                       */ 00443000
         L     @10,DCBLEN                                          0197 00444000
         BCTR  @10,0                                               0197 00445000
         EX    @10,@SM02246                                        0197 00446000
*                             DCBDDN(1:DDNLEN)=DDN(1:DDNLEN);/* COPY    00447000
*                                      THE DDNAME ASSIGNED BY DYNAM     00448000
*                                      ALLOC INTO THE DCB            */ 00449000
         LH    @10,DDNLEN                                          0198 00450000
         BCTR  @10,0                                               0198 00451000
         EX    @10,@SM02248                                        0198 00452000
*                             OPENEXEC(1:OPENLEN)=OPENLIST(1:OPENLEN);  00453000
         L     @10,OPENLEN                                         0199 00454000
         BCTR  @10,0                                               0199 00455000
         EX    @10,@SM02250                                        0199 00456000
*                             CLOSEXEC(1:CLOSLEN)=CLOSLIST(1:CLOSLEN);  00457000
         L     @10,CLOSLEN                                         0200 00458000
         BCTR  @10,0                                               0200 00459000
         EX    @10,@SM02252                                        0200 00460000
*                             READEXEC(1:READLEN)=READLIST(1:READLEN);  00461000
         L     @10,READLEN                                         0201 00462000
         BCTR  @10,0                                               0201 00463000
         EX    @10,@SM02254                                        0201 00464000
*                             GEN SETS(DCBEXEC) CODE;              0202 00465000
         OPEN  (DCBEXEC),MF=(E,OPENEXEC)                                00466000
*                             IF DCBOFOPN=OFF/* TEST THE OPEN FLAG   */ 00467000
*                               THEN/* IF THE OPEN FAILED            */ 00468000
         TM    DCBOFOPN,B'00010000'                                0203 00469000
         BNZ   @RF00203                                            0203 00470000
*                               DO;                                0204 00471000
*                                 OPENERR(ENT)=ON;/* INDICATE THE  0205 00472000
*                                      ERROR IN THE TABLE            */ 00473000
*                                 FULL(ENT)=ON;/* ASSUME THE DATASET    00474000
*                                      IS FULL                       */ 00475000
         LR    @10,ENT                                             0206 00476000
         MH    @10,@CH02234                                        0206 00477000
         LA    @05,OPENERR-105(@10)                                0206 00478000
         OI    0(@05),B'01000010'                                  0206 00479000
*                                 FULLCNT=FULLCNT+1;/* INCR THE FULL    00480000
*                                      COUNT                         */ 00481000
         LA    @10,1                                               0207 00482000
         AL    @10,FULLCNT                                         0207 00483000
         ST    @10,FULLCNT                                         0207 00484000
*                               END;                               0208 00485000
*                                                                  0209 00486000
*                             /***************************************/ 00487000
*                             /*                                     */ 00488000
*                             /* READ THE FIRST RECORD OF THIS DUMP  */ 00489000
*                             /* DATASET. IF THERE IS A DUMP HEADER  */ 00490000
*                             /* THERE SAVE THE TITLE, IF NOTHING IS */ 00491000
*                             /* THERE CONSIDER THE DATASET          */ 00492000
*                             /* AVAILABLE, OTHERWISE CONSIDER IT    */ 00493000
*                             /* FULL                                */ 00494000
*                             /*                                     */ 00495000
*                             /***************************************/ 00496000
*                                                                  0209 00497000
*                             ELSE  /* IF THE OPEN WAS SUCCESSFUL    */ 00498000
*                               DO;                                0209 00499000
         B     @RC00203                                            0209 00500000
@RF00203 DS    0H                                                  0210 00501000
*                                 GEN SETS(DCBEXEC) FLOWS(EODFOUND,     00502000
*                                     READERR) CODE;               0210 00503000
*                                 INVLDHDR(ENT)=ON;/* PRE SET TO BAD    00504000
*                                      HEADER                @ZA26869*/ 00505000
         LR    @10,ENT                                             0211 00506000
         MH    @10,@CH02234                                        0211 00507000
         LA    @05,INVLDHDR-105(@10)                               0211 00508000
         OI    0(@05),B'00000100'                                  0211 00509000
*                                 RFY                              0212 00510000
*                                  (READCNT) RSTD;/* RESTRICT THE  0212 00511000
*                                      LOOP COUNTER          @ZA26869*/ 00512000
*                                 DO READCNT=1 TO 5;/* GONNA LOOK  0213 00513000
*                                      THRU FIVE RECS        @ZA26869*/ 00514000
         LA    READCNT,1                                           0213 00515000
@DL00213 DS    0H                                                  0214 00516000
*                                   GEN;                           0214 00517000
*                                                         /* @ZA26869*/ 00518000
         READ  READECB,SF,DCBEXEC,BUFFER,MF=(E,READEXEC)                00519000
         CHECK READECB                                                  00520000
*                                   IF READCNT=1 THEN/* FIRST TIME 0215 00521000
*                                      THROUGH?              @ZA26869*/ 00522000
         LA    @10,1                                               0215 00523000
         CR    READCNT,@10                                         0215 00524000
         BNE   @RF00215                                            0215 00525000
*                                    DO;/* YES....           @ZA26869*/ 00526000
*                                     FULL(ENT)=ON;/* SINCE NO END OF   00527000
*                                      FILE WAS FOUND ON THE FIRST 0217 00528000
*                                      READ THIS DATASET IS BY     0217 00529000
*                                      DEFINITION FULL               */ 00530000
         LR    @05,ENT                                             0217 00531000
         MH    @05,@CH02234                                        0217 00532000
         LA    @02,FULL-105(@05)                                   0217 00533000
         OI    0(@02),B'01000000'                                  0217 00534000
*                                     FULLCNT=FULLCNT+1;           0218 00535000
         AL    @10,FULLCNT                                         0218 00536000
         ST    @10,FULLCNT                                         0218 00537000
*                                    END;/* END.... FIRST TIME     0219 00538000
*                                      THROUGH               @ZA26869*/ 00539000
*                                   IF SDHID='FF'X&SDHRID='FF'X/*  0220 00540000
*                                      CHECK THE RECORD ID FIELDS FOR   00541000
*                                      THE VALID DUMP & HEADER RECORD   00542000
*                                      ID                            */ 00543000
*                                     THEN/* IF THEY ARE VALID       */ 00544000
@RF00215 CLI   SDHID,X'FF'                                         0220 00545000
         BNE   @RF00220                                            0220 00546000
         CLI   SDHRID,X'FF'                                        0220 00547000
         BNE   @RF00220                                            0220 00548000
*                                    DO;                           0221 00549000
*                                     TITLE(ENT)=SDHTITLE;/* SAVE THE   00550000
*                                      DUMP TITLE                    */ 00551000
         LR    @10,ENT                                             0222 00552000
         MH    @10,@CH02234                                        0222 00553000
         LA    @05,TITLE-105(@10)                                  0222 00554000
         MVC   0(100,@05),SDHTITLE                                 0222 00555000
*                                     TITLEOK(ENT)=ON;             0223 00556000
         LA    @05,TITLEOK-105(@10)                                0223 00557000
         OI    0(@05),B'10000000'                                  0223 00558000
*                                     READCNT=6;/* SET TO EXIT READ     00559000
*                                      LOOP                  @ZA26869*/ 00560000
         LA    READCNT,6                                           0224 00561000
*                                     INVLDHDR(ENT)=OFF;/* SET TO  0225 00562000
*                                      INDICATE GOOD HEADER  @ZA26869*/ 00563000
         LA    @05,INVLDHDR-105(@10)                               0225 00564000
         NI    0(@05),B'11111011'                                  0225 00565000
*                                    END;/* END.... VALID HEADER   0226 00566000
*                                                            @ZA26869*/ 00567000
*                                 END;/* END.... FIVE RECORD SEARCH     00568000
*                                                            @ZA26869*/ 00569000
@RF00220 AH    READCNT,@CH00267                                    0227 00570000
         CH    READCNT,@CH01013                                    0227 00571000
         BNH   @DL00213                                            0227 00572000
*                                 GO TO CLOSE;/* GO CLOSE DCB        */ 00573000
         B     CLOSE                                               0228 00574000
*READERR:                           /* READ WILL BRANCH HERE IF THERE   00575000
*                                      IS AN ERROR ON THE READ       */ 00576000
*                                 READERRR(ENT)=ON;/* INDICATE THE 0229 00577000
*                                      ERROR IN THE TABLE            */ 00578000
READERR  DS    0H                                                  0230 00579000
*                                 FULL(ENT)=ON;/* ASSUME THE DATASET    00580000
*                                      IS FULL                       */ 00581000
         LR    @10,ENT                                             0230 00582000
         MH    @10,@CH02234                                        0230 00583000
         LA    @05,READERRR-105(@10)                               0230 00584000
         OI    0(@05),B'01000001'                                  0230 00585000
*                                 FULLCNT=FULLCNT+1;/* INCR THE FULL    00586000
*                                      COUNT                         */ 00587000
         LA    @10,1                                               0231 00588000
         AL    @10,FULLCNT                                         0231 00589000
         ST    @10,FULLCNT                                         0231 00590000
*                                 GO TO CLOSE;/* GO CLOSE DCB        */ 00591000
         B     CLOSE                                               0232 00592000
*EODFOUND:                          /* READ WILL BRANCH HERE IF THE     00593000
*                                      END OF FILE MARK IS READ      */ 00594000
*                                 IF READCNT=1 THEN/* FLAG AS EMPTY     00595000
*                                      ONLY AFTER 1ST READ   @ZA26869*/ 00596000
EODFOUND CH    READCNT,@CH00267                                    0233 00597000
         BNE   @RF00233                                            0233 00598000
*                                   DO;/* ELSE.... JUST CLOSE DATA 0234 00599000
*                                      SET                   @ZA26869*/ 00600000
*                                    INVLDHDR(ENT)=OFF;/* NOT INVALID   00601000
*                                      HEADER                @ZA26869*/ 00602000
*                                    AVAIL(ENT)=ON;/* THIS DATASET IS   00603000
*                                      AVAILABLE EVEN THOUGH THE RTCT   00604000
*                                      DOES NOT SHOW IT SO           */ 00605000
         LR    @10,ENT                                             0236 00606000
         MH    @10,@CH02234                                        0236 00607000
         LA    @05,AVAIL-105(@10)                                  0236 00608000
         OI    0(@05),B'10000000'                                  0236 00609000
         NI    0(@05),B'11111011'                                  0236 00610000
*                                   END;/* END.... FIRST READ CODE 0237 00611000
*                                                            @ZA26869*/ 00612000
*                                                                  0238 00613000
*                                 /***********************************/ 00614000
*                                 /*                                 */ 00615000
*                                 /* AFTER THE SYS1.DUMP DATASET HAS */ 00616000
*                                 /* BEEN READ CLOSE THE DCB AND     */ 00617000
*                                 /* UNALLOCATE THE DATASET          */ 00618000
*                                 /*                                 */ 00619000
*                                 /***********************************/ 00620000
*                                                                  0238 00621000
*CLOSE:                             /* PATHS FOR BOTH DATA READ AND     00622000
*                                      END OF DATA REACHED COME    0238 00623000
*                                      TOGETHER HERE                 */ 00624000
*                                 GEN SETS(DCBEXEC,CLOSEXEC) CODE  0238 00625000
*(CLOSE  (DCBEXEC),MF=(E,CLOSEXEC));                               0238 00626000
@RF00233 DS    0H                                                  0238 00627000
CLOSE    CLOSE  (DCBEXEC),MF=(E,CLOSEXEC)                               00628000
*                               END;/* OF SUCCESSFUL OPEN            */ 00629000
*                             S99VERB=S99VRBUN;/* CHANGE DYNAM ALLOC    00630000
*                                      VERB CODE TO UNALLOCATE       */ 00631000
@RC00203 MVI   S99VERB,X'02'                                       0240 00632000
*                             TU3KEY=DUNDDNAM;/* CHANGE KEY TO     0241 00633000
*                                      UNALLOCATE BY DDNAME  @ZA26855*/ 00634000
         MVC   TU3KEY(2),@CB00038                                  0241 00635000
*                             TULSTE2=ON;/* END THE TEST UNITS LIST     00636000
*                                      BEFORE THE DISP TU LEAVING  0242 00637000
*                                      ONLY THE DDNAME & DSNAME TUS  */ 00638000
         OI    TULSTE2,B'10000000'                                 0242 00639000
*                             RFY                                  0243 00640000
*                               R1 RSTD;                           0243 00641000
*                             R1=ADDR(S99RBPTR);                   0244 00642000
*                                                                  0244 00643000
         LA    R1,S99RBPTR                                         0244 00644000
*/* MACDATE Y-2 73082                                                */ 00645000
*                                                                  0245 00646000
*                             SVC(99);                             0245 00647000
         SVC   99                                                  0245 00648000
*                             RFY                                  0246 00649000
*                               R1 UNRSTD;                         0246 00650000
*                           END;    /* OF SUCCESSFUL ALLOC           */ 00651000
*                       END;        /* OF CHECKING DATASET           */ 00652000
@RC00189 DS    0H                                                  0249 00653000
*                   END;            /* OF DASD TYPE DATASET          */ 00654000
@RC00167 DS    0H                                                  0250 00655000
*               END;                /* OF TABLE BUILDING LOOP        */ 00656000
@RC00160 AH    ENT,@CH00267                                        0250 00657000
@DE00157 CH    ENT,@CH01463                                        0250 00658000
         BH    @DC00157                                            0250 00659000
         LR    @10,ENT                                             0250 00660000
         MH    @10,@CH01394                                        0250 00661000
         L     @05,CVTPTR                                          0250 00662000
         L     @05,CVTRTMCT(,@05)                                  0250 00663000
         L     @10,RTCTDSNM-13(@10,@05)                            0250 00664000
         LA    @10,0(,@10)                                         0250 00665000
         LTR   @10,@10                                             0250 00666000
         BNZ   @DL00157                                            0250 00667000
@DC00157 DS    0H                                                  0251 00668000
*               LASTENT=ENT-1;      /* SAVE THE INDEX OF THE LAST  0251 00669000
*                                      ENTRY IN THE TABLE            */ 00670000
         LR    @10,ENT                                             0251 00671000
         BCTR  @10,0                                               0251 00672000
         ST    @10,LASTENT                                         0251 00673000
*               AVAILCNT=LASTENT-FULLCNT;/* WHAT IS NOT FULL IS AVAIL*/ 00674000
         SL    @10,FULLCNT                                         0252 00675000
         ST    @10,AVAILCNT                                        0252 00676000
*                                                                  0253 00677000
*               /*****************************************************/ 00678000
*               /*                                                   */ 00679000
*               /* PUT OUT APPROPRIATE MLWTO CONTROL LINE            */ 00680000
*               /*                                                   */ 00681000
*               /*****************************************************/ 00682000
*                                                                  0253 00683000
*               RFY                                                0253 00684000
*                 MSGPTR RSTD;                                     0253 00685000
*               MSGPTR=ADDR(CNTL856);/* INDICATE THE STATUS MSG    0254 00686000
*                                      CONTROL LINE                  */ 00687000
         L     MSGPTR,@CA02042                                     0254 00688000
*             END;                  /* OF SETUP FOR STATUS MESSAGE   */ 00689000
*           ELSE                    /* IF IT WASN'T THE ERROR MSG AND   00690000
*                                      IT WASN'T THE STATUS MSG THE     00691000
*                                      THE OPTIONS MSG MUST HAVE BEEN   00692000
*                                      REQUESTED                     */ 00693000
*             MSGPTR=ADDR(CNTL857); /* SO POINT TO ITS CNTL LINE TEXT*/ 00694000
         B     @RC00154                                            0256 00695000
@RF00154 L     MSGPTR,@CA02043                                     0256 00696000
*           RFY                                                    0257 00697000
*             WPLPTR RSTD;                                         0257 00698000
@RC00154 DS    0H                                                  0258 00699000
*           WPLPTR=ADDR(BLDAREA);   /* SET UP THE BASE FOR THE WPL 0258 00700000
*                                      MAP                           */ 00701000
         LA    WPLPTR,BLDAREA                                      0258 00702000
*           BLDAREA(1:MSGLEN)=MSG(1:MSGLEN);/* COPY OVER THE LIST  0259 00703000
*                                      FORM WTO                      */ 00704000
         SLR   @10,@10                                             0259 00705000
         IC    @10,MSGLEN(,MSGPTR)                                 0259 00706000
         BCTR  @10,0                                               0259 00707000
         EX    @10,@SM02258                                        0259 00708000
*           RFY                                                    0260 00709000
*             MSGPTR UNRSTD;                                       0260 00710000
*           RFY                                                    0261 00711000
*            (R0,                                                  0261 00712000
*             R1,                                                  0261 00713000
*             R14,                                                 0261 00714000
*             R15) RSTD;                                           0261 00715000
*           GEN SETS(R0,R1,R14,R15) CODE(TIME DEC,ERRET=TIMERR);/* 0262 00716000
*                                      GET TIME                      */ 00717000
         TIME DEC,ERRET=TIMERR                                          00718000
*           TIME=R0;                                               0263 00719000
         ST    R0,TIME                                             0263 00720000
*           RFY                                                    0264 00721000
*            (R0,                                                  0264 00722000
*             R1,                                                  0264 00723000
*             R14,                                                 0264 00724000
*             R15) UNRSTD;                                         0264 00725000
*           UNPK(UNPKAREA,TIME);    /* UNPACK THE TIME VALUE TO MAKE    00726000
*                                      IT PRINTABLE                  */ 00727000
         UNPK  UNPKAREA(7),TIME(4)                                 0265 00728000
*           HH=UNPKAREA(1:2);       /* MOVE THE PIECES INTO THE MSG  */ 00729000
         MVC   HH(2,WPLPTR),UNPKAREA                               0266 00730000
*           MM=UNPKAREA(3:4);       /* TEXT                          */ 00731000
         MVC   MM(2,WPLPTR),UNPKAREA+2                             0267 00732000
*           SS=UNPKAREA(5:6);                                      0268 00733000
         MVC   SS(2,WPLPTR),UNPKAREA+4                             0268 00734000
*TIMERR:                            /* IF NO TIME RETURNED LEAVE 00     00735000
*                                      IN THE MSG                    */ 00736000
*           WPLPTR=ADDR(WPLTXT)+WPLLGH;/* MOVE WPL MAP TO MLWTO FIELD*/ 00737000
TIMERR   LA    @10,WPLTXT(,WPLPTR)                                 0269 00738000
         AH    @10,WPLLGH(,WPLPTR)                                 0269 00739000
         LR    WPLPTR,@10                                          0269 00740000
*           WPLAREA=CHARID;         /* DISPLAY AREA ID               */ 00741000
         L     @10,CSCBPTR                                         0270 00742000
         MVC   WPLAREA(1,WPLPTR),CHARID(@10)                       0270 00743000
*           RFY                                                    0271 00744000
*            (R1,                                                  0271 00745000
*             R0) RSTD;                                            0271 00746000
*           R0=CHCNID;              /* THE LAST BYTE MUST BE THE   0272 00747000
*                                      CONSOLE ID THE REST SHOULD BE    00748000
*                                      ZERO                          */ 00749000
         SLR   R0,R0                                               0272 00750000
         IC    R0,CHCNID(,@10)                                     0272 00751000
*           GEN SETS(R1) REFS(BLDAREA) CODE(WTO MF=(E,BLDAREA));/* 0273 00752000
*                                      WRITE OUT THE CONTROL LINE    */ 00753000
         WTO MF=(E,BLDAREA)                                             00754000
*           MLWTOID=R1;             /* SAVE THE ID FOR WTO CONTINUES */ 00755000
         STCM  R1,7,MLWTOID                                        0274 00756000
*           MLWTOCN=CHCNID;         /* ALSO SAVE THE TARGET CONSOLE     00757000
*                                      ID                            */ 00758000
         L     @10,CSCBPTR                                         0275 00759000
         MVC   MLWTOCN(1),CHCNID(@10)                              0275 00760000
*           WCINIT=0;               /* ALSO INIT THE WORKAREA FOR THE   00761000
*                                      FIRST CALL TO IEECB912        */ 00762000
         SLR   @10,@10                                             0276 00763000
         ST    @10,WCINIT                                          0276 00764000
*           RFY                                                    0277 00765000
*            (R0,                                                  0277 00766000
*             R1,                                                  0277 00767000
*             WPLPTR) UNRSTD;                                      0277 00768000
*                                                                  0278 00769000
*           /*********************************************************/ 00770000
*           /*                                                       */ 00771000
*           /* GENERATE MSG IEE856I DISPLAY DUMP STATUS              */ 00772000
*           /*                                                       */ 00773000
*           /*********************************************************/ 00774000
*                                                                  0278 00775000
*           IF STATUS=YES           /* WAS THIS MSG REQUESTED ?      */ 00776000
*             THEN                                                 0278 00777000
         TM    STATUS,B'10000000'                                  0278 00778000
         BNO   @RF00278                                            0278 00779000
*             DO;                                                  0279 00780000
*                                                                  0279 00781000
*               /*****************************************************/ 00782000
*               /*                                                   */ 00783000
*               /* BUILD THE LABEL LINE FOR IEE856I                  */ 00784000
*               /*                                                   */ 00785000
*               /*****************************************************/ 00786000
*                                                                  0280 00787000
*               RFY                                                0280 00788000
*                (NEWPTR,                                          0280 00789000
*                 TXTPTR) RSTD;                                    0280 00790000
*               NEWPTR=ADDR(BLDLINE);/* LOCATE THE AREA WHERE THE  0281 00791000
*                                      LINE WILL BE BUILT            */ 00792000
         LA    @09,BLDLINE                                         0281 00793000
         LR    NEWPTR,@09                                          0281 00794000
*               TXTPTR=ADDR(LABEL856);/* LOCATE THE TEXT FOR THE   0282 00795000
*                                      SUMMARY LINE                  */ 00796000
         L     TXTPTR,@CA02055                                     0282 00797000
*               NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* MOVE IN THE FIRST     00798000
*                                      PART                          */ 00799000
         SLR   @15,@15                                             0283 00800000
         IC    @15,TXTLEN(,TXTPTR)                                 0283 00801000
         LR    @14,@15                                             0283 00802000
         BCTR  @14,0                                               0283 00803000
         EX    @14,@SM02260                                        0283 00804000
*               NEWPTR=NEWPTR+TXTLEN;                              0284 00805000
         ALR   NEWPTR,@15                                          0284 00806000
*               TXTPTR=ADDR(TXT)+TXTLEN;                           0285 00807000
         LA    @14,TXT(,TXTPTR)                                    0285 00808000
         ALR   @14,@15                                             0285 00809000
         LR    TXTPTR,@14                                          0285 00810000
*               CVD(AVAILCNT,CVDAREA);/* CONVERT COUNT TO DECIMAL    */ 00811000
         L     @15,AVAILCNT                                        0286 00812000
         CVD   @15,CVDAREA                                         0286 00813000
*               CVDAREA(8)=CVDAREA(8)|ZONE;/* CONVERT SIGN TO A ZONE */ 00814000
         OI    CVDAREA+7,X'0F'                                     0287 00815000
*               UNPK(NEWTXT(1:2),CVDAREA(7:8));/* ADD THE NUMBER OF     00816000
*                                      AVAILABLE DS TO THE MSG       */ 00817000
         UNPK  NEWTXT(2,NEWPTR),CVDAREA+6(2)                       0288 00818000
*               NEWPTR=NEWPTR+2;                                   0289 00819000
         LA    @15,2                                               0289 00820000
         ALR   NEWPTR,@15                                          0289 00821000
*               NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* MOVE IN THE REST OF   00822000
*                                      THE TEXT                      */ 00823000
         SLR   @14,@14                                             0290 00824000
         IC    @14,TXTLEN(,TXTPTR)                                 0290 00825000
         LR    @07,@14                                             0290 00826000
         BCTR  @07,0                                               0290 00827000
         EX    @07,@SM02260                                        0290 00828000
*               NEWPTR=NEWPTR+TXTLEN;                              0291 00829000
         ALR   NEWPTR,@14                                          0291 00830000
*               CVD(FULLCNT,CVDAREA);                              0292 00831000
         L     @14,FULLCNT                                         0292 00832000
         CVD   @14,CVDAREA                                         0292 00833000
*               CVDAREA(8)=CVDAREA(8)|ZONE;                        0293 00834000
         OI    CVDAREA+7,X'0F'                                     0293 00835000
*               UNPK(NEWTXT(1:2),CVDAREA(7:8));/* ADD NUMBER OF FULL    00836000
*                                      DATASETS TO THE MSG           */ 00837000
         UNPK  NEWTXT(2,NEWPTR),CVDAREA+6(2)                       0294 00838000
*               BLDLEN=NEWPTR+2-ADDR(BLDLINE);/* CALC THE LENGTH OF     00839000
*                                      THE LINE                      */ 00840000
         ALR   @15,NEWPTR                                          0295 00841000
         SLR   @15,@09                                             0295 00842000
         STC   @15,BLDLEN                                          0295 00843000
*                                                                  0296 00844000
*               /*****************************************************/ 00845000
*               /*                                                   */ 00846000
*               /* IF THERE ARE NO DUMP DATASETS DEFINED THE LABEL   */ 00847000
*               /* LINE WILL BE PUT OUT AS THE ENDING DATA LINE AND  */ 00848000
*               /* THE NORMAL DATA LINE GENERATION WILL NOT BE DONE. */ 00849000
*               /*                                                   */ 00850000
*               /*****************************************************/ 00851000
*                                                                  0296 00852000
*               IF LASTENT=0        /* ARE THERE NO DUMP DATASETS?   */ 00853000
*                 THEN              /* YES THERE ARE NONE            */ 00854000
         C     @10,LASTENT                                         0296 00855000
         BNE   @RF00296                                            0296 00856000
*                 CALL IEECB912(BLDAREA,1,1,ENDTYPE,MLWTOID,WTOCONTA);  00857000
         LA    @10,BLDAREA                                         0297 00858000
         ST    @10,@AL00001                                        0297 00859000
         LA    @10,@CF00267                                        0297 00860000
         ST    @10,@AL00001+4                                      0297 00861000
         LA    @10,@CF00267                                        0297 00862000
         ST    @10,@AL00001+8                                      0297 00863000
         LA    @10,@CB02003                                        0297 00864000
         ST    @10,@AL00001+12                                     0297 00865000
         LA    @10,MLWTOID                                         0297 00866000
         ST    @10,@AL00001+16                                     0297 00867000
         LA    @10,WTOCONTA                                        0297 00868000
         ST    @10,@AL00001+20                                     0297 00869000
         L     @15,@CV01998                                        0297 00870000
         LA    @01,@AL00001                                        0297 00871000
         BALR  @14,@15                                             0297 00872000
*                                   /* WRITE OUT THE LINE. SEE     0298 00873000
*                                      IEECB912 FOR PARM EXPLANATION */ 00874000
*               ELSE                                               0298 00875000
*                 DO;               /* THERE WILL BE DATA LINES TO 0298 00876000
*                                      FOLLOW                        */ 00877000
         B     @RC00296                                            0298 00878000
@RF00296 DS    0H                                                  0299 00879000
*                   CALL IEECB912(BLDAREA,1,1,LABLTYPE,MLWTOID,WTOCONTA 00880000
*                       );          /* WRITE OUT THE LINE. SEE     0299 00881000
*                                      WTOCOUNT FOR PARM EXPLANATION */ 00882000
         LA    @10,BLDAREA                                         0299 00883000
         ST    @10,@AL00001                                        0299 00884000
         LA    @10,@CF00267                                        0299 00885000
         ST    @10,@AL00001+4                                      0299 00886000
         LA    @10,@CF00267                                        0299 00887000
         ST    @10,@AL00001+8                                      0299 00888000
         LA    @10,@CB00302                                        0299 00889000
         ST    @10,@AL00001+12                                     0299 00890000
         LA    @10,MLWTOID                                         0299 00891000
         ST    @10,@AL00001+16                                     0299 00892000
         LA    @10,WTOCONTA                                        0299 00893000
         ST    @10,@AL00001+20                                     0299 00894000
         L     @15,@CV01998                                        0299 00895000
         LA    @01,@AL00001                                        0299 00896000
         BALR  @14,@15                                             0299 00897000
*                                                                  0300 00898000
*                   /*************************************************/ 00899000
*                   /*                                               */ 00900000
*                   /* BUILD THE DATA LINES FOR MSG IEE856I          */ 00901000
*                   /*                                               */ 00902000
*                   /*************************************************/ 00903000
*                                                                  0300 00904000
*                   DO ENT=1 TO LASTENT;/* GENERATE A DATA LINE FOR     00905000
*                                      EACH ENTRY IN DSTABLE         */ 00906000
         LA    ENT,1                                               0300 00907000
         B     @DE00300                                            0300 00908000
@DL00300 DS    0H                                                  0301 00909000
*                     NEWPTR=ADDR(BLDLINE);                        0301 00910000
         LA    NEWPTR,BLDLINE                                      0301 00911000
*                     TXTPTR=ADDR(DATA856);/* LOCATE THE TEXT FOR THE   00912000
*                                      DATA SET LINE                 */ 00913000
*                                                                  0302 00914000
         L     TXTPTR,@CA02056                                     0302 00915000
*                     /***********************************************/ 00916000
*                     /*                                             */ 00917000
*                     /* BIT INTERPRETATION. EACH BIT IN MSGBITS     */ 00918000
*                     /* INDICATES A PORTION OF TEXT TO BE ADDED TO  */ 00919000
*                     /* THE LINE TO CONSTRUCT THE TOTAL LINE. EACH  */ 00920000
*                     /* BIT IS TESTED AND IF IT IS ON THE           */ 00921000
*                     /* CORRESPONDING TEXT IS MOVED INTO THE LINE.  */ 00922000
*                     /* CSECT IEECB911 CONTAINS A STRING OF         */ 00923000
*                     /* LENGTH&TEXT ELEMENTS IN THE SAME ORDER AS   */ 00924000
*                     /* THE BITS.                                   */ 00925000
*                     /*                                             */ 00926000
*                     /***********************************************/ 00927000
*                                                                  0303 00928000
*                     RFY                                          0303 00929000
*                      (BYTEREG,                                   0303 00930000
*                       BITREG) RSTD;                              0303 00931000
*                     BYTEREG=ADDR(MSGBITS(ENT));/* LOCATE THE MSG 0304 00932000
*                                      BITS THAT DESCRIBE THE      0304 00933000
*                                      CONDITION OF THE DATASET AND     00934000
*                                      CAN BE USED TO BUILD THE TEXT */ 00935000
         LR    BYTEREG,ENT                                         0304 00936000
         MH    BYTEREG,@CH02234                                    0304 00937000
         LA    BYTEREG,MSGBITS-105(BYTEREG)                        0304 00938000
*                     BITREG='00000100'X;/* INIT THE BIT MASK WHICH     00939000
*                                      CONTROLS WHICH BIT IN THE BYTE   00940000
*                                      POINTED TO BY BYTEREG IS TO BE   00941000
*                                      TESTED                        */ 00942000
         LA    BITREG,256                                          0305 00943000
*                     DO WHILE BITREG>1;/* TEST EACH BIT IN THE BYTE */ 00944000
         B     @DE00306                                            0306 00945000
@DL00306 DS    0H                                                  0307 00946000
*                       GEN SETS(BITREG) REFS(BYTEREG,TMINST) CODE;     00947000
         SRA   BITREG,1              SHIFT TO THE NEXT BIT POSITION     00948000
         EX    BITREG,TMINST                                            00949000
*                       BC(8,NOTEXT);/* IF THE TM SHOWED THE BIT TO     00950000
*                                      BE OFF SKIP THE CODE THAT   0308 00951000
*                                      MOVES IN THE TEXT FOR THE BIT    00952000
*                                      BEING ON                      */ 00953000
         BC    8,NOTEXT                                            0308 00954000
*                       NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* IF BIT IS     00955000
*                                      ON MOVE IN ITS TEXT           */ 00956000
         SLR   @09,@09                                             0309 00957000
         IC    @09,TXTLEN(,TXTPTR)                                 0309 00958000
         LR    @07,@09                                             0309 00959000
         BCTR  @07,0                                               0309 00960000
         EX    @07,@SM02260                                        0309 00961000
*                       NEWPTR=NEWPTR+TXTLEN;/* MOVE TO THE NEXT SLOT*/ 00962000
         ALR   NEWPTR,@09                                          0310 00963000
*                       IF BITREG=16|BITREG=32/* CHECK TO SEE IF THE    00964000
*                                      NAME SHOULD BE MOVED IN       */ 00965000
*                         THEN                                     0311 00966000
         CH    BITREG,@CH00037                                     0311 00967000
         BE    @RT00311                                            0311 00968000
         CH    BITREG,@CH00400                                     0311 00969000
         BNE   @RF00311                                            0311 00970000
@RT00311 DS    0H                                                  0312 00971000
*                         DO;                                      0312 00972000
*                           NEWTXT(1:LENGTH(NAME))=NAME(ENT);/* COPY    00973000
*                                      IN THE NAME FROM THE DSTABLE  */ 00974000
         LR    @09,ENT                                             0313 00975000
         MH    @09,@CH02234                                        0313 00976000
         LA    @07,NAME-105(@09)                                   0313 00977000
         MVC   NEWTXT(3,NEWPTR),0(@07)                             0313 00978000
*                           NEWPTR=NEWPTR+LENGTH(NAME);            0314 00979000
         AH    NEWPTR,@CH00582                                     0314 00980000
*                         END;                                     0315 00981000
*NOTEXT:                            /* BRANCH HERE TO AVOID ADDING 0316 00982000
*                                      TEXT TO THE LINE              */ 00983000
*                       TXTPTR=ADDR(TXT)+TXTLEN;/* MOVE TO THE TEXT     00984000
*                                      FOR THE NEXT OPTION BIT       */ 00985000
@RF00311 DS    0H                                                  0316 00986000
NOTEXT   LA    @09,TXT(,TXTPTR)                                    0316 00987000
         SLR   @07,@07                                             0316 00988000
         IC    @07,TXTLEN(,TXTPTR)                                 0316 00989000
         ALR   @09,@07                                             0316 00990000
         LR    TXTPTR,@09                                          0316 00991000
*                     END;          /* IF THE NEXT TXTLEN IS 0 OR THE   00992000
*                                      BIT MASK IN BITREG IS 1,    0317 00993000
*                                      INDICATING THE LAST BIT OF THE   00994000
*                                      BYTE HAS BEEN TESTED, END THE    00995000
*                                      LOOP                          */ 00996000
@DE00306 CH    BITREG,@CH00267                                     0317 00997000
         BH    @DL00306                                            0317 00998000
*                     RFY                                          0318 00999000
*                      (BITREG,                                    0318 01000000
*                       BYTEREG) UNRSTD;                           0318 01001000
*                     IF TITLEOK(ENT)=ON/* CHECK FOR A TITLE IN    0319 01002000
*                                      DSTABLE                       */ 01003000
*                       THEN        /* IF THERE IS ONE               */ 01004000
         LR    @10,ENT                                             0319 01005000
         MH    @10,@CH02234                                        0319 01006000
         LA    @09,TITLEOK-105(@10)                                0319 01007000
         TM    0(@09),B'10000000'                                  0319 01008000
         BNO   @RF00319                                            0319 01009000
*                       DO;                                        0320 01010000
*                         NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* COPY IN     01011000
*                                      TITLE HEADER WHICH WILL BE THE   01012000
*                                      TEXT POINTED TO AFTER THE BIT    01013000
*                                      LOOP IS DONE                  */ 01014000
         SLR   @09,@09                                             0321 01015000
         IC    @09,TXTLEN(,TXTPTR)                                 0321 01016000
         LR    @05,@09                                             0321 01017000
         BCTR  @05,0                                               0321 01018000
         EX    @05,@SM02260                                        0321 01019000
*                         NEWPTR=NEWPTR+TXTLEN;                    0322 01020000
         ALR   NEWPTR,@09                                          0322 01021000
*                         NEWTXT(1:LENGTH(TITLE))=TITLE(ENT);/* THEN    01022000
*                                      COPY IN THE TITLE ITSELF      */ 01023000
         LA    @09,TITLE-105(@10)                                  0323 01024000
         MVC   NEWTXT(100,NEWPTR),0(@09)                           0323 01025000
*                         NEWPTR=NEWPTR+LENGTH(TITLE);             0324 01026000
         AH    NEWPTR,@CH02102                                     0324 01027000
*                       END;                                       0325 01028000
*                     BLDLEN=NEWPTR-ADDR(BLDLINE);/* CALC THE LENGTH    01029000
*                                      OF THIS LINE                  */ 01030000
@RF00319 LA    @10,BLDLINE                                         0326 01031000
         LCR   @10,@10                                             0326 01032000
         ALR   @10,NEWPTR                                          0326 01033000
         STC   @10,BLDLEN                                          0326 01034000
*                     IF ENT=LASTENT/* IS THIS THE LAST LINE         */ 01035000
*                       THEN        /* IT IS THE LAST                */ 01036000
         C     ENT,LASTENT                                         0327 01037000
         BNE   @RF00327                                            0327 01038000
*                       TYPELINE=ENDTYPE;                          0328 01039000
         MVI   TYPELINE,X'FF'                                      0328 01040000
*                     ELSE          /* IT IS NOT THE LAST            */ 01041000
*                       TYPELINE=DATATYPE;                         0329 01042000
         B     @RC00327                                            0329 01043000
@RF00327 MVI   TYPELINE,X'02'                                      0329 01044000
*                     CALL IEECB912(BLDAREA,15,35,TYPELINE,MLWTOID,     01045000
*                         WTOCONTA);                               0330 01046000
@RC00327 LA    @10,BLDAREA                                         0330 01047000
         ST    @10,@AL00001                                        0330 01048000
         LA    @10,@CF00323                                        0330 01049000
         ST    @10,@AL00001+4                                      0330 01050000
         LA    @10,@CF02219                                        0330 01051000
         ST    @10,@AL00001+8                                      0330 01052000
         LA    @10,TYPELINE                                        0330 01053000
         ST    @10,@AL00001+12                                     0330 01054000
         LA    @10,MLWTOID                                         0330 01055000
         ST    @10,@AL00001+16                                     0330 01056000
         LA    @10,WTOCONTA                                        0330 01057000
         ST    @10,@AL00001+20                                     0330 01058000
         L     @15,@CV01998                                        0330 01059000
         LA    @01,@AL00001                                        0330 01060000
         BALR  @14,@15                                             0330 01061000
*                   END;            /* OF LOOP TO BUILD IEE856I DATA    01062000
*                                      LINES                         */ 01063000
         AL    ENT,@CF00267                                        0331 01064000
@DE00300 C     ENT,LASTENT                                         0331 01065000
         BNH   @DL00300                                            0331 01066000
*                   RFY                                            0332 01067000
*                    (NEWPTR,                                      0332 01068000
*                     TXTPTR) UNRSTD;                              0332 01069000
*                 END;              /* OF DATA LINES FOLLOWING THE 0333 01070000
*                                      LABEL LINE                    */ 01071000
*             END;                  /* OF BUILDING MSG IEE856I       */ 01072000
*                                                                  0335 01073000
*           /*********************************************************/ 01074000
*           /*                                                       */ 01075000
*           /* GENERATE MSG IEE857I DISPLAY DUMP OPTIONS DATA LINES  */ 01076000
*           /*                                                       */ 01077000
*           /*********************************************************/ 01078000
*                                                                  0335 01079000
*           ELSE                    /* ASSUME THAT OPTIONS WAS     0335 01080000
*                                      REQUESTED IF NONE OF THE OTHER   01081000
*                                      FLAGS WAS ON                  */ 01082000
*             DO;                                                  0335 01083000
         B     @RC00278                                            0335 01084000
@RF00278 DS    0H                                                  0336 01085000
*               RTCTCOPY=RTCTOPT;   /* SAVE A COPY OF THE RTCT     0336 01086000
*                                      EFFECTIVE DUMP OPTIONS FOR  0336 01087000
*                                      STABILITY                     */ 01088000
         L     @10,CVTPTR                                          0336 01089000
         L     @10,CVTRTMCT(,@10)                                  0336 01090000
         MVC   RTCTCOPY(16),RTCTOPT(@10)                           0336 01091000
*               RFY                                                0337 01092000
*                (NEWPTR,                                          0337 01093000
*                 TXTPTR) RSTD;                                    0337 01094000
*               DO DT=1 TO 4;       /* LOOP ONCE FOR EACH DUMP TYPE  */ 01095000
         LA    DT,1                                                0338 01096000
@DL00338 DS    0H                                                  0339 01097000
*                 NEWPTR=ADDR(BLDLINE);/* LOCATE THE AREA WHERE THE     01098000
*                                      TEXT WILL BE BUILT            */ 01099000
         LA    NEWPTR,BLDLINE                                      0339 01100000
*                 TXTPTR=DUMPTYPE(DT);/* USING THE ARRAY DUMPTYPE  0340 01101000
*                                      OBTAIN THE ADDRESS OF THE DUMP   01102000
*                                      TYPE TEXT IN IEECB911         */ 01103000
         LR    @10,DT                                              0340 01104000
         SLA   @10,2                                               0340 01105000
         L     @05,@CA02062                                        0340 01106000
         AL    @05,@CF02262                                        0340 01107000
         L     TXTPTR,DUMPTYPE-DUMPTYPE(@10,@05)                   0340 01108000
*                 NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* MOVE IN THE DUMP    01109000
*                                      TYPE AND ITS TRAILING BLANK   */ 01110000
         SLR   @09,@09                                             0341 01111000
         IC    @09,TXTLEN(,TXTPTR)                                 0341 01112000
         LR    @05,@09                                             0341 01113000
         BCTR  @05,0                                               0341 01114000
         EX    @05,@SM02260                                        0341 01115000
*                 NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT BASE           */ 01116000
         ALR   NEWPTR,@09                                          0342 01117000
*                 IF IGNOROPT(DT)=ON/* CHECK TO SEE IF THE EXCLUSIVE    01118000
*                                      IGNORE DUMP REQUESTS OPTION IS   01119000
*                                      ON                            */ 01120000
*                   THEN                                           0343 01121000
         LA    @09,IGNOROPT-4(@10)                                 0343 01122000
         TM    0(@09),B'00000001'                                  0343 01123000
         BNO   @RF00343                                            0343 01124000
*                   DO;                                            0344 01125000
*                     TXTPTR=ADDR(NODUMPS);/* GET THE TXT ADDR IN  0345 01126000
*                                      IEECB911                      */ 01127000
         L     TXTPTR,@CA02046                                     0345 01128000
*                     NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* MOVE IN THE     01129000
*                                      TEXT                          */ 01130000
         SLR   @10,@10                                             0346 01131000
         IC    @10,TXTLEN(,TXTPTR)                                 0346 01132000
         LR    @09,@10                                             0346 01133000
         BCTR  @09,0                                               0346 01134000
         EX    @09,@SM02260                                        0346 01135000
*                     NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT TO THE NEXT   01136000
*                                      EMPTY POSITION                */ 01137000
         ALR   NEWPTR,@10                                          0347 01138000
*                   END;                                           0348 01139000
*                 ELSE                                             0349 01140000
*                   DO;             /* IF NOT NO DUMPS               */ 01141000
         B     @RC00343                                            0349 01142000
@RF00343 DS    0H                                                  0350 01143000
*                     IF OPTWORD(DT)=ADDONLY/* ARE ANY OPTIONS     0350 01144000
*                                      SPECIFIED                     */ 01145000
*                       THEN        /* IF NOT SKIP THE OPTION      0350 01146000
*                                      GENERATION                    */ 01147000
         LR    @10,DT                                              0350 01148000
         SLA   @10,2                                               0350 01149000
         L     @10,OPTWORD-4(@10)                                  0350 01150000
         LTR   @10,@10                                             0350 01151000
         BNZ   @RF00350                                            0350 01152000
*                       DO;                                        0351 01153000
*                         TXTPTR=ADDR(ADDNOOPT);/* GET THE TXT ADDR     01154000
*                                      IN IEECB911                   */ 01155000
         L     TXTPTR,@CA02048                                     0352 01156000
*                         NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* MOVE IN     01157000
*                                      THE TEXT                      */ 01158000
         SLR   @10,@10                                             0353 01159000
         IC    @10,TXTLEN(,TXTPTR)                                 0353 01160000
         LR    @09,@10                                             0353 01161000
         BCTR  @09,0                                               0353 01162000
         EX    @09,@SM02260                                        0353 01163000
*                         NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT TO THE    01164000
*                                      NEXT EMPTY POSITION           */ 01165000
         ALR   NEWPTR,@10                                          0354 01166000
*                       END;                                       0355 01167000
*                     ELSE          /* IF THERE ARE OPTIONS          */ 01168000
*                       DO;         /* A LIST WILL NEED TO BE      0356 01169000
*                                      GENERATED                     */ 01170000
         B     @RC00350                                            0356 01171000
@RF00350 DS    0H                                                  0357 01172000
*                         IF OVEROPT(DT)=ON/* DETERMINE THE MODE     */ 01173000
*                           THEN    /* OVERRIDE MODE                 */ 01174000
         LR    @10,DT                                              0357 01175000
         SLA   @10,2                                               0357 01176000
         LA    @09,OVEROPT-4(@10)                                  0357 01177000
         TM    0(@09),B'00000010'                                  0357 01178000
         BNO   @RF00357                                            0357 01179000
*                           DO;                                    0358 01180000
*                             TXTPTR=ADDR(OVERMODE);/* GET THE TXT 0359 01181000
*                                      ADDR IN IEECB911              */ 01182000
         L     TXTPTR,@CA02045                                     0359 01183000
*                             NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* MOVE    01184000
*                                      IN THE TEXT                   */ 01185000
         SLR   @10,@10                                             0360 01186000
         IC    @10,TXTLEN(,TXTPTR)                                 0360 01187000
         LR    @09,@10                                             0360 01188000
         BCTR  @09,0                                               0360 01189000
         EX    @09,@SM02260                                        0360 01190000
*                             NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT TO    01191000
*                                      THE NEXT EMPTY POSITION       */ 01192000
         ALR   NEWPTR,@10                                          0361 01193000
*                           END;                                   0362 01194000
*                         ELSE      /* ADD MODE                      */ 01195000
*                           IF DT=SVCTYPE|/* IF IT IS SDUMP WE     0363 01196000
*                                      ALREADY KNOW THERE ARE CHANGES   01197000
*                                      BECAUSE IT HAS NO PARMLIB   0363 01198000
*                                      VALUES                        */ 01199000
*                               OPTWORD(DT)¬=PLIBOPT(DT)/* IF IT IS     01200000
*                                      ANY OTHER DUMP TYPE COMPARE 0363 01201000
*                                      WITH PARM LIB TO SEE IF THERE    01202000
*                                      HAVE BEEN ANY CHANGES         */ 01203000
*                             THEN  /* FOR OPTIONS DIFFERENT FROM  0363 01204000
*                                      PARMLIB                       */ 01205000
         B     @RC00357                                            0363 01206000
@RF00357 CH    DT,@CH00280                                         0363 01207000
         BE    @RT00363                                            0363 01208000
         LR    @10,DT                                              0363 01209000
         SLA   @10,2                                               0363 01210000
         L     @09,CVTPTR                                          0363 01211000
         L     @09,CVTRTMCT(,@09)                                  0363 01212000
         L     @05,OPTWORD-4(@10)                                  0363 01213000
         CL    @05,PLIBOPT-4(@10,@09)                              0363 01214000
         BE    @RF00363                                            0363 01215000
@RT00363 DS    0H                                                  0364 01216000
*                             DO;                                  0364 01217000
*                               TXTPTR=ADDR(ADDOPTS);/* GET THE TXT     01218000
*                                      ADDR IN IEECB911              */ 01219000
         L     TXTPTR,@CA02047                                     0365 01220000
*                               NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/*  0366 01221000
*                                      MOVE IN THE TEXT              */ 01222000
         SLR   @10,@10                                             0366 01223000
         IC    @10,TXTLEN(,TXTPTR)                                 0366 01224000
         LR    @09,@10                                             0366 01225000
         BCTR  @09,0                                               0366 01226000
         EX    @09,@SM02260                                        0366 01227000
*                               NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT     01228000
*                                      TO THE NEXT EMPTY POSITION    */ 01229000
         ALR   NEWPTR,@10                                          0367 01230000
*                             END;                                 0368 01231000
*                           ELSE    /* FOR DUMP TYPES WHERE THE    0369 01232000
*                                      EFFECTIVE OPTIONS MATCH THE 0369 01233000
*                                      PARMLIB OPTIONS               */ 01234000
*                             DO;                                  0369 01235000
         B     @RC00363                                            0369 01236000
@RF00363 DS    0H                                                  0370 01237000
*                               TXTPTR=ADDR(ADDPLIB);/* GET THE TXT     01238000
*                                      ADDR IN IEECB911              */ 01239000
         L     TXTPTR,@CA02049                                     0370 01240000
*                               NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/*  0371 01241000
*                                      MOVE IN THE TEXT              */ 01242000
         SLR   @10,@10                                             0371 01243000
         IC    @10,TXTLEN(,TXTPTR)                                 0371 01244000
         LR    @09,@10                                             0371 01245000
         BCTR  @09,0                                               0371 01246000
         EX    @09,@SM02260                                        0371 01247000
*                               NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT     01248000
*                                      TO THE NEXT EMPTY POSITION    */ 01249000
         ALR   NEWPTR,@10                                          0372 01250000
*                             END;                                 0373 01251000
*                                                                  0374 01252000
*                         /*******************************************/ 01253000
*                         /*                                         */ 01254000
*                         /* BUILD OPTION LIST FROM RTCT BITS        */ 01255000
*                         /*                                         */ 01256000
*                         /*******************************************/ 01257000
*                                                                  0374 01258000
*                         RFY                                      0374 01259000
*                          (BITREG,                                0374 01260000
*                           BYTEREG) RSTD;                         0374 01261000
@RC00363 DS    0H                                                  0374 01262000
@RC00357 DS    0H                                                  0375 01263000
*                         IF(DT=SATYPE|DT=SUTYPE)/* CHECK DUMPTYPE 0375 01264000
*                                      FOR SDATA OR PDATA PROCESSING */ 01265000
*                           THEN                                   0375 01266000
         CH    DT,@CH00267                                         0375 01267000
         BE    @RT00375                                            0375 01268000
         CH    DT,@CH00272                                         0375 01269000
         BNE   @RF00375                                            0375 01270000
@RT00375 DS    0H                                                  0376 01271000
*                           DO;     /* SETUP SDATA                   */ 01272000
*                             IF SDATOPTS(DT)=SDATONLY/* IF IF THERE    01273000
*                                      ARE NO SDATA OPTIONS          */ 01274000
*                               THEN/* THEN JUST SAY SO              */ 01275000
         LR    @09,DT                                              0377 01276000
         SLA   @09,2                                               0377 01277000
         LA    @07,SDATOPTS-4(@09)                                 0377 01278000
         CLC   0(2,@07),@CB02071                                   0377 01279000
         BNE   @RF00377                                            0377 01280000
*                               TXTPTR=ADDR(NOSDATA);/* POINT TO TEXT   01281000
*                                      IN IEECB911                   */ 01282000
         L     TXTPTR,@CA02051                                     0378 01283000
*                             ELSE  /* BEGIN THE OPTIONS LIST        */ 01284000
*                               TXTPTR=ADDR(SDATA);/* POINT TO TEXT     01285000
*                                      IN IEECB911                   */ 01286000
         B     @RC00377                                            0379 01287000
@RF00377 L     TXTPTR,@CA02053                                     0379 01288000
*                           END;                                   0380 01289000
*                         ELSE                                     0381 01290000
*                           IF DT=SVCTYPE/* CHECK FOR THE ONLY OTHER    01291000
*                                      TWO DUMP TYPES                */ 01292000
*                             THEN                                 0381 01293000
         B     @RC00375                                            0381 01294000
@RF00375 CH    DT,@CH00280                                         0381 01295000
         BNE   @RF00381                                            0381 01296000
*                             TXTPTR=ADDR(SVCDATA);/* SVC DUMP       */ 01297000
         L     TXTPTR,@CA02054                                     0382 01298000
*                           ELSE    /* ASSUME                        */ 01299000
*                             TXTPTR=ADDR(SMDATA);/* SYSMDUMP        */ 01300000
         B     @RC00381                                            0383 01301000
@RF00381 L     TXTPTR,@CA02044                                     0383 01302000
*                         NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* MOVE IN     01303000
*                                      LIST BEGINNING                */ 01304000
@RC00381 DS    0H                                                  0384 01305000
@RC00375 SLR   @09,@09                                             0384 01306000
         IC    @09,TXTLEN(,TXTPTR)                                 0384 01307000
         LR    @07,@09                                             0384 01308000
         BCTR  @07,0                                               0384 01309000
         EX    @07,@SM02260                                        0384 01310000
*                         NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT TO NEXT   01311000
*                                      SLOT                          */ 01312000
         ALR   NEWPTR,@09                                          0385 01313000
*                         TXTPTR=TXTPTR+TXTLEN+1;/* POINT TO THE NEXT   01314000
*                                      TEXT IN THE LIST              */ 01315000
         LA    @07,1                                               0386 01316000
         ALR   @09,TXTPTR                                          0386 01317000
         ALR   @09,@07                                             0386 01318000
         LR    TXTPTR,@09                                          0386 01319000
*                         BYTEREG=ADDR(OPTWORD(DT));/* INIT THE BYTE    01320000
*                                      PTR FOR THE BIT ANALYSIS LOOP */ 01321000
         LR    BYTEREG,DT                                          0387 01322000
         SLA   BYTEREG,2                                           0387 01323000
         LA    BYTEREG,OPTWORD-4(BYTEREG)                          0387 01324000
*                                                                  0388 01325000
*                         /*******************************************/ 01326000
*                         /*                                         */ 01327000
*                         /* LOOP THROUGH THE OPTION BYTES TO BUILD  */ 01328000
*                         /* THE OPTIONS LIST                        */ 01329000
*                         /*                                         */ 01330000
*                         /*******************************************/ 01331000
*                                                                  0388 01332000
*                         DO BYTE=1 TO 4;/* DO EACH BYTE OF DUMP   0388 01333000
*                                      OITIONS                       */ 01334000
         LR    BYTE,@07                                            0388 01335000
@DL00388 DS    0H                                                  0389 01336000
*                           BITREG='00000100'X;/* INIT BIT SELECTOR     01337000
*                                      MASK FOR EX OF TM INST        */ 01338000
         LA    BITREG,256                                          0389 01339000
*                           IF(DT=SATYPE|DT=SUTYPE)/* CHECK FOR SDATA   01340000
*                                      PDATA PROCESSING              */ 01341000
*                               &BYTE=3/* SDATA TEXT ENDING AND PDATA   01342000
*                                      TEXT BEGINNING                */ 01343000
*                             THEN                                 0390 01344000
         CH    DT,@CH00267                                         0390 01345000
         BE    @GL00007                                            0390 01346000
         CH    DT,@CH00272                                         0390 01347000
         BNE   @RF00390                                            0390 01348000
@GL00007 CH    BYTE,@CH00582                                       0390 01349000
         BNE   @RF00390                                            0390 01350000
*                             DO;   /* SET UP FOR PDATA              */ 01351000
*                               IF SDATOPTS(DT)¬=SDATONLY/* IF THERE    01352000
*                                      WERE SDATA OPTIONS            */ 01353000
*                                 THEN/* THEN CLOSE UP THE LIST TEXT */ 01354000
         LR    @09,DT                                              0392 01355000
         SLA   @09,2                                               0392 01356000
         LA    @07,SDATOPTS-4(@09)                                 0392 01357000
         CLC   0(2,@07),@CB02071                                   0392 01358000
         BE    @RF00392                                            0392 01359000
*                                 EVAL(NEWPTR-1)->NEWTXT(1)=')';/* 0393 01360000
*                                      OVERLAY THE LAST COMMA IN THE    01361000
*                                      LIST OF OPTIONS WITH A CLOSE     01362000
*                                      PAREN                         */ 01363000
         LR    @09,NEWPTR                                          0393 01364000
         BCTR  @09,0                                               0393 01365000
         MVI   NEWTXT(@09),C')'                                    0393 01366000
*                               IF PDATOPTS(DT)=PDATONLY/* IF THERE     01367000
*                                      ARE NO PDATA OPTIONS          */ 01368000
*                                 THEN/* THEN JUST SAY SO            */ 01369000
@RF00392 LR    @09,DT                                              0394 01370000
         SLA   @09,2                                               0394 01371000
         LA    @07,PDATOPTS-4(@09)                                 0394 01372000
         MVC   @TS00001(2),0(@07)                                  0394 01373000
         NC    @TS00001(2),@CB02263                                0394 01374000
         BNZ   @RF00394                                            0394 01375000
*                                 TXTPTR=ADDR(NOPDATA);            0395 01376000
         L     TXTPTR,@CA02050                                     0395 01377000
*                               ELSE/* BEGIN THE OPTIONS LIST        */ 01378000
*                                 TXTPTR=ADDR(PDATA);/* POINT TO TEXT   01379000
*                                      IN IEECB911                   */ 01380000
         B     @RC00394                                            0396 01381000
@RF00394 L     TXTPTR,@CA02052                                     0396 01382000
*                               NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/*  0397 01383000
*                                      MOVE IN KEYWORD               */ 01384000
@RC00394 SLR   @09,@09                                             0397 01385000
         IC    @09,TXTLEN(,TXTPTR)                                 0397 01386000
         LR    @07,@09                                             0397 01387000
         BCTR  @07,0                                               0397 01388000
         EX    @07,@SM02260                                        0397 01389000
*                               NEWPTR=NEWPTR+TXTLEN;/* MOVE NEWTXT     01390000
*                                      TO NEXT SLOT                  */ 01391000
         ALR   NEWPTR,@09                                          0398 01392000
*                               TXTPTR=TXTPTR+TXTLEN+1;/* POINT TO 0399 01393000
*                                      THE NEXT TEXT IN THE LIST     */ 01394000
         ALR   @09,TXTPTR                                          0399 01395000
         AL    @09,@CF00267                                        0399 01396000
         LR    TXTPTR,@09                                          0399 01397000
*                             END;                                 0400 01398000
*                                                                  0401 01399000
*                           /*****************************************/ 01400000
*                           /*                                       */ 01401000
*                           /* BIT INTERPRETATION. EACH BIT IN AN OPT*/ 01402000
*                           /* BYTE INDICATES A PORTION OF TEXT TO BE*/ 01403000
*                           /* ADDED TO THE LINE TO CONSTRUCT THE    */ 01404000
*                           /* TOTAL LINE. EACH BIT IS TESTED AND IF */ 01405000
*                           /* IT IS ON THE CORRESPONDING TEXT IS    */ 01406000
*                           /* MOVED INTO THE LINE. CSECT IEECB911   */ 01407000
*                           /* CONTAINS A STRING OF LENGTH&TEXT      */ 01408000
*                           /* ELEMENTS IN THE SAME ORDER AS THE     */ 01409000
*                           /* BITS.                                 */ 01410000
*                           /*                                       */ 01411000
*                           /*****************************************/ 01412000
*                                                                  0401 01413000
*                           DO WHILE(BITREG>1&TXTLEN¬=0);/* TEST EACH   01414000
*                                      BIT IN THE BYTE               */ 01415000
@RF00390 B     @DE00401                                            0401 01416000
@DL00401 DS    0H                                                  0402 01417000
*                             GEN SETS(BITREG) REFS(BYTEREG,TMINST)     01418000
*                                 CODE;                            0402 01419000
         SRA   BITREG,1              SHIFT TO THE NEXT BIT POSITION     01420000
         EX    BITREG,TMINST                                            01421000
*                             BC(8,NOOPT);/* IF THE TM SHOWED THE BIT   01422000
*                                      TO BE OFF SKIP THE CODE THAT     01423000
*                                      MOVES IN THE TEXT FOR THE BIT    01424000
*                                      BEING ON                      */ 01425000
         BC    8,NOOPT                                             0403 01426000
*                             NEWTXT(1:TXTLEN)=TXT(1:TXTLEN);/* IF 0404 01427000
*                                      BIT IS ON MOVE IN ITS TEXT    */ 01428000
         SLR   @09,@09                                             0404 01429000
         IC    @09,TXTLEN(,TXTPTR)                                 0404 01430000
         LR    @07,@09                                             0404 01431000
         BCTR  @07,0                                               0404 01432000
         EX    @07,@SM02260                                        0404 01433000
*                             NEWPTR=NEWPTR+TXTLEN;/* MOVE TO THE  0405 01434000
*                                      NEXT SLOT                     */ 01435000
         ALR   NEWPTR,@09                                          0405 01436000
*NOOPT:                             /* BRANCH HERE TO AVOID ADDING 0406 01437000
*                                      TEXT TO THE LINE              */ 01438000
*                             TXTPTR=TXTPTR+TXTLEN+1;/* MOVE TO THE     01439000
*                                      TEXT FOR THE NEXT OPTION BIT  */ 01440000
NOOPT    LR    @09,TXTPTR                                          0406 01441000
         SLR   @07,@07                                             0406 01442000
         IC    @07,TXTLEN(,TXTPTR)                                 0406 01443000
         ALR   @09,@07                                             0406 01444000
         AL    @09,@CF00267                                        0406 01445000
         LR    TXTPTR,@09                                          0406 01446000
*                           END;    /* IF THE NEXT TXTLEN IS 0 OR THE   01447000
*                                      BIT MASK IN BITREG IS 1,    0407 01448000
*                                      INDICATING THE LAST BIT OF THE   01449000
*                                      BYTE HAS BEEN TESTED, END THE    01450000
*                                      LOOP                          */ 01451000
@DE00401 CH    BITREG,@CH00267                                     0407 01452000
         BNH   @DC00401                                            0407 01453000
         CLI   TXTLEN(TXTPTR),0                                    0407 01454000
         BNE   @DL00401                                            0407 01455000
@DC00401 DS    0H                                                  0408 01456000
*                           BYTEREG=BYTEREG+1;/* MOVE TO THE NEXT  0408 01457000
*                                      BYTE OF OPTIONS               */ 01458000
         AL    BYTEREG,@CF00267                                    0408 01459000
*                         END;      /* OF BIT INTERPRETATION BYTE  0409 01460000
*                                      LOOP                          */ 01461000
         AL    BYTE,@CF00267                                       0409 01462000
         CH    BYTE,@CH00280                                       0409 01463000
         BNH   @DL00388                                            0409 01464000
*                         RFY                                      0410 01465000
*                          (BITREG,                                0410 01466000
*                           BYTEREG) UNRSTD;                       0410 01467000
*                         IF(DT=SATYPE|DT=SUTYPE)/* FOR THE DUMPTYPES   01468000
*                                      THAT HAVE PDATA               */ 01469000
*                             &PDATOPTS(DT)=PDATONLY/* IF THERE WERE    01470000
*                                      NO PDATA OPTIONS              */ 01471000
*                           THEN                                   0411 01472000
         CH    DT,@CH00267                                         0411 01473000
         BE    @GL00010                                            0411 01474000
         CH    DT,@CH00272                                         0411 01475000
         BNE   @RF00411                                            0411 01476000
@GL00010 LR    @10,DT                                              0411 01477000
         SLA   @10,2                                               0411 01478000
         LA    @09,PDATOPTS-4(@10)                                 0411 01479000
         MVC   @TS00001(2),0(@09)                                  0411 01480000
         NC    @TS00001(2),@CB02263                                0411 01481000
         BZ    @RT00411                                            0411 01482000
*                           ;       /* DON'T CLOSE THE LIST          */ 01483000
*                         ELSE                                     0413 01484000
*                           EVAL(NEWPTR-1)->NEWTXT(1)=')';/* OVERLAY    01485000
*                                      THE LAST COMMA IN THE LIST OF    01486000
*                                      OPTIONS WITH A CLOSE PAREN    */ 01487000
@RF00411 LR    @10,NEWPTR                                          0413 01488000
         BCTR  @10,0                                               0413 01489000
         MVI   NEWTXT(@10),C')'                                    0413 01490000
*                       END;        /* OF OPTION GENERATION          */ 01491000
@RT00411 DS    0H                                                  0415 01492000
*                   END;            /* OF THERE ARE NO OPTIONS       */ 01493000
@RC00350 DS    0H                                                  0416 01494000
*                                                                  0416 01495000
*                 /***************************************************/ 01496000
*                 /*                                                 */ 01497000
*                 /* NOW THAT THIS UNIT OF TEXT IS BUILT CALL        */ 01498000
*                 /* IEECB912 TO HAVE IT BROKEN UP INTO MLWTO LISTS  */ 01499000
*                 /* AND WRITTEN OUT                                 */ 01500000
*                 /*                                                 */ 01501000
*                 /***************************************************/ 01502000
*                                                                  0416 01503000
*                 BLDLEN=ADDR(NEWTXT)-ADDR(BLDLINE);/* CALC LENGTH OF   01504000
*                                      TEXT IN BLDLINE FOR IEECB912  */ 01505000
@RC00343 LA    @10,BLDLINE                                         0416 01506000
         LCR   @10,@10                                             0416 01507000
         ALR   @10,NEWPTR                                          0416 01508000
         STC   @10,BLDLEN                                          0416 01509000
*                 IF DT=4           /* CHECK TO SEE IF THE MSG     0417 01510000
*                                      BUILDING IS AT AN END         */ 01511000
*                   THEN                                           0417 01512000
         CH    DT,@CH00280                                         0417 01513000
         BNE   @RF00417                                            0417 01514000
*                   TYPELINE=ENDTYPE;/* SIGNAL THE MLWTO SHOULD BE 0418 01515000
*                                      ENDED AFTER THIS LINE         */ 01516000
         MVI   TYPELINE,X'FF'                                      0418 01517000
*                 ELSE                                             0419 01518000
*                   TYPELINE=DATATYPE;/* SHOW THAT MORE LINES ARE TO    01519000
*                                      COME FOR THE MLWTO            */ 01520000
         B     @RC00417                                            0419 01521000
@RF00417 MVI   TYPELINE,X'02'                                      0419 01522000
*                 CALL IEECB912(BLDAREA,15,23,TYPELINE,MLWTOID,WTOCONTA 01523000
*                     );            /* SEE THE IEECB912 PROLOG FOR AN   01524000
*                                      EXPLANATION OF THE PARMS      */ 01525000
@RC00417 LA    @10,BLDAREA                                         0420 01526000
         ST    @10,@AL00001                                        0420 01527000
         LA    @10,@CF00323                                        0420 01528000
         ST    @10,@AL00001+4                                      0420 01529000
         LA    @10,@CF02224                                        0420 01530000
         ST    @10,@AL00001+8                                      0420 01531000
         LA    @10,TYPELINE                                        0420 01532000
         ST    @10,@AL00001+12                                     0420 01533000
         LA    @10,MLWTOID                                         0420 01534000
         ST    @10,@AL00001+16                                     0420 01535000
         LA    @10,WTOCONTA                                        0420 01536000
         ST    @10,@AL00001+20                                     0420 01537000
         L     @15,@CV01998                                        0420 01538000
         LA    @01,@AL00001                                        0420 01539000
         BALR  @14,@15                                             0420 01540000
*               END;                /* END OF DUMP TYPE LOOP         */ 01541000
         AL    DT,@CF00267                                         0421 01542000
         CH    DT,@CH00280                                         0421 01543000
         BNH   @DL00338                                            0421 01544000
*               RFY                                                0422 01545000
*                (NEWPTR,                                          0422 01546000
*                 TXTPTR) UNRSTD;                                  0422 01547000
*             END;                  /* OF BUILDING MSG IEE857I       */ 01548000
*           RFY                                                    0424 01549000
*             R14 RSTD;                                            0424 01550000
@RC00278 DS    0H                                                  0425 01551000
*         END;                      /* OF SUCCESSFUL PARSE OF OPERAND*/ 01552000
*     END;                          /* OF SUCCESSFUL CALL TO IEECB860*/ 01553000
@RC00130 DS    0H                                                  0427 01554000
*EXITCODE:                                                         0427 01555000
*                                                                  0427 01556000
*   /*****************************************************************/ 01557000
*   /*                                                               */ 01558000
*   /* COMMON EXIT CODE                                              */ 01559000
*   /*                                                               */ 01560000
*   /*****************************************************************/ 01561000
*                                                                  0427 01562000
*   CHFC=ON;                        /* INDICATE THE CSCB IS TO BE  0427 01563000
*                                      FREED                         */ 01564000
@RF00108 DS    0H                                                  0427 01565000
EXITCODE L     @15,CSCBPTR                                         0427 01566000
         OI    CHFC(@15),B'00000010'                               0427 01567000
*   RFY                                                            0428 01568000
*     R1 RSTD;                                                     0428 01569000
*   R1=ADDR(CHAIN);                                                0429 01570000
         LR    R1,@15                                              0429 01571000
*   GEN REFS(R1,CHAIN) CODE( MGCR (R1),CHAIN);/* FREE THE CSCB       */ 01572000
          MGCR (R1),CHAIN                                               01573000
*   RFY                                                            0431 01574000
*     R1 UNRSTD;                                                   0431 01575000
*   DO;                             /* DELETE EP(NAME860)            */ 01576000
*     RESPECIFY                                                    0433 01577000
*      (GPR00P) RESTRICTED;                                        0433 01578000
*     GPR00P=ADDR(NAME860);         /* ->ENTRY NAME                  */ 01579000
         LA    GPR00P,NAME860                                      0434 01580000
*     SVC(9);                       /* DELETE SVC                    */ 01581000
         SVC   9                                                   0435 01582000
*     RESPECIFY                                                    0436 01583000
*      (GPR00P) UNRESTRICTED;                                      0436 01584000
*   END;                            /* DELETE EP(NAME860)            */ 01585000
*   R14=R14SAVE;                                                   0438 01586000
         L     R14,R14SAVE                                         0438 01587000
*   RETURN CODE(0);                                                0439 01588000
         L     @13,4(,@13)                                         0439 01589000
         L     @00,@SIZDATD                                        0439 01590000
         LR    @01,@11                                             0439 01591000
         FREEMAIN R,LV=(0),A=(1)                                        01592000
         SLR   @15,@15                                             0439 01593000
         BR    @14                                                 0439 01594000
*   RFY                                                            0440 01595000
*     R14 UNRSTD;                                                  0440 01596000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 01597000
*     GPR00P PTR(31) REG(0),                                       0441 01598000
*     GPR01P PTR(31) REG(1),                                       0441 01599000
*     GPR15P PTR(31) REG(15);                                      0441 01600000
*   DECLARE                         /* COMMON VARIABLES              */ 01601000
*     I256C CHAR(256) BASED,                                       0442 01602000
*     I031F FIXED(31) BASED,                                       0442 01603000
*     I031P PTR(31) BASED,                                         0442 01604000
*     I015F FIXED(15) BASED,                                       0442 01605000
*     I015P PTR(15) BASED,                                         0442 01606000
*     I008P PTR(8) BASED,                                          0442 01607000
*     I001C CHAR(1) BASED;                                         0442 01608000
*   END IEECB910                                                   0443 01609000
*                                                                  0443 01610000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01611000
*/*%INCLUDE SYSLIB  (IEFZB4D2)                                       */ 01612000
*/*%INCLUDE SYSLIB  (IEFZB4D0)                                       */ 01613000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 01614000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01615000
*/*%INCLUDE SYSLIB  (IEECHAIN)                                       */ 01616000
*/*%INCLUDE SYSLIB  (IHARTCT )                                       */ 01617000
*/*%INCLUDE SYSLIB  (IEEXSA  )                                       */ 01618000
*/*%INCLUDE SYSLIB  (IEZWPL  )                                       */ 01619000
*                                                                  0443 01620000
*       ;                                                          0443 01621000
@DATA    DS    0H                                                       01622000
@CH00272 DC    H'2'                                                     01623000
@CH00582 DC    H'3'                                                     01624000
@CH00280 DC    H'4'                                                     01625000
@CH01013 DC    H'5'                                                     01626000
@CH01463 DC    H'10'                                                    01627000
@CH01394 DC    H'12'                                                    01628000
@CH00037 DC    H'16'                                                    01629000
@CH00400 DC    H'32'                                                    01630000
@CH02102 DC    H'100'                                                   01631000
@CH02234 DC    H'105'                                                   01632000
@SM02246 MVC   DCBEXEC(0),DCBLIST                                       01633000
@SM02248 MVC   DCBDDN(0),DDN                                            01634000
@SM02250 MVC   OPENEXEC(0),OPENLIST                                     01635000
@SM02252 MVC   CLOSEXEC(0),CLOSLIST                                     01636000
@SM02254 MVC   READEXEC(0),READLIST                                     01637000
@SM02258 MVC   BLDAREA(0),MSG(MSGPTR)                                   01638000
@SM02260 MVC   NEWTXT(0,NEWPTR),TXT(TXTPTR)                             01639000
@DATD    DSECT                                                          01640000
         DS    0F                                                       01641000
@SA00001 DS    18F                                                      01642000
@PC00001 DS    1F                                                       01643000
@AL00001 DS    6A                                                       01644000
@TF00001 DS    F                                                        01645000
IEECB910 CSECT                                                          01646000
         DS    0F                                                       01647000
@CF00267 DC    F'1'                                                     01648000
@CH00267 EQU   @CF00267+2                                               01649000
@CF00323 DC    F'15'                                                    01650000
@CF02224 DC    F'23'                                                    01651000
@CF02219 DC    F'35'                                                    01652000
@CF02262 DC    F'-4'                                                    01653000
@DATD    DSECT                                                          01654000
         DS    0D                                                       01655000
S99RBPTR DS    AL4                                                      01656000
         ORG   S99RBPTR                                                 01657000
S99RBPND DS    BL1                                                      01658000
         ORG   S99RBPTR+4                                               01659000
CSCBPTR  DS    A                                                        01660000
R14SAVE  DS    A                                                        01661000
@NM00057 DS    AL4                                                      01662000
         ORG   @NM00057                                                 01663000
MLWTOID  DS    CL3                                                      01664000
MLWTOCN  DS    CL1                                                      01665000
         ORG   @NM00057+4                                               01666000
LASTENT  DS    F                                                        01667000
FULLCNT  DS    F                                                        01668000
AVAILCNT DS    F                                                        01669000
@TS00001 DS    CL2                                                      01670000
         DS    CL2                                                      01671000
S99RB    DS    CL20                                                     01672000
         ORG   S99RB                                                    01673000
S99RBLN  DS    CL1                                                      01674000
S99VERB  DS    CL1                                                      01675000
S99FLAG1 DS    CL2                                                      01676000
         ORG   S99FLAG1                                                 01677000
S99FLG11 DS    CL1                                                      01678000
         ORG   S99FLG11                                                 01679000
S99ONCNV DS    BL1                                                      01680000
S99NOCNV EQU   S99FLG11+0                                               01681000
S99NOMNT EQU   S99FLG11+0                                               01682000
S99JBSYS EQU   S99FLG11+0                                               01683000
         ORG   S99FLAG1+1                                               01684000
S99FLG12 DS    CL1                                                      01685000
         ORG   S99RB+4                                                  01686000
S99RSC   DS    CL4                                                      01687000
         ORG   S99RSC                                                   01688000
S99ERROR DS    CL2                                                      01689000
S99INFO  DS    CL2                                                      01690000
         ORG   S99RB+8                                                  01691000
S99TXTPP DS    AL4                                                      01692000
S99RSV01 DS    FL4                                                      01693000
S99FLAG2 DS    CL4                                                      01694000
         ORG   S99FLAG2                                                 01695000
S99FLG21 DS    CL1                                                      01696000
         ORG   S99FLG21                                                 01697000
S99WTVOL DS    BL1                                                      01698000
S99WTDSN EQU   S99FLG21+0                                               01699000
S99NORES EQU   S99FLG21+0                                               01700000
S99WTUNT EQU   S99FLG21+0                                               01701000
S99OFFLN EQU   S99FLG21+0                                               01702000
S99TIONQ EQU   S99FLG21+0                                               01703000
S99CATLG EQU   S99FLG21+0                                               01704000
S99MOUNT EQU   S99FLG21+0                                               01705000
         ORG   S99FLAG2+1                                               01706000
S99FLG22 DS    CL1                                                      01707000
         ORG   S99FLG22                                                 01708000
S99UDEVT DS    BL1                                                      01709000
S99PCINT EQU   S99FLG22+0                                               01710000
         ORG   S99FLAG2+2                                               01711000
S99FLG23 DS    CL1                                                      01712000
S99FLG24 DS    CL1                                                      01713000
         ORG   S99RB+20                                                 01714000
LNKEXC   DS    CL8                                                      01715000
         ORG   LNKEXC                                                   01716000
LNKEXC01 DS    CL1                                                      01717000
LNKEXC02 DS    AL3                                                      01718000
LNKEXC03 DS    CL1                                                      01719000
LNKEXC04 DS    AL3                                                      01720000
         ORG   LNKEXC+8                                                 01721000
TYPELINE DS    BL1                                                      01722000
         DS    CL3                                                      01723000
WTOCONTA DS    CL776                                                    01724000
         ORG   WTOCONTA                                                 01725000
WCINIT   DS    AL4                                                      01726000
         ORG   WTOCONTA+776                                             01727000
BLDAREA  DS    CL256                                                    01728000
         ORG   BLDAREA                                                  01729000
BLDLEN   DS    AL1                                                      01730000
BLDLINE  DS    CL255                                                    01731000
         ORG   BLDAREA+256                                              01732000
FCFLAGS  DS    BL1                                                      01733000
         ORG   FCFLAGS                                                  01734000
STATUS   DS    BL1                                                      01735000
OPTIONS  EQU   FCFLAGS+0                                                01736000
PARSERR  EQU   FCFLAGS+0                                                01737000
         ORG   FCFLAGS+1                                                01738000
UNPKAREA DS    CL7                                                      01739000
CVDAREA  DS    CL8                                                      01740000
TIME     DS    CL4                                                      01741000
RTCTCOPY DS    CL16                                                     01742000
TEXTLIST DS    CL12                                                     01743000
         ORG   TEXTLIST                                                 01744000
TUP3     DS    AL4                                                      01745000
         ORG   TUP3                                                     01746000
TULSTE2  DS    BL1                                                      01747000
         ORG   TEXTLIST+4                                               01748000
TUP1     DS    AL4                                                      01749000
TUP2     DS    AL4                                                      01750000
         ORG   TUP2                                                     01751000
TULSTEND DS    BL1                                                      01752000
         ORG   TEXTLIST+12                                              01753000
TU1      DS    CL17                                                     01754000
         ORG   TU1                                                      01755000
TU1KEY   DS    CL2                                                      01756000
TU1NUM   DS    FL2                                                      01757000
TU1LNG   DS    FL2                                                      01758000
TU1DSN   DS    CL11                                                     01759000
         ORG   TU1+17                                                   01760000
         DS    CL1                                                      01761000
TU2      DS    CL7                                                      01762000
         ORG   TU2                                                      01763000
@NM00075 DS    CL2                                                      01764000
@NM00076 DS    FL2                                                      01765000
@NM00077 DS    FL2                                                      01766000
@NM00078 DS    BL1                                                      01767000
         ORG   TU2+7                                                    01768000
         DS    CL1                                                      01769000
TU3      DS    CL14                                                     01770000
         ORG   TU3                                                      01771000
TU3KEY   DS    CL2                                                      01772000
@NM00079 DS    FL2                                                      01773000
DDNLEN   DS    FL2                                                      01774000
DDN      DS    CL8                                                      01775000
         ORG   TU3+14                                                   01776000
DSTABLE  DS    CL105                                                    01777000
         ORG   DSTABLE+0                                                01778000
NAME     DS    CL3                                                      01779000
         ORG   NAME+0                                                   01780000
DSNNAME  DS    CL2                                                      01781000
@NM00062 DS    CL1                                                      01782000
         ORG   DSTABLE+3                                                01783000
MSGBITS  DS    BL2                                                      01784000
         ORG   MSGBITS+0                                                01785000
AVAIL    DS    BL1                                                      01786000
FULL     EQU   MSGBITS+0                                                01787000
TAPE     EQU   MSGBITS+0                                                01788000
DASD     EQU   MSGBITS+0                                                01789000
DYNALERR EQU   MSGBITS+0                                                01790000
INVLDHDR EQU   MSGBITS+0                                                01791000
OPENERR  EQU   MSGBITS+0                                                01792000
READERRR EQU   MSGBITS+0                                                01793000
TITLEOK  DS    BL1                                                      01794000
         ORG   DSTABLE+5                                                01795000
TITLE    DS    CL100                                                    01796000
         ORG   DSTABLE+1050                                             01797000
IEECB910 CSECT                                                          01798000
         DS    0F                                                       01799000
@SIZDATD DC    AL1(0)                                                   01800000
         DC    AL3(@ENDDATD-@DATD)                                      01801000
@CV01998 DC    V(IEECB912)                                              01802000
@CA02042 DC    A(CNTL856)                                               01803000
@CA02043 DC    A(CNTL857)                                               01804000
@CA02044 DC    A(SMDATA)                                                01805000
@CA02045 DC    A(OVERMODE)                                              01806000
@CA02046 DC    A(NODUMPS)                                               01807000
@CA02047 DC    A(ADDOPTS)                                               01808000
@CA02048 DC    A(ADDNOOPT)                                              01809000
@CA02049 DC    A(ADDPLIB)                                               01810000
@CA02050 DC    A(NOPDATA)                                               01811000
@CA02051 DC    A(NOSDATA)                                               01812000
@CA02052 DC    A(PDATA)                                                 01813000
@CA02053 DC    A(SDATA)                                                 01814000
@CA02054 DC    A(SVCDATA)                                               01815000
@CA02055 DC    A(LABEL856)                                              01816000
@CA02056 DC    A(DATA856)                                               01817000
@CA02062 DC    A(DUMPTYPE)                                              01818000
         DS    0D                                                       01819000
@CC02202 DC    C'OPTIONS '                                              01820000
@CC02201 DC    C'STATUS '                                               01821000
@CC02196 DC    C'DUMP '                                                 01822000
@CC02198 DC    C'DUMP,'                                                 01823000
@CC02197 DC    C'D '                                                    01824000
@CC02199 DC    C'S '                                                    01825000
@CC02200 DC    C'O '                                                    01826000
@CB00038 DC    X'0001'                                                  01827000
@CB02071 DC    X'0000'                                                  01828000
@CB00302 DC    X'01'                                                    01829000
@CB02003 DC    X'FF'                                                    01830000
@CB02263 DC    B'1111111111111100'                                      01831000
CB860CMD DS    CL7                                                      01832000
         ORG   CB860CMD                                                 01833000
@NM00055 DC    AL1(6)                                                   01834000
@NM00056 DC    CL6'D DUMP'                                              01835000
         ORG   CB860CMD+7                                               01836000
         DS    CL2                                                      01837000
LNKLST   DS    CL8                                                      01838000
         ORG   LNKLST                                                   01839000
LNKLST01 DC    X'00'                                                    01840000
LNKLST02 DC    AL3(NAME503D)                                            01841000
LNKLST03 DC    X'00'                                                    01842000
LNKLST04 DC    AL3(0)                                                   01843000
         ORG   LNKLST+8                                                 01844000
NAME503D DC    CL8'IEE0503D'                                            01845000
NAME860  DC    CL8'IEECB860'                                            01846000
TU1LIST  DS    CL17                                                     01847000
         ORG   TU1LIST                                                  01848000
@NM00063 DC    X'0002'                                                  01849000
@NM00064 DC    H'1'                                                     01850000
@NM00065 DC    H'11'                                                    01851000
@NM00066 DC    CL11'SYS1.DUMP00'                                        01852000
         ORG   TU1LIST+17                                               01853000
         DS    CL1                                                      01854000
TU2LIST  DS    CL7                                                      01855000
         ORG   TU2LIST                                                  01856000
@NM00067 DC    X'0004'                                                  01857000
@NM00068 DC    H'1'                                                     01858000
@NM00069 DC    H'1'                                                     01859000
@NM00070 DC    X'08'                                                    01860000
         ORG   TU2LIST+7                                                01861000
         DS    CL1                                                      01862000
TU3LIST  DS    CL14                                                     01863000
         ORG   TU3LIST                                                  01864000
@NM00071 DC    X'0055'                                                  01865000
@NM00072 DC    H'1'                                                     01866000
@NM00073 DC    H'8'                                                     01867000
@NM00074 DC    CL8'        '                                            01868000
         ORG   TU3LIST+14                                               01869000
PATCHLOC DC    CL256'*** PATCHAREA FOR IEECB910.  256 BYTES LONG. ***'  01870000
IEECB910 CSECT                                                          01871000
TMINST TM 0(BYTEREG),0                                                  01872000
IEECB910 CSECT                                                          01873000
DCBLIST  DCB                   DSORG=PS,BLKSIZE=4104,LRECL=4104,NCP=1, *01874000
               BUFNO=1,DEVD=DA,EODAD=EODFOUND,MACRF=R,RECFM=F,         *01875000
               SYNAD=READERR                                            01876000
DCBLEN   DC    A(DCBLEN-DCBLIST)                                        01877000
         SPACE 2                                                        01878000
OPENLIST OPEN  (,(INPUT)),MF=L                                          01879000
OPENLEN  DC    A(OPENLEN-OPENLIST)                                      01880000
         SPACE 2                                                        01881000
CLOSLIST CLOSE (,LEAVE),MF=L                                            01882000
CLOSLEN  DC    A(CLOSLEN-CLOSLIST)                                      01883000
         SPACE 2                                                        01884000
READLIST READ  READECBL,SF,MF=L                                         01885000
READLEN  DC    A(READLEN-READLIST)                                      01886000
@DATD    DSECT                                                          01887000
DCBEXEC  DCB                   DSORG=PS,BLKSIZE=4104,LRECL=4104,NCP=1, *01888000
               BUFNO=1,DEVD=DA,EODAD=EODFOUND,MACRF=R,RECFM=F,         *01889000
               SYNAD=READERR                                            01890000
         SPACE 2                                                        01891000
OPENEXEC OPEN  (,(INPUT)),MF=L                                          01892000
         SPACE 2                                                        01893000
CLOSEXEC CLOSE (,LEAVE),MF=L                                            01894000
         SPACE 2                                                        01895000
READEXEC READ  READECB,SF,MF=L                                          01896000
BUFFER   DS    CL4104                                                   01897000
@DATD    DSECT                                                          01898000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01899000
@ENDDATD EQU   *                                                        01900000
IEECB910 CSECT                                                          01901000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01902000
@01      EQU   01                                                       01903000
@02      EQU   02                                                       01904000
@03      EQU   03                                                       01905000
@04      EQU   04                                                       01906000
@05      EQU   05                                                       01907000
@06      EQU   06                                                       01908000
@07      EQU   07                                                       01909000
@08      EQU   08                                                       01910000
@09      EQU   09                                                       01911000
@10      EQU   10                                                       01912000
@11      EQU   11                                                       01913000
@12      EQU   12                                                       01914000
@13      EQU   13                                                       01915000
@14      EQU   14                                                       01916000
@15      EQU   15                                                       01917000
ENT      EQU   @04                                                      01918000
BYTE     EQU   @05                                                      01919000
DT       EQU   @04                                                      01920000
XSAPTR   EQU   @02                                                      01921000
WPLPTR   EQU   @06                                                      01922000
R1       EQU   @01                                                      01923000
R0       EQU   @00                                                      01924000
R15      EQU   @15                                                      01925000
RETCODE  EQU   @15                                                      01926000
R14      EQU   @14                                                      01927000
READCNT  EQU   @03                                                      01928000
R13      EQU   @13                                                      01929000
MSGPTR   EQU   @03                                                      01930000
NEWPTR   EQU   @02                                                      01931000
TXTPTR   EQU   @08                                                      01932000
OPTPTR   EQU   @03                                                      01933000
BITREG   EQU   @10                                                      01934000
BYTEREG  EQU   @06                                                      01935000
GPR00P   EQU   @00                                                      01936000
GPR01P   EQU   @01                                                      01937000
GPR15P   EQU   @15                                                      01938000
         EXTRN CNTL856                                                  01939000
         EXTRN CNTL857                                                  01940000
         EXTRN SMDATA                                                   01941000
         EXTRN OVERMODE                                                 01942000
         EXTRN NODUMPS                                                  01943000
         EXTRN ADDOPTS                                                  01944000
         EXTRN ADDNOOPT                                                 01945000
         EXTRN ADDPLIB                                                  01946000
         EXTRN NOPDATA                                                  01947000
         EXTRN NOSDATA                                                  01948000
         EXTRN PDATA                                                    01949000
         EXTRN SDATA                                                    01950000
         EXTRN SVCDATA                                                  01951000
         EXTRN LABEL856                                                 01952000
         EXTRN DATA856                                                  01953000
         EXTRN DUMPTYPE                                                 01954000
PSA      EQU   0                                                        01955000
FLCRNPSW EQU   PSA                                                      01956000
FLCROPSW EQU   PSA+8                                                    01957000
FLCICCW2 EQU   PSA+16                                                   01958000
FLCCVT   EQU   FLCICCW2                                                 01959000
PSAEEPSW EQU   PSA+132                                                  01960000
PSAESPSW EQU   PSA+136                                                  01961000
FLCSVILC EQU   PSAESPSW+1                                               01962000
PSAEPPSW EQU   PSA+140                                                  01963000
FLCPIILC EQU   PSAEPPSW+1                                               01964000
FLCPICOD EQU   PSAEPPSW+2                                               01965000
PSAPICOD EQU   FLCPICOD+1                                               01966000
FLCTEA   EQU   PSAEPPSW+4                                               01967000
FLCPER   EQU   PSA+152                                                  01968000
FLCMCLA  EQU   PSA+168                                                  01969000
FLCIOEL  EQU   FLCMCLA+4                                                01970000
FLCIOA   EQU   FLCMCLA+16                                               01971000
FLCFSA   EQU   FLCMCLA+80                                               01972000
PSASUPER EQU   PSA+552                                                  01973000
PSASUP1  EQU   PSASUPER                                                 01974000
PSASUP2  EQU   PSASUPER+1                                               01975000
PSASUP3  EQU   PSASUPER+2                                               01976000
PSASUP4  EQU   PSASUPER+3                                               01977000
PSACLHT  EQU   PSA+640                                                  01978000
PSALKSA  EQU   PSA+696                                                  01979000
PSAHLHI  EQU   PSA+760                                                  01980000
PSADSSFL EQU   PSA+836                                                  01981000
PSADSSF1 EQU   PSADSSFL                                                 01982000
PSADSSF3 EQU   PSADSSFL+2                                               01983000
PSADSSF4 EQU   PSADSSFL+3                                               01984000
PSARSVT  EQU   PSA+896                                                  01985000
S99TUPL  EQU   0                                                        01986000
S99TUPTR EQU   S99TUPL                                                  01987000
S99TUP   EQU   0                                                        01988000
S99TUNIT EQU   0                                                        01989000
S99TUENT EQU   S99TUNIT+4                                               01990000
S99TUFLD EQU   0                                                        01991000
CVTMAP   EQU   0                                                        01992000
CVTDAR   EQU   CVTMAP+72                                                01993000
CVTFLGS1 EQU   CVTDAR                                                   01994000
CVTDCB   EQU   CVTMAP+116                                               01995000
CVTIOQET EQU   CVTMAP+120                                               01996000
CVTIERLC EQU   CVTMAP+144                                               01997000
CVTHEAD  EQU   CVTMAP+160                                               01998000
CVTSV76C EQU   CVTHEAD                                                  01999000
CVTOPTA  EQU   CVTMAP+182                                               02000000
CVTOPTB  EQU   CVTMAP+183                                               02001000
CVTGTF   EQU   CVTMAP+236                                               02002000
CVTGTFST EQU   CVTGTF                                                   02003000
CVTGTFS  EQU   CVTGTFST                                                 02004000
CVTSTATE EQU   CVTGTFST                                                 02005000
CVTTMODE EQU   CVTGTFST                                                 02006000
CVTFORM  EQU   CVTGTFST                                                 02007000
CVTAQAVT EQU   CVTMAP+240                                               02008000
CVTTCMFG EQU   CVTAQAVT                                                 02009000
CVTVOLM2 EQU   CVTMAP+244                                               02010000
CVTTATA  EQU   CVTVOLM2                                                 02011000
CVTTSKS  EQU   CVTTATA                                                  02012000
CVTVOLF2 EQU   CVTTSKS                                                  02013000
CVTTAT   EQU   CVTTATA+1                                                02014000
CVTATER  EQU   CVTMAP+248                                               02015000
CVTEXT1  EQU   CVTMAP+252                                               02016000
CVTPURG  EQU   CVTMAP+260                                               02017000
CVTQMSG  EQU   CVTMAP+268                                               02018000
CVTDMSR  EQU   CVTMAP+272                                               02019000
CVTRSV37 EQU   CVTDMSR                                                  02020000
CVTDMSRF EQU   CVTRSV37                                                 02021000
CVTERPV  EQU   CVTMAP+316                                               02022000
CVTINTLA EQU   CVTMAP+320                                               02023000
CVTAPF   EQU   CVTMAP+324                                               02024000
CVTEXT2  EQU   CVTMAP+328                                               02025000
CVTHJES  EQU   CVTMAP+332                                               02026000
CVTPGSIA EQU   CVTMAP+348                                               02027000
CVTA1F1  EQU   CVTMAP+356                                               02028000
CVTSYSK  EQU   CVTMAP+357                                               02029000
CVTVOLM1 EQU   CVTMAP+380                                               02030000
CVTVOLF1 EQU   CVTVOLM1                                                 02031000
CVTXTNT1 EQU   0                                                        02032000
CVTXTNT2 EQU   0                                                        02033000
CVTDSSV  EQU   CVTXTNT2                                                 02034000
CVTFLGBT EQU   CVTXTNT2+5                                               02035000
CVTQID   EQU   CVTXTNT2+24                                              02036000
CVTRV400 EQU   CVTXTNT2+52                                              02037000
CVTRV409 EQU   CVTXTNT2+53                                              02038000
CVTATCVT EQU   CVTXTNT2+64                                              02039000
CVTRV429 EQU   CVTXTNT2+84                                              02040000
CVTRV438 EQU   CVTXTNT2+85                                              02041000
CVTRV457 EQU   CVTXTNT2+112                                             02042000
CVTRV466 EQU   CVTXTNT2+113                                             02043000
CVTFIX   EQU   0                                                        02044000
CVTRELNO EQU   CVTFIX+252                                               02045000
CHAIN    EQU   0                                                        02046000
CHFLG    EQU   CHAIN+4                                                  02047000
CHSTS    EQU   CHFLG+2                                                  02048000
CHFC     EQU   CHSTS                                                    02049000
CHACT    EQU   CHFLG+3                                                  02050000
CHIFY    EQU   CHACT                                                    02051000
CHKEY    EQU   CHAIN+8                                                  02052000
CHPARM   EQU   CHKEY                                                    02053000
CHPKE    EQU   CHAIN+28                                                 02054000
CHUCMP   EQU   CHAIN+29                                                 02055000
CHTJID   EQU   CHAIN+30                                                 02056000
CHPROCSN EQU   CHAIN+32                                                 02057000
CHACT1   EQU   CHPROCSN+3                                               02058000
CHASM    EQU   CHAIN+40                                                 02059000
CHCIBP   EQU   CHASM+4                                                  02060000
CHRGNSZ  EQU   CHASM+8                                                  02061000
CHSTEP   EQU   CHASM+24                                                 02062000
CHSWT    EQU   CHSTEP                                                   02063000
CHSHORT  EQU   CHASM+32                                                 02064000
RTCT     EQU   0                                                        02065000
RTCTPLIB EQU   RTCT+4                                                   02066000
RTCTSAP  EQU   RTCTPLIB                                                 02067000
RTCTSAP1 EQU   RTCTSAP                                                  02068000
RTCTSAP2 EQU   RTCTSAP+1                                                02069000
RTCTSAP3 EQU   RTCTSAP+2                                                02070000
RTCTSUP  EQU   RTCTPLIB+4                                               02071000
RTCTSUP1 EQU   RTCTSUP                                                  02072000
RTCTSUP2 EQU   RTCTSUP+1                                                02073000
RTCTSUP3 EQU   RTCTSUP+2                                                02074000
RTCTSYD  EQU   RTCTPLIB+8                                               02075000
RTCTSY01 EQU   RTCTSYD                                                  02076000
RTCTSDDS EQU   RTCT+36                                                  02077000
RTCTDSNM EQU   RTCTSDDS                                                 02078000
RTCTFLG  EQU   RTCTSDDS+3                                               02079000
RTCTDSST EQU   RTCTFLG                                                  02080000
RTCTDSUS EQU   RTCTFLG                                                  02081000
RTCTDETP EQU   RTCTFLG                                                  02082000
RTCTSDPL EQU   RTCT+156                                                 02083000
RTCTRFLG EQU   RTCT+176                                                 02084000
RTCTERID EQU   RTCT+224                                                 02085000
RTCTOPT  EQU   RTCT+236                                                 02086000
RTCTASO  EQU   RTCT+252                                                 02087000
RTCTASO1 EQU   RTCTASO                                                  02088000
RTCTASO2 EQU   RTCTASO+1                                                02089000
RTCTSDI  EQU   RTCT+254                                                 02090000
RTCTSDF  EQU   RTCT+264                                                 02091000
RTCTSDF1 EQU   RTCTSDF                                                  02092000
RTCTSDF2 EQU   RTCTSDF+1                                                02093000
RTCTR2D2 EQU   RTCTSDF+2                                                02094000
RTCTC3PO EQU   RTCTSDF+3                                                02095000
RTCTSDF3 EQU   RTCT+268                                                 02096000
RTCTSDF4 EQU   RTCTSDF3+2                                               02097000
RTCTMOPT EQU   0                                                        02098000
RTCTMSAO EQU   RTCTMOPT                                                 02099000
RTCTSASD EQU   RTCTMSAO                                                 02100000
RTCTSAO1 EQU   RTCTSASD                                                 02101000
RTCTSAO2 EQU   RTCTSASD+1                                               02102000
RTCTSAPD EQU   RTCTMSAO+2                                               02103000
RTCTSAO3 EQU   RTCTSAPD                                                 02104000
RTCTSAO4 EQU   RTCTSAPD+1                                               02105000
RTCTSAMG EQU   RTCTSAO4                                                 02106000
RTCTMSUO EQU   RTCTMOPT+4                                               02107000
RTCTSUSD EQU   RTCTMSUO                                                 02108000
RTCTSUO1 EQU   RTCTSUSD                                                 02109000
RTCTSUO2 EQU   RTCTSUSD+1                                               02110000
RTCTSUPD EQU   RTCTMSUO+2                                               02111000
RTCTSUO3 EQU   RTCTSUPD                                                 02112000
RTCTSUO4 EQU   RTCTSUPD+1                                               02113000
RTCTSUMG EQU   RTCTSUO4                                                 02114000
RTCTMSYO EQU   RTCTMOPT+8                                               02115000
RTCTSD01 EQU   RTCTMSYO                                                 02116000
RTCTSD04 EQU   RTCTMSYO+3                                               02117000
RTCTSMMG EQU   RTCTSD04                                                 02118000
RTCTMSDO EQU   RTCTMOPT+12                                              02119000
RTCTSDOD EQU   RTCTMSDO                                                 02120000
RTCTSDO1 EQU   RTCTSDOD                                                 02121000
RTCTSDO2 EQU   RTCTSDOD+1                                               02122000
RTCTSDO3 EQU   RTCTMSDO+2                                               02123000
RTCTSDO4 EQU   RTCTMSDO+3                                               02124000
RTCTSDMG EQU   RTCTSDO4                                                 02125000
XSAMAP   EQU   0                                                        02126000
XASVRB   EQU   XSAMAP                                                   02127000
XSA      EQU   XASVRB                                                   02128000
XAD      EQU   XSA+4                                                    02129000
XAX      EQU   XASVRB+8                                                 02130000
@NM00046 EQU   XASVRB+16                                                02131000
XAE      EQU   @NM00046                                                 02132000
@NM00047 EQU   XASVRB+20                                                02133000
XAV      EQU   XASVRB+24                                                02134000
XAS      EQU   XASVRB+32                                                02135000
XAU      EQU   XASVRB+40                                                02136000
XAA      EQU   XASVRB+42                                                02137000
XASAVLOC EQU   XSAMAP+48                                                02138000
XASAVLOX EQU   XASAVLOC                                                 02139000
XASAVSTD EQU   XSAMAP+64                                                02140000
XASAVSTR EQU   XASAVSTD                                                 02141000
@NM00049 EQU   XSAMAP+136                                               02142000
XACMFLGS EQU   @NM00049                                                 02143000
XACMFLGA EQU   XACMFLGS                                                 02144000
XACMFLG1 EQU   XACMFLGA                                                 02145000
XACMFLG2 EQU   XACMFLGA+1                                               02146000
XACMFLGB EQU   XACMFLGS+2                                               02147000
XAWORK   EQU   XSAMAP+152                                               02148000
EEXSAS01 EQU   0                                                        02149000
EEXSAS02 EQU   0                                                        02150000
XADUSWIT EQU   EEXSAS02                                                 02151000
EEXSAS03 EQU   0                                                        02152000
XASDS    EQU   EEXSAS03+2                                               02153000
@NM00051 EQU   EEXSAS03+4                                               02154000
EEXSAS04 EQU   0                                                        02155000
XAXMASK  EQU   EEXSAS04                                                 02156000
EEXSAS05 EQU   0                                                        02157000
XASOPCOD EQU   EEXSAS05                                                 02158000
XASWITCH EQU   EEXSAS05+1                                               02159000
XALTCHG  EQU   XASWITCH                                                 02160000
XACOMPMS EQU   XASWITCH                                                 02161000
XARESV   EQU   EEXSAS05+2                                               02162000
EEXSAS06 EQU   0                                                        02163000
XAAVRANG EQU   EEXSAS06                                                 02164000
XAAVRNG2 EQU   EEXSAS06+1                                               02165000
WPLRF    EQU   0                                                        02166000
WPLRPTR  EQU   WPLRF                                                    02167000
WPL      EQU   0                                                        02168000
WPLLGH   EQU   WPL                                                      02169000
WPLMCSF  EQU   WPL+2                                                    02170000
WPLMCSF1 EQU   WPLMCSF                                                  02171000
WPLMCSF2 EQU   WPLMCSF+1                                                02172000
WPLTXT   EQU   WPL+4                                                    02173000
WPLFLGS  EQU   0                                                        02174000
WPLDESC  EQU   WPLFLGS                                                  02175000
WPLDESC1 EQU   WPLDESC                                                  02176000
WPLDESC2 EQU   WPLDESC+1                                                02177000
WPLROUT  EQU   WPLFLGS+2                                                02178000
WPLROUT1 EQU   WPLROUT                                                  02179000
WPLROUT2 EQU   WPLROUT+1                                                02180000
WPLMSGTY EQU   WPLFLGS+4                                                02181000
WPLMSGT1 EQU   WPLMSGTY                                                 02182000
WPLMSGT2 EQU   WPLMSGTY+1                                               02183000
WPLLS01  EQU   0                                                        02184000
WPLLTF   EQU   WPLLS01                                                  02185000
WPLLTF1  EQU   WPLLTF                                                   02186000
WPLAREA  EQU   WPLLS01+2                                                02187000
WPLML    EQU   0                                                        02188000
WPLMLLTF EQU   WPLML+2                                                  02189000
WPLMLLT1 EQU   WPLMLLTF                                                 02190000
SAVEAREA EQU   0                                                        02191000
IEECB860 EQU   0                                                        02192000
MSGMAP   EQU   0                                                        02193000
MSGLEN   EQU   MSGMAP                                                   02194000
MSG      EQU   MSGMAP+1                                                 02195000
NEWTXT   EQU   0                                                        02196000
TXTMAP   EQU   0                                                        02197000
TXTLEN   EQU   TXTMAP                                                   02198000
TXT      EQU   TXTMAP+1                                                 02199000
OPERAND  EQU   0                                                        02200000
I001C    EQU   0                                                        02201000
I008P    EQU   0                                                        02202000
I015F    EQU   0                                                        02203000
I015P    EQU   0                                                        02204000
I031F    EQU   0                                                        02205000
I031P    EQU   0                                                        02206000
I256C    EQU   0                                                        02207000
X        EQU   0                                                        02208000
S99TUFP  EQU   S99TUP                                                   02209000
CVTPTR   EQU   FLCCVT                                                   02210000
CVTS01   EQU   CVTPGSIA                                                 02211000
CVTLPDIA EQU   CVTS01+12                                                02212000
CVTDIRST EQU   CVTLPDIA                                                 02213000
CVTSLIDA EQU   CVTS01+24                                                02214000
CVTCTLFG EQU   CVTS01+50                                                02215000
CVTRTMCT EQU   CVTS01+224                                               02216000
CVTRV210 EQU   CVTS01+424                                               02217000
CVTRV219 EQU   CVTS01+425                                               02218000
CVTRV228 EQU   CVTS01+426                                               02219000
CVTRV237 EQU   CVTS01+427                                               02220000
CVTMFRTR EQU   CVTS01+452                                               02221000
CVTRV262 EQU   CVTS01+468                                               02222000
CVTRV271 EQU   CVTS01+469                                               02223000
CVTRV280 EQU   CVTS01+470                                               02224000
CVTRV289 EQU   CVTS01+471                                               02225000
CVTGSDA  EQU   CVTS01+600                                               02226000
PSARSVTE EQU   PSARSVT                                                  02227000
CHAINS01 EQU   CHASM                                                    02228000
CHBUF    EQU   CHAINS01                                                 02229000
CHTYPE   EQU   CHAINS01+124                                             02230000
CHTRSTAT EQU   CHAINS01+125                                             02231000
CHCNID   EQU   CHAINS01+126                                             02232000
CHARID   EQU   CHAINS01+127                                             02233000
CHCSYSO  EQU   CHAINS01+134                                             02234000
@NM00058 EQU   WPLTXT                                                   02235000
HH       EQU   @NM00058+8                                               02236000
MM       EQU   @NM00058+11                                              02237000
SS       EQU   @NM00058+14                                              02238000
OPTWORD  EQU   RTCTCOPY                                                 02239000
SDATOPTS EQU   OPTWORD                                                  02240000
PDATOPTS EQU   OPTWORD+2                                                02241000
OVEROPT  EQU   OPTWORD+3                                                02242000
IGNOROPT EQU   OPTWORD+3                                                02243000
PLIBOPT  EQU   RTCTPLIB                                                 02244000
DCBMAP   EQU   DCBEXEC                                                  02245000
DCBDDN   EQU   DCBMAP+40                                                02246000
DCBOFLGS EQU   DCBMAP+48                                                02247000
DCBOFOPN EQU   DCBOFLGS                                                 02248000
SDHEADER EQU   BUFFER                                                   02249000
SDHID    EQU   SDHEADER                                                 02250000
SDHRID   EQU   SDHEADER+1                                               02251000
SDHTITLE EQU   SDHEADER+20                                              02252000
FLC      EQU   PSA                                                      02253000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    02254000
SDHTOD   EQU   SDHEADER+12                                              02255000
SDHMODNM EQU   SDHEADER+4                                               02256000
SDHASID  EQU   SDHEADER+2                                               02257000
@NM00081 EQU   DCBOFLGS                                                 02258000
@NM00080 EQU   DCBMAP                                                   02259000
@NM00061 EQU   @NM00058+13                                              02260000
@NM00060 EQU   @NM00058+10                                              02261000
@NM00059 EQU   @NM00058                                                 02262000
CHLAST   EQU   CHAINS01+136                                             02263000
CHSPA    EQU   CHAINS01+135                                             02264000
CHUSERID EQU   CHCSYSO                                                  02265000
CHJB     EQU   CHCSYSO                                                  02266000
CHDUMP   EQU   CHCSYSO                                                  02267000
CHQUE    EQU   CHCSYSO                                                  02268000
CHHOLD   EQU   CHCSYSO                                                  02269000
CHOUT    EQU   CHCSYSO                                                  02270000
CHINN    EQU   CHCSYSO                                                  02271000
CHALL    EQU   CHCSYSO                                                  02272000
CHINC    EQU   CHAINS01+132                                             02273000
CHPEND   EQU   CHAINS01+128                                             02274000
@NM00030 EQU   CHTRSTAT                                                 02275000
CHTSL    EQU   CHTRSTAT                                                 02276000
CHTS     EQU   CHTRSTAT                                                 02277000
CHINITL  EQU   CHTRSTAT                                                 02278000
CHINIT   EQU   CHTRSTAT                                                 02279000
CHJOBSL  EQU   CHTRSTAT                                                 02280000
CHJOBS   EQU   CHTRSTAT                                                 02281000
CHDEF    EQU   CHTYPE                                                   02282000
CHHIAR   EQU   CHTYPE                                                   02283000
CHARSV29 EQU   CHTYPE                                                   02284000
CHARSV28 EQU   CHTYPE                                                   02285000
CHARSV27 EQU   CHTYPE                                                   02286000
CHARSV26 EQU   CHTYPE                                                   02287000
CHARSV25 EQU   CHTYPE                                                   02288000
CHDSTAT  EQU   CHTYPE                                                   02289000
PSARSAV  EQU   PSARSVTE+60                                              02290000
PSARSTK  EQU   PSARSVTE+56                                              02291000
PSAESAV3 EQU   PSARSVTE+52                                              02292000
PSAESTK3 EQU   PSARSVTE+48                                              02293000
PSAESAV2 EQU   PSARSVTE+44                                              02294000
PSAESTK2 EQU   PSARSVTE+40                                              02295000
PSAESAV1 EQU   PSARSVTE+36                                              02296000
PSAESTK1 EQU   PSARSVTE+32                                              02297000
PSAPSAV  EQU   PSARSVTE+28                                              02298000
PSAPSTK  EQU   PSARSVTE+24                                              02299000
PSAMSAV  EQU   PSARSVTE+20                                              02300000
PSAMSTK  EQU   PSARSVTE+16                                              02301000
PSASSAV  EQU   PSARSVTE+12                                              02302000
PSASSTK  EQU   PSARSVTE+8                                               02303000
PSANSTK  EQU   PSARSVTE+4                                               02304000
PSACSTK  EQU   PSARSVTE                                                 02305000
CVTRV628 EQU   CVTS01+728                                               02306000
CVTRV627 EQU   CVTS01+724                                               02307000
CVTRV626 EQU   CVTS01+720                                               02308000
CVTRV625 EQU   CVTS01+716                                               02309000
CVTRV624 EQU   CVTS01+712                                               02310000
CVTRV623 EQU   CVTS01+708                                               02311000
CVTRV622 EQU   CVTS01+704                                               02312000
CVTRV621 EQU   CVTS01+700                                               02313000
CVTIHASU EQU   CVTS01+696                                               02314000
CVTSUSP  EQU   CVTS01+692                                               02315000
CVTT6SVC EQU   CVTS01+688                                               02316000
CVTCDAL  EQU   CVTS01+684                                               02317000
CVTTCTL  EQU   CVTS01+680                                               02318000
CVTRSUME EQU   CVTS01+676                                               02319000
CVTJTERM EQU   CVTS01+672                                               02320000
CVTASMRM EQU   CVTS01+668                                               02321000
CVTTCASP EQU   CVTS01+664                                               02322000
CVT0PT03 EQU   CVTS01+660                                               02323000
CVT0PT0E EQU   CVTS01+656                                               02324000
CVTRV609 EQU   CVTS01+652                                               02325000
CVTCGK   EQU   CVTS01+648                                               02326000
CVTRAC   EQU   CVTS01+644                                               02327000
CVTHSM   EQU   CVTS01+640                                               02328000
CVTRV605 EQU   CVTS01+636                                               02329000
CVTRV604 EQU   CVTS01+632                                               02330000
CVTEFF02 EQU   CVTS01+628                                               02331000
CVTCBBR  EQU   CVTS01+624                                               02332000
CVTSSCR  EQU   CVTS01+620                                               02333000
CVTEVENT EQU   CVTS01+616                                               02334000
CVTCRCA  EQU   CVTS01+612                                               02335000
CVTTPIO  EQU   CVTS01+608                                               02336000
CVTADV   EQU   CVTS01+604                                               02337000
CVTGSDAB EQU   CVTGSDA                                                  02338000
CVTQV3   EQU   CVTS01+596                                               02339000
CVTQV2   EQU   CVTS01+592                                               02340000
CVTQV1   EQU   CVTS01+588                                               02341000
CVTRPT   EQU   CVTS01+584                                               02342000
CVTSSRB  EQU   CVTS01+580                                               02343000
CVTCSDRL EQU   CVTS01+576                                               02344000
CVTEXP1  EQU   CVTS01+572                                               02345000
CVTRMPMT EQU   CVTS01+568                                               02346000
CVTRMPTT EQU   CVTS01+564                                               02347000
CVTVPSA  EQU   CVTS01+560                                               02348000
CVTVSTOP EQU   CVTS01+556                                               02349000
CVTGTFR8 EQU   CVTS01+552                                               02350000
CVTQUIT  EQU   CVTS01+548                                               02351000
CVTVACR  EQU   CVTS01+544                                               02352000
CVTWTCB  EQU   CVTS01+540                                               02353000
CVTSTPRS EQU   CVTS01+536                                               02354000
CVT0PT02 EQU   CVTS01+532                                               02355000
CVTDARCM EQU   CVTS01+528                                               02356000
CVTIRECM EQU   CVTS01+524                                               02357000
CVTJRECM EQU   CVTS01+520                                               02358000
CVTVEMS0 EQU   CVTS01+516                                               02359000
CVTSPFRR EQU   CVTS01+512                                               02360000
CVTRLSTG EQU   CVTS01+508                                               02361000
CVT0TC0A EQU   CVTS01+504                                               02362000
CVTGMBR  EQU   CVTS01+500                                               02363000
CVTLFRM  EQU   CVTS01+496                                               02364000
CVTRMBR  EQU   CVTS01+492                                               02365000
CVTVIOP  EQU   CVTS01+488                                               02366000
CVTRV307 EQU   CVTS01+486                                               02367000
CVTRV306 EQU   CVTS01+484                                               02368000
CVTRV305 EQU   CVTS01+482                                               02369000
CVTRV304 EQU   CVTS01+480                                               02370000
CVTRV303 EQU   CVTS01+478                                               02371000
CVTRV302 EQU   CVTS01+476                                               02372000
CVTTRCA  EQU   CVTS01+472                                               02373000
CVTRV297 EQU   CVTRV289                                                 02374000
CVTRV296 EQU   CVTRV289                                                 02375000
CVTRV295 EQU   CVTRV289                                                 02376000
CVTRV294 EQU   CVTRV289                                                 02377000
CVTRV293 EQU   CVTRV289                                                 02378000
CVTRV292 EQU   CVTRV289                                                 02379000
CVTRV291 EQU   CVTRV289                                                 02380000
CVTRV290 EQU   CVTRV289                                                 02381000
CVTRV288 EQU   CVTRV280                                                 02382000
CVTRV287 EQU   CVTRV280                                                 02383000
CVTRV286 EQU   CVTRV280                                                 02384000
CVTRV285 EQU   CVTRV280                                                 02385000
CVTRV284 EQU   CVTRV280                                                 02386000
CVTRV283 EQU   CVTRV280                                                 02387000
CVTRV282 EQU   CVTRV280                                                 02388000
CVTRV281 EQU   CVTRV280                                                 02389000
CVTRV279 EQU   CVTRV271                                                 02390000
CVTRV278 EQU   CVTRV271                                                 02391000
CVTRV277 EQU   CVTRV271                                                 02392000
CVTRV276 EQU   CVTRV271                                                 02393000
CVTRV275 EQU   CVTRV271                                                 02394000
CVTRV274 EQU   CVTRV271                                                 02395000
CVTRV273 EQU   CVTRV271                                                 02396000
CVTRV272 EQU   CVTRV271                                                 02397000
CVTRV270 EQU   CVTRV262                                                 02398000
CVTRV269 EQU   CVTRV262                                                 02399000
CVTRV268 EQU   CVTRV262                                                 02400000
CVTRV267 EQU   CVTRV262                                                 02401000
CVTRV266 EQU   CVTRV262                                                 02402000
CVTRV265 EQU   CVTRV262                                                 02403000
CVTRV264 EQU   CVTRV262                                                 02404000
CVTRV263 EQU   CVTRV262                                                 02405000
CVTVFP   EQU   CVTS01+464                                               02406000
CVTVSI   EQU   CVTS01+460                                               02407000
CVTVPSIB EQU   CVTS01+456                                               02408000
CVTMFACT EQU   CVTMFRTR                                                 02409000
CVTMFCTL EQU   CVTS01+448                                               02410000
CVTPVBP  EQU   CVTS01+444                                               02411000
CVTPWI   EQU   CVTS01+440                                               02412000
CVTRV254 EQU   CVTS01+438                                               02413000
CVTRV253 EQU   CVTS01+436                                               02414000
CVTRV252 EQU   CVTS01+434                                               02415000
CVTRV251 EQU   CVTS01+433                                               02416000
CVTRV250 EQU   CVTS01+432                                               02417000
CVTRV249 EQU   CVTS01+431                                               02418000
CVTRV248 EQU   CVTS01+430                                               02419000
CVTRV247 EQU   CVTS01+429                                               02420000
CVTRV246 EQU   CVTS01+428                                               02421000
CVTRV245 EQU   CVTRV237                                                 02422000
CVTRV244 EQU   CVTRV237                                                 02423000
CVTRV243 EQU   CVTRV237                                                 02424000
CVTRV242 EQU   CVTRV237                                                 02425000
CVTRV241 EQU   CVTRV237                                                 02426000
CVTRV240 EQU   CVTRV237                                                 02427000
CVTRV239 EQU   CVTRV237                                                 02428000
CVTRV238 EQU   CVTRV237                                                 02429000
CVTRV236 EQU   CVTRV228                                                 02430000
CVTRV235 EQU   CVTRV228                                                 02431000
CVTRV234 EQU   CVTRV228                                                 02432000
CVTRV233 EQU   CVTRV228                                                 02433000
CVTRV232 EQU   CVTRV228                                                 02434000
CVTRV231 EQU   CVTRV228                                                 02435000
CVTRV230 EQU   CVTRV228                                                 02436000
CVTRV229 EQU   CVTRV228                                                 02437000
CVTRV227 EQU   CVTRV219                                                 02438000
CVTRV226 EQU   CVTRV219                                                 02439000
CVTRV225 EQU   CVTRV219                                                 02440000
CVTRV224 EQU   CVTRV219                                                 02441000
CVTRV223 EQU   CVTRV219                                                 02442000
CVTRV222 EQU   CVTRV219                                                 02443000
CVTRV221 EQU   CVTRV219                                                 02444000
CVTRV220 EQU   CVTRV219                                                 02445000
CVTRV218 EQU   CVTRV210                                                 02446000
CVTRV217 EQU   CVTRV210                                                 02447000
CVTRV216 EQU   CVTRV210                                                 02448000
CVTRV215 EQU   CVTRV210                                                 02449000
CVTRV214 EQU   CVTRV210                                                 02450000
CVTRV213 EQU   CVTRV210                                                 02451000
CVTRV212 EQU   CVTRV210                                                 02452000
CVTRV211 EQU   CVTRV210                                                 02453000
CVTLCCAT EQU   CVTS01+420                                               02454000
CVTPCCAT EQU   CVTS01+416                                               02455000
CVTIPCRP EQU   CVTS01+412                                               02456000
CVTIPCRI EQU   CVTS01+408                                               02457000
CVTIPCDS EQU   CVTS01+404                                               02458000
CVTAIDVT EQU   CVTS01+400                                               02459000
CVTSSAP  EQU   CVTS01+396                                               02460000
CVTEHCIR EQU   CVTS01+392                                               02461000
CVTEHDEF EQU   CVTS01+388                                               02462000
CVTDAIR  EQU   CVTS01+384                                               02463000
CVTPERFM EQU   CVTS01+380                                               02464000
CVT044R2 EQU   CVTS01+376                                               02465000
CVTFETCH EQU   CVTS01+372                                               02466000
CVTRSTWD EQU   CVTS01+368                                               02467000
CVTSPOST EQU   CVTS01+364                                               02468000
CVTIOBP  EQU   CVTS01+360                                               02469000
CVTASMVT EQU   CVTS01+356                                               02470000
CVTRECRQ EQU   CVTS01+352                                               02471000
CVTWSAC  EQU   CVTS01+348                                               02472000
CVTRV149 EQU   CVTS01+344                                               02473000
CVTWSAL  EQU   CVTS01+340                                               02474000
CVTSPSA  EQU   CVTS01+336                                               02475000
CVTGLMN  EQU   CVTS01+332                                               02476000
CVTVEAC0 EQU   CVTS01+328                                               02477000
CVT062R1 EQU   CVTS01+324                                               02478000
CVTRPOST EQU   CVTS01+320                                               02479000
CVTDQIQE EQU   CVTS01+316                                               02480000
CVTCSD   EQU   CVTS01+312                                               02481000
CVTLKRMA EQU   CVTS01+308                                               02482000
CVTRSPIE EQU   CVTS01+304                                               02483000
CVTRENQ  EQU   CVTS01+300                                               02484000
CVTLQCB  EQU   CVTS01+296                                               02485000
CVTFQCB  EQU   CVTS01+292                                               02486000
CVTQCS01 EQU   CVTS01+288                                               02487000
CVTAPFT  EQU   CVTS01+284                                               02488000
CVTPARRL EQU   CVTS01+280                                               02489000
CVTVWAIT EQU   CVTS01+276                                               02490000
CVTGSPL  EQU   CVTS01+272                                               02491000
CVTLSMQ  EQU   CVTS01+268                                               02492000
CVTGSMQ  EQU   CVTS01+264                                               02493000
CVTEXPRO EQU   CVTS01+260                                               02494000
CVTOPCTP EQU   CVTS01+256                                               02495000
CVTSIC   EQU   CVTS01+252                                               02496000
CVTTPIOS EQU   CVTS01+248                                               02497000
CVTRTMS  EQU   CVTS01+244                                               02498000
CVTSDBF  EQU   CVTS01+240                                               02499000
CVTSCBP  EQU   CVTS01+236                                               02500000
CVTSDMP  EQU   CVTS01+232                                               02501000
CVTSV60  EQU   CVTS01+228                                               02502000
CVTASCBL EQU   CVTS01+220                                               02503000
CVTASCBH EQU   CVTS01+216                                               02504000
CVTGDA   EQU   CVTS01+212                                               02505000
CVTASVT  EQU   CVTS01+208                                               02506000
CVTVVMDI EQU   CVTS01+204                                               02507000
CVTAQTOP EQU   CVTS01+200                                               02508000
CVTIOSCS EQU   CVTS01+196                                               02509000
CVTSDRM  EQU   CVTS01+192                                               02510000
CVTOPTE  EQU   CVTS01+188                                               02511000
CVTSTXU  EQU   CVTS01+184                                               02512000
CVTQUIS  EQU   CVTS01+180                                               02513000
CVTPARS  EQU   CVTS01+176                                               02514000
CVTS1EE  EQU   CVTS01+172                                               02515000
CVTFRAS  EQU   CVTS01+168                                               02516000
CVTQSAS  EQU   CVTS01+164                                               02517000
CVTCRAS  EQU   CVTS01+160                                               02518000
CVTCRMN  EQU   CVTS01+156                                               02519000
CVTDELCP EQU   CVTS01+152                                               02520000
CVTFRECL EQU   CVTS01+148                                               02521000
CVTGETCL EQU   CVTS01+144                                               02522000
CVTBLDCP EQU   CVTS01+140                                               02523000
CVTAUTHL EQU   CVTS01+136                                               02524000
CVTSCAN  EQU   CVTS01+132                                               02525000
CVTRV144 EQU   CVTS01+130                                               02526000
CVTMAXMP EQU   CVTS01+128                                               02527000
CVTSTCK  EQU   CVTS01+124                                               02528000
CVTRV139 EQU   CVTS01+123                                               02529000
CVTDSSAC EQU   CVTS01+122                                               02530000
CVTRV513 EQU   CVTS01+121                                               02531000
CVTIOSPL EQU   CVTS01+120                                               02532000
CVTPTGT  EQU   CVTS01+116                                               02533000
CVTCSPIE EQU   CVTS01+112                                               02534000
CVTSMFEX EQU   CVTS01+108                                               02535000
CVTOLT0A EQU   CVTS01+104                                               02536000
CVTSRBRT EQU   CVTS01+100                                               02537000
CVTPUTL  EQU   CVTS01+96                                                02538000
CVTASCRL EQU   CVTS01+92                                                02539000
CVTASCRF EQU   CVTS01+88                                                02540000
CVTRV326 EQU   CVTS01+84                                                02541000
CVTRV325 EQU   CVTS01+80                                                02542000
CVTRV324 EQU   CVTS01+76                                                02543000
CVT0VL01 EQU   CVTS01+72                                                02544000
CVTSHRVM EQU   CVTS01+68                                                02545000
CVTRV332 EQU   CVTS01+64                                                02546000
CVTTAS   EQU   CVTS01+60                                                02547000
CVTRSCN  EQU   CVTS01+56                                                02548000
CVTTRAC2 EQU   CVTS01+54                                                02549000
CVTTRACE EQU   CVTS01+52                                                02550000
CVTAPG   EQU   CVTS01+51                                                02551000
CVTSDTRC EQU   CVTCTLFG                                                 02552000
CVTGTRCE EQU   CVTCTLFG                                                 02553000
CVTNOMP  EQU   CVTCTLFG                                                 02554000
CVTRSV79 EQU   CVTCTLFG                                                 02555000
CVTDSTAT EQU   CVTCTLFG                                                 02556000
CVTRSV78 EQU   CVTCTLFG                                                 02557000
CVTRV333 EQU   CVTCTLFG                                                 02558000
CVTRV323 EQU   CVTCTLFG                                                 02559000
CVTSPVLK EQU   CVTS01+49                                                02560000
CVTRSV77 EQU   CVTS01+48                                                02561000
CVTRV331 EQU   CVTS01+44                                                02562000
CVTRV330 EQU   CVTS01+40                                                02563000
CVTRV329 EQU   CVTS01+36                                                02564000
CVTRV328 EQU   CVTS01+32                                                02565000
CVTRV322 EQU   CVTS01+28                                                02566000
CVTSLID  EQU   CVTSLIDA+1                                               02567000
CVTSYLK  EQU   CVTSLIDA                                                 02568000
CVTRV321 EQU   CVTS01+20                                                02569000
CVTRV320 EQU   CVTS01+16                                                02570000
CVTLPDIR EQU   CVTLPDIA+1                                               02571000
CVTRSV69 EQU   CVTDIRST                                                 02572000
CVTRSV68 EQU   CVTDIRST                                                 02573000
CVTRSV67 EQU   CVTDIRST                                                 02574000
CVTRSV66 EQU   CVTDIRST                                                 02575000
CVTRSV65 EQU   CVTDIRST                                                 02576000
CVTRSV64 EQU   CVTDIRST                                                 02577000
CVTRSV63 EQU   CVTDIRST                                                 02578000
CVTDICOM EQU   CVTDIRST                                                 02579000
CVTPVTP  EQU   CVTS01+8                                                 02580000
CVTLPDSR EQU   CVTS01+4                                                 02581000
CVTGETL  EQU   CVTS01                                                   02582000
WPLMLTXT EQU   WPLML+4                                                  02583000
WPLMLLT2 EQU   WPLMLLTF+1                                               02584000
WPLRSV24 EQU   WPLMLLT1                                                 02585000
WPLRSV23 EQU   WPLMLLT1                                                 02586000
WPLRSV22 EQU   WPLMLLT1                                                 02587000
WPLRSV21 EQU   WPLMLLT1                                                 02588000
WPLMLLTD EQU   WPLMLLT1                                                 02589000
WPLMLLTC EQU   WPLMLLT1                                                 02590000
WPLMLLTB EQU   WPLMLLT1                                                 02591000
WPLMLLTA EQU   WPLMLLT1                                                 02592000
WPLMLLEN EQU   WPLML+1                                                  02593000
WPLML0   EQU   WPLML                                                    02594000
WPLLINES EQU   WPLLS01+3                                                02595000
WPLLTF2  EQU   WPLLTF+1                                                 02596000
WPLRSV20 EQU   WPLLTF1                                                  02597000
WPLRSV19 EQU   WPLLTF1                                                  02598000
WPLRSV18 EQU   WPLLTF1                                                  02599000
WPLRSV17 EQU   WPLLTF1                                                  02600000
WPLLTFD  EQU   WPLLTF1                                                  02601000
WPLLTFC  EQU   WPLLTF1                                                  02602000
WPLLTFB  EQU   WPLLTF1                                                  02603000
WPLLTFA  EQU   WPLLTF1                                                  02604000
WPLQID   EQU   WPLFLGS+6                                                02605000
WPLRSV32 EQU   WPLMSGT2                                                 02606000
WPLRSV31 EQU   WPLMSGT2                                                 02607000
WPLRSV30 EQU   WPLMSGT2                                                 02608000
WPLRSV29 EQU   WPLMSGT2                                                 02609000
WPLRSV28 EQU   WPLMSGT2                                                 02610000
WPLRSV27 EQU   WPLMSGT2                                                 02611000
WPLRSV26 EQU   WPLMSGT2                                                 02612000
WPLRSV25 EQU   WPLMSGT2                                                 02613000
WPLRSV16 EQU   WPLMSGT1                                                 02614000
WPLRSV15 EQU   WPLMSGT1                                                 02615000
WPLMSGTF EQU   WPLMSGT1                                                 02616000
WPLRSV14 EQU   WPLMSGT1                                                 02617000
WPLMSGTD EQU   WPLMSGT1                                                 02618000
WPLMSGTC EQU   WPLMSGT1                                                 02619000
WPLMSGTB EQU   WPLMSGT1                                                 02620000
WPLMSGTA EQU   WPLMSGT1                                                 02621000
WPLRSV13 EQU   WPLROUT2                                                 02622000
WPLROUTO EQU   WPLROUT2                                                 02623000
WPLROUTN EQU   WPLROUT2                                                 02624000
WPLROUTM EQU   WPLROUT2                                                 02625000
WPLROUTL EQU   WPLROUT2                                                 02626000
WPLROUTK EQU   WPLROUT2                                                 02627000
WPLROUTJ EQU   WPLROUT2                                                 02628000
WPLROUTI EQU   WPLROUT2                                                 02629000
WPLROUTH EQU   WPLROUT1                                                 02630000
WPLROUTG EQU   WPLROUT1                                                 02631000
WPLROUTF EQU   WPLROUT1                                                 02632000
WPLROUTE EQU   WPLROUT1                                                 02633000
WPLROUTD EQU   WPLROUT1                                                 02634000
WPLROUTC EQU   WPLROUT1                                                 02635000
WPLROUTB EQU   WPLROUT1                                                 02636000
WPLROUTA EQU   WPLROUT1                                                 02637000
WPLRSV12 EQU   WPLDESC2                                                 02638000
WPLRSV11 EQU   WPLDESC2                                                 02639000
WPLRSV10 EQU   WPLDESC2                                                 02640000
WPLRSV09 EQU   WPLDESC2                                                 02641000
WPLRSV08 EQU   WPLDESC2                                                 02642000
WPLRSV07 EQU   WPLDESC2                                                 02643000
WPLDESCJ EQU   WPLDESC2                                                 02644000
WPLDESCI EQU   WPLDESC2                                                 02645000
WPLDESCH EQU   WPLDESC1                                                 02646000
WPLDESCG EQU   WPLDESC1                                                 02647000
WPLDESCF EQU   WPLDESC1                                                 02648000
WPLDESCE EQU   WPLDESC1                                                 02649000
WPLDESCD EQU   WPLDESC1                                                 02650000
WPLDESCC EQU   WPLDESC1                                                 02651000
WPLDESCB EQU   WPLDESC1                                                 02652000
WPLDESCA EQU   WPLDESC1                                                 02653000
WPLTXTL  EQU   WPLTXT+125                                               02654000
@NM00054 EQU   WPLTXT                                                   02655000
WPLRSV05 EQU   WPLMCSF2                                                 02656000
WPLRSV04 EQU   WPLMCSF2                                                 02657000
WPLMCSFN EQU   WPLMCSF2                                                 02658000
WPLRSV03 EQU   WPLMCSF2                                                 02659000
WPLNOWTP EQU   WPLMCSF2                                                 02660000
WPLMCSFK EQU   WPLMCSF2                                                 02661000
WPLMCSFJ EQU   WPLMCSF2                                                 02662000
WPLMCSFI EQU   WPLMCSF2                                                 02663000
WPLMCSFH EQU   WPLMCSF1                                                 02664000
WPLMCSFG EQU   WPLMCSF1                                                 02665000
WPLMCSFF EQU   WPLMCSF1                                                 02666000
WPLMCSFE EQU   WPLMCSF1                                                 02667000
WPLMCSFD EQU   WPLMCSF1                                                 02668000
WPLMCSFC EQU   WPLMCSF1                                                 02669000
WPLMCSFB EQU   WPLMCSF1                                                 02670000
WPLMCSFA EQU   WPLMCSF1                                                 02671000
WPLRECB  EQU   WPLRF+4                                                  02672000
WPLRPTRA EQU   WPLRPTR+1                                                02673000
WPLRLN   EQU   WPLRPTR                                                  02674000
XAARNG16 EQU   XAAVRNG2                                                 02675000
XAARNG15 EQU   XAAVRNG2                                                 02676000
XAARNG14 EQU   XAAVRNG2                                                 02677000
XAARNG13 EQU   XAAVRNG2                                                 02678000
XAARNG12 EQU   XAAVRNG2                                                 02679000
XAARNG11 EQU   XAAVRNG2                                                 02680000
XAARNG10 EQU   XAAVRNG2                                                 02681000
XAARNG9  EQU   XAAVRNG2                                                 02682000
XAARNG8  EQU   XAAVRANG                                                 02683000
XAARNG7  EQU   XAAVRANG                                                 02684000
XAARNG6  EQU   XAAVRANG                                                 02685000
XAARNG5  EQU   XAAVRANG                                                 02686000
XAARNG4  EQU   XAAVRANG                                                 02687000
XAARNG3  EQU   XAAVRANG                                                 02688000
XAARNG2  EQU   XAAVRANG                                                 02689000
XAARNG1  EQU   XAAVRANG                                                 02690000
XARTCODE EQU   EEXSAS05+6                                               02691000
XACMDATH EQU   EEXSAS05+4                                               02692000
XALTPTR  EQU   EEXSAS05+3                                               02693000
XACRT2   EQU   XARESV                                                   02694000
XACENDCK EQU   XARESV                                                   02695000
XARES1   EQU   XASWITCH                                                 02696000
XASMF44  EQU   XASWITCH                                                 02697000
XASMF42  EQU   XASWITCH                                                 02698000
XAHRDREQ EQU   XASWITCH                                                 02699000
XASTHDCP EQU   XACOMPMS                                                 02700000
XAINHDCP EQU   XALTCHG                                                  02701000
XAHRDCMD EQU   XASWITCH                                                 02702000
XAROUT   EQU   XASWITCH                                                 02703000
XALTCON  EQU   XASOPCOD                                                 02704000
XACMD    EQU   XASOPCOD                                                 02705000
XALTCOM  EQU   XASOPCOD                                                 02706000
XARESB   EQU   XASOPCOD                                                 02707000
XAOFF    EQU   XASOPCOD                                                 02708000
XAON     EQU   XASOPCOD                                                 02709000
XARESA   EQU   XASOPCOD                                                 02710000
XACON    EQU   XASOPCOD                                                 02711000
XAXSACB  EQU   EEXSAS04+4                                               02712000
XAXUTME  EQU   EEXSAS04+2                                               02713000
XAXFREE  EQU   EEXSAS04+1                                               02714000
@NM00053 EQU   XAXMASK                                                  02715000
XAXTSL   EQU   XAXMASK                                                  02716000
XAXTS    EQU   XAXMASK                                                  02717000
@NM00052 EQU   XAXMASK                                                  02718000
XAXJOBSL EQU   XAXMASK                                                  02719000
XAXJOBS  EQU   XAXMASK                                                  02720000
XASOPTR  EQU   @NM00051+1                                               02721000
XASTSAVE EQU   @NM00051                                                 02722000
XASPLS3  EQU   EEXSAS03+3                                               02723000
XASSDS8  EQU   XASDS                                                    02724000
XASSDS7  EQU   XASDS                                                    02725000
XASSDS6  EQU   XASDS                                                    02726000
XASSDS5  EQU   XASDS                                                    02727000
XASSDS4  EQU   XASDS                                                    02728000
XASSDS3  EQU   XASDS                                                    02729000
XASSDS2  EQU   XASDS                                                    02730000
XASSDS1  EQU   XASDS                                                    02731000
XASDID   EQU   EEXSAS03+1                                               02732000
XASCID   EQU   EEXSAS03                                                 02733000
XACAHOLD EQU   EEXSAS02+2                                               02734000
XADRES1  EQU   EEXSAS02+1                                               02735000
XAUBLANK EQU   XADUSWIT                                                 02736000
XAOUNIT  EQU   XADUSWIT                                                 02737000
XAIOCOMP EQU   XADUSWIT                                                 02738000
XARES3   EQU   XADUSWIT                                                 02739000
XAUDVC   EQU   XADUSWIT                                                 02740000
XARES2   EQU   XADUSWIT                                                 02741000
XAIPAREN EQU   XADUSWIT                                                 02742000
XAXPAREN EQU   XADUSWIT                                                 02743000
@NM00050 EQU   EEXSAS01+44                                              02744000
XAT      EQU   EEXSAS01+20                                              02745000
XAF      EQU   EEXSAS01+12                                              02746000
XAI      EQU   EEXSAS01+4                                               02747000
XAH      EQU   EEXSAS01                                                 02748000
XAWORKH  EQU   XAWORK+28                                                02749000
XAWORKG  EQU   XAWORK+24                                                02750000
XAWORKF  EQU   XAWORK+20                                                02751000
XAWORKE  EQU   XAWORK+16                                                02752000
XAWORKD  EQU   XAWORK+12                                                02753000
XAWORKC  EQU   XAWORK+8                                                 02754000
XAWORKB  EQU   XAWORK+4                                                 02755000
XAWORKA  EQU   XAWORK                                                   02756000
XARESRZ  EQU   @NM00049+12                                              02757000
XARESRY  EQU   @NM00049+8                                               02758000
XARESRX  EQU   @NM00049+4                                               02759000
XACMFLG4 EQU   XACMFLGB+1                                               02760000
XACMFLG3 EQU   XACMFLGB                                                 02761000
XACMF28  EQU   XACMFLG2                                                 02762000
XACMF27  EQU   XACMFLG2                                                 02763000
XACMF26  EQU   XACMFLG2                                                 02764000
XACMF25  EQU   XACMFLG2                                                 02765000
XACMF24  EQU   XACMFLG2                                                 02766000
XACMF23  EQU   XACMFLG2                                                 02767000
XACMF22  EQU   XACMFLG2                                                 02768000
XACMF21  EQU   XACMFLG2                                                 02769000
XACMF18  EQU   XACMFLG1                                                 02770000
XACMF17  EQU   XACMFLG1                                                 02771000
XACMF16  EQU   XACMFLG1                                                 02772000
XACMF15  EQU   XACMFLG1                                                 02773000
XACMF14  EQU   XACMFLG1                                                 02774000
XACMF13  EQU   XACMFLG1                                                 02775000
XACMF12  EQU   XACMFLG1                                                 02776000
XACMF11  EQU   XACMFLG1                                                 02777000
XASAVSDR EQU   XASAVSTR+68                                              02778000
XASAVSDQ EQU   XASAVSTR+64                                              02779000
XASAVSDP EQU   XASAVSTR+60                                              02780000
XASAVSDO EQU   XASAVSTR+56                                              02781000
XASAVSDN EQU   XASAVSTR+52                                              02782000
XASAVSDM EQU   XASAVSTR+48                                              02783000
XASAVSDL EQU   XASAVSTR+44                                              02784000
XASAVSDK EQU   XASAVSTR+40                                              02785000
XASAVSDJ EQU   XASAVSTR+36                                              02786000
XASAVSDI EQU   XASAVSTR+32                                              02787000
XASAVSDH EQU   XASAVSTR+28                                              02788000
XASAVSDG EQU   XASAVSTR+24                                              02789000
XASAVSDF EQU   XASAVSTR+20                                              02790000
XASAVSDE EQU   XASAVSTR+16                                              02791000
XASAVSDD EQU   XASAVSTR+12                                              02792000
XASAVSDC EQU   XASAVSTR+8                                               02793000
XASAVSDB EQU   XASAVSTR+4                                               02794000
XASAVSDA EQU   XASAVSTR                                                 02795000
XASAVLC4 EQU   XASAVLOX+12                                              02796000
XASAVLC3 EQU   XASAVLOX+8                                               02797000
XASAVLC2 EQU   XASAVLOX+4                                               02798000
XASAVLC1 EQU   XASAVLOX                                                 02799000
XAK      EQU   XASVRB+44                                                02800000
@NM00048 EQU   XASVRB+41                                                02801000
XAL      EQU   @NM00047+1                                               02802000
XAN      EQU   @NM00047                                                 02803000
XAR      EQU   @NM00046+1                                               02804000
XAP      EQU   XSA                                                      02805000
RTCTISVC EQU   RTCTSDO4                                                 02806000
RTCTSDOV EQU   RTCTSDMG                                                 02807000
@NM00045 EQU   RTCTSDO4                                                 02808000
@NM00044 EQU   RTCTSDO3                                                 02809000
RTCTSDPH EQU   RTCTSDO3                                                 02810000
RTCTSDPG EQU   RTCTSDO3                                                 02811000
@NM00043 EQU   RTCTSDO2                                                 02812000
RTCTSDPD EQU   RTCTSDO2                                                 02813000
RTCTSDPC EQU   RTCTSDO2                                                 02814000
RTCTSDPB EQU   RTCTSDO2                                                 02815000
RTCTSDPA EQU   RTCTSDO2                                                 02816000
RTCTSDP9 EQU   RTCTSDO2                                                 02817000
RTCTSDP8 EQU   RTCTSDO2                                                 02818000
RTCTSDP7 EQU   RTCTSDO1                                                 02819000
RTCTSDP6 EQU   RTCTSDO1                                                 02820000
RTCTSDP5 EQU   RTCTSDO1                                                 02821000
RTCTSDP4 EQU   RTCTSDO1                                                 02822000
RTCTSDP3 EQU   RTCTSDO1                                                 02823000
RTCTSDP2 EQU   RTCTSDO1                                                 02824000
RTCTSDP1 EQU   RTCTSDO1                                                 02825000
RTCTSDP0 EQU   RTCTSDO1                                                 02826000
RTCTISYM EQU   RTCTSD04                                                 02827000
RTCTSMOV EQU   RTCTSMMG                                                 02828000
@NM00042 EQU   RTCTSD04                                                 02829000
RTCTSD03 EQU   RTCTMSYO+2                                               02830000
RTCTSD02 EQU   RTCTMSYO+1                                               02831000
RTCTSDS7 EQU   RTCTSD01                                                 02832000
RTCTSDS6 EQU   RTCTSD01                                                 02833000
RTCTSDS5 EQU   RTCTSD01                                                 02834000
RTCTSDS4 EQU   RTCTSD01                                                 02835000
RTCTSDS3 EQU   RTCTSD01                                                 02836000
RTCTSDS2 EQU   RTCTSD01                                                 02837000
RTCTSDS1 EQU   RTCTSD01                                                 02838000
RTCTSDS0 EQU   RTCTSD01                                                 02839000
RTCTISYU EQU   RTCTSUO4                                                 02840000
RTCTSUOV EQU   RTCTSUMG                                                 02841000
@NM00041 EQU   RTCTSUO4                                                 02842000
RTCTSYDF EQU   RTCTSUO3                                                 02843000
RTCTSYDE EQU   RTCTSUO3                                                 02844000
RTCTSYDD EQU   RTCTSUO3                                                 02845000
RTCTSYDC EQU   RTCTSUO3                                                 02846000
RTCTSYDB EQU   RTCTSUO3                                                 02847000
RTCTSYDA EQU   RTCTSUO3                                                 02848000
RTCTSYD9 EQU   RTCTSUO3                                                 02849000
RTCTSYD8 EQU   RTCTSUO3                                                 02850000
@NM00040 EQU   RTCTSUO2                                                 02851000
RTCTSYDH EQU   RTCTSUO2                                                 02852000
RTCTSYDG EQU   RTCTSUO2                                                 02853000
RTCTSYD7 EQU   RTCTSUO1                                                 02854000
RTCTSYD6 EQU   RTCTSUO1                                                 02855000
RTCTSYD5 EQU   RTCTSUO1                                                 02856000
RTCTSYD4 EQU   RTCTSUO1                                                 02857000
RTCTSYD3 EQU   RTCTSUO1                                                 02858000
RTCTSYD2 EQU   RTCTSUO1                                                 02859000
RTCTSYD1 EQU   RTCTSUO1                                                 02860000
RTCTSYD0 EQU   RTCTSUO1                                                 02861000
RTCTISAB EQU   RTCTSAO4                                                 02862000
RTCTSAOV EQU   RTCTSAMG                                                 02863000
@NM00039 EQU   RTCTSAO4                                                 02864000
RTCTSADF EQU   RTCTSAO3                                                 02865000
RTCTSADE EQU   RTCTSAO3                                                 02866000
RTCTSADD EQU   RTCTSAO3                                                 02867000
RTCTSADC EQU   RTCTSAO3                                                 02868000
RTCTSADB EQU   RTCTSAO3                                                 02869000
RTCTSADA EQU   RTCTSAO3                                                 02870000
RTCTSAD9 EQU   RTCTSAO3                                                 02871000
RTCTSAD8 EQU   RTCTSAO3                                                 02872000
@NM00038 EQU   RTCTSAO2                                                 02873000
RTCTSADH EQU   RTCTSAO2                                                 02874000
RTCTSADG EQU   RTCTSAO2                                                 02875000
RTCTSAD7 EQU   RTCTSAO1                                                 02876000
RTCTSAD6 EQU   RTCTSAO1                                                 02877000
RTCTSAD5 EQU   RTCTSAO1                                                 02878000
RTCTSAD4 EQU   RTCTSAO1                                                 02879000
RTCTSAD3 EQU   RTCTSAO1                                                 02880000
RTCTSAD2 EQU   RTCTSAO1                                                 02881000
RTCTSAD1 EQU   RTCTSAO1                                                 02882000
RTCTSAD0 EQU   RTCTSAO1                                                 02883000
RTCTZZZ5 EQU   RTCT+340                                                 02884000
RTCTZZZ4 EQU   RTCT+336                                                 02885000
RTCTMRMQ EQU   RTCT+332                                                 02886000
RTCTSDF5 EQU   RTCTSDF3+3                                               02887000
RTCTSDDO EQU   RTCTSDF4                                                 02888000
RTCTSDEN EQU   RTCTSDF4                                                 02889000
RTCTSDEQ EQU   RTCTSDF4                                                 02890000
RTCTSDTR EQU   RTCTSDF4                                                 02891000
RTCTSDRM EQU   RTCTSDF4                                                 02892000
RTCTSDAN EQU   RTCTSDF4                                                 02893000
RTCTSDNC EQU   RTCTSDF4                                                 02894000
RTCTSDSS EQU   RTCTSDF4                                                 02895000
RTCTSDAS EQU   RTCTSDF3                                                 02896000
@NM00037 EQU   RTCTC3PO                                                 02897000
@NM00036 EQU   RTCTR2D2                                                 02898000
RTCTSDFX EQU   RTCTSDF2                                                 02899000
RTCTSDRW EQU   RTCTSDF2                                                 02900000
RTCTSDSL EQU   RTCTSDF2                                                 02901000
RTCTSDWF EQU   RTCTSDF2                                                 02902000
RTCTSDLA EQU   RTCTSDF2                                                 02903000
RTCTSDDI EQU   RTCTSDF2                                                 02904000
RTCTSDTQ EQU   RTCTSDF2                                                 02905000
RTCTSDMR EQU   RTCTSDF2                                                 02906000
RTCTSDSC EQU   RTCTSDF1                                                 02907000
RTCTSDRS EQU   RTCTSDF1                                                 02908000
RTCTSDSD EQU   RTCTSDF1                                                 02909000
RTCTSDEP EQU   RTCTSDF1                                                 02910000
RTCTSDMA EQU   RTCTSDF1                                                 02911000
RTCTSDSH EQU   RTCTSDF1                                                 02912000
RTCTSDND EQU   RTCTSDF1                                                 02913000
RTCTSDNO EQU   RTCTSDF1                                                 02914000
RTCTZZZ2 EQU   RTCT+257                                                 02915000
RTCTSDPR EQU   RTCTSDI+2                                                02916000
RTCTINDX EQU   RTCTSDI+1                                                02917000
RTCTSDNA EQU   RTCTSDI                                                  02918000
@NM00035 EQU   RTCTASO2                                                 02919000
RTCTASNQ EQU   RTCTASO2                                                 02920000
RTCTASNA EQU   RTCTASO2                                                 02921000
RTCTASNS EQU   RTCTASO2                                                 02922000
RTCTASSU EQU   RTCTASO2                                                 02923000
RTCTASSW EQU   RTCTASO2                                                 02924000
RTCTASCS EQU   RTCTASO2                                                 02925000
RTCTASTR EQU   RTCTASO1                                                 02926000
RTCTASLP EQU   RTCTASO1                                                 02927000
RTCTASRG EQU   RTCTASO1                                                 02928000
RTCTASLS EQU   RTCTASO1                                                 02929000
RTCTASSQ EQU   RTCTASO1                                                 02930000
RTCTASNU EQU   RTCTASO1                                                 02931000
RTCTASPS EQU   RTCTASO1                                                 02932000
RTCTASAL EQU   RTCTASO1                                                 02933000
RTCTSDO  EQU   RTCTOPT+12                                               02934000
RTCTSYO  EQU   RTCTOPT+8                                                02935000
RTCTSUO  EQU   RTCTOPT+4                                                02936000
RTCTSAO  EQU   RTCTOPT                                                  02937000
RTCTXXX2 EQU   RTCT+234                                                 02938000
RTCTETIM EQU   RTCTERID+6                                               02939000
RTCTEASD EQU   RTCTERID+4                                               02940000
RTCTECPU EQU   RTCTERID+2                                               02941000
RTCTESEQ EQU   RTCTERID                                                 02942000
RTCTSDWK EQU   RTCT+220                                                 02943000
RTCTTDCB EQU   RTCT+184                                                 02944000
RTCTSDSW EQU   RTCT+180                                                 02945000
RTCTSEQ# EQU   RTCT+178                                                 02946000
RTCTXXX1 EQU   RTCT+177                                                 02947000
@NM00034 EQU   RTCTRFLG                                                 02948000
RTCTRSTF EQU   RTCTRFLG                                                 02949000
RTCTRPER EQU   RTCTRFLG                                                 02950000
RTCTRTER EQU   RTCTRFLG                                                 02951000
RTCTTEST EQU   RTCT+172                                                 02952000
RTCTMSRB EQU   RTCT+168                                                 02953000
RTCTMLCK EQU   RTCT+164                                                 02954000
RTCTFMT  EQU   RTCT+160                                                 02955000
RTCTSDIP EQU   RTCTSDPL                                                 02956000
RTCTDEV  EQU   RTCTSDDS+8                                               02957000
RTCTDCB  EQU   RTCTSDDS+4                                               02958000
@NM00033 EQU   RTCTFLG                                                  02959000
RTCTRCB  EQU   RTCT+32                                                  02960000
RTCTRECB EQU   RTCT+28                                                  02961000
RTCTFASB EQU   RTCT+24                                                  02962000
RTCTMECB EQU   RTCT+20                                                  02963000
RTCTSDID EQU   RTCT+18                                                  02964000
RTCTYYY1 EQU   RTCT+16                                                  02965000
RTCTSY04 EQU   RTCTSYD+3                                                02966000
RTCTSY03 EQU   RTCTSYD+2                                                02967000
RTCTSY02 EQU   RTCTSYD+1                                                02968000
RTCTSYM7 EQU   RTCTSY01                                                 02969000
RTCTSYM6 EQU   RTCTSY01                                                 02970000
RTCTSYM5 EQU   RTCTSY01                                                 02971000
RTCTSYM4 EQU   RTCTSY01                                                 02972000
RTCTSYM3 EQU   RTCTSY01                                                 02973000
RTCTSYM2 EQU   RTCTSY01                                                 02974000
RTCTSYM1 EQU   RTCTSY01                                                 02975000
RTCTSYM0 EQU   RTCTSY01                                                 02976000
RTCTSUP4 EQU   RTCTSUP+3                                                02977000
RTCTSUDF EQU   RTCTSUP3                                                 02978000
RTCTSUDE EQU   RTCTSUP3                                                 02979000
RTCTSUDD EQU   RTCTSUP3                                                 02980000
RTCTSUDC EQU   RTCTSUP3                                                 02981000
RTCTSUDB EQU   RTCTSUP3                                                 02982000
RTCTSUDA EQU   RTCTSUP3                                                 02983000
RTCTSUD9 EQU   RTCTSUP3                                                 02984000
RTCTSUD8 EQU   RTCTSUP3                                                 02985000
@NM00032 EQU   RTCTSUP2                                                 02986000
RTCTSUDH EQU   RTCTSUP2                                                 02987000
RTCTSUDG EQU   RTCTSUP2                                                 02988000
RTCTSUD7 EQU   RTCTSUP1                                                 02989000
RTCTSUD6 EQU   RTCTSUP1                                                 02990000
RTCTSUD5 EQU   RTCTSUP1                                                 02991000
RTCTSUD4 EQU   RTCTSUP1                                                 02992000
RTCTSUD3 EQU   RTCTSUP1                                                 02993000
RTCTSUD2 EQU   RTCTSUP1                                                 02994000
RTCTSUD1 EQU   RTCTSUP1                                                 02995000
RTCTSUD0 EQU   RTCTSUP1                                                 02996000
RTCTSAP4 EQU   RTCTSAP+3                                                02997000
RTCTSABF EQU   RTCTSAP3                                                 02998000
RTCTSABE EQU   RTCTSAP3                                                 02999000
RTCTSABD EQU   RTCTSAP3                                                 03000000
RTCTSABC EQU   RTCTSAP3                                                 03001000
RTCTSABB EQU   RTCTSAP3                                                 03002000
RTCTSABA EQU   RTCTSAP3                                                 03003000
RTCTSAB9 EQU   RTCTSAP3                                                 03004000
RTCTSAB8 EQU   RTCTSAP3                                                 03005000
@NM00031 EQU   RTCTSAP2                                                 03006000
RTCTSABH EQU   RTCTSAP2                                                 03007000
RTCTSABG EQU   RTCTSAP2                                                 03008000
RTCTSAB7 EQU   RTCTSAP1                                                 03009000
RTCTSAB6 EQU   RTCTSAP1                                                 03010000
RTCTSAB5 EQU   RTCTSAP1                                                 03011000
RTCTSAB4 EQU   RTCTSAP1                                                 03012000
RTCTSAB3 EQU   RTCTSAP1                                                 03013000
RTCTSAB2 EQU   RTCTSAP1                                                 03014000
RTCTSAB1 EQU   RTCTSAP1                                                 03015000
RTCTSAB0 EQU   RTCTSAP1                                                 03016000
RTCTNAME EQU   RTCT                                                     03017000
CHSAVWD2 EQU   CHSHORT+100                                              03018000
CHSAVWD1 EQU   CHSHORT+96                                               03019000
CHJSCBVS EQU   CHSHORT+92                                               03020000
CHUSCVS  EQU   CHSHORT+88                                               03021000
@NM00029 EQU   CHSHORT+84                                               03022000
@NM00028 EQU   CHSHORT+80                                               03023000
CHSQA    EQU   CHSHORT+44                                               03024000
CHQPA    EQU   CHSHORT+8                                                03025000
CHJCL    EQU   CHSHORT+4                                                03026000
CHSPC    EQU   CHSHORT                                                  03027000
CHSPB    EQU   CHSTEP+4                                                 03028000
CHTCB    EQU   CHSTEP+1                                                 03029000
CHARSV23 EQU   CHSWT                                                    03030000
CHARSV22 EQU   CHSWT                                                    03031000
CHARSV21 EQU   CHSWT                                                    03032000
CHAC     EQU   CHSWT                                                    03033000
CHPSF    EQU   CHSWT                                                    03034000
CHPSD    EQU   CHSWT                                                    03035000
CHJCT    EQU   CHSWT                                                    03036000
CHARSV20 EQU   CHSWT                                                    03037000
CHCECB   EQU   CHASM+20                                                 03038000
CHECB    EQU   CHASM+16                                                 03039000
CHRGNAD  EQU   CHASM+12                                                 03040000
CHARSV18 EQU   CHRGNSZ+1                                                03041000
CHRPRTY  EQU   CHRGNSZ                                                  03042000
@NM00027 EQU   CHCIBP                                                   03043000
CHEND    EQU   CHCIBP                                                   03044000
CHECBP   EQU   CHASM                                                    03045000
CHDER    EQU   CHPROCSN+4                                               03046000
CHARSV10 EQU   CHACT1                                                   03047000
CHARSV09 EQU   CHACT1                                                   03048000
CHARSV08 EQU   CHACT1                                                   03049000
CHARSV07 EQU   CHACT1                                                   03050000
CHARSV06 EQU   CHACT1                                                   03051000
CHARSV05 EQU   CHACT1                                                   03052000
CHMODIFY EQU   CHACT1                                                   03053000
CHRDWTR  EQU   CHACT1                                                   03054000
CHARSV30 EQU   CHPROCSN+2                                               03055000
CHQID    EQU   CHPROCSN                                                 03056000
CHASID   EQU   CHTJID                                                   03057000
CHTRKID  EQU   CHPKE                                                    03058000
CHCIBCTR EQU   CHAIN+27                                                 03059000
CHUNIT   EQU   CHAIN+24                                                 03060000
CHCLS    EQU   CHAIN+16                                                 03061000
CHPCOI   EQU   CHPARM                                                   03062000
CHAFORCE EQU   CHIFY                                                    03063000
CHAIFX   EQU   CHACT                                                    03064000
CHCLD    EQU   CHACT                                                    03065000
CHCL     EQU   CHACT                                                    03066000
CHDSI    EQU   CHACT                                                    03067000
CHDISC   EQU   CHACT                                                    03068000
CHTERM   EQU   CHACT                                                    03069000
CHSWAP   EQU   CHACT                                                    03070000
CHABTERM EQU   CHSTS                                                    03071000
CHDL     EQU   CHSTS                                                    03072000
CHAD     EQU   CHSTS                                                    03073000
CHQSPC   EQU   CHSTS                                                    03074000
CHSOUT   EQU   CHSTS                                                    03075000
CHSYS    EQU   CHSTS                                                    03076000
CHAP     EQU   CHSTS                                                    03077000
CHSZE    EQU   CHFLG+1                                                  03078000
CHVCD    EQU   CHFLG                                                    03079000
CHPTR    EQU   CHAIN                                                    03080000
CVTLEVL  EQU   CVTRELNO+2                                               03081000
CVTNUMB  EQU   CVTRELNO                                                 03082000
CVTMDL   EQU   CVTFIX+250                                               03083000
@NM00002 EQU   CVTFIX+248                                               03084000
@NM00001 EQU   CVTFIX                                                   03085000
CVTRV482 EQU   CVTXTNT2+128                                             03086000
CVTRV481 EQU   CVTXTNT2+124                                             03087000
CVTRV480 EQU   CVTXTNT2+120                                             03088000
CVTRV479 EQU   CVTXTNT2+118                                             03089000
CVTRV478 EQU   CVTXTNT2+117                                             03090000
CVTRV477 EQU   CVTXTNT2+116                                             03091000
CVTRV476 EQU   CVTXTNT2+115                                             03092000
CVTRV475 EQU   CVTXTNT2+114                                             03093000
CVTRV474 EQU   CVTRV466                                                 03094000
CVTRV473 EQU   CVTRV466                                                 03095000
CVTRV472 EQU   CVTRV466                                                 03096000
CVTRV471 EQU   CVTRV466                                                 03097000
CVTRV470 EQU   CVTRV466                                                 03098000
CVTRV469 EQU   CVTRV466                                                 03099000
CVTRV468 EQU   CVTRV466                                                 03100000
CVTRV467 EQU   CVTRV466                                                 03101000
CVTRV465 EQU   CVTRV457                                                 03102000
CVTRV464 EQU   CVTRV457                                                 03103000
CVTRV463 EQU   CVTRV457                                                 03104000
CVTRV462 EQU   CVTRV457                                                 03105000
CVTRV461 EQU   CVTRV457                                                 03106000
CVTRV460 EQU   CVTRV457                                                 03107000
CVTRV459 EQU   CVTRV457                                                 03108000
CVTRV458 EQU   CVTRV457                                                 03109000
CVTRV456 EQU   CVTXTNT2+108                                             03110000
CVTRV455 EQU   CVTXTNT2+104                                             03111000
CVTRV454 EQU   CVTXTNT2+100                                             03112000
CVTRV453 EQU   CVTXTNT2+96                                              03113000
CVTRV452 EQU   CVTXTNT2+94                                              03114000
CVTRV451 EQU   CVTXTNT2+92                                              03115000
CVTRV450 EQU   CVTXTNT2+90                                              03116000
CVTRV449 EQU   CVTXTNT2+88                                              03117000
CVTRV448 EQU   CVTXTNT2+87                                              03118000
CVTRV447 EQU   CVTXTNT2+86                                              03119000
CVTRV446 EQU   CVTRV438                                                 03120000
CVTRV445 EQU   CVTRV438                                                 03121000
CVTRV444 EQU   CVTRV438                                                 03122000
CVTRV443 EQU   CVTRV438                                                 03123000
CVTRV442 EQU   CVTRV438                                                 03124000
CVTRV441 EQU   CVTRV438                                                 03125000
CVTRV440 EQU   CVTRV438                                                 03126000
CVTRV439 EQU   CVTRV438                                                 03127000
CVTRV437 EQU   CVTRV429                                                 03128000
CVTRV436 EQU   CVTRV429                                                 03129000
CVTRV435 EQU   CVTRV429                                                 03130000
CVTRV434 EQU   CVTRV429                                                 03131000
CVTRV433 EQU   CVTRV429                                                 03132000
CVTRV432 EQU   CVTRV429                                                 03133000
CVTRV431 EQU   CVTRV429                                                 03134000
CVTRV430 EQU   CVTRV429                                                 03135000
CVTRV428 EQU   CVTXTNT2+80                                              03136000
CVTRV427 EQU   CVTXTNT2+76                                              03137000
CVTRV426 EQU   CVTXTNT2+72                                              03138000
CVTRV425 EQU   CVTXTNT2+68                                              03139000
CVTATACT EQU   CVTATCVT                                                 03140000
CVTRV423 EQU   CVTXTNT2+62                                              03141000
CVTRV422 EQU   CVTXTNT2+60                                              03142000
CVTRV421 EQU   CVTXTNT2+58                                              03143000
CVTRV420 EQU   CVTXTNT2+56                                              03144000
CVTRV419 EQU   CVTXTNT2+55                                              03145000
CVTRV418 EQU   CVTXTNT2+54                                              03146000
CVTRV417 EQU   CVTRV409                                                 03147000
CVTRV416 EQU   CVTRV409                                                 03148000
CVTRV415 EQU   CVTRV409                                                 03149000
CVTRV414 EQU   CVTRV409                                                 03150000
CVTRV413 EQU   CVTRV409                                                 03151000
CVTRV412 EQU   CVTRV409                                                 03152000
CVTRV411 EQU   CVTRV409                                                 03153000
CVTRV410 EQU   CVTRV409                                                 03154000
CVTRV408 EQU   CVTRV400                                                 03155000
CVTRV407 EQU   CVTRV400                                                 03156000
CVTRV406 EQU   CVTRV400                                                 03157000
CVTRV405 EQU   CVTRV400                                                 03158000
CVTRV404 EQU   CVTRV400                                                 03159000
CVTRV403 EQU   CVTRV400                                                 03160000
CVTRV402 EQU   CVTRV400                                                 03161000
CVTRV401 EQU   CVTRV400                                                 03162000
CVTICB   EQU   CVTXTNT2+48                                              03163000
CVTSKTA  EQU   CVTXTNT2+44                                              03164000
CVTCCVT  EQU   CVTXTNT2+40                                              03165000
CVTRSV98 EQU   CVTXTNT2+36                                              03166000
CVTRSV97 EQU   CVTXTNT2+34                                              03167000
CVTRSV96 EQU   CVTXTNT2+32                                              03168000
CVTOLTEP EQU   CVTXTNT2+28                                              03169000
CVTQIDA  EQU   CVTQID+1                                                 03170000
CVTRSV95 EQU   CVTQID                                                   03171000
CVTRSV94 EQU   CVTXTNT2+20                                              03172000
CVTRSV93 EQU   CVTXTNT2+16                                              03173000
CVTRSV92 EQU   CVTXTNT2+12                                              03174000
CVTDEBVR EQU   CVTXTNT2+8                                               03175000
CVTRSV91 EQU   CVTXTNT2+6                                               03176000
CVTRSV9H EQU   CVTFLGBT                                                 03177000
CVTRSV9G EQU   CVTFLGBT                                                 03178000
CVTRSV9F EQU   CVTFLGBT                                                 03179000
CVTRSV9E EQU   CVTFLGBT                                                 03180000
CVTRSV9D EQU   CVTFLGBT                                                 03181000
CVTBAH   EQU   CVTFLGBT                                                 03182000
CVTVME   EQU   CVTFLGBT                                                 03183000
CVTNPE   EQU   CVTFLGBT                                                 03184000
CVTNUCLS EQU   CVTXTNT2+4                                               03185000
CVTDSSVA EQU   CVTDSSV+1                                                03186000
CVTRSV89 EQU   CVTDSSV                                                  03187000
CVTRSV88 EQU   CVTXTNT1+8                                               03188000
CVTRSV87 EQU   CVTXTNT1+4                                               03189000
CVTFACHN EQU   CVTXTNT1                                                 03190000
CVTRV488 EQU   CVTMAP+412                                               03191000
CVTRV487 EQU   CVTMAP+408                                               03192000
CVTRV486 EQU   CVTMAP+404                                               03193000
CVTRV485 EQU   CVTMAP+400                                               03194000
CVTACTAP EQU   CVTMAP+396                                               03195000
CVTAUTH  EQU   CVTMAP+392                                               03196000
CVTRV490 EQU   CVTMAP+388                                               03197000
CVTSU    EQU   CVTMAP+384                                               03198000
CVTVOLT1 EQU   CVTVOLM1+1                                               03199000
CVTVOLI1 EQU   CVTVOLF1                                                 03200000
CVTSTOA  EQU   CVTMAP+376                                               03201000
CVTRSV58 EQU   CVTMAP+374                                               03202000
CVTRSV57 EQU   CVTMAP+372                                               03203000
CVTDDCE  EQU   CVTMAP+368                                               03204000
CVTPNWFR EQU   CVTMAP+364                                               03205000
CVTSMF   EQU   CVTMAP+360                                               03206000
CVTSULK  EQU   CVTMAP+358                                               03207000
CVTSLKO  EQU   CVTSYSK                                                  03208000
CVTSLKP  EQU   CVTSYSK                                                  03209000
CVTSLKQ  EQU   CVTSYSK                                                  03210000
CVTSLKR  EQU   CVTSYSK                                                  03211000
CVTRSV56 EQU   CVTSYSK                                                  03212000
CVTRSV55 EQU   CVTSYSK                                                  03213000
CVTRSV54 EQU   CVTSYSK                                                  03214000
CVTRSV53 EQU   CVTSYSK                                                  03215000
CVTRSV52 EQU   CVTA1F1                                                  03216000
CVTRSV51 EQU   CVTA1F1                                                  03217000
CVTRSV50 EQU   CVTA1F1                                                  03218000
CVTRSV49 EQU   CVTA1F1                                                  03219000
CVTRSV48 EQU   CVTA1F1                                                  03220000
CVTRSV47 EQU   CVTA1F1                                                  03221000
CVTSRSW  EQU   CVTA1F1                                                  03222000
CVTPFSW  EQU   CVTA1F1                                                  03223000
CVTPCVT  EQU   CVTMAP+352                                               03224000
CVTRSV46 EQU   CVTMAP+344                                               03225000
CVTRSV45 EQU   CVTMAP+340                                               03226000
CVTRSV44 EQU   CVTMAP+338                                               03227000
CVTRSV43 EQU   CVTMAP+336                                               03228000
CVTHJESA EQU   CVTHJES+1                                                03229000
CVTRSV42 EQU   CVTHJES                                                  03230000
CVTEXT2A EQU   CVTEXT2+1                                                03231000
CVTRSV41 EQU   CVTEXT2                                                  03232000
CVTAPFA  EQU   CVTAPF+1                                                 03233000
CVTRSV40 EQU   CVTAPF                                                   03234000
CVTRV518 EQU   CVTINTLA                                                 03235000
CVTRV517 EQU   CVTERPV                                                  03236000
CVTEORM  EQU   CVTMAP+312                                               03237000
CVTMCHPR EQU   CVTMAP+308                                               03238000
CVTTZ    EQU   CVTMAP+304                                               03239000
CVTJEPS  EQU   CVTMAP+300                                               03240000
CVTJESCT EQU   CVTMAP+296                                               03241000
CVTMODE  EQU   CVTMAP+292                                               03242000
CVTPTRV  EQU   CVTMAP+288                                               03243000
CVTREAL  EQU   CVTMAP+284                                               03244000
CVTRSV39 EQU   CVTMAP+280                                               03245000
CVTRSV38 EQU   CVTMAP+276                                               03246000
CVTDMSRA EQU   CVTDMSR+1                                                03247000
CVTRV634 EQU   CVTDMSRF                                                 03248000
CVTRV633 EQU   CVTDMSRF                                                 03249000
CVTRV632 EQU   CVTDMSRF                                                 03250000
CVTRV631 EQU   CVTDMSRF                                                 03251000
CVTRV630 EQU   CVTDMSRF                                                 03252000
CVTRV629 EQU   CVTDMSRF                                                 03253000
CVTUDUMP EQU   CVTDMSRF                                                 03254000
CVTSDUMP EQU   CVTDMSRF                                                 03255000
CVTQMSGA EQU   CVTQMSG+1                                                03256000
CVTRSV36 EQU   CVTQMSG                                                  03257000
CVTAMFF  EQU   CVTMAP+264                                               03258000
CVTPURGA EQU   CVTPURG+1                                                03259000
CVTRSV35 EQU   CVTPURG                                                  03260000
CVTCBSP  EQU   CVTMAP+256                                               03261000
CVTATERA EQU   CVTATER+1                                                03262000
CVTSYST  EQU   CVTATER                                                  03263000
CVTVOLT2 EQU   CVTTAT                                                   03264000
CVTVOLI2 EQU   CVTVOLF2                                                 03265000
CVTAQAVB EQU   CVTAQAVT+1                                               03266000
CVTRSV34 EQU   CVTTCMFG                                                 03267000
CVTRSV33 EQU   CVTTCMFG                                                 03268000
CVTRSV32 EQU   CVTTCMFG                                                 03269000
CVTRSV31 EQU   CVTTCMFG                                                 03270000
CVTRSV30 EQU   CVTTCMFG                                                 03271000
CVTRSV29 EQU   CVTTCMFG                                                 03272000
CVTLDEV  EQU   CVTTCMFG                                                 03273000
CVTTCRDY EQU   CVTTCMFG                                                 03274000
CVTGTFA  EQU   CVTGTF+1                                                 03275000
CVTRSV27 EQU   CVTGTFST                                                 03276000
CVTRNIO  EQU   CVTGTFST                                                 03277000
CVTUSR   EQU   CVTGTFST                                                 03278000
CVTRV318 EQU   CVTFORM                                                  03279000
CVTRV317 EQU   CVTTMODE                                                 03280000
CVTRV316 EQU   CVTSTATE                                                 03281000
CVTRV315 EQU   CVTGTFS                                                  03282000
CVTGTFAV EQU   CVTGTFS                                                  03283000
CVT0SCR1 EQU   CVTMAP+232                                               03284000
CVTRV515 EQU   CVTMAP+228                                               03285000
CVTRMS   EQU   CVTMAP+224                                               03286000
CVTPATCH EQU   CVTMAP+220                                               03287000
CVTTSCE  EQU   CVTMAP+216                                               03288000
CVTLNKSC EQU   CVTMAP+214                                               03289000
CVTQABST EQU   CVTMAP+212                                               03290000
CVTMDLDS EQU   CVTMAP+208                                               03291000
CVTUSER  EQU   CVTMAP+204                                               03292000
CVTABEND EQU   CVTMAP+200                                               03293000
CVTSMCA  EQU   CVTMAP+196                                               03294000
CVTRSV18 EQU   CVTMAP+192                                               03295000
CVTQLPAQ EQU   CVTMAP+188                                               03296000
CVTQCDSR EQU   CVTMAP+184                                               03297000
CVTVS1B  EQU   CVTOPTB                                                  03298000
CVTVS1A  EQU   CVTOPTB                                                  03299000
CVTFP    EQU   CVTOPTB                                                  03300000
CVTAPTHR EQU   CVTOPTB                                                  03301000
CVTNLOG  EQU   CVTOPTB                                                  03302000
CVTTOD   EQU   CVTOPTB                                                  03303000
CVTCTIMS EQU   CVTOPTB                                                  03304000
CVTPROT  EQU   CVTOPTB                                                  03305000
CVTXPFP  EQU   CVTOPTA                                                  03306000
CVTASCII EQU   CVTOPTA                                                  03307000
CVTRSV13 EQU   CVTOPTA                                                  03308000
CVTRSV12 EQU   CVTOPTA                                                  03309000
CVTNIP   EQU   CVTOPTA                                                  03310000
CVTDDR   EQU   CVTOPTA                                                  03311000
CVTAPR   EQU   CVTOPTA                                                  03312000
CVTCCH   EQU   CVTOPTA                                                  03313000
CVTSNCTR EQU   CVTMAP+180                                               03314000
CVTQMWR  EQU   CVTMAP+176                                               03315000
CVTQOCR  EQU   CVTMAP+172                                               03316000
CVT1EF00 EQU   CVTMAP+168                                               03317000
CVTMZ00  EQU   CVTMAP+164                                               03318000
CVTSV76Q EQU   CVTSV76C                                                 03319000
CVTRSV11 EQU   CVTMAP+156                                               03320000
CVT0PT01 EQU   CVTMAP+152                                               03321000
CVTMSER  EQU   CVTMAP+148                                               03322000
CVTRV516 EQU   CVTIERLC                                                 03323000
CVTILCH  EQU   CVTMAP+140                                               03324000
CVT0DS   EQU   CVTMAP+136                                               03325000
CVTFBOSV EQU   CVTMAP+132                                               03326000
CVTNUCB  EQU   CVTMAP+128                                               03327000
CVTIXAVL EQU   CVTMAP+124                                               03328000
CVTSV76M EQU   CVTIOQET                                                 03329000
CVTDCBA  EQU   CVTMAP+117                                               03330000
CVTMVS2  EQU   CVTDCB                                                   03331000
CVT6DAT  EQU   CVTDCB                                                   03332000
CVT4MPS  EQU   CVTDCB                                                   03333000
CVTRSV09 EQU   CVTDCB                                                   03334000
CVT4MS1  EQU   CVTDCB                                                   03335000
CVT2SPS  EQU   CVTDCB                                                   03336000
CVT1SSS  EQU   CVTDCB                                                   03337000
CVTRSV08 EQU   CVTDCB                                                   03338000
CVTSTB   EQU   CVTMAP+112                                               03339000
CVTQTD00 EQU   CVTMAP+108                                               03340000
CVTQTE00 EQU   CVTMAP+104                                               03341000
CVTCUCB  EQU   CVTMAP+100                                               03342000
CVTSJQ   EQU   CVTMAP+96                                                03343000
CVTPBLDL EQU   CVTMAP+92                                                03344000
CVTTPC   EQU   CVTMAP+88                                                03345000
CVTSVDCB EQU   CVTMAP+84                                                03346000
CVTBRET  EQU   CVTMAP+82                                                03347000
CVTEXIT  EQU   CVTMAP+80                                                03348000
CVT0FN00 EQU   CVTMAP+76                                                03349000
CVTDARA  EQU   CVTDAR+1                                                 03350000
CVTRSV07 EQU   CVTFLGS1                                                 03351000
CVTRSV06 EQU   CVTFLGS1                                                 03352000
CVTRSV05 EQU   CVTFLGS1                                                 03353000
CVTRSV04 EQU   CVTFLGS1                                                 03354000
CVTRSV03 EQU   CVTFLGS1                                                 03355000
CVTRSV02 EQU   CVTFLGS1                                                 03356000
CVTRSV01 EQU   CVTFLGS1                                                 03357000
CVTDMPLK EQU   CVTFLGS1                                                 03358000
CVTXITP  EQU   CVTMAP+68                                                03359000
CVTZDTAB EQU   CVTMAP+64                                                03360000
CVTMSLT  EQU   CVTMAP+60                                                03361000
CVTDATE  EQU   CVTMAP+56                                                03362000
CVTBTERM EQU   CVTMAP+52                                                03363000
CVTSYSAD EQU   CVTMAP+48                                                03364000
CVTXTLER EQU   CVTMAP+44                                                03365000
CVTILK2  EQU   CVTMAP+40                                                03366000
CVTILK1  EQU   CVTMAP+36                                                03367000
CVTPRLTV EQU   CVTMAP+32                                                03368000
CVTPCNVT EQU   CVTMAP+28                                                03369000
CVT0VL00 EQU   CVTMAP+24                                                03370000
CVTXAPG  EQU   CVTMAP+20                                                03371000
CVTBUF   EQU   CVTMAP+16                                                03372000
CVTJOB   EQU   CVTMAP+12                                                03373000
CVTLINK  EQU   CVTMAP+8                                                 03374000
CVT0EF00 EQU   CVTMAP+4                                                 03375000
CVTTCBP  EQU   CVTMAP                                                   03376000
CVT      EQU   CVTMAP                                                   03377000
S99TUPRM EQU   S99TUFLD+2                                               03378000
S99TULEN EQU   S99TUFLD                                                 03379000
S99TUPAR EQU   S99TUENT+2                                               03380000
S99TULNG EQU   S99TUENT                                                 03381000
S99TUNUM EQU   S99TUNIT+2                                               03382000
S99TUKEY EQU   S99TUNIT                                                 03383000
S99TUPND EQU   S99TUP                                                   03384000
S99TUPLN EQU   S99TUPTR                                                 03385000
@NM00026 EQU   PSA+3668                                                 03386000
PSASTAK  EQU   PSA+3072                                                 03387000
@NM00025 EQU   PSA+1048                                                 03388000
PSAUSEND EQU   PSA+1048                                                 03389000
PSARV062 EQU   PSA+1044                                                 03390000
PSACDAL  EQU   PSA+1040                                                 03391000
PSAWTCOD EQU   PSA+1036                                                 03392000
PSAATCVT EQU   PSA+1032                                                 03393000
PSAPCPSW EQU   PSA+1024                                                 03394000
PSAPIR2  EQU   PSA+1020                                                 03395000
PSARV059 EQU   PSA+1018                                                 03396000
PSASVC13 EQU   PSA+1016                                                 03397000
PSALSFCC EQU   PSA+1012                                                 03398000
PSASFACC EQU   PSA+1008                                                 03399000
PSASTOP  EQU   PSA+992                                                  03400000
PSASTART EQU   PSA+976                                                  03401000
PSARSPSW EQU   PSA+968                                                  03402000
PSASRPSW EQU   PSA+960                                                  03403000
PSARV045 EQU   PSA+892                                                  03404000
PSARV044 EQU   PSA+888                                                  03405000
PSARV043 EQU   PSA+884                                                  03406000
PSARV042 EQU   PSA+880                                                  03407000
PSARV041 EQU   PSA+876                                                  03408000
PSARV040 EQU   PSA+872                                                  03409000
PSARV025 EQU   PSA+868                                                  03410000
PSADSSED EQU   PSA+868                                                  03411000
PSADSSPR EQU   PSA+864                                                  03412000
PSADSSFW EQU   PSA+860                                                  03413000
PSADSS14 EQU   PSA+856                                                  03414000
PSADSSPP EQU   PSA+848                                                  03415000
PSADSSRP EQU   PSA+840                                                  03416000
PSADSS05 EQU   PSADSSF4                                                 03417000
PSADSS10 EQU   PSADSSF4                                                 03418000
PSADSSVE EQU   PSADSSF4                                                 03419000
PSADSSDE EQU   PSADSSF4                                                 03420000
PSADSSC0 EQU   PSADSSF4                                                 03421000
PSADSSIE EQU   PSADSSF4                                                 03422000
PSADSS12 EQU   PSADSSF4                                                 03423000
PSADSSRC EQU   PSADSSF4                                                 03424000
PSARV057 EQU   PSADSSF3                                                 03425000
PSARV056 EQU   PSADSSF3                                                 03426000
PSARV055 EQU   PSADSSF3                                                 03427000
PSADSSMC EQU   PSADSSF3                                                 03428000
PSADSSRW EQU   PSADSSF3                                                 03429000
PSADSSNM EQU   PSADSSF3                                                 03430000
PSADSSES EQU   PSADSSF3                                                 03431000
PSADSSGP EQU   PSADSSF3                                                 03432000
PSADSSF2 EQU   PSADSSFL+1                                               03433000
PSADSSPI EQU   PSADSSF1                                                 03434000
PSADSSOI EQU   PSADSSF1                                                 03435000
PSADSSSP EQU   PSADSSF1                                                 03436000
PSADSSTP EQU   PSADSSF1                                                 03437000
PSADSSDW EQU   PSADSSF1                                                 03438000
PSADSSDD EQU   PSADSSF1                                                 03439000
PSADSSDM EQU   PSADSSF1                                                 03440000
PSADSSMV EQU   PSADSSF1                                                 03441000
PSADSSTS EQU   PSA+816                                                  03442000
PSADSSWK EQU   PSA+812                                                  03443000
PSADSSR3 EQU   PSA+808                                                  03444000
PSADSSR2 EQU   PSA+804                                                  03445000
PSADSSRS EQU   PSA+800                                                  03446000
PSASTOR  EQU   PSA+796                                                  03447000
PSACPUSA EQU   PSA+794                                                  03448000
PSAVSTAP EQU   PSA+792                                                  03449000
PSAWKVAP EQU   PSA+788                                                  03450000
PSAWKRAP EQU   PSA+784                                                  03451000
PSAMCHIC EQU   PSA+783                                                  03452000
PSARV061 EQU   PSA+782                                                  03453000
PSASYMSK EQU   PSA+781                                                  03454000
PSAMCHFL EQU   PSA+780                                                  03455000
PSACR0   EQU   PSA+776                                                  03456000
PSAPSWSV EQU   PSA+768                                                  03457000
PSALITA  EQU   PSA+764                                                  03458000
PSACLHS  EQU   PSAHLHI                                                  03459000
PSALKR15 EQU   PSALKSA+60                                               03460000
PSALKR14 EQU   PSALKSA+56                                               03461000
PSALKR13 EQU   PSALKSA+52                                               03462000
PSALKR12 EQU   PSALKSA+48                                               03463000
PSALKR11 EQU   PSALKSA+44                                               03464000
PSALKR10 EQU   PSALKSA+40                                               03465000
PSALKR9  EQU   PSALKSA+36                                               03466000
PSALKR8  EQU   PSALKSA+32                                               03467000
PSALKR7  EQU   PSALKSA+28                                               03468000
PSALKR6  EQU   PSALKSA+24                                               03469000
PSALKR5  EQU   PSALKSA+20                                               03470000
PSALKR4  EQU   PSALKSA+16                                               03471000
PSALKR3  EQU   PSALKSA+12                                               03472000
PSALKR2  EQU   PSALKSA+8                                                03473000
PSALKR1  EQU   PSALKSA+4                                                03474000
PSALKR0  EQU   PSALKSA                                                  03475000
PSARV023 EQU   PSACLHT+52                                               03476000
PSALOCAL EQU   PSACLHT+48                                               03477000
PSACMSL  EQU   PSACLHT+44                                               03478000
PSAOPTL  EQU   PSACLHT+40                                               03479000
PSATPACL EQU   PSACLHT+36                                               03480000
PSATPDNL EQU   PSACLHT+32                                               03481000
PSATPNCL EQU   PSACLHT+28                                               03482000
PSAIOSLL EQU   PSACLHT+24                                               03483000
PSAIOSUL EQU   PSACLHT+20                                               03484000
PSAIOSCL EQU   PSACLHT+16                                               03485000
PSAIOSSL EQU   PSACLHT+12                                               03486000
PSASALCL EQU   PSACLHT+8                                                03487000
PSAASML  EQU   PSACLHT+4                                                03488000
PSADISPL EQU   PSACLHT                                                  03489000
PSASRSA  EQU   PSA+636                                                  03490000
PSARV050 EQU   PSA+634                                                  03491000
PSADSSGO EQU   PSA+633                                                  03492000
PSARECUR EQU   PSA+632                                                  03493000
PSAHLHIS EQU   PSA+628                                                  03494000
PSAIPCSA EQU   PSA+624                                                  03495000
@NM00024 EQU   PSA+621                                                  03496000
PSAIPCDM EQU   PSA+620                                                  03497000
PSAIPCD  EQU   PSA+616                                                  03498000
@NM00023 EQU   PSA+613                                                  03499000
PSAIPCRM EQU   PSA+612                                                  03500000
PSAIPCR  EQU   PSA+608                                                  03501000
PSAMCHEX EQU   PSA+600                                                  03502000
PSAMPSW  EQU   PSA+592                                                  03503000
PSAEXPS2 EQU   PSA+584                                                  03504000
PSAEXPS1 EQU   PSA+576                                                  03505000
PSAPIREG EQU   PSA+572                                                  03506000
PSARSREG EQU   PSA+568                                                  03507000
PSAGPREG EQU   PSA+556                                                  03508000
PSARV022 EQU   PSASUP4                                                  03509000
PSARV021 EQU   PSASUP4                                                  03510000
PSARV020 EQU   PSASUP4                                                  03511000
PSARV019 EQU   PSASUP4                                                  03512000
PSARV018 EQU   PSASUP4                                                  03513000
PSARV017 EQU   PSASUP4                                                  03514000
PSARV016 EQU   PSASUP4                                                  03515000
PSARV015 EQU   PSASUP4                                                  03516000
PSARV014 EQU   PSASUP3                                                  03517000
PSAULCMS EQU   PSASUP3                                                  03518000
PSARV012 EQU   PSASUP3                                                  03519000
PSAESTA  EQU   PSASUP3                                                  03520000
PSASPR   EQU   PSASUP3                                                  03521000
PSAPSREG EQU   PSASUP3                                                  03522000
PSAPI2   EQU   PSASUP3                                                  03523000
PSAIOSUP EQU   PSASUP3                                                  03524000
PSALCR   EQU   PSASUP2                                                  03525000
PSARTM   EQU   PSASUP2                                                  03526000
PSAACR   EQU   PSASUP2                                                  03527000
PSAIPCE2 EQU   PSASUP2                                                  03528000
PSAIPCES EQU   PSASUP2                                                  03529000
PSAIPCEC EQU   PSASUP2                                                  03530000
PSAGTF   EQU   PSASUP2                                                  03531000
PSAIPCRI EQU   PSASUP2                                                  03532000
PSATYPE6 EQU   PSASUP1                                                  03533000
PSATCTL  EQU   PSASUP1                                                  03534000
PSADISP  EQU   PSASUP1                                                  03535000
PSALOCK  EQU   PSASUP1                                                  03536000
PSAPI    EQU   PSASUP1                                                  03537000
PSAEXT   EQU   PSASUP1                                                  03538000
PSASVC   EQU   PSASUP1                                                  03539000
PSAIO    EQU   PSASUP1                                                  03540000
PSAAOLD  EQU   PSA+548                                                  03541000
PSAANEW  EQU   PSA+544                                                  03542000
PSATOLD  EQU   PSA+540                                                  03543000
PSATNEW  EQU   PSA+536                                                  03544000
PSALCCAR EQU   PSA+532                                                  03545000
PSALCCAV EQU   PSA+528                                                  03546000
PSAPCCAR EQU   PSA+524                                                  03547000
PSAPCCAV EQU   PSA+520                                                  03548000
PSACPULA EQU   PSA+518                                                  03549000
PSACPUPA EQU   PSA+516                                                  03550000
PSAPSA   EQU   PSA+512                                                  03551000
FLCHDEND EQU   PSA+512                                                  03552000
FLCCRSAV EQU   FLCMCLA+280                                              03553000
FLCGRSAV EQU   FLCMCLA+216                                              03554000
FLCFPSAV EQU   FLCMCLA+184                                              03555000
FLCFLA   EQU   FLCMCLA+88                                               03556000
FLCRGNCD EQU   FLCMCLA+84                                               03557000
FLCFSAA  EQU   FLCFSA+1                                                 03558000
@NM00022 EQU   FLCFSA                                                   03559000
@NM00021 EQU   FLCMCLA+72                                               03560000
FLCMCIC  EQU   FLCMCLA+64                                               03561000
@NM00020 EQU   FLCMCLA+20                                               03562000
FLCIOAA  EQU   FLCIOA+1                                                 03563000
@NM00019 EQU   FLCIOA                                                   03564000
@NM00018 EQU   FLCMCLA+15                                               03565000
@NM00017 EQU   FLCMCLA+14                                               03566000
@NM00016 EQU   FLCMCLA+12                                               03567000
FLCLCL   EQU   FLCMCLA+8                                                03568000
FLCIOELA EQU   FLCIOEL+1                                                03569000
@NM00015 EQU   FLCIOEL                                                  03570000
FLCCHNID EQU   FLCMCLA                                                  03571000
@NM00014 EQU   PSA+160                                                  03572000
FLCMTRCD EQU   PSA+157                                                  03573000
@NM00013 EQU   PSA+156                                                  03574000
FLCPERA  EQU   FLCPER+1                                                 03575000
@NM00012 EQU   FLCPER                                                   03576000
@NM00011 EQU   PSA+151                                                  03577000
FLCPERCD EQU   PSA+150                                                  03578000
FLCMCNUM EQU   PSA+149                                                  03579000
@NM00010 EQU   PSA+148                                                  03580000
FLCTEAA  EQU   FLCTEA+1                                                 03581000
@NM00009 EQU   FLCTEA                                                   03582000
PSAPIPC  EQU   PSAPICOD                                                 03583000
PSAPIMC  EQU   PSAPICOD                                                 03584000
PSAPIPER EQU   PSAPICOD                                                 03585000
PSARV049 EQU   FLCPICOD                                                 03586000
FLCPILCB EQU   FLCPIILC                                                 03587000
@NM00008 EQU   FLCPIILC                                                 03588000
@NM00007 EQU   PSAEPPSW                                                 03589000
FLCSVCN  EQU   PSAESPSW+2                                               03590000
FLCSILCB EQU   FLCSVILC                                                 03591000
@NM00006 EQU   FLCSVILC                                                 03592000
@NM00005 EQU   PSAESPSW                                                 03593000
FLCEICOD EQU   PSAEEPSW+2                                               03594000
PSASPAD  EQU   PSAEEPSW                                                 03595000
@NM00004 EQU   PSA+128                                                  03596000
FLCINPSW EQU   PSA+120                                                  03597000
FLCMNPSW EQU   PSA+112                                                  03598000
FLCPNPSW EQU   PSA+104                                                  03599000
FLCSNPSW EQU   PSA+96                                                   03600000
FLCENPSW EQU   PSA+88                                                   03601000
FLCTRACE EQU   PSA+84                                                   03602000
FLCTIMER EQU   PSA+80                                                   03603000
FLCCVT2  EQU   PSA+76                                                   03604000
FLCCAW   EQU   PSA+72                                                   03605000
FLCCSW   EQU   PSA+64                                                   03606000
FLCIOPSW EQU   PSA+56                                                   03607000
FLCMOPSW EQU   PSA+48                                                   03608000
FLCPOPSW EQU   PSA+40                                                   03609000
FLCSOPSW EQU   PSA+32                                                   03610000
FLCEOPSW EQU   PSA+24                                                   03611000
@NM00003 EQU   FLCICCW2+4                                               03612000
FLCICCW1 EQU   FLCROPSW                                                 03613000
FLCIPPSW EQU   FLCRNPSW                                                 03614000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03615000
@RC00296 EQU   @RC00278                                                 03616000
@RC00377 EQU   @RC00375                                                 03617000
@ENDDATA EQU   *                                                        03618000
         END   IEECB910,(C'PLS1033',0701,78157)                         03619000
./  ADD  SSI=70060406,NAME=IEECB911
MSG TITLE 'IEECB911 MSG CSECT FOR IEECB910'                             00050043
IEECB911 CSECT                                                          00100043
         MODID BRANCH=NO                                                00120043
*/***************************************************************/      00150043
* /* START OF SPECIFICATIONS ****                                       00200043
*                                                                       00250043
*     MODULE NAME = IEECB911                                            00300043
*                                                                       00350043
*     DESCRIPTIVE NAME = DISPLAY DUMP MESSAGE CSECT                     00400043
*                                                                       00450043
*****************************************************************       00500043
*     COPYRIGHT =  NONE                                                 00550043
*                                                                       00600043
*     STATUS = NEW FOR OS/VS2 R3.7 SU33                 @G33CPHE        00650043
*                                                                       00700043
*     FUNCTION = MESSAGE CSECT FOR IEECB910                             00750043
*                                                                       00800043
*       OPERATION = NONE                                                00850043
*                                                                       00900043
*     NOTES =                                                           00950043
*                                                                       01000043
*       DEPENDENCIES = SYSTEM 370 COMPATABLE HARDWARE.                  01050043
*                   MUST BE ASSEMBLED WITH THE CHARACTER CODE THAT THE  01070043
*                   WTO MESSAGES ARE TO APPEAR IN.                      01090043
*                                                                       01150043
*       RESTRICTIONS = NONE                                             01200043
*                                                                       01250043
*       REGISTER CONVENTIONS = NONE                                     01300043
*                                                                       01350043
*       ADDITIONAL NOTES = WHERE BIT STRINGS ARE THE BASIS OF THE MSG   01400043
*                   TO BE GENERATED THE TEXT IN THIS CSECT IS IN A      01403043
*                   CONTINUOUS STRING CORRESPONDING TO THE BIT STRING.  01406043
*                   THERE IS ONE ELEMENT OF THE STRING FOR EACH BIT     01409043
*                   IN THE STRING. EACH ELEMENT CONSISTS OF A ONE BYTE  01412043
*                   LENGTH OF THE TEXT THAT FOLLOWS AND THEN THE TEXT   01415043
*                   THAT CORRESPONDS TO THE BIT. AT THE END OF THE LIST 01418043
*                   A LENGTH OF ZERO INDICATES THE END.                 01421043
*                     THEN THE MSG IS BUILT BY TESTING EACH BIT AND     01424043
*                   MOVING IN THE TEXT IF IT IS ON. THEN SKIPPING TO    01427043
*                   THE NEXT TEXT AND REPEATTING THE PROCESS IF THE     01430043
*                   LENGTH IS NOT ZERO.                                 01433043
*                                                                       01450043
*       PACKAGING = LOAD MODULE IEECB910                                01500043
*                   SYSGEN MACRO=SGIEA410 (LPA)                         01520043
*                                                                       01550043
*     PATCH LABEL = PATCH AREA IN IEECB910                              01700043
*                                                                       01750043
*     MODULE TYPE =                                                     01800043
*       PROCESSOR = ASSEM                                               01850043
*       MODULE SIZE = 1K                                                01900043
*       ATTRIBUTES = REENTRANT, NOT EXECUTABLE                          01950043
*                                                                       02000043
*     ENTRY POINT = NONE                                                02050043
*                                                                       02300043
*     EXIT-NORMAL = NONE                                                02350043
*                                                                       02550043
*     EXIT-ERROR = NONE                                                 02600043
*                                                                       02800043
*     EXTERNAL REFERENCES = NONE                                        02850043
*                                                                       03050043
*     MACROS = WTO                                                      03200043
*                                                                       03250043
*       SERIALIZATION = NONE                                            03300043
*                                                                       03350043
*     MESSAGES = IEE856I, IEE857I                                       03400043
*                                                                       03450043
*     ABEND CODES = NONE                                                03500043
*                                                                       03550043
*     CHANGE ACTIVITY = NONE 6/28/76                          @G33CPHE  03600043
*                                                                       03650043
**** END OF SPECIFICATIONS ***/                                         03700043
*/*A0-999999                                                 @G33CPHE*/ 03750043
         EJECT                                                          03770043
*                                                                       03790043
* THE CONTROL LINES FOR THE TWO DISPLAY DUMP MESSAGES                   03810043
*                                                                       03830043
         ENTRY CNTL856                                                  03850043
         DS    0F                                                       03860043
         DS    3B                                                       03870043
CNTL856  DC   AL1(E1-W1)                                                03900043
W1       WTO ('IEE856I 00.00.00 SYS1.DUMP STATUS',C),DESC=(5,8,9),MF=L,*03940043
               MCSFLAG=(REG0,RESP),AREAID=Z                             03950043
E1       EQU   *                                                        03980043
         SPACE 2                                                        04020043
         ENTRY CNTL857                                                  04150043
         DS    0F                                                       04160043
         DS    3B                                                       04170043
CNTL857  DC   AL1(E2-W2)                                                04200043
W2       WTO ('IEE857I 00.00.00 DUMP OPTIONS',C),DESC=(5,8,9),MF=L,    *04220043
               MCSFLAG=(REG0,RESP),AREAID=Z                             04226043
E2       EQU   *                                                        04240043
         EJECT                                                          04240543
*                                                                       04241043
* LABEL & DATA LINE TEXT FOR MSG IEE856I (DISPLAY DUMP,STATUS)          04241543
*                                                                       04242043
         ENTRY LABEL856                                                 04242543
LABEL856 DC    AL1(E350-T350)                                           04243043
T350     DC    C'SYS1.DUMP DATASETS AVAILABLE '                         04243543
E350     DC    AL1(E351-T351)                                           04244043
T351     DC    C', AND FULL '                                           04244543
E351     EQU   *                                                        04245043
         SPACE 2                                                        04245543
         ENTRY DATA856                                                  04246043
DATA856  DC    AL1(E352-T352)                                           04247243
T352     DC    C'AVAILABLE '                                            04247343
E352     DC    AL1(E353-T353)                                           04247443
T353     DC    C'FULL '                                                 04247543
E353     DC    AL1(E354-T354)                                           04247643
T354     DC    C'TAPE DATASET UNIT='                                    04247743
E354     DC    AL1(E355-T355)                                           04247843
T355     DC    C'DASD DATASET SYS1.DUMP'                                04247943
E355     DC    AL1(E357-T357)                                           04249543
T357     DC    C' *-*-*-*-- ERROR ATTEMPTING TO ALLOCATE THIS SYS1.DUMP*04249743
                DATASET TO READ THE HEADER RECORD.--*-*-*-*'            04249943
E357     DC    AL1(E358-T358)                                           04250143
T358     DC    C' *-*-*-*-- ERROR. FIRST RECORD IN DATASET IS NOT A VALI04250243
               LD DUMP HEADER RECORD.--*-*-*-*'                         04250343
E358     DC    AL1(E359-T359)                                           04250543
T359     DC    C' *-*-*-*-- ERROR. AN ATTEMPT TO OPEN THIS DATASET RESUL04250643
               LTED IN AN ERROR.--*-*-*-*'                              04250743
E359     DC    AL1(E399-T399)                                           04250843
T399     DC    C' *-*-*-*-- ERROR. AN ATTEMPT TO READ THIS DATASET RESUL04250943
               LTED IN AN ERROR.--*-*-*-*'                              04251043
E399     DC    AL1(E356-T356)                                           04251143
T356     DC    C'  DUMP TITLE= '                                        04251243
E356     EQU   *                                                        04251643
         EJECT                                                          04251843
*                                                                       04251943
* DATA LINE TEXT FOR MSG IEE857I (DISPLAY DUMP,OPTIONS)                 04252043
*                                                                       04252143
         ENTRY DUMPTYPE                                                 04252243
DUMPTYPE DC    A(SYSATYPE)                                              04252343
         DC    A(SYSUTYPE)                                              04252443
         DC    A(SYSMTYPE)                                              04252543
         DC    A(SDMPTYPE)                                              04252643
         SPACE 2                                                        04252743
SYSATYPE DC    AL1(L205-T205)                                           04252843
T205     DC    C'SYSABEND- '                                            04252943
L205     EQU   *                                                        04253043
SYSUTYPE DC    AL1(L206-T206)                                           04253143
T206     DC    C'SYSUDUMP- '                                            04253243
L206     EQU   *                                                        04253343
SYSMTYPE DC    AL1(L207-T207)                                           04253443
T207     DC    C'SYSMDUMP- '                                            04254343
L207     EQU   *                                                        04254443
SDMPTYPE DC    AL1(L208-T208)                                           04254543
T208     DC    C'SDUMP- '                                               04254643
L208     EQU   *                                                        04254743
*                                                                       04254843
*   OPTION MODES FOR IEE857I                                            04254943
*                                                                       04255043
         ENTRY OVERMODE                                                 04255143
OVERMODE DC    AL1(L200-T200)                                           04256043
T200     DC    C'OVERRIDE WITH '                                        04256143
L200     EQU   *                                                        04256243
         ENTRY ADDOPTS                                                  04256343
ADDOPTS  DC    AL1(L201-T201)                                           04256443
T201     DC    C'ADD OPTIONS '                                          04256543
L201     EQU   *                                                        04256643
         ENTRY ADDNOOPT                                                 04256943
ADDNOOPT DC    AL1(L202-T202)                                           04257043
T202     DC    C'ADD NO OPTIONS'                                        04257143
L202     EQU   *                                                        04258043
         ENTRY ADDPLIB                                                  04258943
ADDPLIB  DC    AL1(L203-T203)                                           04260043
T203     DC    C'ADD PARMLIB OPTIONS '                                  04261043
L203     EQU   *                                                        04262043
         ENTRY NODUMPS                                                  04263043
NODUMPS  DC    AL1(L204-T204)                                           04264043
T204     DC    C'IGNORE DUMP REQUESTS'                                  04265043
L204     EQU   *                                                        04266043
         EJECT                                                          04283943
*                                                                       04284143
*   OPTIONS FOR SDATA BITS                                              04284343
*                                                                       04284543
         ENTRY NOSDATA                                                  04284943
NOSDATA  DC    AL1(L60-T60)                                             04285043
T60      DC    C'NO SDATA OPTIONS'                                      04286043
L60      DC   AL1(0)             END OF LIST INDICATOR                  04287043
         SPACE 2                                                        04288043
         ENTRY SDATA                                                    04301043
SDATA    DC    AL1(L1-T1)                                               04302043
T1       DC    C'SDATA=('                                               04304043
L1       DC    AL1(L2-T2)                                               04306043
T2       DC    C'NUC,'                                                  04308043
L2       DC    AL1(L3-T3)                                               04310043
T3       DC    C'SQA,'                                                  04312043
L3       DC    AL1(L4-T4)                                               04314043
T4       DC    C'LSQA,'                                                 04316043
L4       DC    AL1(L5-T5)                                               04318043
T5       DC    C'SWA,'                                                  04320043
L5       DC    AL1(L6-T6)                                               04322043
T6       DC    C'TRT,'                                                  04324043
L6       DC    AL1(L7-T7)                                               04326043
T7       DC    C'CB,'                                                   04328043
L7       DC    AL1(L8-T8)                                               04330043
T8       DC    C'ENQ,'                                                  04332043
L8       DC    AL1(L9-T9)                                               04334043
T9       DC    C'DM,'                                                   04336043
L9       DC    AL1(L10-T10)                                             04338043
T10      DC    C'IO,'                                                   04340043
L10      DC    AL1(L11-T11)                                             04342043
T11      DC    C'ERR,'                                                  04344043
L11      DC    AL1(0)              END OF LIST INDICATOR                04350043
         EJECT                                                          04400043
*                                                                       04401043
*   OPTIONS FOR PDATA BITS                                              04402043
*                                                                       04403043
         ENTRY NOPDATA                                                  04407043
NOPDATA  DC    AL1(L61-T61)                                             04414043
T61      DC    C', NO PDATA OPTIONS'                                    04419043
L61      DC    AL1(0)                   END OF LIST INDICATOR           04424043
         SPACE 2                                                        04435043
         ENTRY PDATA                                                    04450043
PDATA    DC    AL1(L51-T51)                                             04500043
T51      DC    C', PDATA=('                                             04550043
L51      DC    AL1(L52-T52)                                             04600043
T52      DC    C'SA,'                                                   04650043
L52      DC    AL1(L53-T53)                                             04700043
T53      DC    C'SAH,'                                                  04750043
L53      DC    AL1(L54-T54)                                             04800043
T54      DC    C'REGS,'                                                 04850043
L54      DC    AL1(L55-T55)                                             04900043
T55      DC    C'LPA,'                                                  04950043
L55      DC    AL1(L56-T56)                                             05000043
T56      DC    C'JPA,'                                                  05050043
L56      DC    AL1(L57-T57)                                             05100043
T57      DC    C'PSW,'                                                  05150043
L57      DC    AL1(L58-T58)                                             05200043
T58      DC    C'SPLS,'                                                 05250043
L58      DC    AL1(0)              END OF LIST INDICATOR                05300043
         EJECT                                                          05320043
*                                                                       05327043
*   OPTIONS FOR SYSMDUMP BITS                                           05334043
*                                                                       05341043
         ENTRY SMDATA                                                   05350043
SMDATA   DC    AL1(L101-T101)                                           05400043
T101     DC    C'('                                                     05450043
L101     DC    AL1(L102-T102)                                           05500043
T102     DC    C'NUC,'                                                  05550043
L102     DC    AL1(L103-T103)                                           05600043
T103     DC    C'SQA,'                                                  05650043
L103     DC    AL1(L104-T104)                                           05700043
T104     DC    C'LSQA,'                                                 05750043
L104     DC    AL1(L105-T105)                                           05800043
T105     DC    C'SWA,'                                                  05850043
L105     DC    AL1(L106-T106)                                           05900043
T106     DC    C'TRT,'                                                  05950043
L106     DC    AL1(L107-T107)                                           06000043
T107     DC    C'RGN,'                                                  06050043
L107     DC    AL1(L108-T108)                                           06100043
T108     DC    C'LPA,'                                                  06150043
L108     DC    AL1(L109-T109)                                           06200043
T109     DC    C'CSA,'                                                  06250043
L109     DC    AL1(0)              END OF LIST INDICATOR                06300043
         EJECT                                                          06304043
*                                                                       06308043
*   OPTIONS FOR SDUMP BITS                                              06312043
*                                                                       06316043
         ENTRY SVCDATA                                                  06350043
SVCDATA  DC    AL1(L151-T151)                                           06400043
T151     DC    C'('                                                     06450043
L151     DC    AL1(L152-T152)                                           06500043
T152     DC    C'ALLPSA,'                                               06550043
L152     DC    AL1(L153-T153)                                           06600043
T153     DC    C'PSA,'                                                  06650043
L153     DC    AL1(L154-T154)                                           06700043
T154     DC    C'NUC,'                                                  06750043
L154     DC    AL1(L155-T155)                                           06800043
T155     DC    C'SQA,'                                                  06850043
L155     DC    AL1(L156-T156)                                           06900043
T156     DC    C'LSQA,'                                                 06950043
L156     DC    AL1(L157-T157)                                           07000043
T157     DC    C'RGN,'                                                  07050043
L157     DC    AL1(L158-T158)                                           07100043
T158     DC    C'LPA,'                                                  07150043
L158     DC    AL1(L159-T159)                                           07200043
T159     DC    C'TRT,'                                                  07250043
L159     DC    AL1(L160-T160)                                           07300043
T160     DC    C'CSA,'                                                  07350043
L160     DC    AL1(L161-T161)                                           07400043
T161     DC    C'SWA,'                                                  07450043
L161     DC    AL1(L162-T162)                                           07500043
T162     DC    C'SUMDUMP,'                                              07550043
L162     DC    AL1(L163-T163)                                           07600043
T163     DC    C'NOSUMDUMP,'                                            07650043
L163     DC    AL1(L164-T164)                                           07700043
T164     DC    C'NOALLPSA,'                                             07750043
L164     DC    AL1(L165-T165)                                           07800043
T165     DC    C'NOSQA,'                                                07850043
L165     DC    AL1(L166-T166)                                           07900043
T166     DC    C'RESERVED,'                                             07950043
L166     DC    AL1(L167-T167)                                           08000043
T167     DC    C'RESERVED,'                                             08050043
L167     DC    AL1(L168-T168)                                           08100043
T168     DC    C'Q=YES,'                                                08150043
L168     DC    AL1(L169-T169)                                           08200043
T169     DC    C'Q=NO,'                                                 08250043
L169     DC    AL1(0)              END OF LIST INDICATOR                08300043
         END                                                            09050043
./  ADD  SSI=70060407,NAME=IEECB912
B912     TITLE 'IEECB912  MLWTO CONTINUATION PROCESSOR                 *00001000
                        '                                               00002000
IEECB912 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(19)                                             0001 00007000
         DC    C'IEECB912R0300077006'                              0001 00008000
         DROP  @15                                                      00009000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00010000
         BALR  @12,0                                               0001 00011000
@PSTART  DS    0H                                                  0001 00012000
         USING @PSTART,@12                                         0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @11,@01                                             0001 00016000
         USING @DATD,@11                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LM    @00,@01,20(@13)                                     0001 00019000
         ST    @11,8(,@13)                                         0001 00020000
         LR    @13,@11                                             0001 00021000
         MVC   @PC00001(24),0(@01)                                 0001 00022000
*                                                                  0022 00023000
*   /*****************************************************************/ 00024000
*   /*                                                               */ 00025000
*   /* CHECK TO SEE IF THERE WAS AN ERROR RETURN CODE FROM A PREVIOUS*/ 00026000
*   /* CALL TO WTO                                                   */ 00027000
*   /*                                                               */ 00028000
*   /*****************************************************************/ 00029000
*                                                                  0022 00030000
*   IF WAREAPTR=WTOERROR THEN       /* YES THERE WAS                 */ 00031000
         L     @10,@PC00001+20                                     0022 00032000
         CLC   WAREAPTR(4,@10),@CF00190                            0022 00033000
         BNE   @RF00022                                            0022 00034000
*     RETURN CODE(4);               /* SO THROW AWAY THE TEXT AND  0023 00035000
*                                      QUIT. NO FURTHER ATTEMPT    0023 00036000
*                                      SHOULD BE MADE TO WRITE OUT TO   00037000
*                                      THIS MLWTO ID                 */ 00038000
*                                                                  0023 00039000
         L     @13,4(,@13)                                         0023 00040000
         L     @00,@SIZDATD                                        0023 00041000
         LR    @01,@11                                             0023 00042000
         FREEMAIN R,LV=(0),A=(1)                                        00043000
         LA    @15,4                                               0023 00044000
         L     @14,12(,@13)                                        0023 00045000
         LM    @00,@12,20(@13)                                     0023 00046000
         BR    @14                                                 0023 00047000
*   /*****************************************************************/ 00048000
*   /*                                                               */ 00049000
*   /* INIT AND IF NECESSARY DROP ANY TRAILING BLANKS FROM THE TEXT  */ 00050000
*   /* TO BE PROCESSED                                               */ 00051000
*   /*                                                               */ 00052000
*   /*****************************************************************/ 00053000
*                                                                  0024 00054000
*   IF WAREAPTR=0                   /* CHECK TO SEE IF THIS IS THE 0024 00055000
*                                      FIRST CALL IN                 */ 00056000
*     THEN                                                         0024 00057000
@RF00022 L     @10,@PC00001+20                                     0024 00058000
         ICM   @03,15,WAREAPTR(@10)                                0024 00059000
         BNZ   @RF00024                                            0024 00060000
*     WAREAPTR=ADDR(WTOAREA);       /* INIT THE WAREAPTR             */ 00061000
         LA    @03,WTOAREA(,@10)                                   0025 00062000
         ST    @03,WAREAPTR(,@10)                                  0025 00063000
*   CONTINUE=BITOFF;                /* INIT                          */ 00064000
@RF00024 NI    CONTINUE,B'01111111'                                0026 00065000
*   START=ADDR(TEXT);               /* INIT                          */ 00066000
         L     START,@PC00001                                      0027 00067000
         LA    @10,TEXT(,START)                                    0027 00068000
         LR    START,@10                                           0027 00069000
*   DO SCANPTR=START+TEXTLEN-1 TO START BY-1/* SCAN BACKWARDS TO DROP   00070000
*                                      TRAILING BLANKS               */ 00071000
*         WHILE CHAR=' ';           /* STOP WHEN A NONBLANK IS FOUND */ 00072000
         L     @10,@PC00001                                        0028 00073000
         LR    SCANPTR,START                                       0028 00074000
         SLR   @04,@04                                             0028 00075000
         IC    @04,TEXTLEN(,@10)                                   0028 00076000
         ALR   SCANPTR,@04                                         0028 00077000
         BCTR  SCANPTR,0                                           0028 00078000
         B     @DE00028                                            0028 00079000
@DL00028 CLI   CHAR(SCANPTR),C' '                                  0028 00080000
         BNE   @DC00028                                            0028 00081000
*   END;                                                           0029 00082000
         BCTR  SCANPTR,0                                           0029 00083000
@DE00028 CR    SCANPTR,START                                       0029 00084000
         BNL   @DL00028                                            0029 00085000
@DC00028 DS    0H                                                  0030 00086000
*   ENDPTR=SCANPTR+1;               /* POINT TO BYTE FOLLOWING LAST     00087000
*                                      NONBLANK IN THE LINE          */ 00088000
         LA    ENDPTR,1                                            0030 00089000
         ALR   ENDPTR,SCANPTR                                      0030 00090000
*                                                                  0031 00091000
*   /*****************************************************************/ 00092000
*   /*                                                               */ 00093000
*   /* LOOP ONCE FOR EACH MLWTO LINE GENERATED FRON THE INPUT TEXT   */ 00094000
*   /*                                                               */ 00095000
*   /*****************************************************************/ 00096000
*                                                                  0031 00097000
*   DO WHILE START<ENDPTR;          /* PROCESS THE WHOLE INPUT LINE  */ 00098000
         B     @DE00031                                            0031 00099000
@DL00031 DS    0H                                                  0032 00100000
*     IF CONTINUE=BITOFF            /* IS THIS BEGINNING A NEW LINE     00101000
*                                      OR CONTINUING AN OLD ONE      */ 00102000
*       THEN                        /* THIS IS THE BEGINNING OF A THE   00103000
*                                      LINE OF INPUT TEXT            */ 00104000
         TM    CONTINUE,B'10000000'                                0032 00105000
         BNZ   @RF00032                                            0032 00106000
*       DO;                                                        0033 00107000
*         MAXLEN=MAXWTO;            /* THE AMOUNT OF TEXT THAT MAY BE   00108000
*                                      PUT ON THIS LINE IS THE MAX 0034 00109000
*                                      THAT WTO WILL ALLOW           */ 00110000
         LA    MAXLEN,70                                           0034 00111000
*         WTOLEN=0;                 /* INIT LENGTH COUNT             */ 00112000
         SLR   WTOLEN,WTOLEN                                       0035 00113000
*       END;                                                       0036 00114000
*     ELSE                          /* THIS IS A MLWTO CONTINUATION     00115000
*                                      LINE FOR THE INPUT TEXT       */ 00116000
*       DO;                                                        0037 00117000
         B     @RC00032                                            0037 00118000
@RF00032 DS    0H                                                  0038 00119000
*         MAXLEN=MAXWTO-CONTCOL+1;  /* THE AMOUNT OF TEXT THAT MAY BE   00120000
*                                      PUT ON THIS LINE IS REDUCED BY   00121000
*                                      THE NEED FOR INDENTING        */ 00122000
         L     @10,@PC00001+8                                      0038 00123000
         L     @10,CONTCOL(,@10)                                   0038 00124000
         LA    MAXLEN,70                                           0038 00125000
         SLR   MAXLEN,@10                                          0038 00126000
         AH    MAXLEN,@CH00062                                     0038 00127000
*         WTOLEN=CONTCOL-1;         /* START OFF WITH THE LENGTH OF     00128000
*                                      BLANKS AT THE HEAD OF THE LINE*/ 00129000
         BCTR  @10,0                                               0039 00130000
         LR    WTOLEN,@10                                          0039 00131000
*       END;                                                       0040 00132000
*                                                                  0041 00133000
*     /***************************************************************/ 00134000
*     /*                                                             */ 00135000
*     /* FIND THE END OF THE NEXT MLWTO LINE TO BE GENERATED FROM THE*/ 00136000
*     /* INPUT TEXT                                                  */ 00137000
*     /*                                                             */ 00138000
*     /***************************************************************/ 00139000
*                                                                  0041 00140000
*     IF(ENDPTR-START<=MAXLEN)      /* WILL THE REMAINING TEXT ALL 0041 00141000
*                                      FIT ON THE NEXT LINE          */ 00142000
*       THEN                        /* YES IT WILL                   */ 00143000
@RC00032 LR    @10,ENDPTR                                          0041 00144000
         SLR   @10,START                                           0041 00145000
         CR    @10,MAXLEN                                          0041 00146000
         BH    @RF00041                                            0041 00147000
*       TRUELEN=ENDPTR-START;       /* THEN TAKE IT ALL              */ 00148000
         LR    TRUELEN,@10                                         0042 00149000
*     ELSE                                                         0043 00150000
*       DO;                         /* NO IT WON'T, SO FIND A BREAK     00151000
*                                      POINT                         */ 00152000
         B     @RC00041                                            0043 00153000
@RF00041 DS    0H                                                  0044 00154000
*         TRUELEN=MAXLEN;           /* SET UP FOR THE DEFAULT BREAK     00155000
*                                      POINT IN CASE NOTHING BETTER     00156000
*                                      IS FOUND WITHIN THE SCANBACK     00157000
*                                      RANGE                         */ 00158000
         LR    TRUELEN,MAXLEN                                      0044 00159000
*         SCANEND=START+TRUELEN-1;  /* CALC END CONDITION FOR LOOP   */ 00160000
         LR    @10,START                                           0045 00161000
         ALR   @10,TRUELEN                                         0045 00162000
         LR    SCANEND,@10                                         0045 00163000
         BCTR  SCANEND,0                                           0045 00164000
*         DO SCANPTR=(START+TRUELEN-SCANBACK) TO SCANEND BY 1;/* SCAN   00165000
*                                      LOOKING FOR A BREAK POINT     */ 00166000
         L     @09,@PC00001+4                                      0046 00167000
         SL    @10,SCANBACK(,@09)                                  0046 00168000
         LR    SCANPTR,@10                                         0046 00169000
         B     @DE00046                                            0046 00170000
@DL00046 DS    0H                                                  0047 00171000
*           IF CHAR=' '|CHAR=','    /* IS THIS A BREAK CHAR          */ 00172000
*             THEN                                                 0047 00173000
         CLI   CHAR(SCANPTR),C' '                                  0047 00174000
         BE    @RT00047                                            0047 00175000
         CLI   CHAR(SCANPTR),C','                                  0047 00176000
         BNE   @RF00047                                            0047 00177000
@RT00047 DS    0H                                                  0048 00178000
*             TRUELEN=SCANPTR+1-START;/* CHANGE THE LENGTH TO POINT     00179000
*                                      TO THIS BREAK POINT WHICH IS     00180000
*                                      THE BEST ONE FOUND SO FAR     */ 00181000
         LA    TRUELEN,1                                           0048 00182000
         ALR   TRUELEN,SCANPTR                                     0048 00183000
         SLR   TRUELEN,START                                       0048 00184000
*         END;                      /* CONTINUE LOOKING FOR A BETTER    00185000
*                                      BREAK POINT                   */ 00186000
@RF00047 AH    SCANPTR,@CH00062                                    0049 00187000
@DE00046 CR    SCANPTR,SCANEND                                     0049 00188000
         BNH   @DL00046                                            0049 00189000
*       END;                        /* OF FINDING A BREAK POINT      */ 00190000
*     WTOLEN=WTOLEN+TRUELEN;        /* ADD TO THE ACCUMULATED WTO  0051 00191000
*                                      LENGTH THE LENGTH OF THE TEXT    00192000
*                                      TO BE ADDED                   */ 00193000
@RC00041 ALR   WTOLEN,TRUELEN                                      0051 00194000
*                                                                  0052 00195000
*     /***************************************************************/ 00196000
*     /*                                                             */ 00197000
*     /* BUILD THE MLWTO PARMLIST SECTION FOR THIS LINE AND          */ 00198000
*     /* ACCUMULATE IT IN THE BUFFER                                 */ 00199000
*     /*                                                             */ 00200000
*     /***************************************************************/ 00201000
*                                                                  0052 00202000
*     IF WAREAPTR=ADDR(WTOAREA)     /* CHECK TO SEE IF A NEW MLWTO 0052 00203000
*                                      BUFFER SHOULD BE STARTED      */ 00204000
*       THEN                        /* YES A NEW BUFFER SHOULD BE  0052 00205000
*                                                             STARTED*/ 00206000
         L     @10,@PC00001+20                                     0052 00207000
         L     @03,WAREAPTR(,@10)                                  0052 00208000
         LA    @15,WTOAREA(,@10)                                   0052 00209000
         CR    @03,@15                                             0052 00210000
         BNE   @RF00052                                            0052 00211000
*       DO;                                                        0053 00212000
*         WPLPTR=ADDR(WTODUMMY);    /* BASE WPL MAP ON LIST FORM   0054 00213000
*                                      MLWTO MACRO TO GET THE MCS  0054 00214000
*                                      FLGS ETC                      */ 00215000
         LA    WPLPTR,WTODUMMY                                     0054 00216000
*         WAREAPTR->WPLLGH=WTOLEN+LENGTH(WPLLS01);/* FILL IN LENGTH     00217000
*                                      FIELD                         */ 00218000
         LA    @15,4                                               0055 00219000
         ALR   @15,WTOLEN                                          0055 00220000
         STH   @15,WPLLGH(,@03)                                    0055 00221000
*         WAREAPTR->WPLMCSF=WPLMCSF;/* COPY PARMS                    */ 00222000
         MVC   WPLMCSF(2,@03),WPLMCSF(WPLPTR)                      0056 00223000
*         IF CONTINUE=BITON         /* IS THE NEXT LINE TO BE      0057 00224000
*                                      GENERATED AS A CONTINUATION OF   00225000
*                                      THE ONE BEFORE                */ 00226000
*           THEN                                                   0057 00227000
         TM    CONTINUE,B'10000000'                                0057 00228000
         BNO   @RF00057                                            0057 00229000
*           DO;                     /* YES                           */ 00230000
*             WAREAPTR->WPLTXT(1:CONTCOL-1)=BLANKS(1:CONTCOL-1);/* 0059 00231000
*                                      BLANK OUT THE PORTION OF THE     00232000
*                                      MLWTO LINE PRECEDING THE    0059 00233000
*                                      CONTINUATION                  */ 00234000
         L     @07,@PC00001+8                                      0059 00235000
         L     @07,CONTCOL(,@07)                                   0059 00236000
         LR    @15,@07                                             0059 00237000
         BCTR  @15,0                                               0059 00238000
         BCTR  @15,0                                               0059 00239000
         EX    @15,@SM00232                                        0059 00240000
*             WAREAPTR=WAREAPTR+CONTCOL-1;/* CHANGE THE MAPPING BASE    00241000
*                                      TO COMPENSATE FOR THE BLANKS     00242000
*                                      ADDED                         */ 00243000
         ALR   @03,@07                                             0060 00244000
         BCTR  @03,0                                               0060 00245000
         ST    @03,WAREAPTR(,@10)                                  0060 00246000
*           END;                                                   0061 00247000
*         WAREAPTR->WPLTXT(1:TRUELEN)=CHARSTR(1:TRUELEN);/* MOVE IN     00248000
*                                      THE TEXT                      */ 00249000
@RF00057 L     @10,@PC00001+20                                     0062 00250000
         L     @07,WAREAPTR(,@10)                                  0062 00251000
         LR    @03,TRUELEN                                         0062 00252000
         BCTR  @03,0                                               0062 00253000
         EX    @03,@SM00234                                        0062 00254000
*         WAREAPTR=ADDR(WAREAPTR->WPLTXT)+TRUELEN;/* SHIFT TO THE END   00255000
*                                      OF TEXT                       */ 00256000
         LA    @07,WPLTXT(,@07)                                    0063 00257000
         ALR   @07,TRUELEN                                         0063 00258000
         ST    @07,WAREAPTR(,@10)                                  0063 00259000
*         IF LINETYPE=LABLINE       /* CHECK WHICH TYPE OF LINE THIS    00260000
*                                      IS                            */ 00261000
*           THEN                    /* IF THIS IS A LABEL LINE       */ 00262000
         L     @10,@PC00001+12                                     0064 00263000
         CLI   LINETYPE(@10),X'01'                                 0064 00264000
         BNE   @RF00064                                            0064 00265000
*           WPLPTR=ADDR(WD1);       /* SHIFT THE WTO MAPPING BASE ON    00266000
*                                      THE LIST FORM WTO TO THE LABEL   00267000
*                                      LINE PORTION                  */ 00268000
         LA    WPLPTR,WD1                                          0065 00269000
*         ELSE                      /* IF NOT A LABEL LINE           */ 00270000
*           WPLPTR=ADDR(WD2);       /* THEN SHIFT WPLPTR TO THE DATA    00271000
*                                      LINE IN THE LIST FORM WTO     */ 00272000
         B     @RC00064                                            0066 00273000
@RF00064 LA    WPLPTR,WD2                                          0066 00274000
*         WAREAPTR->WPLLTF=WPLMLLTF;/* COPY WTO FLAGS                */ 00275000
@RC00064 L     @10,@PC00001+20                                     0067 00276000
         L     @07,WAREAPTR(,@10)                                  0067 00277000
         MVC   WPLLTF(2,@07),WPLMLLTF(WPLPTR)                      0067 00278000
*         LSTFLGP=ADDR(WAREAPTR->WPLLTF);/* SAVE THE ADDRESS OF THE     00279000
*                                      LAST FLAG FIELD UPDATED SO  0068 00280000
*                                      THAT IT CAN BE REPLACED WITH     00281000
*                                      AN END OF MLWTO VERSION IF  0068 00282000
*                                      THIS TURNS OUT TO BE THE LAST    00283000
*                                      LINE                          */ 00284000
         LR    LSTFLGP,@07                                         0068 00285000
*         NUMLNPTR=ADDR(WAREAPTR->WPLLINES);/* SAVE THE ADDR OF WHERE   00286000
*                                      THE # OF LINES FIELD IS     0069 00287000
*                                      BECAUSE THERE IS NO WAY TO  0069 00288000
*                                      FIND IT LATER WHEN THE # OF 0069 00289000
*                                      LINES IS KNOWN                */ 00290000
         LA    @15,WPLLINES(,@07)                                  0069 00291000
         ST    @15,NUMLNPTR(,@10)                                  0069 00292000
*         NUMLINES=1;               /* INIT THE WTO PARM LIST LINE 0070 00293000
*                                      CNT                           */ 00294000
         MVI   NUMLINES(@15),X'01'                                 0070 00295000
*         WAREAPTR=WAREAPTR+LENGTH(WPLLS01);/* MOVE THE MAPPING BASE    00296000
*                                      PAST THE END OF THE LIST FOR     00297000
*                                      THIS LINE                     */ 00298000
         AH    @07,@CH00180                                        0071 00299000
         ST    @07,WAREAPTR(,@10)                                  0071 00300000
*       END;                                                       0072 00301000
*     ELSE                          /* FOR MLWTO LINES OTHER THAN THE   00302000
*                                      FIRST IN A GROUP              */ 00303000
*       DO;                                                        0073 00304000
         B     @RC00052                                            0073 00305000
@RF00052 DS    0H                                                  0074 00306000
*         IF LINETYPE=LABLINE       /* CHECK WHICH TYPE OF LINE THIS    00307000
*                                      IS                            */ 00308000
*           THEN                    /* IF THIS IS A LABEL LINE       */ 00309000
         L     @10,@PC00001+12                                     0074 00310000
         CLI   LINETYPE(@10),X'01'                                 0074 00311000
         BNE   @RF00074                                            0074 00312000
*           WPLPTR=ADDR(WD1);       /* SHIFT THE WTO MAPPING BASE ON    00313000
*                                      THE LIST FORM WTO TO THE LABEL   00314000
*                                      LINE PORTION                  */ 00315000
         LA    WPLPTR,WD1                                          0075 00316000
*         ELSE                      /* IF NOT A LABEL LINE           */ 00317000
*           WPLPTR=ADDR(WD2);       /* BASE WPL MAP ON LIST FORM WTO    00318000
*                                      MACRO SECOND PART (A DATA   0076 00319000
*                                      LINE)                         */ 00320000
         B     @RC00074                                            0076 00321000
@RF00074 LA    WPLPTR,WD2                                          0076 00322000
*         WAREAPTR->WPLLGH=WTOLEN+LENGTH(WPLLS01);/* FILL IN LENGTH     00323000
*                                      FIELD                         */ 00324000
@RC00074 L     @10,@PC00001+20                                     0077 00325000
         L     @15,WAREAPTR(,@10)                                  0077 00326000
         LA    @14,4                                               0077 00327000
         ALR   @14,WTOLEN                                          0077 00328000
         STH   @14,WPLLGH(,@15)                                    0077 00329000
*         WAREAPTR->WPLMLLTF=WPLMLLTF;/* COPY FLAGS                  */ 00330000
         MVC   WPLMLLTF(2,@15),WPLMLLTF(WPLPTR)                    0078 00331000
*         LSTFLGP=ADDR(WAREAPTR->WPLMLLTF);/* SAVE THE ADDRESS OF THE   00332000
*                                      LAST FLAG FIELD UPDATED SO  0079 00333000
*                                      THAT IT CAN BE REPLACED WITH     00334000
*                                      AN END OF MLWTO VERSION IF  0079 00335000
*                                      THIS TURNS OUT TO BE THE LAST    00336000
*                                      LINE                          */ 00337000
         LA    LSTFLGP,WPLMLLTF(,@15)                              0079 00338000
*         IF CONTINUE=BITON         /* IS THE NEXT LINE TO BE      0080 00339000
*                                      GENERATED A CONTINUATION OF 0080 00340000
*                                      THE ONE BEFORE                */ 00341000
*           THEN                                                   0080 00342000
         TM    CONTINUE,B'10000000'                                0080 00343000
         BNO   @RF00080                                            0080 00344000
*           DO;                                                    0081 00345000
*             WAREAPTR->WPLTXT(1:CONTCOL-1)=BLANKS(1:CONTCOL-1);/* 0082 00346000
*                                      BLANK OUT THE PORTION OF THE     00347000
*                                      MLWTO LINE PRECEDING THE    0082 00348000
*                                      CONTINUATION                  */ 00349000
         L     @07,@PC00001+8                                      0082 00350000
         L     @07,CONTCOL(,@07)                                   0082 00351000
         LR    @14,@07                                             0082 00352000
         BCTR  @14,0                                               0082 00353000
         BCTR  @14,0                                               0082 00354000
         EX    @14,@SM00236                                        0082 00355000
*             WAREAPTR=WAREAPTR+CONTCOL-1;/* CHANGE THE MAPPING BASE    00356000
*                                      TO COMPENSATE FOR THE BLANKS     00357000
*                                      ADDED                         */ 00358000
         ALR   @15,@07                                             0083 00359000
         BCTR  @15,0                                               0083 00360000
         ST    @15,WAREAPTR(,@10)                                  0083 00361000
*           END;                                                   0084 00362000
*         WAREAPTR->WPLTXT(1:TRUELEN)=CHARSTR(1:TRUELEN);/* MOVE IN     00363000
*                                      THE TEXT                      */ 00364000
@RF00080 L     @10,@PC00001+20                                     0085 00365000
         L     @07,WAREAPTR(,@10)                                  0085 00366000
         LR    @15,TRUELEN                                         0085 00367000
         BCTR  @15,0                                               0085 00368000
         EX    @15,@SM00234                                        0085 00369000
*         WAREAPTR=ADDR(WAREAPTR->WPLTXT)+TRUELEN;/* SHIFT TO THE END   00370000
*                                      OF TEXT                       */ 00371000
         LA    @07,WPLTXT(,@07)                                    0086 00372000
         ALR   @07,TRUELEN                                         0086 00373000
         ST    @07,WAREAPTR(,@10)                                  0086 00374000
*         NUMLINES=NUMLINES+1;      /* BUMP COUNT OF LINES IN THIS 0087 00375000
*                                      GROUP                         */ 00376000
         L     @10,NUMLNPTR(,@10)                                  0087 00377000
         LA    @07,1                                               0087 00378000
         SLR   @15,@15                                             0087 00379000
         IC    @15,NUMLINES(,@10)                                  0087 00380000
         ALR   @07,@15                                             0087 00381000
         STC   @07,NUMLINES(,@10)                                  0087 00382000
*       END;                                                       0088 00383000
*     START=START+TRUELEN;          /* ADVANCE TO THE NEXT TEXT TO BE   00384000
*                                      PROCESSED                     */ 00385000
@RC00052 ALR   START,TRUELEN                                       0089 00386000
*                                                                  0090 00387000
*     /***************************************************************/ 00388000
*     /*                                                             */ 00389000
*     /* CALL WTO VIA THE SVC IF THE BUFFER IS FULL OR THE END HAS   */ 00390000
*     /* HAS BEEN SIGNALED                                           */ 00391000
*     /*                                                             */ 00392000
*     /***************************************************************/ 00393000
*                                                                  0090 00394000
*     IF NUMLINES=10                /* CHECK FOR MAX GROUP SIZE      */ 00395000
*         |(START=ENDPTR&LINETYPE=ENDLINE)/* OR THE END              */ 00396000
*       THEN                                                       0090 00397000
         L     @10,@PC00001+20                                     0090 00398000
         L     @10,NUMLNPTR(,@10)                                  0090 00399000
         CLI   NUMLINES(@10),10                                    0090 00400000
         BE    @RT00090                                            0090 00401000
         CR    START,ENDPTR                                        0090 00402000
         BNE   @RF00090                                            0090 00403000
         L     @10,@PC00001+12                                     0090 00404000
         CLI   LINETYPE(@10),X'FF'                                 0090 00405000
         BNE   @RF00090                                            0090 00406000
@RT00090 DS    0H                                                  0091 00407000
*       DO;                         /* PASS THE MLWTO PARM LIST TO 0091 00408000
*                                      WTO                           */ 00409000
*         IF(START=ENDPTR&LINETYPE=ENDLINE)/* CHECK TO SEE IF THE END   00410000
*                                      OF DATA FLAG SHOULD BE SET    */ 00411000
*           THEN                                                   0092 00412000
         CR    START,ENDPTR                                        0092 00413000
         BNE   @RF00092                                            0092 00414000
         L     @10,@PC00001+12                                     0092 00415000
         CLI   LINETYPE(@10),X'FF'                                 0092 00416000
         BNE   @RF00092                                            0092 00417000
*           DO;                                                    0093 00418000
*             WPLPTR=ADDR(WD3);     /* BASE THE WPL MAPPING ON THE 0094 00419000
*                                      3RD PART OF THE LIST FORM WTO    00420000
*                                      (A DATA TYPE END LINE)        */ 00421000
         LA    WPLPTR,WD3                                          0094 00422000
*             LSTFLG=WPLMLLTF;      /* COPY END FLAGS INTO THE LAST     00423000
*                                      FLAG FIELD IN THE MLWTO LIST  */ 00424000
         MVC   LSTFLG(2,LSTFLGP),WPLMLLTF(WPLPTR)                  0095 00425000
*           END;                                                   0096 00426000
*         RFY                                                      0097 00427000
*          (REG0,                                                  0097 00428000
*           REG1,                                                  0097 00429000
*           RETCODE) RSTD;                                         0097 00430000
@RF00092 DS    0H                                                  0098 00431000
*         REG0=WTOREG0;                                            0098 00432000
         L     @14,@PC00001+16                                     0098 00433000
         L     REG0,WTOREG0(,@14)                                  0098 00434000
*         REG1=ADDR(WTOAREA);       /* PASS THE MLWTO CONTINUATION 0099 00435000
*                                      PARM LIST BUILT               */ 00436000
         L     REG1,@PC00001+20                                    0099 00437000
         LA    REG1,WTOAREA(,REG1)                                 0099 00438000
*MLWTO:                                                            0100 00439000
*         GEN SETS(REG1) REFS(REG0,WTOAREA) CODE(WTO MF=(E,(1)) ); 0100 00440000
MLWTO    WTO MF=(E,(1))                                                 00441000
*         IF RETCODE¬=0             /* CHECK THE RETURN CODE         */ 00442000
*           THEN                    /* IF IT INDICATES AN ERROR      */ 00443000
         LTR   RETCODE,RETCODE                                     0101 00444000
         BZ    @RF00101                                            0101 00445000
*           WAREAPTR=WTOERROR;      /* SET WAREAPTR SO THAT NO     0102 00446000
*                                      ADDITIONAL ATTEMPTS WILL BE 0102 00447000
*                                      MADE TO PASS DATA TO WTO      */ 00448000
         L     @14,@PC00001+20                                     0102 00449000
         MVC   WAREAPTR(4,@14),@CF00190                            0102 00450000
*         ELSE                      /* IF THE WTO WENT OK            */ 00451000
*           WAREAPTR=ADDR(WTOAREA); /* SHOW THAT THE WTOAREA IS EMPTY   00452000
*                                      AND A NEW PARM LIST WILL HAVE    00453000
*                                      TO BE STARTED                 */ 00454000
         B     @RC00101                                            0103 00455000
@RF00101 L     @14,@PC00001+20                                     0103 00456000
         LA    @10,WTOAREA(,@14)                                   0103 00457000
         ST    @10,WAREAPTR(,@14)                                  0103 00458000
*         RFY                                                      0104 00459000
*          (REG0,                                                  0104 00460000
*           REG1,                                                  0104 00461000
*           RETCODE) UNRSTD;                                       0104 00462000
@RC00101 DS    0H                                                  0105 00463000
*       END;                                                       0105 00464000
*     CONTINUE=BITON;               /* INDICATED THAT THE LINE AFTER    00465000
*                                      THIS MUST BE A CONTINUATION   */ 00466000
@RF00090 OI    CONTINUE,B'10000000'                                0106 00467000
*   END;                            /* OF PROCESSING WHOLE INPUT LINE*/ 00468000
@DE00031 CR    START,ENDPTR                                        0107 00469000
         BL    @DL00031                                            0107 00470000
*   END IEECB912                                                   0108 00471000
*                                                                  0108 00472000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00473000
*/*%INCLUDE SYSLIB  (IEZWPL  )                                       */ 00474000
*                                                                  0108 00475000
*       ;                                                          0108 00476000
@EL00001 L     @13,4(,@13)                                         0108 00477000
@EF00001 L     @00,@SIZDATD                                        0108 00478000
         LR    @01,@11                                             0108 00479000
         FREEMAIN R,LV=(0),A=(1)                                        00480000
@ER00001 LM    @14,@12,12(@13)                                     0108 00481000
         BR    @14                                                 0108 00482000
@DATA    DS    0H                                                       00483000
@CH00062 DC    H'1'                                                     00484000
@CH00180 DC    H'4'                                                     00485000
@SM00232 MVC   WPLTXT(0,@03),BLANKS                                     00486000
@SM00234 MVC   WPLTXT(0,@07),CHARSTR(START)                             00487000
@SM00236 MVC   WPLTXT(0,@15),BLANKS                                     00488000
@DATD    DSECT                                                          00489000
         DS    0F                                                       00490000
@SA00001 DS    18F                                                      00491000
@PC00001 DS    6F                                                       00492000
IEECB912 CSECT                                                          00493000
         DS    0F                                                       00494000
@CF00190 DC    XL4'FFFFFFFF'                                            00495000
@DATD    DSECT                                                          00496000
         DS    0D                                                       00497000
CONTINUE DS    BL1                                                      00498000
IEECB912 CSECT                                                          00499000
         DS    0F                                                       00500000
@SIZDATD DC    AL1(0)                                                   00501000
         DC    AL3(@ENDDATD-@DATD)                                      00502000
         DS    0D                                                       00503000
BLANKS   DC    CL70' '                                                  00504000
IEECB912 CSECT                                                          00505000
WTOLIST  WTO   ('TEXT',C),('TEXT',L),('TEXT',D),('TEXT',DE),MF=L        00506000
@DATD    DSECT                                                          00507000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00508000
@ENDDATD EQU   *                                                        00509000
IEECB912 CSECT                                                          00510000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00511000
@01      EQU   01                                                       00512000
@02      EQU   02                                                       00513000
@03      EQU   03                                                       00514000
@04      EQU   04                                                       00515000
@05      EQU   05                                                       00516000
@06      EQU   06                                                       00517000
@07      EQU   07                                                       00518000
@08      EQU   08                                                       00519000
@09      EQU   09                                                       00520000
@10      EQU   10                                                       00521000
@11      EQU   11                                                       00522000
@12      EQU   12                                                       00523000
@13      EQU   13                                                       00524000
@14      EQU   14                                                       00525000
@15      EQU   15                                                       00526000
LSTFLGP  EQU   @03                                                      00527000
WTOLEN   EQU   @07                                                      00528000
SCANPTR  EQU   @03                                                      00529000
SCANEND  EQU   @08                                                      00530000
TRUELEN  EQU   @04                                                      00531000
MAXLEN   EQU   @03                                                      00532000
ENDPTR   EQU   @06                                                      00533000
START    EQU   @05                                                      00534000
WPLPTR   EQU   @02                                                      00535000
REG0     EQU   @00                                                      00536000
REG1     EQU   @01                                                      00537000
RETCODE  EQU   @15                                                      00538000
WPLRF    EQU   0                                                        00539000
WPLRPTR  EQU   WPLRF                                                    00540000
WPL      EQU   0                                                        00541000
WPLLGH   EQU   WPL                                                      00542000
WPLMCSF  EQU   WPL+2                                                    00543000
WPLMCSF1 EQU   WPLMCSF                                                  00544000
WPLMCSF2 EQU   WPLMCSF+1                                                00545000
WPLTXT   EQU   WPL+4                                                    00546000
WPLFLGS  EQU   0                                                        00547000
WPLDESC  EQU   WPLFLGS                                                  00548000
WPLDESC1 EQU   WPLDESC                                                  00549000
WPLDESC2 EQU   WPLDESC+1                                                00550000
WPLROUT  EQU   WPLFLGS+2                                                00551000
WPLROUT1 EQU   WPLROUT                                                  00552000
WPLROUT2 EQU   WPLROUT+1                                                00553000
WPLMSGTY EQU   WPLFLGS+4                                                00554000
WPLMSGT1 EQU   WPLMSGTY                                                 00555000
WPLMSGT2 EQU   WPLMSGTY+1                                               00556000
WPLLS01  EQU   0                                                        00557000
WPLLTF   EQU   WPLLS01                                                  00558000
WPLLTF1  EQU   WPLLTF                                                   00559000
WPLLINES EQU   WPLLS01+3                                                00560000
WPLML    EQU   0                                                        00561000
WPLMLLTF EQU   WPLML+2                                                  00562000
WPLMLLT1 EQU   WPLMLLTF                                                 00563000
CHARSTR  EQU   0                                                        00564000
CHAR     EQU   0                                                        00565000
NUMLINES EQU   0                                                        00566000
LSTFLG   EQU   0                                                        00567000
TEXTLINE EQU   0                                                        00568000
TEXTLEN  EQU   TEXTLINE                                                 00569000
TEXT     EQU   TEXTLINE+1                                               00570000
SCANBACK EQU   0                                                        00571000
CONTCOL  EQU   0                                                        00572000
LINETYPE EQU   0                                                        00573000
WTOREG0  EQU   0                                                        00574000
WTRTNWKA EQU   0                                                        00575000
WAREAPTR EQU   WTRTNWKA                                                 00576000
NUMLNPTR EQU   WTRTNWKA+4                                               00577000
WTOAREA  EQU   WTRTNWKA+8                                               00578000
WTODUMMY EQU   WTOLIST                                                  00579000
WD1      EQU   WTODUMMY+12                                              00580000
WD2      EQU   WTODUMMY+20                                              00581000
WD3      EQU   WTODUMMY+28                                              00582000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00583000
@NM00004 EQU   WTODUMMY                                                 00584000
@NM00003 EQU   WTOREG0+3                                                00585000
@NM00002 EQU   WTOREG0                                                  00586000
WPLMLTXT EQU   WPLML+4                                                  00587000
WPLMLLT2 EQU   WPLMLLTF+1                                               00588000
WPLRSV24 EQU   WPLMLLT1                                                 00589000
WPLRSV23 EQU   WPLMLLT1                                                 00590000
WPLRSV22 EQU   WPLMLLT1                                                 00591000
WPLRSV21 EQU   WPLMLLT1                                                 00592000
WPLMLLTD EQU   WPLMLLT1                                                 00593000
WPLMLLTC EQU   WPLMLLT1                                                 00594000
WPLMLLTB EQU   WPLMLLT1                                                 00595000
WPLMLLTA EQU   WPLMLLT1                                                 00596000
WPLMLLEN EQU   WPLML+1                                                  00597000
WPLML0   EQU   WPLML                                                    00598000
WPLAREA  EQU   WPLLS01+2                                                00599000
WPLLTF2  EQU   WPLLTF+1                                                 00600000
WPLRSV20 EQU   WPLLTF1                                                  00601000
WPLRSV19 EQU   WPLLTF1                                                  00602000
WPLRSV18 EQU   WPLLTF1                                                  00603000
WPLRSV17 EQU   WPLLTF1                                                  00604000
WPLLTFD  EQU   WPLLTF1                                                  00605000
WPLLTFC  EQU   WPLLTF1                                                  00606000
WPLLTFB  EQU   WPLLTF1                                                  00607000
WPLLTFA  EQU   WPLLTF1                                                  00608000
WPLQID   EQU   WPLFLGS+6                                                00609000
WPLRSV32 EQU   WPLMSGT2                                                 00610000
WPLRSV31 EQU   WPLMSGT2                                                 00611000
WPLRSV30 EQU   WPLMSGT2                                                 00612000
WPLRSV29 EQU   WPLMSGT2                                                 00613000
WPLRSV28 EQU   WPLMSGT2                                                 00614000
WPLRSV27 EQU   WPLMSGT2                                                 00615000
WPLRSV26 EQU   WPLMSGT2                                                 00616000
WPLRSV25 EQU   WPLMSGT2                                                 00617000
WPLRSV16 EQU   WPLMSGT1                                                 00618000
WPLRSV15 EQU   WPLMSGT1                                                 00619000
WPLMSGTF EQU   WPLMSGT1                                                 00620000
WPLRSV14 EQU   WPLMSGT1                                                 00621000
WPLMSGTD EQU   WPLMSGT1                                                 00622000
WPLMSGTC EQU   WPLMSGT1                                                 00623000
WPLMSGTB EQU   WPLMSGT1                                                 00624000
WPLMSGTA EQU   WPLMSGT1                                                 00625000
WPLRSV13 EQU   WPLROUT2                                                 00626000
WPLROUTO EQU   WPLROUT2                                                 00627000
WPLROUTN EQU   WPLROUT2                                                 00628000
WPLROUTM EQU   WPLROUT2                                                 00629000
WPLROUTL EQU   WPLROUT2                                                 00630000
WPLROUTK EQU   WPLROUT2                                                 00631000
WPLROUTJ EQU   WPLROUT2                                                 00632000
WPLROUTI EQU   WPLROUT2                                                 00633000
WPLROUTH EQU   WPLROUT1                                                 00634000
WPLROUTG EQU   WPLROUT1                                                 00635000
WPLROUTF EQU   WPLROUT1                                                 00636000
WPLROUTE EQU   WPLROUT1                                                 00637000
WPLROUTD EQU   WPLROUT1                                                 00638000
WPLROUTC EQU   WPLROUT1                                                 00639000
WPLROUTB EQU   WPLROUT1                                                 00640000
WPLROUTA EQU   WPLROUT1                                                 00641000
WPLRSV12 EQU   WPLDESC2                                                 00642000
WPLRSV11 EQU   WPLDESC2                                                 00643000
WPLRSV10 EQU   WPLDESC2                                                 00644000
WPLRSV09 EQU   WPLDESC2                                                 00645000
WPLRSV08 EQU   WPLDESC2                                                 00646000
WPLRSV07 EQU   WPLDESC2                                                 00647000
WPLDESCJ EQU   WPLDESC2                                                 00648000
WPLDESCI EQU   WPLDESC2                                                 00649000
WPLDESCH EQU   WPLDESC1                                                 00650000
WPLDESCG EQU   WPLDESC1                                                 00651000
WPLDESCF EQU   WPLDESC1                                                 00652000
WPLDESCE EQU   WPLDESC1                                                 00653000
WPLDESCD EQU   WPLDESC1                                                 00654000
WPLDESCC EQU   WPLDESC1                                                 00655000
WPLDESCB EQU   WPLDESC1                                                 00656000
WPLDESCA EQU   WPLDESC1                                                 00657000
WPLTXTL  EQU   WPLTXT+125                                               00658000
@NM00001 EQU   WPLTXT                                                   00659000
WPLRSV05 EQU   WPLMCSF2                                                 00660000
WPLRSV04 EQU   WPLMCSF2                                                 00661000
WPLMCSFN EQU   WPLMCSF2                                                 00662000
WPLRSV03 EQU   WPLMCSF2                                                 00663000
WPLNOWTP EQU   WPLMCSF2                                                 00664000
WPLMCSFK EQU   WPLMCSF2                                                 00665000
WPLMCSFJ EQU   WPLMCSF2                                                 00666000
WPLMCSFI EQU   WPLMCSF2                                                 00667000
WPLMCSFH EQU   WPLMCSF1                                                 00668000
WPLMCSFG EQU   WPLMCSF1                                                 00669000
WPLMCSFF EQU   WPLMCSF1                                                 00670000
WPLMCSFE EQU   WPLMCSF1                                                 00671000
WPLMCSFD EQU   WPLMCSF1                                                 00672000
WPLMCSFC EQU   WPLMCSF1                                                 00673000
WPLMCSFB EQU   WPLMCSF1                                                 00674000
WPLMCSFA EQU   WPLMCSF1                                                 00675000
WPLRECB  EQU   WPLRF+4                                                  00676000
WPLRPTRA EQU   WPLRPTR+1                                                00677000
WPLRLN   EQU   WPLRPTR                                                  00678000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00679000
@ENDDATA EQU   *                                                        00680000
         END   IEECB912,(C'PLS2200',0701,77006)                         00681000
./  ADD  SSI=70470634,NAME=IEEMB815
         TITLE 'IEEMB815 - CHNGDUMP COMMAND PROCESSOR                  *00001000
                        '                                               00002000
IEEMB815 CSECT ,                                                   0001 00003000
@MAINENT DS    0H                                                  0001 00004000
         USING *,@15                                               0001 00005000
         B     @PROLOG                                             0001 00006000
         DC    AL1(19)                                             0001 00007000
         DC    C'IEEMB815R0300077047'                              0001 00008000
         DROP  @15                                                      00009000
@PROLOG  BALR  @12,0                                               0001 00010000
@PSTART  LA    @10,4095(,@12)                                      0001 00011000
         USING @PSTART,@12                                         0001 00012000
         USING @PSTART+4095,@10                                    0001 00013000
         L     @00,@SIZDATD                                        0001 00014000
         GETMAIN  R,LV=(0)                                              00015000
         LR    @08,@01                                             0001 00016000
         USING @DATD,@08                                           0001 00017000
         ST    @13,@SA00001+4                                      0001 00018000
         LR    @13,@08                                             0001 00019000
*                                                                  0082 00020000
*   /*****************************************************************/ 00021000
*   /*                                                               */ 00022000
*   /* GET AND INITIALIZE WORKAREA                                   */ 00023000
*   /*                                                               */ 00024000
*   /*****************************************************************/ 00025000
*                                                                  0082 00026000
*   PART1=''B;                      /* CLEAR FIRST PART OF WORKAREA  */ 00027000
         XC    PART1(88),PART1                                     0082 00028000
*   XSASAVE=XSAPTR;                 /* SAVE PTR TO XSA               */ 00029000
         ST    XSAPTR,XSASAVE                                      0083 00030000
*   START=XAL;                      /* INITIALIZE PTR TO OPERAND     */ 00031000
*                                                                  0084 00032000
         SLR   START,START                                         0084 00033000
         ICM   START,7,XAL(XSAPTR)                                 0084 00034000
*   /*****************************************************************/ 00035000
*   /*                                                               */ 00036000
*   /* INITIALIZE TRANSLATE TABLE FOR FIRST SCAN INITIALIZE TRANSLATE*/ 00037000
*   /* TABLE TO ALL INVALIDS                                         */ 00038000
*   /*                                                               */ 00039000
*   /*****************************************************************/ 00040000
*                                                                  0085 00041000
*   TRANTBL(1)=INVLDCDE;            /* INITIALIZE FIRST BYTE OF    0085 00042000
*                                      TRANSLATE TABLE TO FUNCTION 0085 00043000
*                                      CODE FOR 'INVALIDS'   @G33CPHE*/ 00044000
         MVI   TRANTBL,X'07'                                       0085 00045000
*   MVC(TRANTBL(2:256),TRANTBL(1:255));/* PROPAGATE INVALIDS @G33CPHE*/ 00046000
         MVC   TRANTBL+1(255),TRANTBL                              0086 00047000
*   TRANTBL(','+1)=COMMACDE;        /* STOPPER CHARACTER AFTER 'SET'    00048000
*                                      OR 'DEL' CAN BE COMMA @G33CPHE*/ 00049000
         MVI   TRANTBL+107,X'02'                                   0087 00050000
*   TRANTBL(' '+1)=EOCMDCDE;        /* STOPPER CHARACTER CAN ALSO BE    00051000
*                                      A BLANK AFTER 'DEL'   @G33CPHE*/ 00052000
         MVI   TRANTBL+64,X'03'                                    0088 00053000
*   TRANTBL('='+1)=UNEXPCDE;        /* A VALID BUT CURRENTLY       0089 00054000
*                                      UNEXPECTED DELIMITER  @G33CPHE*/ 00055000
         MVI   TRANTBL+126,X'06'                                   0089 00056000
*   TRANTBL('('+1)=UNEXPCDE;        /* A VALID BUT CURRENTLY       0090 00057000
*                                      UNEXPECTED DELIMITER  @G33CPHE*/ 00058000
         MVI   TRANTBL+77,X'06'                                    0090 00059000
*   TRANTBL(')'+1)=UNEXPCDE;        /* A VALID BUT CURRENTLY       0091 00060000
*                                      UNEXPECTED DELIMITER  @G33CPHE*/ 00061000
*                                                                  0091 00062000
         MVI   TRANTBL+93,X'06'                                    0091 00063000
*   /*****************************************************************/ 00064000
*   /*                                                               */ 00065000
*   /* DON'T STOP TRANSLATE ON ALPHABETIC CHARACTERS                 */ 00066000
*   /*                                                               */ 00067000
*   /*****************************************************************/ 00068000
*                                                                  0092 00069000
*   TRANTBL('A'+1:'I'+1)=TRANTBL('A'+1:'I'+1)&&TRANTBL('A'+1:'I'+1);    00070000
         XC    TRANTBL+193(9),TRANTBL+193                          0092 00071000
*   TRANTBL('J'+1:'R'+1)=TRANTBL('J'+1:'R'+1)&&TRANTBL('J'+1:'R'+1);    00072000
         XC    TRANTBL+209(9),TRANTBL+209                          0093 00073000
*   TRANTBL('S'+1:'Z'+1)=TRANTBL('S'+1:'Z'+1)&&TRANTBL('S'+1:'Z'+1);    00074000
         XC    TRANTBL+226(8),TRANTBL+226                          0094 00075000
*   TRANTBL('0'+1:'9'+1)=TRANTBL('0'+1:'9'+1)&&TRANTBL('0'+1:'9'+1);    00076000
         XC    TRANTBL+240(10),TRANTBL+240                         0095 00077000
*   ENP=0;                          /* INITIALIZE PTR TO LAST CHAR 0096 00078000
*                                      TRANSLATED                    */ 00079000
         SLR   ENP,ENP                                             0096 00080000
*   PKEY1='1'B;                     /* INDICATE 'SET', 'DEL', OR   0097 00081000
*                                      'RESET' IS EXPECTED (FIRST  0097 00082000
*                                      POSITION KEYWORD)     @G33CPHE*/ 00083000
         OI    PKEY1,B'10000000'                                   0097 00084000
*   DT=0;                           /* CLEAR DUMP TYPE INDICATOR   0098 00085000
*                                                            @G33CPHE*/ 00086000
         SLR   DT,DT                                               0098 00087000
*   MSGID='00'X;                    /* CLEAR MESSAGE INDEX   @G33CPHE*/ 00088000
         MVI   MSGID,X'00'                                         0099 00089000
*   R14SVC34=R14;                   /* RET ADDRESS OF SVC 34 ROUTER  */ 00090000
         ST    R14,R14SVC34                                        0100 00091000
*   IF START=0                      /* IS THERE ANY OPERAND ?        */ 00092000
*     THEN                          /* NO                            */ 00093000
         LTR   START,START                                         0101 00094000
         BNZ   @RF00101                                            0101 00095000
*     MSGID=IEE305;                 /* MSG INDEX FOR KEYWORD MISSING    00096000
*                                                            @G33CPHE*/ 00097000
         MVI   MSGID,X'05'                                         0102 00098000
*   ELSE                                                           0103 00099000
*     DO;                                                          0103 00100000
         B     @RC00101                                            0103 00101000
@RF00101 DS    0H                                                  0104 00102000
*       OPLNTH=10;                  /* INITIALIZE TO ONE MORE THAN 0104 00103000
*                                      MAXIMUM KEYWORD LENGTH        */ 00104000
         LA    OPLNTH,10                                           0104 00105000
*       STOPPER=0;                  /* INITIALIZE REG USED TO HOLD 0105 00106000
*                                      TRANSLATE STOPPER VALUE       */ 00107000
         SLR   STOPPER,STOPPER                                     0105 00108000
*                                                                  0106 00109000
*       /*************************************************************/ 00110000
*       /*                                                           */ 00111000
*       /* THIS IS THE CONTROLLER SEGMENT OF THE CHNGDUMP COMMAND    */ 00112000
*       /* PROCESSOR. IT CALCULATES THE LENGTH OF THE KEYWORD OR     */ 00113000
*       /* PARAMETER ENCOUNTERED, THE LENGTH OF THE OPERAND REMAINING*/ 00114000
*       /* TO BE TRANSLATED. IT MAINTAINS POINTERS TO THE CURRENT    */ 00115000
*       /* KEYWORD, CALLS TRANSLATE AND CALLS INTERNAL PROCEDURES TO */ 00116000
*       /* PROCESS THE DELIMITERS ENCOUNTERED.                       */ 00117000
*       /*                                                           */ 00118000
*       /*************************************************************/ 00119000
*                                                                  0106 00120000
*       DO                          /* CONTROLS TRT OF OPERAND       */ 00121000
*             WHILE(MSGID='00'X);   /* TRT UNTIL END OF OPERAND OR 0106 00122000
*                                      ERROR                 @G33CPHE*/ 00123000
         B     @DE00106                                            0106 00124000
@DL00106 DS    0H                                                  0107 00125000
*         ERRTXTP=START;            /* POINT TO THE TEXT TO BE     0107 00126000
*                                      SCANNED NEXT AS THE TEXT TO BE   00127000
*                                      PUT INTO AN ERROR MSG @G33CPHE*/ 00128000
         ST    START,ERRTXTP                                       0107 00129000
*         GEN REFS(OPLNTH,TRTIN,TRANTBL,OPERAND) SETS(ENP,STOPPER);     00130000
        EX   OPLNTH,TRTIN          EXECUTE TRT INSTRUCTION FOR FULL     00131000
*                                  LENGTH OF OPERAND NOT YET            00132000
*                                  TRANSLATED                           00133000
*         BC(8,NOSTOPER);           /* UNINTERUPTED TRT SCAN         */ 00134000
         BC    8,NOSTOPER                                          0109 00135000
*/* AFTER THE TRT ENP=ADDR OF CHAR THAT CAUSED TRT TO STOP AND     0110 00136000
*   STOPPER=FUNCTION CODE FROM TRANTBL THAT CAUSED THE STOP   @G33CPHE  00137000
*                                                                    */ 00138000
*                                                                  0110 00139000
*         LEN=ENP-START;            /* DETERMINE LENGTH OF KEYWORD OR   00140000
*                                      PARAMETER JUST ISOLATED       */ 00141000
         LR    LEN,ENP                                             0110 00142000
         SLR   LEN,START                                           0110 00143000
*         CALL BRTABLE(STOPPER);    /* GO TO PROPER DELIMITER      0111 00144000
*                                      SUBROUTINE TO PROCESS THIS  0111 00145000
*                                      PART OF OPERAND               */ 00146000
         LR    @06,STOPPER                                         0111 00147000
         SLA   @06,2                                               0111 00148000
         L     @15,BRTABLE-4(@06)                                  0111 00149000
         BALR  @14,@15                                             0111 00150000
*         STOPSAVE=STOPPER;         /* SAVE TO DETERMINE PREVIOUS  0112 00151000
*                                      STOPPER CHARACTER             */ 00152000
         STC   STOPPER,STOPSAVE                                    0112 00153000
*         START=ENP+1;                                             0113 00154000
         LA    START,1                                             0113 00155000
         ALR   START,ENP                                           0113 00156000
*       END;                                                       0114 00157000
@DE00106 CLI   MSGID,X'00'                                         0114 00158000
         BE    @DL00106                                            0114 00159000
*       GO TO CONTINUE;             /* BRANCH AROUND MAX LENGTH PARM    00160000
*                                      ERROR HANDLING                */ 00161000
         B     CONTINUE                                            0115 00162000
*NOSTOPER:                                                         0116 00163000
*       MSGID=IEE308;               /* MSG INDEX FOR TERM LENGTH   0116 00164000
*                                      ERROR -- ISOLATED PARM EXCEEDS   00165000
*                                      MAXIMUM ALLOWABLE     @G33CPHE*/ 00166000
NOSTOPER MVI   MSGID,X'08'                                         0116 00167000
*CONTINUE:                          /* RESUME NORMAL PROCESSING      */ 00168000
*     END;                                                         0117 00169000
CONTINUE DS    0H                                                  0118 00170000
*   RESPECIFY                                                      0118 00171000
*    (OPSETPTR,                                                    0118 00172000
*     STOPPER,                                                     0118 00173000
*     ENP) UNRESTRICTED;                                           0118 00174000
*                                                                  0118 00175000
@RC00101 DS    0H                                                  0119 00176000
*   /*****************************************************************/ 00177000
*   /*                                                               */ 00178000
*   /* UPDATE THE RTCT WITH THE NEW EFFECTIVE DUMP OPTIONS IF THE    */ 00179000
*   /* MSGID IS NOT AN ERROR ONE.                            @G33CPHE*/ 00180000
*   /*                                                               */ 00181000
*   /*****************************************************************/ 00182000
*                                                                  0119 00183000
*   IF MSGID=IEE712                 /* IS THIS THE PROCESSING      0119 00184000
*                                      COMPLETE MSG?         @G33CPHE*/ 00185000
*     THEN                          /* YES SO GO AHEAD WITH THE RTCT    00186000
*                                      UPDATE                @G33CPHE*/ 00187000
         CLI   MSGID,X'03'                                         0119 00188000
         BNE   @RF00119                                            0119 00189000
*     IF DT=ALL                     /* CHECK TO SEE IF ALL THE DUMP     00190000
*                                      TYPES MUST BE UPDATED OR JUST    00191000
*                                      ONE                   @G33CPHE*/ 00192000
*       THEN                                                       0120 00193000
         LTR   DT,DT                                               0120 00194000
         BNZ   @RF00120                                            0120 00195000
*       DO DT=1 TO DIM(RTCTOPTS);   /* IF ALL THE DUMP TYPES ARE   0121 00196000
*                                      INVOLVED LOOP DOING EACH ONE     00197000
*                                      AT A TIME             @G33CPHE*/ 00198000
         LA    DT,1                                                0121 00199000
@DL00121 DS    0H                                                  0122 00200000
*         CALL UPDTERTN;            /* THIS SUBROUTINE WILL UPDATE 0122 00201000
*                                      THE RTCT EFFECTIVE DUMP OPTION   00202000
*                                      CORRESPONDING TO THE DT     0122 00203000
*                                                            @G33CPHE*/ 00204000
         BAL   @14,UPDTERTN                                        0122 00205000
*       END;                        /*                       @G33CPHE*/ 00206000
         AH    DT,@CH00065                                         0123 00207000
         CH    DT,@CH00057                                         0123 00208000
         BNH   @DL00121                                            0123 00209000
*     ELSE                                                         0124 00210000
*       CALL UPDTERTN;              /* UPDATE THE EFFECTIVE RTCT   0124 00211000
*                                      OPTIONS FOR THE DUMP TYPE   0124 00212000
*                                      SPECIFIED (DT)        @G33CPHE*/ 00213000
         B     @RC00120                                            0124 00214000
@RF00120 BAL   @14,UPDTERTN                                        0124 00215000
*   XSAPTR=XSASAVE;                 /* RESTORE PTR TO XSA            */ 00216000
@RC00120 DS    0H                                                  0125 00217000
@RF00119 L     XSAPTR,XSASAVE                                      0125 00218000
*   XAE=MSGID;                      /* PUT MSG INDEX INTO XSA      0126 00219000
*                                                            @G33CPHE*/ 00220000
         MVC   XAE(1,XSAPTR),MSGID                                 0126 00221000
*   IF MSGID¬=IEE712&MSGID¬=IEE305  /* IS THE MSG ONE THAT NEEDS THE    00222000
*                                      ERROR TEXT INSERTED   @G33CPHE*/ 00223000
*       &START¬=0                   /* AND IS THERE TEXT TO BE     0127 00224000
*                                      INSERTED INTO THE MSG TEXT  0127 00225000
*                                                            @G33CPHE*/ 00226000
*     THEN                          /* YES                   @G33CPHE*/ 00227000
         CLI   MSGID,X'03'                                         0127 00228000
         BE    @RF00127                                            0127 00229000
         CLI   MSGID,X'05'                                         0127 00230000
         BE    @RF00127                                            0127 00231000
         LTR   START,START                                         0127 00232000
         BZ    @RF00127                                            0127 00233000
*     DO;                           /*                       @G33CPHE*/ 00234000
*       IF LEN<LENGTH(XAV)          /* IS THE LENGTH OF THE ERROR  0129 00235000
*                                      PARM TEXT LESS THAN THE     0129 00236000
*                                      VARIABLE SECTION OF THE MSG 0129 00237000
*                                                            @G33CPHE*/ 00238000
*         THEN                      /* YES IT IS             @G33CPHE*/ 00239000
         CH    LEN,@CH00063                                        0129 00240000
         BNL   @RF00129                                            0129 00241000
*         LEN=LEN+1;                /* SO INCREASE IT BY ONE TO    0130 00242000
*                                      INCLUDE THE DELIMITER THAT  0130 00243000
*                                      FOLLOWS IT            @G33CPHE*/ 00244000
         AH    LEN,@CH00065                                        0130 00245000
*       ELSE                        /* OTHERWISE IF IT IS TOO LONG 0131 00246000
*                                                            @G33CPHE*/ 00247000
*         LEN=LENGTH(XAV);          /* TRUNCATE IT           @G33CPHE*/ 00248000
         B     @RC00129                                            0131 00249000
@RF00129 LA    LEN,8                                               0131 00250000
*       XAV='        ';             /* INIT THE VARIABLE AREA TO   0132 00251000
*                                      BLANKS                @G33CPHE*/ 00252000
@RC00129 MVC   XAV(8,XSAPTR),@CC02081                              0132 00253000
*       XAV(1:LEN)=ERRTXT(1:LEN);   /* AND MOVE IN THE OFFENDING PARM   00254000
*                                                            @G33CPHE*/ 00255000
         LR    @15,LEN                                             0133 00256000
         BCTR  @15,0                                               0133 00257000
         L     @05,ERRTXTP                                         0133 00258000
         EX    @15,@SM02259                                        0133 00259000
*     END;                          /* OR ERROR TEXT INSERTION     0134 00260000
*                                                            @G33CPHE*/ 00261000
*   CALL IEE2103D;                  /* ISSUE MESSAGE TO INDICATE   0135 00262000
*                                      SUCCESS OR FAILURE OF COMMAND */ 00263000
@RF00127 L     @15,@CV02052                                        0135 00264000
         BALR  @14,@15                                             0135 00265000
*   R14=R14SVC34;                   /* RESTORE RETURN ADDRESS OF   0136 00266000
*                                      CHNGDUMP CALLER       @G33CPHE*/ 00267000
         L     R14,R14SVC34                                        0136 00268000
*   RETURN;                                                        0137 00269000
@EL00001 L     @13,4(,@13)                                         0137 00270000
@EF00001 L     @00,@SIZDATD                                        0137 00271000
         LR    @01,@08                                             0137 00272000
         FREEMAIN R,LV=(0),A=(1)                                        00273000
@ER00001 BR    @14                                                 0137 00274000
*   RESPECIFY                                                      0138 00275000
*    (OPSETPTR,                                                    0138 00276000
*     STOPPER,                                                     0138 00277000
*     ENP) RESTRICTED;                                             0138 00278000
*CHDLPARN:                                                         0139 00279000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0139 00280000
*                                                                  0139 00281000
CHDLPARN DS    0H                                                  0140 00282000
*   /*****************************************************************/ 00283000
*   /*                                                               */ 00284000
*   /* THIS PROC HANDLES PROCESSING OF THE LEFT PARANTHESIS DELIMITER*/ 00285000
*   /*                                                               */ 00286000
*   /*****************************************************************/ 00287000
*                                                                  0140 00288000
*   LPARAN='1'B;                    /* INDICATE LEFT PARAN         0140 00289000
*                                      ENCOUNTERED                   */ 00290000
*                                                                  0140 00291000
         OI    LPARAN,B'00001000'                                  0140 00292000
*   /*****************************************************************/ 00293000
*   /*                                                               */ 00294000
*   /* RESET TRANSLATE TABLE FOR NEXT SCAN                           */ 00295000
*   /*                                                               */ 00296000
*   /*****************************************************************/ 00297000
*                                                                  0141 00298000
*   TRANTBL(')'+1)=RPARNCDE;        /* STOP ON RIGHT PARAN   @G33CPHE*/ 00299000
         MVI   TRANTBL+93,X'05'                                    0141 00300000
*   TRANTBL(','+1)=COMMACDE;        /* STOP ON COMMA         @G33CPHE*/ 00301000
         MVI   TRANTBL+107,X'02'                                   0142 00302000
*   TRANTBL('='+1)=UNEXPCDE;        /* EQUAL SIGN UNEXPECTED @G33CPHE*/ 00303000
         MVI   TRANTBL+126,X'06'                                   0143 00304000
*   TRANTBL(' '+1)=UNEXPCDE;        /* BLANK IS UNEXPECTED   @G33CPHE*/ 00305000
         MVI   TRANTBL+64,X'06'                                    0144 00306000
*   TRANTBL('('+1)=UNEXPCDE;        /* LEFT PARAN IS UNEXPECTED    0145 00307000
*                                                            @G33CPHE*/ 00308000
         MVI   TRANTBL+77,X'06'                                    0145 00309000
*   RETURN;                                                        0146 00310000
@EL00002 DS    0H                                                  0146 00311000
@EF00002 DS    0H                                                  0146 00312000
@ER00002 BR    @14                                                 0146 00313000
*   END CHDLPARN;                                                  0147 00314000
*CHDRPARN:                                                         0148 00315000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0148 00316000
*                                                                  0148 00317000
CHDRPARN DS    0H                                                  0149 00318000
*   /*****************************************************************/ 00319000
*   /*                                                               */ 00320000
*   /* HANDLES PROCESSING OF RIGHT PARANTHESIS. VALIDITY CHECKS FOR  */ 00321000
*   /* PREVIOUS LEFT PARANTHESIS AND OPTIONS EXPECTED. CALLS OPTION  */ 00322000
*   /* HANDLER TO PROCESS THE OPTION                                 */ 00323000
*   /*                                                               */ 00324000
*   /*****************************************************************/ 00325000
*                                                                  0149 00326000
*   R14SAVE=R14;                    /* SAVE RETURN ADDRESS TO      0149 00327000
*                                      MAINLINE PROCESSING BEFORE  0149 00328000
*                                      CALLING OPTION HANDLING     0149 00329000
*                                      SUBROUTINE                    */ 00330000
         ST    R14,R14SAVE                                         0149 00331000
*   CALL OPSET;                     /* GO TO OPTION HANDLER          */ 00332000
         LR    @15,OPSETPTR                                        0150 00333000
         BALR  @14,@15                                             0150 00334000
*   R14=R14SAVE;                    /* RESTORE RETURN ADDRESS TO   0151 00335000
*                                      MAINLINE PROCESSING           */ 00336000
         L     R14,R14SAVE                                         0151 00337000
*   LPARAN='0'B;                    /* REINITIALIZE LEFT PARANTHESIS    00338000
*                                      INDICATOR SINCE WE HAVE     0152 00339000
*                                      ENCOUNTERED THE MATCHING RIGHT   00340000
*                                      PARAN.                        */ 00341000
*   OPTIONX='0'B;                   /* NO MORE OPTIONS EXPECTED      */ 00342000
*                                                                  0153 00343000
         NI    LPARAN,B'11110011'                                  0153 00344000
*   /*****************************************************************/ 00345000
*   /*                                                               */ 00346000
*   /* RIGHT PARAN PROCESSOR - RESET TRANSLATE TABLE FOR NEXT SCAN   */ 00347000
*   /*                                                               */ 00348000
*   /*****************************************************************/ 00349000
*                                                                  0154 00350000
*   TRANTBL(','+1)=COMMACDE;        /* STOP ON COMMA         @G33CPHE*/ 00351000
         MVI   TRANTBL+107,X'02'                                   0154 00352000
*   TRANTBL(' '+1)=EOCMDCDE;        /* STOP ON BLANK         @G33CPHE*/ 00353000
         MVI   TRANTBL+64,X'03'                                    0155 00354000
*   TRANTBL('='+1)=UNEXPCDE;        /* EQUAL SIGN IS UNEXPECTED    0156 00355000
*                                                            @G33CPHE*/ 00356000
         MVI   TRANTBL+126,X'06'                                   0156 00357000
*   TRANTBL('('+1)=UNEXPCDE;        /* LEFT PARAN IS UNEXPECTED    0157 00358000
*                                                            @G33CPHE*/ 00359000
         MVI   TRANTBL+77,X'06'                                    0157 00360000
*   TRANTBL(')'+1)=UNEXPCDE;        /* RIGHT PARAN IS UNEXPECTED   0158 00361000
*                                                            @G33CPHE*/ 00362000
         MVI   TRANTBL+93,X'06'                                    0158 00363000
*   RETURN;                                                        0159 00364000
@EL00003 DS    0H                                                  0159 00365000
@EF00003 DS    0H                                                  0159 00366000
@ER00003 BR    @14                                                 0159 00367000
*   END CHDRPARN;                                                  0160 00368000
*CHDEQUAL:                                                         0161 00369000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0161 00370000
*                                                                  0161 00371000
CHDEQUAL DS    0H                                                  0162 00372000
*   /*****************************************************************/ 00373000
*   /*                                                               */ 00374000
*   /* THIS PROCESSES THE KEYWORDS WHICH ARE FOLLOWED BY THE EQUAL   */ 00375000
*   /* SIGN DELIMITER. POSSIBLE KEYWORDS IN THIS POSITION ARE        */ 00376000
*   /* PDATA,SDATA,Q OR SDUMP. THE OPTIONS EXPECTED FLAG IS TURNED ON*/ 00377000
*   /* AND THE KEYWORDS ARE SYNTAX CHECKED. IF AN ERROR IS DETECTED, */ 00378000
*   /* IT WILL BE FLAGGED AS UNIDENTIFIABLE KEYWORD.                 */ 00379000
*   /*                                                               */ 00380000
*   /*****************************************************************/ 00381000
*                                                                  0162 00382000
*   IF OPTIONX='0'B THEN                                           0162 00383000
         TM    OPTIONX,B'00000100'                                 0162 00384000
         BNZ   @RF00162                                            0162 00385000
*     IF KEY3='1'B                  /* EXPECTING 3RD POSITION      0163 00386000
*                                      KEYWORD?                      */ 00387000
*       THEN                                                       0163 00388000
         TM    KEY3,B'00100000'                                    0163 00389000
         BNO   @RF00163                                            0163 00390000
*       DO;                         /* YES- MUST BE PDATA,SDATA OR Q    00391000
*                                                             @G33CPH*/ 00392000
*         KEY31=OFF;                /* AN EXCLUSIVE 3RD POS KEYWORD     00393000
*                                      IS NO LONGER POSSIBLE @G33CPHE*/ 00394000
         NI    KEY31,B'11101111'                                   0165 00395000
*         IF DT=SADINDEX|DT=SUDINDEX/* SYSABEND OR SYSUDUMP SPECIFIED   00396000
*                                                            @G33CPHE*/ 00397000
*             &LEN=5                /*                       @G33CPHE*/ 00398000
*           THEN                    /* YES                           */ 00399000
         CH    DT,@CH00065                                         0166 00400000
         BE    @RT00166                                            0166 00401000
         CH    DT,@CH00077                                         0166 00402000
         BNE   @RF00166                                            0166 00403000
         CH    LEN,@CH00770                                        0166 00404000
         BNE   @RF00166                                            0166 00405000
@RT00166 DS    0H                                                  0167 00406000
*           DO;                     /*                       @G33CPHE*/ 00407000
*             OPTIONX=ON;           /*                       @G33CPHE*/ 00408000
         OI    OPTIONX,B'00000100'                                 0168 00409000
*             IF OPERAND(1:5)='PDATA'/*                      @G33CPHE*/ 00410000
*               THEN                                               0169 00411000
         CLC   OPERAND(5,START),@CC02091                           0169 00412000
         BNE   @RF00169                                            0169 00413000
*               DO;                                                0170 00414000
*                 PDATAKEY='1'B;                                   0171 00415000
         OI    PDATAKEY,B'00010000'                                0171 00416000
*                 OPSETPTR=ADDR(CHDPDATA);/* SET PTR TO OPTION     0172 00417000
*                                      HANDLER FOR PDATA OPTIONS     */ 00418000
         LA    OPSETPTR,CHDPDATA                                   0172 00419000
*               END;                                               0173 00420000
*             ELSE                                                 0174 00421000
*               IF OPERAND(1:5)='SDATA'/* SDATA KEYWORD ?    @G33CPHE*/ 00422000
*                 THEN              /* YES                           */ 00423000
         B     @RC00169                                            0174 00424000
@RF00169 CLC   OPERAND(5,START),@CC02093                           0174 00425000
         BNE   @RF00174                                            0174 00426000
*                 DO;                                              0175 00427000
*                   SDATAKEY='1'B;  /* INDICATE SDATA SPECIFIED      */ 00428000
         OI    SDATAKEY,B'00100000'                                0176 00429000
*                   OPSETPTR=ADDR(CHDSDATA);/* SET PTR TO OPTION   0177 00430000
*                                      HANDLER FOR SDATA OPTIONS     */ 00431000
         LA    OPSETPTR,CHDSDATA                                   0177 00432000
*                 END;                                             0178 00433000
*               ELSE                                               0179 00434000
*                 MSGID=IEE309;     /* KEYWORD NOT VALID FOR 3ND   0179 00435000
*                                      POSITIONAL FOLLOWED BY AN = 0179 00436000
*                                                            @G33CPHE*/ 00437000
         B     @RC00174                                            0179 00438000
@RF00174 MVI   MSGID,X'09'                                         0179 00439000
*           END;                    /*                       @G33CPHE*/ 00440000
*         ELSE                                                     0181 00441000
*           IF DT=SVDINDEX&LEN=1&OPERAND(1)='Q'/* Q= KEYWORD @G33CPHE*/ 00442000
*             THEN                                                 0181 00443000
         B     @RC00166                                            0181 00444000
@RF00166 CH    DT,@CH00057                                         0181 00445000
         BNE   @RF00181                                            0181 00446000
         CH    LEN,@CH00065                                        0181 00447000
         BNE   @RF00181                                            0181 00448000
         CLI   OPERAND(START),C'Q'                                 0181 00449000
         BNE   @RF00181                                            0181 00450000
*             YESNO='1'B;           /* EXPECTING 'YES' OR'NO'        */ 00451000
         OI    YESNO,B'00001000'                                   0182 00452000
*           ELSE                                                   0183 00453000
*             MSGID=IEE309;         /* KEYWORD NOT VALID FOR 3ND   0183 00454000
*                                      POSITIONAL FOLLOWED BY AN = 0183 00455000
*                                                            @G33CPHE*/ 00456000
         B     @RC00181                                            0183 00457000
@RF00181 MVI   MSGID,X'09'                                         0183 00458000
*       END;                        /*                       @G33CPHE*/ 00459000
*     ELSE                                                         0185 00460000
*       IF PKEY2='1'B&CDRESET=OFF   /* EXPECTING 2ND POS. PARM     0185 00461000
*                                                            @G33CPHE*/ 00462000
*         THEN                      /* MUST BE SDUMP OR SYSMDUMP   0185 00463000
*                                                            @G33CPHE*/ 00464000
         B     @RC00163                                            0185 00465000
@RF00163 TM    PKEY2,B'01000000'                                   0185 00466000
         BNO   @RF00185                                            0185 00467000
         TM    CDRESET,B'01000000'                                 0185 00468000
         BNZ   @RF00185                                            0185 00469000
*         DO;                       /*                       @G33CPHE*/ 00470000
*           PKEY2='0'B;             /* NO LONGER EXPECTING PKEY2     */ 00471000
*           KEY3='1'B;              /* INDICATE -NOW EXPECTING     0188 00472000
*                                      3RD-4TH POSITION PARAMETERS   */ 00473000
*           OPTIONX='1'B;           /* OPTIONS NOW EXPECTED          */ 00474000
         OI    KEY3,B'00100100'                                    0189 00475000
         NI    PKEY2,B'10111111'                                   0189 00476000
*           IF LEN=5&OPERAND(1:5)='SDUMP' THEN                     0190 00477000
         CH    LEN,@CH00770                                        0190 00478000
         BNE   @RF00190                                            0190 00479000
         CLC   OPERAND(5,START),@CC02096                           0190 00480000
         BNE   @RF00190                                            0190 00481000
*             DO;                                                  0191 00482000
*               OPSETPTR=ADDR(CHDSDUMP);/* SET PTR TO OPTION HANDLER    00483000
*                                      FOR SDUMP OPTIONS             */ 00484000
         LA    OPSETPTR,CHDSDUMP                                   0192 00485000
*               DT=SVDINDEX;        /* SET DUMP TYPE         @G33CPHE*/ 00486000
         LA    DT,4                                                0193 00487000
*             END;                                                 0194 00488000
*           ELSE                                                   0195 00489000
*             IF LEN=8&OPERAND(1:8)='SYSMDUMP'/*             @G33CPHE*/ 00490000
*               THEN                /*                       @G33CPHE*/ 00491000
         B     @RC00190                                            0195 00492000
@RF00190 CH    LEN,@CH00063                                        0195 00493000
         BNE   @RF00195                                            0195 00494000
         CLC   OPERAND(8,START),@CC02098                           0195 00495000
         BNE   @RF00195                                            0195 00496000
*               DO;                 /*                       @G33CPHE*/ 00497000
*                 DT=SMDINDEX;      /* SET DUMP TYPE         @G33CPHE*/ 00498000
         LA    DT,3                                                0197 00499000
*                 OPSETPTR=ADDR(CHDSYSM);/* POINT TO SYSMDUMP OPTION    00500000
*                                      RTN                   @G33CPHE*/ 00501000
         LA    OPSETPTR,CHDSYSM                                    0198 00502000
*               END;                /*                       @G33CPHE*/ 00503000
*             ELSE                  /*                       @G33CPHE*/ 00504000
*               MSGID=IEE309;       /* KEYWORD NOT VALID FOR 2ND   0200 00505000
*                                      POSITIONAL FOLLOWED BY AN = 0200 00506000
*                                                            @G33CPHE*/ 00507000
         B     @RC00195                                            0200 00508000
@RF00195 MVI   MSGID,X'09'                                         0200 00509000
*         END;                      /*                       @G33CPHE*/ 00510000
*       ELSE                                                       0202 00511000
*         MSGID=IEE307;             /* EQUAL SIGN FOUND IN OPTION  0202 00512000
*                                      LIST                  @G33CPHE*/ 00513000
         B     @RC00185                                            0202 00514000
@RF00185 MVI   MSGID,X'07'                                         0202 00515000
*   ELSE                            /*                       @G33CPHE*/ 00516000
*     MSGID=IEE307;                 /* MSG INDEX FOR INVALID       0203 00517000
*                                      DELIMITER             @G33CPHE*/ 00518000
*                                                                  0203 00519000
         B     @RC00162                                            0203 00520000
@RF00162 MVI   MSGID,X'07'                                         0203 00521000
*   /*****************************************************************/ 00522000
*   /*                                                               */ 00523000
*   /* EQUAL PROCESSOR -- RESET TRANSLATE TABLE FOR NEXT SCAN        */ 00524000
*   /*                                                               */ 00525000
*   /*****************************************************************/ 00526000
*                                                                  0204 00527000
*   TRANTBL(','+1)=COMMACDE;        /* STOP ON COMMA         @G33CPHE*/ 00528000
@RC00162 MVI   TRANTBL+107,X'02'                                   0204 00529000
*   TRANTBL('('+1)=LPARNCDE;        /* STOP ON LEFT PARAN    @G33CPHE*/ 00530000
         MVI   TRANTBL+77,X'04'                                    0205 00531000
*   TRANTBL('='+1)=UNEXPCDE;        /* EQUAL SIGN IS UNEXPECTED    0206 00532000
*                                                            @G33CPHE*/ 00533000
         MVI   TRANTBL+126,X'06'                                   0206 00534000
*   TRANTBL(' '+1)=EOCMDCDE;        /* BLANK IS VALID        @G33CPHE*/ 00535000
         MVI   TRANTBL+64,X'03'                                    0207 00536000
*   TRANTBL(')'+1)=UNEXPCDE;        /* RIGHT PARAN IS UNEXPECTED   0208 00537000
*                                                            @G33CPHE*/ 00538000
         MVI   TRANTBL+93,X'06'                                    0208 00539000
*   RETURN;                                                        0209 00540000
@EL00004 DS    0H                                                  0209 00541000
@EF00004 DS    0H                                                  0209 00542000
@ER00004 BR    @14                                                 0209 00543000
*   END CHDEQUAL;                                                  0210 00544000
*CHDCOMMA:                                                         0211 00545000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0211 00546000
*                                                                  0211 00547000
CHDCOMMA DS    0H                                                  0212 00548000
*/*    *****  THE COMMA SUBROUTINE  ****                             */ 00549000
*/*    IF OPTIONS ARE EXPECTED, THIS ROUTINE CALLS THE OPTION        */ 00550000
*/*    HANDLER FOR SDATA OR PDATA OR SDUMP.                          */ 00551000
*/*    IF THE SECOND POSITION KEYWORD IS EXPECTED, THEN A CHECK IS   */ 00552000
*/*    MADE FOR SYSABEND, SYSUDUMP, OR SDUMP, AND THE PROPER         */ 00553000
*/*    INDICATORS ARE SET ACCORDINGLY.                               */ 00554000
*/*                                                                  */ 00555000
*/*    IF THE FIRST POSITION KEYWORD IS EXPECTED, THEN A CHECK IS    */ 00556000
*/*    MADE FOR SET OR DEL.                                          */ 00557000
*/*                                                                  */ 00558000
*/*    FINALLY IF NONE OF THE ABOVE CONDITIONS ARE FOUND, A CHECK IS */ 00559000
*/*    MADE TO SEE IF THIS IS A COMMA FOLLOWING THE RIGHT PARAN. IF  */ 00560000
*/*    THIS IS THE CASE,WE DO NOT HAVE A KEYWORD OR SUBPARAMETER     */ 00561000
*/*    ISOLATED, GO TO CONTINUE THE SCAN.                            */ 00562000
*/*                                                                  */ 00563000
*/*    A MESSAGE INDEX FOR AN APPROPRIATE ERROR MESSAGE IS SET       */ 00564000
*/*    WHEN AN UNEXPECTED CONDITION IS FOUND.                        */ 00565000
*/*                                                                  */ 00566000
*                                                                  0212 00567000
*   IF KEY3=ON                      /* CHECK TO SEE IF 3RD POSITION     00568000
*                                      KEYWORDS ARE IN PROCESS       */ 00569000
*     THEN                                                         0212 00570000
         TM    KEY3,B'00100000'                                    0212 00571000
         BNO   @RF00212                                            0212 00572000
*     DO;                           /*                       @G33CPHE*/ 00573000
*       KEY31=OFF;                  /* YES. THIS MEANS THAT MORE THAN   00574000
*                                      ONE 3RD POS IS BEING        0214 00575000
*                                      SPECIFIED, HENCE THE EXCUSIVE    00576000
*                                      ONES CAN NO LONGER POSSIBLY BE   00577000
*                                      VALID                 @G33CPHE*/ 00578000
         NI    KEY31,B'11101111'                                   0214 00579000
*       IF OPTIONX='1'B             /* EXPECTING OPTIONS ??          */ 00580000
*         THEN                                                     0215 00581000
         TM    OPTIONX,B'00000100'                                 0215 00582000
         BNO   @RF00215                                            0215 00583000
*         DO;                                                      0216 00584000
*           R14SAVE=R14;            /* SAVE RETURN ADDRESS           */ 00585000
         ST    R14,R14SAVE                                         0217 00586000
*           CALL OPSET;             /* GO TO OPTION HANDLER          */ 00587000
         LR    @15,OPSETPTR                                        0218 00588000
         BALR  @14,@15                                             0218 00589000
*           R14=R14SAVE;            /* RESTORE R14                   */ 00590000
         L     R14,R14SAVE                                         0219 00591000
*           IF LPARAN¬='1'B         /* IF A LEFT PARAN HAS NOT BEEN     00592000
*                                      ENCOUNTERED, THEN ALLOW ONLY     00593000
*                                      ONE                           */ 00594000
*             THEN                                                 0220 00595000
         TM    LPARAN,B'00001000'                                  0220 00596000
         BO    @RF00220                                            0220 00597000
*             OPTIONX='0'B;         /* NO MORE DUMP OPTIONS ARE    0221 00598000
*                                      EXPECTED FOR THIS KEYWORD   0221 00599000
*                                      BECAUSE PARENTHESIS WERE NOT     00600000
*                                      USED                          */ 00601000
         NI    OPTIONX,B'11111011'                                 0221 00602000
*         END;                                                     0222 00603000
*       ELSE                        /*                       @G33CPHE*/ 00604000
*         IF STOPSAVE=RPARNCDE&LEN=0/* IF THIS COMMA FOLLOWS A RIGHT    00605000
*                                      PAREN WITH NO KEYWORD @G33CPHE*/ 00606000
*           THEN                                                   0223 00607000
         B     @RC00215                                            0223 00608000
@RF00215 CLI   STOPSAVE,X'05'                                      0223 00609000
         BNE   @RF00223                                            0223 00610000
         LTR   LEN,LEN                                             0223 00611000
         BZ    @RT00223                                            0223 00612000
*           ;                       /* THERE IS NOTHING TO PROCESS 0224 00613000
*                                      YET                   @G33CPHE*/ 00614000
*         ELSE                      /* CHECK FOR VALID 3RD POSITION     00615000
*                                      NONEXCLUSIVE KEYWORDS @G33CPHE*/ 00616000
*           IF YESNO=ON             /* IS THE YES OR NO OPTION FOR Q    00617000
*                                      EXPECTED?             @G33CPHE*/ 00618000
*             THEN                  /* YES IT IS             @G33CPHE*/ 00619000
@RF00223 TM    YESNO,B'00001000'                                   0225 00620000
         BNO   @RF00225                                            0225 00621000
*             IF LEN=2&OPERAND(1:2)='NO'/* IS IT NO          @G33CPHE*/ 00622000
*               THEN                                               0226 00623000
         CH    LEN,@CH00077                                        0226 00624000
         BNE   @RF00226                                            0226 00625000
         CLC   OPERAND(2,START),@CC02103                           0226 00626000
         BNE   @RF00226                                            0226 00627000
*               IF ADDR(CHNGWORK)->RTCTSDPG=OFF/* CHECK FOR A      0227 00628000
*                                      CONFLICTING VALUE ALREADY   0227 00629000
*                                      SPECIFIED             @G33CPHE*/ 00630000
*                 THEN              /* Q=NO SPECIFIED        @G33CPHE*/ 00631000
         LA    @15,CHNGWORK                                        0227 00632000
         TM    RTCTSDPG(@15),B'10000000'                           0227 00633000
         BNZ   @RF00227                                            0227 00634000
*                 DO;                                              0228 00635000
*                   YESNO=OFF;      /* SHOW THAT THE YESNO OPTION IS    00636000
*                                      NO LONGER BEING EXPECTED      */ 00637000
         NI    YESNO,B'11110111'                                   0229 00638000
*                   ADDR(CHNGWORK)->RTCTSDPH=ON;/* TURN ON THE OPTION   00639000
*                                      IN THE WORK AREA      @G33CPHE*/ 00640000
         OI    RTCTSDPH(@15),B'01000000'                           0230 00641000
*                 END;                                             0231 00642000
*               ELSE                                               0232 00643000
*                 MSGID=IEE312;     /* INDICATE THE ERROR    @G33CPHE*/ 00644000
         B     @RC00227                                            0232 00645000
@RF00227 MVI   MSGID,X'0C'                                         0232 00646000
*             ELSE                                                 0233 00647000
*               IF LEN=3&OPERAND(1:3)='YES'/* IS IT Q=YES    @G33CPHE*/ 00648000
*                 THEN                                             0233 00649000
         B     @RC00226                                            0233 00650000
@RF00226 CH    LEN,@CH00290                                        0233 00651000
         BNE   @RF00233                                            0233 00652000
         CLC   OPERAND(3,START),@CC02104                           0233 00653000
         BNE   @RF00233                                            0233 00654000
*                 IF ADDR(CHNGWORK)->RTCTSDPH=OFF/* CHECK FOR A    0234 00655000
*                                      CONFLICTING VALUE ALREADY   0234 00656000
*                                      SPECIFIED             @G33CPHE*/ 00657000
*                   THEN            /* YES                   @G33CPHE*/ 00658000
         LA    @15,CHNGWORK                                        0234 00659000
         TM    RTCTSDPH(@15),B'01000000'                           0234 00660000
         BNZ   @RF00234                                            0234 00661000
*                   DO;                                            0235 00662000
*                     YESNO=OFF;    /* SHOW THAT THE YESNO OPTION IS    00663000
*                                      NO LONGER BEING EXPECTED      */ 00664000
         NI    YESNO,B'11110111'                                   0236 00665000
*                     ADDR(CHNGWORK)->RTCTSDPG=ON;/* TURN ON THE   0237 00666000
*                                      OPTION IN THE WORK AREA     0237 00667000
*                                                            @G33CPHE*/ 00668000
         OI    RTCTSDPG(@15),B'10000000'                           0237 00669000
*                   END;                                           0238 00670000
*                 ELSE                                             0239 00671000
*                   MSGID=IEE312;   /* INDICATE THE ERROR    @G33CPHE*/ 00672000
         B     @RC00234                                            0239 00673000
@RF00234 MVI   MSGID,X'0C'                                         0239 00674000
*               ELSE                /* NOT A VALID VALUE     @G33CPHE*/ 00675000
*                 MSGID=IEE708;     /* INDICATE THE ERROR    @G33CPHE*/ 00676000
         B     @RC00233                                            0240 00677000
@RF00233 MVI   MSGID,X'3D'                                         0240 00678000
*           ELSE                    /* YES NO NOT EXPECTED   @G33CPHE*/ 00679000
*             IF LEN=3&OPERAND(1:3)='ADD'/* IS IT ADD?       @G33CPHE*/ 00680000
*               THEN                                               0241 00681000
         B     @RC00225                                            0241 00682000
@RF00225 CH    LEN,@CH00290                                        0241 00683000
         BNE   @RF00241                                            0241 00684000
         CLC   OPERAND(3,START),@CC02105                           0241 00685000
         BNE   @RF00241                                            0241 00686000
*               IF OVERMODE=OFF     /* CHECK FOR A CONFLICTING VALUE    00687000
*                                      ALREADY SPECIFIED     @G33CPHE*/ 00688000
*                 THEN              /* YES                   @G33CPHE*/ 00689000
         TM    OVERMODE,B'00000010'                                0242 00690000
         BNZ   @RF00242                                            0242 00691000
*                 ADDMODE=ON;       /* SET FLAG FOR CHDSAQ SEGMENT 0243 00692000
*                                      WHICH WILL SET BITS IN THE  0243 00693000
*                                      UPDATE AREA           @G33CPHE*/ 00694000
         OI    ADDMODE,B'00000100'                                 0243 00695000
*               ELSE                                               0244 00696000
*                 MSGID=IEE312;     /* INDICATE THE ERROR    @G33CPHE*/ 00697000
         B     @RC00242                                            0244 00698000
@RF00242 MVI   MSGID,X'0C'                                         0244 00699000
*             ELSE                  /* NOT ADD               @G33CPHE*/ 00700000
*               IF LEN=4&OPERAND(1:4)='OVER'/* IS IT OVER?   @G33CPHE*/ 00701000
*                 THEN                                             0245 00702000
         B     @RC00241                                            0245 00703000
@RF00241 CH    LEN,@CH00057                                        0245 00704000
         BNE   @RF00245                                            0245 00705000
         CLC   OPERAND(4,START),@CC02106                           0245 00706000
         BNE   @RF00245                                            0245 00707000
*                 IF ADDMODE=OFF    /* CHECK FOR A CONFLICTING VALUE    00708000
*                                      ALREADY SPECIFIED     @G33CPHE*/ 00709000
*                   THEN            /* YES IT IS             @G33CPHE*/ 00710000
         TM    ADDMODE,B'00000100'                                 0246 00711000
         BNZ   @RF00246                                            0246 00712000
*                   OVERMODE=ON;    /* SET FLAG FOR CHDSAQ SEGMENT 0247 00713000
*                                      WHICH WILL SET BITS IN THE  0247 00714000
*                                      UPDATE AREA           @G33CPHE*/ 00715000
         OI    OVERMODE,B'00000010'                                0247 00716000
*                 ELSE                                             0248 00717000
*                   MSGID=IEE312;   /* INDICATE THE ERROR    @G33CPHE*/ 00718000
         B     @RC00246                                            0248 00719000
@RF00246 MVI   MSGID,X'0C'                                         0248 00720000
*               ELSE                /* THERE ARE NO MORE VALID     0249 00721000
*                                      POSSIBILITIES         @G33CPHE*/ 00722000
*                 MSGID=IEE309;     /* INDICATE THE ERROR    @G33CPHE*/ 00723000
         B     @RC00245                                            0249 00724000
@RF00245 MVI   MSGID,X'09'                                         0249 00725000
*     END;                                                         0250 00726000
*   ELSE                                                           0251 00727000
*     IF PKEY2='1'B                 /* IS THE SECOND POSITION KEYWORD   00728000
*                                      EXPECTED ??                   */ 00729000
*       THEN                        /* THEN THIS MUST BE IT.         */ 00730000
         B     @RC00212                                            0251 00731000
@RF00212 TM    PKEY2,B'01000000'                                   0251 00732000
         BNO   @RF00251                                            0251 00733000
*       DO;                                                        0252 00734000
*         IF CDRESET=ON             /* WAS RESET SPECIFIED?  @G33CPHE*/ 00735000
*           THEN                    /* YES IT WAS            @G33CPHE*/ 00736000
         TM    CDRESET,B'01000000'                                 0253 00737000
         BNO   @RF00253                                            0253 00738000
*           DO;                     /*                       @G33CPHE*/ 00739000
*             MSGID=IEE535;         /* INDICATE THE ERROR. RESET MAY    00740000
*                                      NOT HAVE ANY 3RD POS PARMS  0255 00741000
*                                      HENCE THE 2ND POS PARM MAY NOT   00742000
*                                      BE FOLLOWED BY A COMMA      0255 00743000
*                                                            @G33CPHE*/ 00744000
         MVI   MSGID,X'3E'                                         0255 00745000
*             ERRTXTP=START+LEN;    /* CHANGE THE POINTER TO THE   0256 00746000
*                                      ERROR TEXT TO INCLUDE THE   0256 00747000
*                                      COMMA THAT FOLLOWS THE PORTION   00748000
*                                      JUST SCANNED AND WHATEVER   0256 00749000
*                                      KEYWORD FOLLOWS. THE REASON 0256 00750000
*                                      FOR THIS IS THAT WE KNOW IT IS   00751000
*                                      WRONG BUT WE HAVEN'T CHECKED     00752000
*                                      THE PART JUST SCANNED, SO IT     00753000
*                                      MAY BE RIGHT.         @G33CPHE*/ 00754000
         LR    @15,START                                           0256 00755000
         ALR   @15,LEN                                             0256 00756000
         ST    @15,ERRTXTP                                         0256 00757000
*             LEN=LENGTH(XAV);      /* ALSO CHANGE THE LEN TO THE MAX   00758000
*                                      SINCE WHAT FOLLOWS IS UNKNOWN    00759000
*                                                            @G33CPHE*/ 00760000
         LA    LEN,8                                               0257 00761000
*           END;                                                   0258 00762000
*         ELSE                                                     0259 00763000
*           DO;                     /* RESET NOT SPECIFIED   @G33CPHE*/ 00764000
         B     @RC00253                                            0259 00765000
@RF00253 DS    0H                                                  0260 00766000
*             PKEY2='0'B;           /* NO LONGER EXPECTING THE SECOND   00767000
*                                      POSITION KEYWORD              */ 00768000
*             KEY3='1'B;            /* NOW EXPECTING 3RD POSITION  0261 00769000
*                                      KEYWORDS              @G33CPHE*/ 00770000
*             KEY31='1'B;           /* AN EXCLUSIVE 3RD POS KEYWORD     00771000
*                                      CAN VALIDLY BE SPECIFIED AT 0262 00772000
*                                      THIS TIME             @G33CPHE*/ 00773000
*                                                                  0262 00774000
         OI    KEY3,B'00110000'                                    0262 00775000
         NI    PKEY2,B'10111111'                                   0262 00776000
*             /*******************************************************/ 00777000
*             /*                                                     */ 00778000
*             /* CHECK FOR SYSABEND OR SYSUDUMP                      */ 00779000
*             /*                                                     */ 00780000
*             /*******************************************************/ 00781000
*                                                                  0263 00782000
*             IF LEN=8 THEN         /* CHECK OUT ELIGIBLE 8 CHARACTER   00783000
*                                      KEYWORDS                      */ 00784000
         CH    LEN,@CH00063                                        0263 00785000
         BNE   @RF00263                                            0263 00786000
*               IF OPERAND(1:8)='SYSABEND' THEN                    0264 00787000
         CLC   OPERAND(8,START),@CC02107                           0264 00788000
         BNE   @RF00264                                            0264 00789000
*                 DT=SADINDEX;      /* SET DUMP TYPE INDICATOR     0265 00790000
*                                                            @G33CPHE*/ 00791000
         LA    DT,1                                                0265 00792000
*               ELSE                                               0266 00793000
*                 IF OPERAND(1:8)='SYSUDUMP' THEN                  0266 00794000
         B     @RC00264                                            0266 00795000
@RF00264 CLC   OPERAND(8,START),@CC02108                           0266 00796000
         BNE   @RF00266                                            0266 00797000
*                   DT=SUDINDEX;    /* SET DUMP TYPE INDICATOR     0267 00798000
*                                                            @G33CPHE*/ 00799000
         LA    DT,2                                                0267 00800000
*                 ELSE              /*                       @G33CPHE*/ 00801000
*                   IF OPERAND(1:8)='SYSMDUMP'/*             @G33CPHE*/ 00802000
*                     THEN          /*                       @G33CPHE*/ 00803000
         B     @RC00266                                            0268 00804000
@RF00266 CLC   OPERAND(8,START),@CC02098                           0268 00805000
         BNE   @RF00268                                            0268 00806000
*                     DT=SMDINDEX;  /* SET DUMP TYPE INDICATOR     0269 00807000
*                                                            @G33CPHE*/ 00808000
         LA    DT,3                                                0269 00809000
*                   ELSE            /* ERROR - KEYWORD IS NEITHER  0270 00810000
*                                      SYSABEND NOR SYSUDUMP         */ 00811000
*                     MSGID=IEE309; /*                       @G33CPHE*/ 00812000
         B     @RC00268                                            0270 00813000
@RF00268 MVI   MSGID,X'09'                                         0270 00814000
*             ELSE                  /* LENGTH IS NOT 8               */ 00815000
*                                                                  0271 00816000
*               /*****************************************************/ 00817000
*               /*                                                   */ 00818000
*               /* CHECK FOR SDUMP                                   */ 00819000
*               /*                                                   */ 00820000
*               /*****************************************************/ 00821000
*                                                                  0271 00822000
*               IF LEN=5&OPERAND(1:5)='SDUMP' THEN                 0271 00823000
         B     @RC00263                                            0271 00824000
@RF00263 CH    LEN,@CH00770                                        0271 00825000
         BNE   @RF00271                                            0271 00826000
         CLC   OPERAND(5,START),@CC02096                           0271 00827000
         BNE   @RF00271                                            0271 00828000
*                 DT=SVDINDEX;      /* SET DUMP TYPE INDICATOR     0272 00829000
*                                                            @G33CPHE*/ 00830000
         LA    DT,4                                                0272 00831000
*               ELSE                /* ERROR - KEYWORD (LENGTH 5) IS    00832000
*                                      NOT SDUMP                     */ 00833000
*                 MSGID=IEE309;     /*                       @G33CPHE*/ 00834000
         B     @RC00271                                            0273 00835000
@RF00271 MVI   MSGID,X'09'                                         0273 00836000
*           END;                    /*                       @G33CPHE*/ 00837000
*       END;                                                       0275 00838000
*     ELSE                          /* KEY POSITION 2 - NOT EXPECTED */ 00839000
*       IF PKEY1='1'B               /* EXPECTING 1ST POSITION KEYWORD*/ 00840000
*         THEN                                                     0276 00841000
         B     @RC00251                                            0276 00842000
@RF00251 TM    PKEY1,B'10000000'                                   0276 00843000
         BNO   @RF00276                                            0276 00844000
*         DO;                                                      0277 00845000
*           PKEY1='0'B;             /* NO LONGER EXPECTING 1ST     0278 00846000
*                                      KEYWORD                       */ 00847000
*           PKEY2='1'B;             /* NEXT,-2ND POSITION IS EXPECTED*/ 00848000
         OI    PKEY2,B'01000000'                                   0279 00849000
         NI    PKEY1,B'01111111'                                   0279 00850000
*           IF LEN=5&OPERAND(1:5)='RESET'/*                  @G33CPHE*/ 00851000
*             THEN                  /*                       @G33CPHE*/ 00852000
         CH    LEN,@CH00770                                        0280 00853000
         BNE   @RF00280                                            0280 00854000
         CLC   OPERAND(5,START),@CC02109                           0280 00855000
         BNE   @RF00280                                            0280 00856000
*             CDRESET=ON;           /*                       @G33CPHE*/ 00857000
         OI    CDRESET,B'01000000'                                 0281 00858000
*           ELSE                    /*                       @G33CPHE*/ 00859000
*             IF LEN=3&OPERAND(1:3)='SET' THEN                     0282 00860000
         B     @RC00280                                            0282 00861000
@RF00280 CH    LEN,@CH00290                                        0282 00862000
         BNE   @RF00282                                            0282 00863000
         CLC   OPERAND(3,START),@CC02110                           0282 00864000
         BNE   @RF00282                                            0282 00865000
*               CDSET='1'B;         /* INDICATE SET FUNCTION         */ 00866000
         OI    CDSET,B'10000000'                                   0283 00867000
*             ELSE                                                 0284 00868000
*               IF LEN=3&OPERAND(1:3)='DEL' THEN                   0284 00869000
         B     @RC00282                                            0284 00870000
@RF00282 CH    LEN,@CH00290                                        0284 00871000
         BNE   @RF00284                                            0284 00872000
         CLC   OPERAND(3,START),@CC02111                           0284 00873000
         BE    @RT00284                                            0284 00874000
*                 ;                 /* OK.                           */ 00875000
*               ELSE                /* ERROR IF NOT SET OR DEL       */ 00876000
*                 MSGID=IEE309;     /*                       @G33CPHE*/ 00877000
@RF00284 MVI   MSGID,X'09'                                         0286 00878000
*         END;                                                     0287 00879000
*                                                                  0287 00880000
@RT00284 DS    0H                                                  0287 00881000
@RC00282 DS    0H                                                  0287 00882000
@RC00280 DS    0H                                                  0288 00883000
*   /*****************************************************************/ 00884000
*   /*                                                               */ 00885000
*   /* 'COMMA' PROCESSOR -- RESET TRANSLATE TABLE FOR NEXT SCAN      */ 00886000
*   /*                                                               */ 00887000
*   /*****************************************************************/ 00888000
*                                                                  0288 00889000
*   TRANTBL('('+1)=UNEXPCDE;        /*                       @G33CPHE*/ 00890000
@RF00276 DS    0H                                                  0288 00891000
@RC00251 DS    0H                                                  0288 00892000
@RC00212 MVI   TRANTBL+77,X'06'                                    0288 00893000
*   TRANTBL(','+1)=COMMACDE;        /*                       @G33CPHE*/ 00894000
         MVI   TRANTBL+107,X'02'                                   0289 00895000
*   IF OPTIONX='1'B                 /* OPTIONS EXPECTED NEXT ?       */ 00896000
*     THEN                          /* YES                           */ 00897000
         TM    OPTIONX,B'00000100'                                 0290 00898000
         BNO   @RF00290                                            0290 00899000
*     DO;                                                          0291 00900000
*       TRANTBL('='+1)=UNEXPCDE;    /* EQUAL SIGN UNEXPECTED @G33CPHE*/ 00901000
         MVI   TRANTBL+126,X'06'                                   0292 00902000
*       TRANTBL(')'+1)=RPARNCDE;    /* RIGHT PARAN IS VALID  @G33CPHE*/ 00903000
         MVI   TRANTBL+93,X'05'                                    0293 00904000
*     END;                                                         0294 00905000
*   ELSE                                                           0295 00906000
*     DO;                                                          0295 00907000
         B     @RC00290                                            0295 00908000
@RF00290 DS    0H                                                  0296 00909000
*       TRANTBL(')'+1)=UNEXPCDE;    /* RIGHT PARAN IS UNEXPECTED   0296 00910000
*                                                            @G33CPHE*/ 00911000
         MVI   TRANTBL+93,X'06'                                    0296 00912000
*       TRANTBL('='+1)=EQUALCDE;    /* EQUAL SIGN IS VALID   @G33CPHE*/ 00913000
         MVI   TRANTBL+126,X'01'                                   0297 00914000
*     END;                                                         0298 00915000
*   IF LPARAN='1'B                  /* IN MIDDLE OF PARANTHESIS ?    */ 00916000
*     THEN                          /* YES                           */ 00917000
@RC00290 TM    LPARAN,B'00001000'                                  0299 00918000
         BNO   @RF00299                                            0299 00919000
*     TRANTBL(' '+1)=UNEXPCDE;      /* THEN BLANK IS UNEXPECTED    0300 00920000
*                                                            @G33CPHE*/ 00921000
         MVI   TRANTBL+64,X'06'                                    0300 00922000
*   ELSE                                                           0301 00923000
*     TRANTBL(' '+1)=EOCMDCDE;      /* BLANK IS VALID STOPPER      0301 00924000
*                                                            @G33CPHE*/ 00925000
         B     @RC00299                                            0301 00926000
@RF00299 MVI   TRANTBL+64,X'03'                                    0301 00927000
*   RETURN;                                                        0302 00928000
@EL00005 DS    0H                                                  0302 00929000
@EF00005 DS    0H                                                  0302 00930000
@ER00005 BR    @14                                                 0302 00931000
*   END CHDCOMMA;                                                  0303 00932000
         B     @EL00005                                            0303 00933000
*CHDEOCMD:                                                         0304 00934000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0304 00935000
*                                                                  0304 00936000
CHDEOCMD DS    0H                                                  0305 00937000
*/*      THE END OF COMMAND TRANSLATE ROUTINE HAS TWO ENTRY          */ 00938000
*/*     SITUATIONS WHEN TRT ENCOUNTERS A BLANK                       */ 00939000
*/*    - THIS BLANK MAY BE THE FIRST BLANK AFTER THE END OF          */ 00940000
*/*       THE OPERAND IN THE BUFFER                                  */ 00941000
*/*       THIS BLANK MAY BE THE STOPPER VALUE WHCIH ISOLATED         */ 00942000
*/*       THE LAST PARAMETER OF THE OPERAND                          */ 00943000
*/*                                                                  */ 00944000
*/*    IF WE HAVE JUST ISOLATED A PARMAMETER :                       */ 00945000
*/*      OUTLINE OF PROCESSING  - BY NESTED  IF-THEN LOGIC IT CHECKS */ 00946000
*/*    FOR  - OPTIONS (OF SDATA,PDATA OR SDUMP)                      */ 00947000
*/*      OR - TEST 'KEY31' FOR INDICATION OF 'ALL' OR 'NODUMP'       */ 00948000
*/*      OR - TEST 'YESNO' FOR SPECIFICATION OF QUIESCE CHANGES      */ 00949000
*/*      OR - TEST 'PKEY2' FOR 2ND POSITION KEYWORD                  */ 00950000
*/*      OR - TEST 'PKEY1' FOR 1ST POSITION KEYWORD                  */ 00951000
*/*                                                                  */ 00952000
*                                                                  0305 00953000
*   /*****************************************************************/ 00954000
*   /*                                                               */ 00955000
*   /* TEST TO SEE IF THIS IS THE END OF THE COMMAND. IF THE PREVIOUS*/ 00956000
*   /* STOPPER VALUE FROM TRANSLATE AND TEST WAS THE FUNCTION CODE   */ 00957000
*   /* FOR A RIGHT PARAN, THEN WE ARE PROCESSING THE FIRST BLANK     */ 00958000
*   /* AFTER THE END OF THE COMMAND                                  */ 00959000
*   /*                                                               */ 00960000
*   /*****************************************************************/ 00961000
*                                                                  0305 00962000
*   MSGID=IEE712;                   /* TO INDICATE NOTHING IS LEFT TO   00963000
*                                      BE SCANNED SET MSG INDEX FOR     00964000
*                                      'PROCESSING COMPLETE' @G33CPHE*/ 00965000
         MVI   MSGID,X'03'                                         0305 00966000
*   IF STOPSAVE=RPARNCDE&LEN=0      /* IS THIS THE 1ST BLANK AFTER 0306 00967000
*                                      THE END OF THE OPERAND LIST ?    00968000
*                                      (PREVIOUS STOPPER MUST HAVE 0306 00969000
*                                      BEEN RIGHT PARAN AND LENGTH OF   00970000
*                                      PARAMETER SHOULD BE ZERO)     */ 00971000
*     THEN                                                         0306 00972000
         CLI   STOPSAVE,X'05'                                      0306 00973000
         BNE   @RF00306                                            0306 00974000
         LTR   LEN,LEN                                             0306 00975000
         BZ    @RT00306                                            0306 00976000
*     ;                                                            0307 00977000
*   ELSE                            /* NO - WE HAVE A PARM TO PROCESS*/ 00978000
*     IF OPTIONX='1'B               /* IS THIS A DUMP OPTION ?       */ 00979000
*       THEN                        /* YES                           */ 00980000
@RF00306 TM    OPTIONX,B'00000100'                                 0308 00981000
         BNO   @RF00308                                            0308 00982000
*       DO;                                                        0309 00983000
*         R14SAVE=R14;              /* SAVE RETURN ADDRESS           */ 00984000
         ST    R14,R14SAVE                                         0310 00985000
*         CALL OPSET;               /* HANDLE THIS DUMP OPTION       */ 00986000
         LR    @15,OPSETPTR                                        0311 00987000
         BALR  @14,@15                                             0311 00988000
*         R14=R14SAVE;              /* RESTORE RETURN ADDRESS TO   0312 00989000
*                                      MAINLINE                      */ 00990000
         L     R14,R14SAVE                                         0312 00991000
*       END;                                                       0313 00992000
*     ELSE                          /* NOT AN OPTION- CHECK FOR    0314 00993000
*                                      QUIESCE                       */ 00994000
*       IF YESNO=ON                 /* IS THE YES OR NO OPTION FOR Q    00995000
*                                      EXPECTED?             @G33CPHE*/ 00996000
*         THEN                      /* YES IT IS             @G33CPHE*/ 00997000
         B     @RC00308                                            0314 00998000
@RF00308 TM    YESNO,B'00001000'                                   0314 00999000
         BNO   @RF00314                                            0314 01000000
*         IF LEN=2&OPERAND(1:2)='NO'/* IS IT NO              @G33CPHE*/ 01001000
*           THEN                                                   0315 01002000
         CH    LEN,@CH00077                                        0315 01003000
         BNE   @RF00315                                            0315 01004000
         CLC   OPERAND(2,START),@CC02103                           0315 01005000
         BNE   @RF00315                                            0315 01006000
*           IF ADDR(CHNGWORK)->RTCTSDPG=OFF/* CHECK FOR A CONFLICTING   01007000
*                                      VALUE ALREADY SPECIFIED     0316 01008000
*                                                            @G33CPHE*/ 01009000
*             THEN                  /* Q=NO SPECIFIED        @G33CPHE*/ 01010000
         LA    @15,CHNGWORK                                        0316 01011000
         TM    RTCTSDPG(@15),B'10000000'                           0316 01012000
         BNZ   @RF00316                                            0316 01013000
*             ADDR(CHNGWORK)->RTCTSDPH=ON;/* TURN ON THE OPTION IN 0317 01014000
*                                      THE WORK AREA         @G33CPHE*/ 01015000
         OI    RTCTSDPH(@15),B'01000000'                           0317 01016000
*           ELSE                                                   0318 01017000
*             MSGID=IEE312;         /* INDICATE THE ERROR    @G33CPHE*/ 01018000
         B     @RC00316                                            0318 01019000
@RF00316 MVI   MSGID,X'0C'                                         0318 01020000
*         ELSE                                                     0319 01021000
*           IF LEN=3&OPERAND(1:3)='YES'/* IS IT Q=YES        @G33CPHE*/ 01022000
*             THEN                                                 0319 01023000
         B     @RC00315                                            0319 01024000
@RF00315 CH    LEN,@CH00290                                        0319 01025000
         BNE   @RF00319                                            0319 01026000
         CLC   OPERAND(3,START),@CC02104                           0319 01027000
         BNE   @RF00319                                            0319 01028000
*             IF ADDR(CHNGWORK)->RTCTSDPH=OFF/* CHECK FOR A        0320 01029000
*                                      CONFLICTING VALUE ALREADY   0320 01030000
*                                      SPECIFIED             @G33CPHE*/ 01031000
*               THEN                /* YES                   @G33CPHE*/ 01032000
         LA    @15,CHNGWORK                                        0320 01033000
         TM    RTCTSDPH(@15),B'01000000'                           0320 01034000
         BNZ   @RF00320                                            0320 01035000
*               ADDR(CHNGWORK)->RTCTSDPG=ON;/* TURN ON THE OPTION IN    01036000
*                                      THE WORK AREA         @G33CPHE*/ 01037000
         OI    RTCTSDPG(@15),B'10000000'                           0321 01038000
*             ELSE                                                 0322 01039000
*               MSGID=IEE312;       /* INDICATE THE ERROR    @G33CPHE*/ 01040000
         B     @RC00320                                            0322 01041000
@RF00320 MVI   MSGID,X'0C'                                         0322 01042000
*           ELSE                    /* NOT A VALID VALUE     @G33CPHE*/ 01043000
*             MSGID=IEE708;         /* INDICATE THE ERROR    @G33CPHE*/ 01044000
         B     @RC00319                                            0323 01045000
@RF00319 MVI   MSGID,X'3D'                                         0323 01046000
*       ELSE                                                       0324 01047000
*         IF CDSET='0'B             /* IS FUNCTION NOT A SET (DEL OR    01048000
*                                      RESET) ?                      */ 01049000
*           THEN                                                   0324 01050000
         B     @RC00314                                            0324 01051000
@RF00314 TM    CDSET,B'10000000'                                   0324 01052000
         BNZ   @RF00324                                            0324 01053000
*           DO;                     /*                       @G33CPHE*/ 01054000
*             CDRESET=ON;           /* THIS MUST BE A RESET OPERATION   01055000
*                                      OR AN INVALID COMMAND, BECAUSE   01056000
*                                      ANYTHING ELSE WOULD HAVE HAD     01057000
*                                      OPTIONS               @G33CPHE*/ 01058000
         OI    CDRESET,B'01000000'                                 0326 01059000
*             IF(PKEY1=ON&((LEN=3&OPERAND(1:3)='DEL')|(LEN=5&OPERAND(1: 01060000
*                 5)='RESET')))|((PKEY2=ON|KEY31=ON)&(LEN=3&OPERAND(1:3 01061000
*                 )='ALL'))         /* CHECK FOR ONE OF THE VALID  0327 01062000
*                                      RESET COMMAND FORMS THAT    0327 01063000
*                                      CONTAIN NO INFORMATION OTHER     01064000
*                                      THAN THAT THIS IS TO BE A   0327 01065000
*                                      RESET                 @G33CPHE*/ 01066000
*               THEN                                               0327 01067000
         TM    PKEY1,B'10000000'                                   0327 01068000
         BNO   @GL00022                                            0327 01069000
         CH    LEN,@CH00290                                        0327 01070000
         BNE   @GL00024                                            0327 01071000
         CLC   OPERAND(3,START),@CC02111                           0327 01072000
         BE    @RT00327                                            0327 01073000
@GL00024 CH    LEN,@CH00770                                        0327 01074000
         BNE   @GL00022                                            0327 01075000
         CLC   OPERAND(5,START),@CC02109                           0327 01076000
         BE    @RT00327                                            0327 01077000
@GL00022 TM    PKEY2,B'01010000'                                   0327 01078000
         BZ    @RF00327                                            0327 01079000
         CH    LEN,@CH00290                                        0327 01080000
         BNE   @RF00327                                            0327 01081000
         CLC   OPERAND(3,START),@CC02115                           0327 01082000
         BE    @RT00327                                            0327 01083000
*               ;                   /* DO NOTHING MORE       @G33CPHE*/ 01084000
*             ELSE                  /* LOOK FOR ONE OF THE VALID   0329 01085000
*                                      RESET COMMANDS THAT ALSO TELLS   01086000
*                                      THE DUMP TYPE         @G33CPHE*/ 01087000
*P2DT:                                                             0329 01088000
*               IF PKEY2=ON         /* THE ONLY REMAINING VALIDS MUST   01089000
*                                      BE 2ND POS DUMP TYPES @G33CPHE*/ 01090000
*                 THEN              /*                       @G33CPHE*/ 01091000
@RF00327 DS    0H                                                  0329 01092000
P2DT     TM    PKEY2,B'01000000'                                   0329 01093000
         BNO   @RF00329                                            0329 01094000
*                 IF LEN=5&OPERAND(1:5)='SDUMP'/*            @G33CPHE*/ 01095000
*                   THEN                                           0330 01096000
         CH    LEN,@CH00770                                        0330 01097000
         BNE   @RF00330                                            0330 01098000
         CLC   OPERAND(5,START),@CC02096                           0330 01099000
         BNE   @RF00330                                            0330 01100000
*                   DT=SVDINDEX;    /* SET DUMP TYPE         @G33CPHE*/ 01101000
         LA    DT,4                                                0331 01102000
*                 ELSE                                             0332 01103000
*                   IF LEN=8        /* ALL REMAINING DUMP TYPES ARE 8   01104000
*                                      CHAR                  @G33CPHE*/ 01105000
*                     THEN          /*                       @G33CPHE*/ 01106000
         B     @RC00330                                            0332 01107000
@RF00330 CH    LEN,@CH00063                                        0332 01108000
         BNE   @RF00332                                            0332 01109000
*                     IF OPERAND(1:8)='SYSABEND'/*           @G33CPHE*/ 01110000
*                       THEN                                       0333 01111000
         CLC   OPERAND(8,START),@CC02107                           0333 01112000
         BNE   @RF00333                                            0333 01113000
*                       DT=SADINDEX;/* SET DUMP TYPE         @G33CPHE*/ 01114000
         LA    DT,1                                                0334 01115000
*                     ELSE                                         0335 01116000
*                       IF OPERAND(1:8)='SYSUDUMP'/*         @G33CPHE*/ 01117000
*                         THEN                                     0335 01118000
         B     @RC00333                                            0335 01119000
@RF00333 CLC   OPERAND(8,START),@CC02108                           0335 01120000
         BNE   @RF00335                                            0335 01121000
*                         DT=SUDINDEX;/* SET DUMP TYPE       @G33CPHE*/ 01122000
         LA    DT,2                                                0336 01123000
*                       ELSE                                       0337 01124000
*                         IF OPERAND(1:8)='SYSMDUMP'/*       @G33CPHE*/ 01125000
*                           THEN                                   0337 01126000
         B     @RC00335                                            0337 01127000
@RF00335 CLC   OPERAND(8,START),@CC02098                           0337 01128000
         BNE   @RF00337                                            0337 01129000
*                           DT=SMDINDEX;/* SET DUMP TYPE     @G33CPHE*/ 01130000
         LA    DT,3                                                0338 01131000
*                         ELSE                                     0339 01132000
*                           MSGID=IEE309;/*                  @G33CPHE*/ 01133000
         B     @RC00337                                            0339 01134000
@RF00337 MVI   MSGID,X'09'                                         0339 01135000
*                   ELSE                                           0340 01136000
*                     MSGID=IEE309; /*                       @G33CPHE*/ 01137000
         B     @RC00332                                            0340 01138000
@RF00332 MVI   MSGID,X'09'                                         0340 01139000
*               ELSE                                               0341 01140000
*                 MSGID=IEE535;     /*                       @G33CPHE*/ 01141000
         B     @RC00329                                            0341 01142000
@RF00329 MVI   MSGID,X'3E'                                         0341 01143000
*           END;                                                   0342 01144000
*         ELSE                      /* PROCESSING OF KEYWORDS VALID     01145000
*                                      ONLY WITH SET IF THERE WERE NO   01146000
*                                      OPTIONS               @G33CPHE*/ 01147000
*           IF LEN=6&OPERAND(1:6)='NODUMP'&(PKEY2=ON|KEY31=ON)/*   0343 01148000
*                                                            @G33CPHE*/ 01149000
*             THEN                                                 0343 01150000
         B     @RC00324                                            0343 01151000
@RF00324 CH    LEN,@CH00709                                        0343 01152000
         BNE   @RF00343                                            0343 01153000
         CLC   OPERAND(6,START),@CC02118                           0343 01154000
         BNE   @RF00343                                            0343 01155000
         TM    PKEY2,B'01010000'                                   0343 01156000
         BZ    @RF00343                                            0343 01157000
*             NODUMP=ON;            /* INDICATE NODUMP       @G33CPHE*/ 01158000
         OI    NODUMP,B'00000001'                                  0344 01159000
*           ELSE                                                   0345 01160000
*             IF LEN=4&OPERAND(1:4)='OVER'/*                 @G33CPHE*/ 01161000
*               THEN                /*                       @G33CPHE*/ 01162000
         B     @RC00343                                            0345 01163000
@RF00343 CH    LEN,@CH00057                                        0345 01164000
         BNE   @RF00345                                            0345 01165000
         CLC   OPERAND(4,START),@CC02106                           0345 01166000
         BNE   @RF00345                                            0345 01167000
*               IF ADDMODE=OFF      /*                       @G33CPHE*/ 01168000
*                 THEN                                             0346 01169000
         TM    ADDMODE,B'00000100'                                 0346 01170000
         BNZ   @RF00346                                            0346 01171000
*                 OVERMODE=ON;      /*                       @G33CPHE*/ 01172000
         OI    OVERMODE,B'00000010'                                0347 01173000
*               ELSE                                               0348 01174000
*                 MSGID=IEE312;     /*                       @G33CPHE*/ 01175000
         B     @RC00346                                            0348 01176000
@RF00346 MVI   MSGID,X'0C'                                         0348 01177000
*             ELSE                                                 0349 01178000
*               IF LEN=3&OPERAND(1:3)='ADD'/*                @G33CPHE*/ 01179000
*                 THEN              /*                       @G33CPHE*/ 01180000
         B     @RC00345                                            0349 01181000
@RF00345 CH    LEN,@CH00290                                        0349 01182000
         BNE   @RF00349                                            0349 01183000
         CLC   OPERAND(3,START),@CC02105                           0349 01184000
         BNE   @RF00349                                            0349 01185000
*                 IF OVERMODE=OFF   /*                       @G33CPHE*/ 01186000
*                   THEN                                           0350 01187000
         TM    OVERMODE,B'00000010'                                0350 01188000
         BNZ   @RF00350                                            0350 01189000
*                   ADDMODE=ON;     /*                       @G33CPHE*/ 01190000
         OI    ADDMODE,B'00000100'                                 0351 01191000
*                 ELSE                                             0352 01192000
*                   MSGID=IEE312;   /*                       @G33CPHE*/ 01193000
         B     @RC00350                                            0352 01194000
@RF00350 MVI   MSGID,X'0C'                                         0352 01195000
*               ELSE                /*                       @G33CPHE*/ 01196000
*                 GO TO P2DT;       /* ONLY 2ND POS DUMP TYPES CAN BE   01197000
*                                      VALID AT THIS POINT   @G33CPHE*/ 01198000
*   IF OVERMODE=OFF                 /* IF OVER MODE HAS NOT BEEN   0354 01199000
*                                      SPECIFIED THEN INSURE THAT ADD   01200000
*                                      MODE IS                       */ 01201000
*     THEN                          /*                       @G33CPHE*/ 01202000
@RC00349 DS    0H                                                  0354 01203000
@RC00345 DS    0H                                                  0354 01204000
@RC00343 DS    0H                                                  0354 01205000
@RC00324 DS    0H                                                  0354 01206000
@RC00314 DS    0H                                                  0354 01207000
@RC00308 DS    0H                                                  0354 01208000
@RT00306 TM    OVERMODE,B'00000010'                                0354 01209000
         BNZ   @RF00354                                            0354 01210000
*     ADDMODE=ON;                   /* THIS MUST BE A DEFAULT ADD  0355 01211000
*                                      MODE                  @G33CPHE*/ 01212000
         OI    ADDMODE,B'00000100'                                 0355 01213000
*   RETURN;                                                        0356 01214000
@EL00006 DS    0H                                                  0356 01215000
@EF00006 DS    0H                                                  0356 01216000
@ER00006 BR    @14                                                 0356 01217000
*   END CHDEOCMD;                                                  0357 01218000
         B     @EL00006                                            0357 01219000
*CHDUNEXP:                                                         0358 01220000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @G33CPHE*/ 01221000
*                                                                  0358 01222000
CHDUNEXP DS    0H                                                  0359 01223000
*   /*****************************************************************/ 01224000
*   /*                                                               */ 01225000
*   /* THE TRANSLATE OF THE OPERAND HAS ENCOUNTERED AN UNEXPECTED    */ 01226000
*   /* DELIMITER. IT IS PROBABLY MISPLACED WITHIN THE COMMAND SYNTAX.*/ 01227000
*   /* MESSAGE WILL BE ISSUED                                @G33CPHE*/ 01228000
*   /*                                                               */ 01229000
*   /*****************************************************************/ 01230000
*                                                                  0359 01231000
*   MSGID=IEE309;                   /* INDICATE ERROR MSG IS TO BE 0359 01232000
*                                      ISSUED                @G33CPHE*/ 01233000
         MVI   MSGID,X'09'                                         0359 01234000
*   RETURN;                         /* RETURN TO MAINLINE    @G33CPHE*/ 01235000
@EL00007 DS    0H                                                  0360 01236000
@EF00007 DS    0H                                                  0360 01237000
@ER00007 BR    @14                                                 0360 01238000
*   END CHDUNEXP;                   /*                       @G33CPHE*/ 01239000
*CHDINVLD:                                                         0362 01240000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0362 01241000
*                                                                  0362 01242000
CHDINVLD DS    0H                                                  0363 01243000
*   /*****************************************************************/ 01244000
*   /*                                                               */ 01245000
*   /* THE TRANSLATE OF THE OPERAND HAS ENCOUNTERED AN INVALID       */ 01246000
*   /* DELIMITER. IT IS AN ILLEGAL CHARACTER WHICH MAY NEVER APPEAR  */ 01247000
*   /* WITHIN THE COMMAND SYNTAX. MESSAGE WILL BE ISSUED     @G33CPHE*/ 01248000
*   /*                                                               */ 01249000
*   /*****************************************************************/ 01250000
*                                                                  0363 01251000
*   MSGID=IEE307;                   /* INDICATE DELIMITER ERROR MSG     01252000
*                                      IS TO BE ISSUED       @G33CPHE*/ 01253000
         MVI   MSGID,X'07'                                         0363 01254000
*   RETURN;                         /* RETURN TO MAINLINE            */ 01255000
@EL00008 DS    0H                                                  0364 01256000
@EF00008 DS    0H                                                  0364 01257000
@ER00008 BR    @14                                                 0364 01258000
*   END CHDINVLD;                                                  0365 01259000
*UPDTERTN:                                                         0366 01260000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);/*                       @G33CPHE*/ 01261000
*                                                                  0366 01262000
UPDTERTN DS    0H                                                  0367 01263000
*   /*****************************************************************/ 01264000
*   /*                                                               */ 01265000
*   /* THIS RTN UPDATES THE RTCT WITH THE NEW OPTIONS. PRIOR TO DOING*/ 01266000
*   /* IT ALL CONFLICTS OF MUTUALLY EXCLUSIVE OPTIONS ARE RESOLVED.  */ 01267000
*   /* COMPARE AND SWAP LOGIC IS USED TO ALTER THE RTCT TO PREVENT   */ 01268000
*   /* CONFUSION SHOULD MULTIPLE UPDATES BE IN PROGRESS.     @G33CPHE*/ 01269000
*   /*                                                               */ 01270000
*   /*****************************************************************/ 01271000
*                                                                  0367 01272000
*   R14SAVE=R14;                    /* SAVE THE RETURN ADDRESS     0367 01273000
*                                                            @G33VPHE*/ 01274000
*                                                                  0367 01275000
         ST    R14,R14SAVE                                         0367 01276000
*   /*****************************************************************/ 01277000
*   /*                                                               */ 01278000
*   /* SUMMARY DUMP SUPPORT TO PGFREE OR PGFIX SUMMARY DUMP AREAS IF */ 01279000
*   /* THE POSSIBILITY OF TAKING A SUMMARY DUMP CHANGES. TWO OPTIONS,*/ 01280000
*   /* NODUMP & NOSUM, CAN MAKE IT IMPOSSIBLE TO TAKE A SUM DUMP. IF */ 01281000
*   /* THIS BRINGS ABOUT THESE CIRCUMSTANCES THE SUM DUMP AREAS ARE  */ 01282000
*   /* PGFREED. IF IS UN DOES THESE CIRCUMSTANCES THE AREA ARE       */ 01283000
*   /* PGFIXED. IN ALL OTHER CASES NO CHANGE IS MADE. ---- AT THIS   */ 01284000
*   /* POINT A PGFIX IS DONE TO ENSURE THAT THE SUMMARY DUMP AREAS   */ 01285000
*   /* WILL BE AVAILABLE DURING THE COMPARE AND SWAP LOGIC EXECUTION.*/ 01286000
*   /* OTHERWISE THERE IS THE POSSIBILITY THAT THE AREAS MAY BE FREE */ 01287000
*   /* WHILE THE OPTIONS REQUIRE THEM FIXED.                 @G33VPHE*/ 01288000
*   /*                                                               */ 01289000
*   /*****************************************************************/ 01290000
*                                                                  0368 01291000
*   IF DT=SVDINDEX                  /* IS THIS AN UPDATE FOR THE   0368 01292000
*                                      SDUMP OPTIONS         @G33VPHE*/ 01293000
*     THEN                          /* YES                   @G33VPHE*/ 01294000
         CH    DT,@CH00057                                         0368 01295000
         BNE   @RF00368                                            0368 01296000
*     DO;                           /* PGFIX THE SUMMARY DUMP AREAS     01297000
*                                      TO AVOID MULTITASKING       0369 01298000
*                                      CONFLICTS WHILE THE NEW/OLD 0369 01299000
*                                      OPTION RELATIONSHIP IS      0369 01300000
*                                      UNCERTAIN             @G33VPHE*/ 01301000
*/* FIRST PGFIX THE VSL AND ECB TO BE USED.                  @G33VPHE*/ 01302000
*                                                                  0370 01303000
*       DO;                         /* PGFIX (R) A(PART1) EA(PART2)     01304000
*                                      ECB(ECB) LONG(N)              */ 01305000
*         RESPECIFY                                                0371 01306000
*          (GPR00P,                                                0371 01307000
*           GPR01P) RESTRICTED;                                    0371 01308000
*         GPR00P=ADDR(ECB);         /* ECB ADDR                      */ 01309000
         LA    GPR00P,ECB                                          0372 01310000
*         GPR01P=ADDR(PART1);       /* PAGE ADDR                     */ 01311000
         LA    GPR01P,PART1                                        0373 01312000
*         RESPECIFY                                                0374 01313000
*           GPR15P RESTRICTED;                                     0374 01314000
*         GPR15P=ADDR(PART2);       /* VSL ADDR                      */ 01315000
         LA    GPR15P,PART2                                        0375 01316000
*         GPR01P=GPR01P|'50000000'X;/* R, PGFIX, RELEASE & LONG FLAGS*/ 01317000
         O     GPR01P,@CF02131                                     0376 01318000
*         SVC(113);                 /* ISSUE PGFIX SVC               */ 01319000
         SVC   113                                                 0377 01320000
*         RESPECIFY                                                0378 01321000
*          (GPR00P,                                                0378 01322000
*           GPR01P) UNRESTRICTED;                                  0378 01323000
*         RESPECIFY                                                0379 01324000
*           GPR15P UNRESTRICTED;                                   0379 01325000
*       END;                        /* PGFIX (R) A(PART1) EA(PART2)     01326000
*                                      ECB(ECB) LONG(N)      @G33VPHE*/ 01327000
*       DO;                         /* WAIT (1) ECB(ECB)             */ 01328000
*         RESPECIFY                                                0382 01329000
*          (GPR00P,                                                0382 01330000
*           GPR01P) RESTRICTED;                                    0382 01331000
*         GPR00P=1;                 /* LOAD WAIT COUNT               */ 01332000
         LA    GPR00P,1                                            0383 01333000
*         GPR01P=ADDR(ECB);         /* ADDRESS OF ECB                */ 01334000
         LA    GPR01P,ECB                                          0384 01335000
*         SVC(1);                   /* WAIT SVC                      */ 01336000
         SVC   1                                                   0385 01337000
*         RESPECIFY                                                0386 01338000
*          (GPR00P,                                                0386 01339000
*           GPR01P) UNRESTRICTED;                                  0386 01340000
*       END;                        /* WAIT (1) ECB(ECB) WAIT FOR THE   01341000
*                                      PAGE FIX              @G33VPHE*/ 01342000
*       ECB=''B;                    /* CLEAR ECB FOR FUTURE USE    0388 01343000
*                                                            @G33VPHE*/ 01344000
         XC    ECB(4),ECB                                          0388 01345000
*       RFY                                                        0389 01346000
*         RETCODE RSTD;             /* SETLOCK SETS A RETCODE      0389 01347000
*                                                            @G33VPHE*/ 01348000
*GL:                                                               0390 01349000
*       DO;                         /* SETLOCK (OBTAIN) MODE(UNCOND)    01350000
*                                      TYPE(LOCAL) REGS(SAVE)      0390 01351000
*                                      RELATED(IEEMB815(FL))         */ 01352000
GL       DS    0H                                                  0391 01353000
*         RFY                                                      0391 01354000
*          (GPR11P,                                                0391 01355000
*           GPR12P,                                                0391 01356000
*           GPR13P,                                                0391 01357000
*           GPR14P) RSTD;                                          0391 01358000
*         RFY                                                      0392 01359000
*           GPR15P RSTD;                                           0392 01360000
*         GPR15P=GPR13P;            /* ADDRESS OF REGISTER SAVE AREA.*/ 01361000
         LR    GPR15P,GPR13P                                       0393 01362000
*         GEN(STM GPR11P,GPR14P,0(GPR15P));/* SAVE REGISTERS.        */ 01363000
         STM GPR11P,GPR14P,0(GPR15P)                                    01364000
*         GPR13P=PSALITA;           /* ADDRESS OF LOCK INTERFACE   0395 01365000
*                                      TABLE.                        */ 01366000
         L     GPR13P,PSALITA                                      0395 01367000
*         GEN(LM GPR11P,GPR13P,576(GPR13P));/* LOAD LOCKWORD, CLHT 0396 01368000
*                                      AND ENTRY ADRS.               */ 01369000
         LM GPR11P,GPR13P,576(GPR13P)                                   01370000
*         GEN(BALR GPR14P,GPR13P);  /* BALR TO SETLOCK RTN.          */ 01371000
         BALR GPR14P,GPR13P                                             01372000
*         GEN(ST GPR13P,16(0,GPR15P));/* SAVE RETURN CODE IN SAVE  0398 01373000
*                                      AREA.                         */ 01374000
         ST GPR13P,16(0,GPR15P)                                         01375000
*         GEN(LM GPR11P,GPR15P,0(GPR15P));/* RESTORE REGS. - PUT   0399 01376000
*                                      RETURN CODE IN 15.            */ 01377000
         LM GPR11P,GPR15P,0(GPR15P)                                     01378000
*         RFY                                                      0400 01379000
*           GPR15P UNRSTD;                                         0400 01380000
*         RFY                                                      0401 01381000
*          (GPR11P,                                                0401 01382000
*           GPR12P,                                                0401 01383000
*           GPR13P,                                                0401 01384000
*           GPR14P) UNRSTD;                                        0401 01385000
*       END;                        /* SETLOCK (OBTAIN) MODE(UNCOND)    01386000
*                                      TYPE(LOCAL) REGS(SAVE)      0402 01387000
*                                      RELATED(IEEMB815(FL)) @G33VPHE*/ 01388000
*       RFY                                                        0403 01389000
*         RETCODE UNRSTD;           /* SETLOCK RETCODE IGNORED     0403 01390000
*                                                            @G33VPHE*/ 01391000
*       RFY                                                        0404 01392000
*        (R0,                                                      0404 01393000
*         R1,                                                      0404 01394000
*         R4) RSTD;                 /* PARM REGS FOR THE BRANCH ENTRY   01395000
*                                      TO PGFIX              @G33VPHE*/ 01396000
*       R0=ADDR(ECB);               /* ECB ADDR IN R0        @G33VPHE*/ 01397000
         LA    R0,ECB                                              0405 01398000
*       R1=ADDR(VSL)|PGCHAIN;       /* LIST OF AREAS TO BE FIXED IS     01399000
*                                      POINTED TO BY R1      @G33VPHE*/ 01400000
         LA    R1,VSL                                              0406 01401000
         O     R1,@CF01975                                         0406 01402000
*       R4=0;                       /* NO TCB AFFINITY IN R4 @G33VPHE*/ 01403000
         SLR   R4,R4                                               0407 01404000
*       VSLOPT(1)=PGFIXFLG;         /* LONG TERM PAGE FIX    @G33VPHE*/ 01405000
         MVI   VSLOPT,X'42'                                        0408 01406000
*       VSLBEGA(1)=ADDR(AREA1BEG);  /* BEGIN ADDR            @G33VPHE*/ 01407000
         L     @15,CVTPTR                                          0409 01408000
         L     @06,CVTRTMCT(,@15)                                  0409 01409000
         L     @05,RTCTSDSW(,@06)                                  0409 01410000
         MVC   VSLBEGA(3),SMWKENTY+1(@05)                          0409 01411000
*       VSLENDA(1)=ADDR(AREA1END);  /* END ADDR              @G33VPHE*/ 01412000
         MVC   VSLENDA(3),SMWKSSDE+1(@05)                          0410 01413000
*       VSLOPT(2)=PGFIXFLG;         /* LONG TERM PAGE FIX    @G33VPHE*/ 01414000
         MVI   VSLOPT+8,X'42'                                      0411 01415000
*       VSLBEGA(2)=ADDR(AREA2BEG);  /* BEGIN ADDR            @G33VPHE*/ 01416000
         MVC   VSLBEGA+8(3),SMWKPFXB+1(@05)                        0412 01417000
*       VSLENDA(2)=ADDR(AREA2END);  /*                       @G33VPHE*/ 01418000
         MVC   VSLENDA+8(3),SMWKPFXE+1(@05)                        0413 01419000
*       VSLOPT(3)=PGFIXFLG;         /* LONG TERM PAGE FIX    @G33VPHE*/ 01420000
         MVI   VSLOPT+16,X'42'                                     0414 01421000
*       VSLBEGA(3)=ADDR(AREA3BEG);  /* BEGIN ADDR            @G33VPHE*/ 01422000
         L     @06,RTCTSDWK(,@06)                                  0415 01423000
         STCM  @06,7,VSLBEGA+16                                    0415 01424000
*       VSLENDA(3)=ADDR(AREA3END);  /*                       @G33VPHE*/ 01425000
         AH    @06,@CH02249                                        0416 01426000
         STCM  @06,7,VSLENDA+16                                    0416 01427000
*       VSLEND(3)=ON;               /* LIST END FLAG         @G33VPHE*/ 01428000
         OI    VSLEND+16,B'10000000'                               0417 01429000
*       CALL IEAVPSIB;              /* CALL PGFIX            @G33VPHE*/ 01430000
         L     @06,PVTPTR(,@15)                                    0418 01431000
         L     @15,PVTPSIB(,@06)                                   0418 01432000
         BALR  @14,@15                                             0418 01433000
*       RFY                                                        0419 01434000
*        (R0,                                                      0419 01435000
*         R1,                                                      0419 01436000
*         R4) UNRSTD;               /*                       @G33VPHE*/ 01437000
*       RFY                                                        0420 01438000
*         RETCODE RSTD;             /* SETLOCK SETS A RETCODE      0420 01439000
*                                                            @G33VPHE*/ 01440000
*FL:                                                               0421 01441000
*       DO;                         /* SETLOCK (RELEASE) TYPE(LOCAL)    01442000
*                                      REGS(SAVE)                  0421 01443000
*                                      RELATED(IEEMB815(GL))         */ 01444000
FL       DS    0H                                                  0422 01445000
*         RFY                                                      0422 01446000
*          (GPR11P,                                                0422 01447000
*           GPR12P,                                                0422 01448000
*           GPR13P,                                                0422 01449000
*           GPR14P) RSTD;                                          0422 01450000
*         RFY                                                      0423 01451000
*           GPR15P RSTD;                                           0423 01452000
*         GPR15P=GPR13P;            /* ADDRESS OF REGISTER SAVE AREA.*/ 01453000
         LR    GPR15P,GPR13P                                       0424 01454000
*         GEN(STM GPR11P,GPR14P,0(GPR15P));/* SAVE REGISTERS.        */ 01455000
         STM GPR11P,GPR14P,0(GPR15P)                                    01456000
*         GPR13P=PSALITA;           /* ADDRESS OF LOCK INTERFACE   0426 01457000
*                                      TABLE.                        */ 01458000
         L     GPR13P,PSALITA                                      0426 01459000
*         GEN(LM GPR11P,GPR13P,588(GPR13P));/* LOAD LOCKWORD, CLHT 0427 01460000
*                                      AND ENTRY ADRS.               */ 01461000
         LM GPR11P,GPR13P,588(GPR13P)                                   01462000
*         GEN(BALR GPR14P,GPR13P);  /* BALR TO SETLOCK RTN.          */ 01463000
         BALR GPR14P,GPR13P                                             01464000
*         GEN(ST GPR13P,16(0,GPR15P));/* SAVE RETURN CODE IN SAVE  0429 01465000
*                                      AREA.                         */ 01466000
         ST GPR13P,16(0,GPR15P)                                         01467000
*         GEN(LM GPR11P,GPR15P,0(GPR15P));/* RESTORE REGS. - PUT   0430 01468000
*                                      RETURN CODE IN 15.            */ 01469000
         LM GPR11P,GPR15P,0(GPR15P)                                     01470000
*         RFY                                                      0431 01471000
*           GPR15P UNRSTD;                                         0431 01472000
*         RFY                                                      0432 01473000
*          (GPR11P,                                                0432 01474000
*           GPR12P,                                                0432 01475000
*           GPR13P,                                                0432 01476000
*           GPR14P) UNRSTD;                                        0432 01477000
*       END;                        /* SETLOCK (RELEASE) TYPE(LOCAL)    01478000
*                                      REGS(SAVE)                  0433 01479000
*                                      RELATED(IEEMB815(GL)) @G33VPHE*/ 01480000
*       RFY                                                        0434 01481000
*         RETCODE UNRSTD;           /* SETLOCK RETCODE IGNORED     0434 01482000
*                                                            @G33VPHE*/ 01483000
*       DO;                         /* WAIT (1) ECB(ECB)             */ 01484000
*         RESPECIFY                                                0436 01485000
*          (GPR00P,                                                0436 01486000
*           GPR01P) RESTRICTED;                                    0436 01487000
*         GPR00P=1;                 /* LOAD WAIT COUNT               */ 01488000
         LA    GPR00P,1                                            0437 01489000
*         GPR01P=ADDR(ECB);         /* ADDRESS OF ECB                */ 01490000
         LA    GPR01P,ECB                                          0438 01491000
*         SVC(1);                   /* WAIT SVC                      */ 01492000
         SVC   1                                                   0439 01493000
*         RESPECIFY                                                0440 01494000
*          (GPR00P,                                                0440 01495000
*           GPR01P) UNRESTRICTED;                                  0440 01496000
*       END;                        /* WAIT (1) ECB(ECB) WAIT FOR THE   01497000
*                                      PAGE FIX              @G33VPHE*/ 01498000
*       FIXCNT=1;                   /* START THE COUNT OF THE NUMBER    01499000
*                                      OF FIXES WHICH MUST BE FREED     01500000
*                                                            @G33VPHE*/ 01501000
         MVC   FIXCNT(2),@CH00065                                  0442 01502000
*     END;                          /* OF PGFIX FOR SUMDUMP  @G33VPHE*/ 01503000
*                                                                  0444 01504000
*   /*****************************************************************/ 01505000
*   /*                                                               */ 01506000
*   /* USING COMPARE AND SWAP, UPDATE THE EFFECTIVE DUMP OPTIONS IN  */ 01507000
*   /* THE RTCT.                                             @G33CPHE*/ 01508000
*   /*                                                               */ 01509000
*   /*****************************************************************/ 01510000
*                                                                  0444 01511000
*   RESPECIFY                                                      0444 01512000
*    (COMPREG,                                                     0444 01513000
*     SWAPREG,                                                     0444 01514000
*     RTCTREG) RESTRICTED;          /*                       @G33CPHE*/ 01515000
@RF00368 DS    0H                                                  0445 01516000
*   RTCTREG=ADDR(RTCT);             /*                       @G33CPHE*/ 01517000
         L     @15,CVTPTR                                          0445 01518000
         L     RTCTREG,CVTRTMCT(,@15)                              0445 01519000
*   RFY                                                            0446 01520000
*     RTCT BASED(RTCTREG);          /*                       @G33CPHE*/ 01521000
*   COMPREG=RTCTOPTS(DT);           /* OBTAIN COMPARE VALUE FOR THE     01522000
*                                      COMPARE AND SWAP      @G33CPHE*/ 01523000
*                                                                  0447 01524000
         LR    @15,DT                                              0447 01525000
         SLA   @15,2                                               0447 01526000
         L     COMPREG,RTCTOPTS-4(@15,RTCTREG)                     0447 01527000
*   /*****************************************************************/ 01528000
*   /*                                                               */ 01529000
*   /* NODUMP CASE                                           @G33CPHE*/ 01530000
*   /*                                                               */ 01531000
*   /*****************************************************************/ 01532000
*                                                                  0448 01533000
*   IF NODUMP=ON                    /* WAS NODUMP SPECIFIED  @G33CPHE*/ 01534000
*     THEN                                                         0448 01535000
         TM    NODUMP,B'00000001'                                  0448 01536000
         BNO   @RF00448                                            0448 01537000
*     DO;                                                          0449 01538000
*       SWAPREG=NODMPOPT;           /* SET ALL OPTIONS TO ZERO EXCEPT   01539000
*                                      NODUMP AND OVER MODE  @G33CPHE*/ 01540000
         LA    SWAPREG,3                                           0450 01541000
*CS1:                                                              0451 01542000
*       CS(COMPREG,SWAPREG,RTCTOPTS(DT));/* MOVE NEW DUMP OPTIONS FOR   01543000
*                                      THIS DUMP TYPE INTO THE RTCT     01544000
*                                                            @G33CPHE*/ 01545000
CS1      LR    @06,DT                                              0451 01546000
         SLA   @06,2                                               0451 01547000
         ALR   @06,RTCTREG                                         0451 01548000
         CS    COMPREG,@07,RTCTOPTS-4(@06)                         0451 01549000
*       BC(4,CS1);                  /* DO IT UNTIL IT WORKS  @G33CPHE*/ 01550000
         BC    4,CS1                                               0452 01551000
*     END;                          /*                       @G33CPHE*/ 01552000
*                                                                  0453 01553000
*   /*****************************************************************/ 01554000
*   /*                                                               */ 01555000
*   /* RESET CASE                                            @G33CPHE*/ 01556000
*   /*                                                               */ 01557000
*   /*****************************************************************/ 01558000
*                                                                  0454 01559000
*   ELSE                                                           0454 01560000
*     IF CDRESET=ON                 /* IS THIS A RESET OPERATION   0454 01561000
*                                                            @G33CPHE*/ 01562000
*       THEN                                                       0454 01563000
         B     @RC00448                                            0454 01564000
@RF00448 TM    CDRESET,B'01000000'                                 0454 01565000
         BNO   @RF00454                                            0454 01566000
*IMPRESET:                                                         0455 01567000
*       DO;                         /*                       @G33CPHE*/ 01568000
IMPRESET DS    0H                                                  0456 01569000
*         IF DT=SVDINDEX            /* BECAUSE SDUMP HAS NO PARM LIB    01570000
*                                      MEMBER IT IS RESET DIFFERENTLY   01571000
*                                                            @G33CPHE*/ 01572000
*           THEN                    /*                       @G33CPHE*/ 01573000
         CH    DT,@CH00057                                         0456 01574000
         BNE   @RF00456                                            0456 01575000
*           SWAPREG=ADDONLY;        /* GO TO ADD MODE BUT HAVE NO  0457 01576000
*                                      DEFAULTS FROM PARMLIB @G33CPHE*/ 01577000
         SLR   SWAPREG,SWAPREG                                     0457 01578000
*         ELSE                      /*                       @G33CPHE*/ 01579000
*           SWAPREG=RTCTPLB(DT)&OVEROFF;/* FOR RESET COPY IN THE   0458 01580000
*                                      INITIAL PARMLIB VALUES AND SET   01581000
*                                      ADD MODE              @G33CPHE*/ 01582000
         B     @RC00456                                            0458 01583000
@RF00456 LR    @15,DT                                              0458 01584000
         SLA   @15,2                                               0458 01585000
         L     SWAPREG,RTCTPLB-4(@15,RTCTREG)                      0458 01586000
         N     SWAPREG,@CF02040                                    0458 01587000
*CS2:                                                              0459 01588000
*         CS(COMPREG,SWAPREG,RTCTOPTS(DT));/* STASH THE ORIGINAL   0459 01589000
*                                      OPTIONS BACK IN THE RTCT AGAIN   01590000
*                                                            @G33CPHE*/ 01591000
@RC00456 DS    0H                                                  0459 01592000
CS2      LR    @06,DT                                              0459 01593000
         SLA   @06,2                                               0459 01594000
         ALR   @06,RTCTREG                                         0459 01595000
         CS    COMPREG,@07,RTCTOPTS-4(@06)                         0459 01596000
*         BC(4,CS2);                /*                       @G33CPHE*/ 01597000
         BC    4,CS2                                               0460 01598000
*       END;                        /*                       @G33CPHE*/ 01599000
*                                                                  0461 01600000
*   /*****************************************************************/ 01601000
*   /*                                                               */ 01602000
*   /* DEL CASE                                              @G33CPHE*/ 01603000
*   /*                                                               */ 01604000
*   /*****************************************************************/ 01605000
*                                                                  0462 01606000
*     ELSE                                                         0462 01607000
*       IF CDSET=OFF                /* IS THIS A DELETE OPERATION. 0462 01608000
*                                      NOTE RESETS HAVE ALREADY BEEN    01609000
*                                      TAKEN CARE OF         @G33CPHE*/ 01610000
*         THEN                                                     0462 01611000
         B     @RC00454                                            0462 01612000
@RF00454 TM    CDSET,B'10000000'                                   0462 01613000
         BNZ   @RF00462                                            0462 01614000
*         DO;                       /* YES                   @G33CPHE*/ 01615000
*CS3:                                                              0464 01616000
*           SWAPREG=COMPREG&(NOT&&CHNGWORK(DT));/* TURN OFF ALL    0464 01617000
*                                      OPTIONS INDICATED     @G33CPHE*/ 01618000
CS3      LR    @15,DT                                              0464 01619000
         SLA   @15,2                                               0464 01620000
         SLR   SWAPREG,SWAPREG                                     0464 01621000
         BCTR  SWAPREG,0                                           0464 01622000
         X     SWAPREG,CHNGWORK-4(@15)                             0464 01623000
         NR    SWAPREG,COMPREG                                     0464 01624000
*           IF SWAPREG=OVERONLY     /* IF THE LAST OPTION HAS BEEN 0465 01625000
*                                      DELETED AND IT IS IN OVER MODE   01626000
*                                                            @G33CPHE*/ 01627000
*             THEN                  /* THIS IS AN IMPLICIT RESET   0465 01628000
*                                                            @G33CPHE*/ 01629000
         CH    SWAPREG,@CH02038                                    0465 01630000
         BE    @RT00465                                            0465 01631000
*             GO TO IMPRESET;       /* BRANCH BACK TO THE CORRECT  0466 01632000
*                                      CODE FOR RESET        @G33CPHE*/ 01633000
*           CS(COMPREG,SWAPREG,RTCTOPTS(DT));/* BRING THE RTCT UP TO    01634000
*                                      DATE                  @G33CPHE*/ 01635000
         ALR   @15,RTCTREG                                         0467 01636000
         CS    COMPREG,@07,RTCTOPTS-4(@15)                         0467 01637000
*           BC(4,CS3);              /*                       @G33CPHE*/ 01638000
         BC    4,CS3                                               0468 01639000
*         END;                      /*                       @G33CPHE*/ 01640000
*                                                                  0469 01641000
*   /*****************************************************************/ 01642000
*   /*                                                               */ 01643000
*   /* SET CASE                                              @G33CPHE*/ 01644000
*   /*                                                               */ 01645000
*   /*****************************************************************/ 01646000
*                                                                  0470 01647000
*       ELSE                                                       0470 01648000
*CS4:                                                              0470 01649000
*         DO;                       /* THIS COULD ONLY BE A SET    0470 01650000
*                                      OPERATION             @G33CPHE*/ 01651000
         B     @RC00462                                            0470 01652000
@RF00462 DS    0H                                                  0470 01653000
CS4      DS    0H                                                  0471 01654000
*                                                                  0471 01655000
*           /*********************************************************/ 01656000
*           /*                                                       */ 01657000
*           /* THIS SEGMENT EXISTS TO HANDLE THE SPECIAL CASES SUCH  */ 01658000
*           /* AS THE 'SA' PDATA OPTION, CONFLICTING SDUMP OPTIONS,  */ 01659000
*           /* AND MODE CHANGES. IF THE MODE CHANGES FROM ADD TO OVER*/ 01660000
*           /* THE EFFECTIVE OPTIONS CORRESPONDING TO VALUES IN      */ 01661000
*           /* PARMLIB MUST BE TURNED OFF. IF IT IS OVER TO ADD MODE */ 01662000
*           /* THE PARMLIB VALUES MUST BE ADDED BACK INTO THE        */ 01663000
*           /* EFFECTIVE OPTIONS LIST.                       @G33CPHE*/ 01664000
*           /* ***************************************************** */ 01665000
*           /* NOTE THIS LOGIC WILL NOT WORK FOR 'OPTION/NOOPTION'   */ 01666000
*           /* PAIRS (E.G. SQA/NOSQA). THE PROBLEM ARRISES IF ONE IS */ 01667000
*           /* IN PARMLIB AND THE OPPOSITE IS IN THE EFFECTIVE OPT   */ 01668000
*           /* LIST PRIOR TO THE CD CMD. IF THE DUMPTYPE IS CHANGING */ 01669000
*           /* FROM OVER TO ADD MODE, THE EFFECTIVE OPTIONS AND THE  */ 01670000
*           /* PARMLIB OPTIONS ARE ADDED TOGETHER WITHOUT CHECKING   */ 01671000
*           /* FOR CONFLICTS. CURRENTLY ONLY THE SDUMP DUMPTYPE HAS  */ 01672000
*           /* CONFLICTING OPTIONS AND SINCE IT DOES NOT HAVE A      */ 01673000
*           /* PARMLIB OPTION LIST THE PROBLEM IS AVOIDED.   @G33CPHE*/ 01674000
*           /*                                                       */ 01675000
*           /*********************************************************/ 01676000
*                                                                  0471 01677000
*           IF(ADDMODE=ON&MODEOPT(DT)=ON)|(OVERMODE=ON&MODEOPT(DT)=OFF) 01678000
*                                   /* IF THE MODE HAS CHANGED     0471 01679000
*                                                            @G33CPHE*/ 01680000
*             THEN                  /* FIGURE IN PARMLIB OPTIONS   0471 01681000
*                                                            @G33CPHE*/ 01682000
         TM    ADDMODE,B'00000100'                                 0471 01683000
         BNO   @GL00034                                            0471 01684000
         LR    @15,DT                                              0471 01685000
         SLA   @15,2                                               0471 01686000
         ALR   @15,RTCTREG                                         0471 01687000
         TM    MODEOPT-4(@15),B'00000010'                          0471 01688000
         BO    @RT00471                                            0471 01689000
@GL00034 TM    OVERMODE,B'00000010'                                0471 01690000
         BNO   @RF00471                                            0471 01691000
         LR    @15,DT                                              0471 01692000
         SLA   @15,2                                               0471 01693000
         ALR   @15,RTCTREG                                         0471 01694000
         TM    MODEOPT-4(@15),B'00000010'                          0471 01695000
         BNZ   @RF00471                                            0471 01696000
@RT00471 DS    0H                                                  0472 01697000
*             IF DT=SVDINDEX        /* SVCDUMP HAS NO PARMLIB MEMBER    01698000
*                                                            @G33CPHE*/ 01699000
*               THEN                                               0472 01700000
         CH    DT,@CH00057                                         0472 01701000
         BNE   @RF00472                                            0472 01702000
*               IF ADDMODE=ON       /*                       @G33CPHE*/ 01703000
*                 THEN                                             0473 01704000
         TM    ADDMODE,B'00000100'                                 0473 01705000
         BNO   @RF00473                                            0473 01706000
*                 CHNGUPDT(SVDINDEX)=COMPREG&OVEROFF;/*      @G33CPHE*/ 01707000
         LR    @15,COMPREG                                         0474 01708000
         N     @15,@CF02040                                        0474 01709000
         ST    @15,CHNGUPDT+12                                     0474 01710000
*               ELSE                                               0475 01711000
*                 CHNGUPDT(SVDINDEX)=COMPREG|OVERON;/*       @G33CPHE*/ 01712000
         B     @RC00473                                            0475 01713000
@RF00473 LR    @15,COMPREG                                         0475 01714000
         O     @15,@CF02038                                        0475 01715000
         ST    @15,CHNGUPDT+12                                     0475 01716000
*             ELSE                  /* FOR ALL OTHER DUMP TYPES    0476 01717000
*                                                            @G33CPHE*/ 01718000
*               IF ADDMODE=ON       /*                       @G33CPHE*/ 01719000
*                 THEN              /* ADD IN THE PARMLIB VALUES   0476 01720000
*                                                            @G33CPHE*/ 01721000
         B     @RC00472                                            0476 01722000
@RF00472 TM    ADDMODE,B'00000100'                                 0476 01723000
         BNO   @RF00476                                            0476 01724000
*                 CHNGUPDT(DT)=(COMPREG|RTCTPLB(DT))&OVEROFF;/* SET     01725000
*                                      ADD MODE AND ADD THE OPTIONS     01726000
*                                      FROM PARMLIB TO OPTIONS     0477 01727000
*                                      ALREADY ON            @G33CPHE*/ 01728000
         LR    @15,DT                                              0477 01729000
         SLA   @15,2                                               0477 01730000
         LR    @06,COMPREG                                         0477 01731000
         O     @06,RTCTPLB-4(@15,RTCTREG)                          0477 01732000
         N     @06,@CF02040                                        0477 01733000
         ST    @06,CHNGUPDT-4(@15)                                 0477 01734000
*               ELSE                /* SUBTRACT OUT THE PARMLIB    0478 01735000
*                                      VALUES FIRST AND SET OVER MODE   01736000
*                                                            @G33CPHE*/ 01737000
*                 CHNGUPDT(DT)=(COMPREG&(NOT&&RTCTPLB(DT)))|OVERON;/*   01738000
*                                                            @G33CPHE*/ 01739000
         B     @RC00476                                            0478 01740000
@RF00476 LR    @15,DT                                              0478 01741000
         SLA   @15,2                                               0478 01742000
         SLR   @06,@06                                             0478 01743000
         BCTR  @06,0                                               0478 01744000
         X     @06,RTCTPLB-4(@15,RTCTREG)                          0478 01745000
         NR    @06,COMPREG                                         0478 01746000
         O     @06,@CF02038                                        0478 01747000
         ST    @06,CHNGUPDT-4(@15)                                 0478 01748000
*           ELSE                    /*                       @G33CPHE*/ 01749000
*             CHNGUPDT(DT)=COMPREG; /* IF THERE IS NO MODE CHANGE  0479 01750000
*                                      THEN START OFF WITH THE     0479 01751000
*                                      OPTIONS AS THEY ARE IN THE  0479 01752000
*                                      RTCT                  @G33CPHE*/ 01753000
         B     @RC00471                                            0479 01754000
@RF00471 LR    @15,DT                                              0479 01755000
         SLA   @15,2                                               0479 01756000
         ST    COMPREG,CHNGUPDT-4(@15)                             0479 01757000
*           CHNGUPDT(DT)=(CHNGUPDT(DT)&NODMPOFF)|CHNGWORK(DT);/* TURN   01758000
*                                      OFF THE NODUMP FLAG IF IT IS     01759000
*                                      ON AND MERGE IN THE OPTIONS 0480 01760000
*                                      FROM THE COMMAND      @G33CPHE*/ 01761000
*                                                                  0480 01762000
@RC00471 LR    @15,DT                                              0480 01763000
         SLA   @15,2                                               0480 01764000
         LA    @06,CHNGUPDT-4(@15)                                 0480 01765000
         ST    @06,@TF00001                                        0480 01766000
         LA    @06,CHNGUPDT-4(@15)                                 0480 01767000
         MVC   @TS00001(4),0(@06)                                  0480 01768000
         NC    @TS00001(4),@CB02042                                0480 01769000
         LA    @06,CHNGWORK-4(@15)                                 0480 01770000
         OC    @TS00001(4),0(@06)                                  0480 01771000
         L     @15,@TF00001                                        0480 01772000
         MVC   0(4,@15),@TS00001                                   0480 01773000
*           /*********************************************************/ 01774000
*           /*                                                       */ 01775000
*           /* ADJUST FOR CONFLICTING SDUMP OPTIONS (E.G. SQA NOSQA) */ 01776000
*           /*                                               @G33CPHE*/ 01777000
*           /*                                                       */ 01778000
*           /*********************************************************/ 01779000
*                                                                  0481 01780000
*           IF DT=SVDINDEX THEN                                    0481 01781000
         CH    DT,@CH00057                                         0481 01782000
         BNE   @RF00481                                            0481 01783000
*             DO;                   /* FOR SDUMP             @G33CPHE*/ 01784000
*               IF ADDR(CHNGWORK)->RTCTSDPB=ON/* NOSUM       @G33CPHE*/ 01785000
*                 THEN                                             0483 01786000
         LA    @15,CHNGWORK                                        0483 01787000
         TM    RTCTSDPB(@15),B'00010000'                           0483 01788000
         BNO   @RF00483                                            0483 01789000
*                 ADDR(CHNGUPDT)->RTCTSDPA=OFF;/* SUM        @G33SPHE*/ 01790000
         LA    @15,CHNGUPDT                                        0484 01791000
         NI    RTCTSDPA(@15),B'11011111'                           0484 01792000
*               ELSE                /* CHECK FOR THE OTHER WAY     0485 01793000
*                                                            @G33CPHE*/ 01794000
*                 IF ADDR(CHNGWORK)->RTCTSDPA=ON/* SUM       @G33CPHE*/ 01795000
*                   THEN                                           0485 01796000
         B     @RC00483                                            0485 01797000
@RF00483 LA    @15,CHNGWORK                                        0485 01798000
         TM    RTCTSDPA(@15),B'00100000'                           0485 01799000
         BNO   @RF00485                                            0485 01800000
*                   ADDR(CHNGUPDT)->RTCTSDPB=OFF;/* NOSUM    @G33SPHE*/ 01801000
         LA    @15,CHNGUPDT                                        0486 01802000
         NI    RTCTSDPB(@15),B'11101111'                           0486 01803000
*               IF ADDR(CHNGWORK)->RTCTSDPC=ON/* NOALLPSA    @G33CPHE*/ 01804000
*                 THEN                                             0487 01805000
@RF00485 DS    0H                                                  0487 01806000
@RC00483 LA    @15,CHNGWORK                                        0487 01807000
         TM    RTCTSDPC(@15),B'00001000'                           0487 01808000
         BNO   @RF00487                                            0487 01809000
*                 ADDR(CHNGUPDT)->RTCTSDP0=OFF;/* ALLPSA     @G33SPHE*/ 01810000
         LA    @15,CHNGUPDT                                        0488 01811000
         NI    RTCTSDP0(@15),B'01111111'                           0488 01812000
*               ELSE                /* CHECK FOR THE OTHER WAY     0489 01813000
*                                                            @G33CPHE*/ 01814000
*                 IF ADDR(CHNGWORK)->RTCTSDP0=ON/* ALLPSA    @G33CPHE*/ 01815000
*                   THEN                                           0489 01816000
         B     @RC00487                                            0489 01817000
@RF00487 LA    @15,CHNGWORK                                        0489 01818000
         TM    RTCTSDP0(@15),B'10000000'                           0489 01819000
         BNO   @RF00489                                            0489 01820000
*                   ADDR(CHNGUPDT)->RTCTSDPC=OFF;/* NOALLPSA @G33SPHE*/ 01821000
         LA    @15,CHNGUPDT                                        0490 01822000
         NI    RTCTSDPC(@15),B'11110111'                           0490 01823000
*               IF ADDR(CHNGWORK)->RTCTSDPD=ON/* NOSQA       @G33CPHE*/ 01824000
*                 THEN                                             0491 01825000
@RF00489 DS    0H                                                  0491 01826000
@RC00487 LA    @15,CHNGWORK                                        0491 01827000
         TM    RTCTSDPD(@15),B'00000100'                           0491 01828000
         BNO   @RF00491                                            0491 01829000
*                 ADDR(CHNGUPDT)->RTCTSDP3=OFF;/* SQA        @G33SPHE*/ 01830000
         LA    @15,CHNGUPDT                                        0492 01831000
         NI    RTCTSDP3(@15),B'11101111'                           0492 01832000
*               ELSE                /* CHECK FOR THE OTHER WAY     0493 01833000
*                                                            @G33CPHE*/ 01834000
*                 IF ADDR(CHNGWORK)->RTCTSDP3=ON/* SQA       @G33CPHE*/ 01835000
*                   THEN                                           0493 01836000
         B     @RC00491                                            0493 01837000
@RF00491 LA    @15,CHNGWORK                                        0493 01838000
         TM    RTCTSDP3(@15),B'00010000'                           0493 01839000
         BNO   @RF00493                                            0493 01840000
*                   ADDR(CHNGUPDT)->RTCTSDPD=OFF;/* NOSQA    @G33SPHE*/ 01841000
         LA    @15,CHNGUPDT                                        0494 01842000
         NI    RTCTSDPD(@15),B'11111011'                           0494 01843000
*               IF ADDR(CHNGWORK)->RTCTSDPG=ON/* CHECK FOR Q=YES FROM   01844000
*                                      THE COMMAND           @G33CPHE*/ 01845000
*                 THEN                                             0495 01846000
@RF00493 DS    0H                                                  0495 01847000
@RC00491 LA    @15,CHNGWORK                                        0495 01848000
         TM    RTCTSDPG(@15),B'10000000'                           0495 01849000
         BNO   @RF00495                                            0495 01850000
*                 ADDR(CHNGUPDT)->RTCTSDPH=OFF;/* TURN OFF Q=NO    0496 01851000
*                                                            @G33CPHE*/ 01852000
         LA    @15,CHNGUPDT                                        0496 01853000
         NI    RTCTSDPH(@15),B'10111111'                           0496 01854000
*               ELSE                                               0497 01855000
*                 IF ADDR(CHNGWORK)->RTCTSDPH=ON/* CHECK FOR Q=NO  0497 01856000
*                                      FROM THE COMMAND      @G33CPHE*/ 01857000
*                   THEN                                           0497 01858000
         B     @RC00495                                            0497 01859000
@RF00495 LA    @15,CHNGWORK                                        0497 01860000
         TM    RTCTSDPH(@15),B'01000000'                           0497 01861000
         BNO   @RF00497                                            0497 01862000
*                   ADDR(CHNGUPDT)->RTCTSDPG=OFF;/* TURN OFF Q=YES 0498 01863000
*                                                            @G33CPHE*/ 01864000
         LA    @15,CHNGUPDT                                        0498 01865000
         NI    RTCTSDPG(@15),B'01111111'                           0498 01866000
*             END;                  /*                       @G33CPHE*/ 01867000
*                                                                  0499 01868000
@RF00497 DS    0H                                                  0499 01869000
@RC00495 DS    0H                                                  0500 01870000
*           /*********************************************************/ 01871000
*           /*                                                       */ 01872000
*           /* ADJUST FOR 'SA' 'SAH' OPTION INTERACTION      @G33CPHE*/ 01873000
*           /*                                                       */ 01874000
*           /*********************************************************/ 01875000
*                                                                  0500 01876000
*           IF(DT=SADINDEX|DT=SUDINDEX)/* FOR SYSABEND AND SYSUDUMP     01877000
*                                                            @G33CPHE*/ 01878000
*               &SETSA='1'B         /* HAS 'SA' OPTION BEEN        0500 01879000
*                                      REQUESTED?                    */ 01880000
*             THEN                                                 0500 01881000
@RF00481 CH    DT,@CH00065                                         0500 01882000
         BE    @GL00037                                            0500 01883000
         CH    DT,@CH00077                                         0500 01884000
         BNE   @RF00500                                            0500 01885000
@GL00037 TM    SETSA,B'00000010'                                   0500 01886000
         BNO   @RF00500                                            0500 01887000
*             ADDR(CHNGUPDT(DT))->RTCTSAD9=OFF;/* INSURE SA FLAG IS     01888000
*                                      OFF BECAUSE THIS IS A       0501 01889000
*                                      BACKWARDS OPTION. TO GET IT 0501 01890000
*                                      THE BIT MUST BE OFF   @G33CPHE*/ 01891000
         LR    @15,DT                                              0501 01892000
         SLA   @15,2                                               0501 01893000
         LA    @15,CHNGUPDT-4(@15)                                 0501 01894000
         NI    RTCTSAD9(@15),B'10111111'                           0501 01895000
*           SWAPREG=CHNGUPDT(DT);   /*                       @G33CPHE*/ 01896000
@RF00500 LR    @15,DT                                              0502 01897000
         SLA   @15,2                                               0502 01898000
         L     SWAPREG,CHNGUPDT-4(@15)                             0502 01899000
*           IF SWAPREG=OVERONLY     /* IF THERE ARE NO OPTIONS AND 0503 01900000
*                                      OVER MODE IS SPECIFIED      0503 01901000
*                                                            @G33CPHE*/ 01902000
*             THEN                  /* THIS IS AN IMPLICIT RESET   0503 01903000
*                                                            @G33CPHE*/ 01904000
         CH    SWAPREG,@CH02038                                    0503 01905000
         BE    @RT00503                                            0503 01906000
*             GO TO IMPRESET;       /* BRANCH BACK TO THE CORRECT  0504 01907000
*                                      CODE FOR RESET        @G33CPHE*/ 01908000
*           CS(COMPREG,SWAPREG,RTCTOPTS(DT));/*              @G33CPHE*/ 01909000
         ALR   @15,RTCTREG                                         0505 01910000
         CS    COMPREG,@07,RTCTOPTS-4(@15)                         0505 01911000
*           BC(4,CS4);              /*                       @G33CPHE*/ 01912000
         BC    4,CS4                                               0506 01913000
*         END;                      /*                       @G33CPHE*/ 01914000
*                                                                  0508 01915000
*   /*****************************************************************/ 01916000
*   /*                                                               */ 01917000
*   /* SUMMARY DUMP SUPPORT TO PGFIX OR PGFREE SUMMARY DUMP AREAS IF */ 01918000
*   /* THE POSSIBILITY OF TAKING A SUMMARY DUMP CHANGES. AT THIS     */ 01919000
*   /* POINT IF THE FIX STATUS OF SUMDUMP IS TO CHANGE THE FIX COUNT */ 01920000
*   /* IS ADJUSTED TO CAUSE ONE MORE OR LESS PGFREE.         @G33VPHE*/ 01921000
*   /*                                                               */ 01922000
*   /*****************************************************************/ 01923000
*                                                                  0508 01924000
*   IF DT=SVDINDEX                  /* IS THIS UPDATE FOR SDUMP    0508 01925000
*                                                            @G33VPHE*/ 01926000
*     THEN                          /* YES IT IS             @G33VPHE*/ 01927000
@RC00462 DS    0H                                                  0508 01928000
@RC00454 DS    0H                                                  0508 01929000
@RC00448 CH    DT,@CH00057                                         0508 01930000
         BNE   @RF00508                                            0508 01931000
*     DO;                           /* SO CALCULATE HOW MANY PGFREE     01932000
*                                      TO DO AND DO THEM     @G33VPHE*/ 01933000
*       IF(COMPREG&SDFREE)=0        /* IF A SUMDUMP WAS POSSIBLE   0510 01934000
*                                      BEFORE THE CHANGE     @G33VPHE*/ 01935000
*           &(SWAPREG&SDFREE)¬=0    /* AND IS NOT POSSIBLE AFTER THE    01936000
*                                      THE CHANGE            @G33VPHE*/ 01937000
*         THEN                      /* THE NET RESULT SHOULD BE TO 0510 01938000
*                                      PGFREE IT             @G33VPHE*/ 01939000
         SLR   @15,@15                                             0510 01940000
         L     @06,@CF01988                                        0510 01941000
         LR    @00,COMPREG                                         0510 01942000
         NR    @00,@06                                             0510 01943000
         CR    @00,@15                                             0510 01944000
         BNE   @RF00510                                            0510 01945000
         NR    @06,SWAPREG                                         0510 01946000
         CR    @06,@15                                             0510 01947000
         BE    @RF00510                                            0510 01948000
*         FIXCNT=FIXCNT+1;          /* INCR THE CNT OF PGFREES TO BE    01949000
*                                      DONE                  @G33VPHE*/ 01950000
         LH    @15,FIXCNT                                          0511 01951000
         LA    @15,1(,@15)                                         0511 01952000
         STH   @15,FIXCNT                                          0511 01953000
*       ELSE                        /* IF IT DOESN'T NEED TO BE    0512 01954000
*                                      PGFREED               @G33VPHE*/ 01955000
*         IF(COMPREG&SDFREE)¬=0     /* IF A SUMDUMP WAS NOT POSSIBLE    01956000
*                                      BEFORE THE CHANGE     @G33VPHE*/ 01957000
*             &(SWAPREG&SDFREE)=0   /* AND IS POSSIBLE AFTERWARD   0512 01958000
*                                                            @G33VPHE*/ 01959000
*           THEN                    /* THE NET RESULT SHOULD BE TO 0512 01960000
*                                      PGFIX IT              @G33VPHE*/ 01961000
         B     @RC00510                                            0512 01962000
@RF00510 SLR   @15,@15                                             0512 01963000
         L     @06,@CF01988                                        0512 01964000
         LR    @00,COMPREG                                         0512 01965000
         NR    @00,@06                                             0512 01966000
         CR    @00,@15                                             0512 01967000
         BE    @RF00512                                            0512 01968000
         NR    @06,SWAPREG                                         0512 01969000
         CR    @06,@15                                             0512 01970000
         BNE   @RF00512                                            0512 01971000
*           FIXCNT=FIXCNT-1;        /* DECR THE CNT OF PGFREES TO BE    01972000
*                                      DONE                  @G33VPHE*/ 01973000
         LH    @15,FIXCNT                                          0513 01974000
         BCTR  @15,0                                               0513 01975000
         STH   @15,FIXCNT                                          0513 01976000
*         ELSE                                                     0514 01977000
*           ;                       /* THERE HAS BEEN NO CHANGE IS 0514 01978000
*                                      STATUS FOR SUMDUMP    @G33VPHE*/ 01979000
@RF00512 DS    0H                                                  0515 01980000
*                                                                  0515 01981000
*       /*************************************************************/ 01982000
*       /*                                                           */ 01983000
*       /* AFTER ADJUSTMENT, IF THE FIX COUNT IS 0 IF THE OPTIONS    */ 01984000
*       /* CHANGED FROM SUMMARY DUMP IMPOSSIBLE TO POSSIBLE, 1 IF THE*/ 01985000
*       /* OPTIONS HAVE NOT CHANGED THE POSSIBILITY OF A SUMDUMP, OR */ 01986000
*       /* 2 IF THE OPTIONS HAVE CHANGED FROM SUMMARY DUMP POSSIBLE  */ 01987000
*       /* TO IMPOSSIBLE. PGFREES IN THE QUANTITY OF FIXCNT ARE DONE.*/ 01988000
*       /*                                                   @G33VPHE*/ 01989000
*       /*                                                           */ 01990000
*       /*************************************************************/ 01991000
*                                                                  0515 01992000
*       VSLOPT(1)=PGFREFLG;         /* CHANGE OPTIONS TO PGFREE    0515 01993000
*                                                            @G33VPHE*/ 01994000
@RC00510 MVI   VSLOPT,X'20'                                        0515 01995000
*       VSLOPT(2)=PGFREFLG;         /* CHANGE OPTIONS TO PGFREE    0516 01996000
*                                                            @G33VPHE*/ 01997000
         MVI   VSLOPT+8,X'20'                                      0516 01998000
*       VSLOPT(3)=PGFREFLG;         /* CHANGE OPTIONS TO PGFREE    0517 01999000
*                                                            @G33VPHE*/ 02000000
         MVI   VSLOPT+16,X'20'                                     0517 02001000
*       DO FIXCNT TO 1 BY-1;        /* LOOP DOING PGFREE UNTIL ALL 0518 02002000
*                                      THE UNNECESSARY PGFIXES ARE 0518 02003000
*                                      NULLIFIED             @G33VPHE*/ 02004000
         LH    @15,FIXCNT                                          0518 02005000
         B     @DE00518                                            0518 02006000
@DL00518 DS    0H                                                  0519 02007000
*         DO;                       /* PGFREE(L) LA(VSL) RELEASE(N)  */ 02008000
*           RESPECIFY                                              0520 02009000
*            (GPR00P,                                              0520 02010000
*             GPR01P) RESTRICTED;                                  0520 02011000
*           GPR00P=0;               /* INDICATE NO PAGE ECB          */ 02012000
         SLR   GPR00P,GPR00P                                       0521 02013000
*           GPR01P=ADDR(VSL);       /* LIST ADDR                     */ 02014000
         LA    GPR01P,VSL                                          0522 02015000
*           GPR01P=GPR01P|'80000000'X;/* L FORM                      */ 02016000
         O     GPR01P,@CF01975                                     0523 02017000
*           GPR01P->I001C=(GPR01P->I001C&'80'X)|'00100000'B;/* L,  0524 02018000
*                                      PGFREE & RELEASE FLAG         */ 02019000
         MVC   @TS00001(1),I001C(GPR01P)                           0524 02020000
         NI    @TS00001,X'80'                                      0524 02021000
         OI    @TS00001,B'00100000'                                0524 02022000
         MVC   I001C(1,GPR01P),@TS00001                            0524 02023000
*           RESPECIFY                                              0525 02024000
*             I001C BASED(GPR01P+4);/* PTR TO PARMLIST BYTE4         */ 02025000
*           I001C=(I001C&'C0'X)|'00000000'B;/* RSAOPT FLAG           */ 02026000
         LA    @15,4                                               0526 02027000
         ALR   @15,GPR01P                                          0526 02028000
         MVC   @TS00001(1),I001C(@15)                              0526 02029000
         NI    @TS00001,X'C0'                                      0526 02030000
         OI    @TS00001,B'00000000'                                0526 02031000
         MVC   I001C(1,@15),@TS00001                               0526 02032000
*           SVC(113);               /* ISSUE PGFREE SVC              */ 02033000
         SVC   113                                                 0527 02034000
*           RESPECIFY                                              0528 02035000
*            (GPR00P,                                              0528 02036000
*             GPR01P) UNRESTRICTED;                                0528 02037000
*         END;                      /* PGFREE(L) LA(VSL) RELEASE(N)     02038000
*                                                            @G33VPHE*/ 02039000
*       END;                        /*                       @G33VPHE*/ 02040000
         SLR   @15,@15                                             0530 02041000
         BCTR  @15,0                                               0530 02042000
         AH    @15,FIXCNT                                          0530 02043000
         STH   @15,FIXCNT                                          0530 02044000
@DE00518 LTR   @15,@15                                             0530 02045000
         BP    @DL00518                                            0530 02046000
*       DO;                         /* PGFREE(R) A(PART1) EA(PART2)  */ 02047000
*         RESPECIFY                                                0532 02048000
*          (GPR00P,                                                0532 02049000
*           GPR01P) RESTRICTED;                                    0532 02050000
*         GPR00P=0;                 /* INDICATE NO PAGE ECB          */ 02051000
         SLR   GPR00P,GPR00P                                       0533 02052000
*         GPR01P=ADDR(PART1);       /* PAGE ADDR                     */ 02053000
         LA    GPR01P,PART1                                        0534 02054000
*         RESPECIFY                                                0535 02055000
*           GPR15P RESTRICTED;                                     0535 02056000
*         GPR15P=ADDR(PART2);       /* VSL ADDR                      */ 02057000
         LA    GPR15P,PART2                                        0536 02058000
*         GPR01P=GPR01P|'20000000'X;/* R, PGFREE & RELEASE FLAG      */ 02059000
         O     GPR01P,@CF02162                                     0537 02060000
*         SVC(113);                 /* ISSUE PGFREE SVC              */ 02061000
         SVC   113                                                 0538 02062000
*         RESPECIFY                                                0539 02063000
*          (GPR00P,                                                0539 02064000
*           GPR01P,                                                0539 02065000
*           GPR15P) UNRESTRICTED;                                  0539 02066000
*       END;                        /* PGFREE(R) A(PART1) EA(PART2)     02067000
*                                                            @G33VPHE*/ 02068000
*     END;                          /* OF SUMMARY DUMP SUPPORT IF  0541 02069000
*                                      THIS IS SDUMP PROCESSING    0541 02070000
*                                                            @G33VPHE*/ 02071000
*   RESPECIFY                                                      0542 02072000
*    (COMPREG,                                                     0542 02073000
*     SWAPREG,                                                     0542 02074000
*     RTCTREG) UNRESTRICTED;        /*                       @G33CPHE*/ 02075000
@RF00508 DS    0H                                                  0543 02076000
*   RFY                                                            0543 02077000
*     RTCT BASED(CVTRTMCT);         /*                       @G33CPHE*/ 02078000
*   R14=R14SAVE;                    /* RESTORE THE RETURN ADDRESS  0544 02079000
*                                      VALUE                 @G33VPHE*/ 02080000
         L     R14,R14SAVE                                         0544 02081000
*   END UPDTERTN;                   /*                       @G33CPHE*/ 02082000
@EL00009 DS    0H                                                  0545 02083000
@EF00009 DS    0H                                                  0545 02084000
@ER00009 BR    @14                                                 0545 02085000
*CHDPDATA:                                                         0546 02086000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0546 02087000
*                                                                  0546 02088000
CHDPDATA DS    0H                                                  0547 02089000
*   /*****************************************************************/ 02090000
*   /*                                                               */ 02091000
*   /* DETERMINE WHICH PDATA DUMP OPTION HAS BEEN SPECIFIED. CHECK   */ 02092000
*   /* FOR CORRECT SPELLING AND ALTER OPTION BIT SETTING IN WORKAREA */ 02093000
*   /* (WHICH WILL LATER BE ALTERED IN THE RTCT ACCORDING TO SET OR  */ 02094000
*   /* DEL FUNCTION)                                                 */ 02095000
*   /*                                                               */ 02096000
*   /*****************************************************************/ 02097000
*                                                                  0547 02098000
*   RFY                                                            0547 02099000
*     TYPEPTR RSTD;                 /*                       @G33CPHE*/ 02100000
*   RFY                                                            0548 02101000
*     RTCTMOPT BASED(TYPEPTR);      /* THE MAPPING FOR THE SYSABEND     02102000
*                                      DUMP OPTION BITS IS USED BY 0548 02103000
*                                      THIS RTN TO SET BOTH SYSABEND    02104000
*                                      & SYSUDUMP BITS. TYPEPTR IS 0548 02105000
*                                      ADJUSTED TO DECIDE WHICH BITS    02106000
*                                      ARE TO BE SET         @G33CPHE*/ 02107000
*   TYPEPTR=ADDR(CHNGWORK(DT));     /*                       @G33CPHE*/ 02108000
         LR    TYPEPTR,DT                                          0549 02109000
         SLA   TYPEPTR,2                                           0549 02110000
         LA    TYPEPTR,CHNGWORK-4(TYPEPTR)                         0549 02111000
*   IF LEN=4                        /* IS SUBPARAMETER 4 BYTES LONG ?*/ 02112000
*     THEN                          /* YES -MUST BE 'SPLS' OR 'REGS' */ 02113000
         CH    LEN,@CH00057                                        0550 02114000
         BNE   @RF00550                                            0550 02115000
*     IF OPERAND(1:4)='REGS'        /* REGISTERS OPTION ?            */ 02116000
*       THEN                        /* YES                           */ 02117000
         CLC   OPERAND(4,START),@CC02168                           0551 02118000
         BNE   @RF00551                                            0551 02119000
*       RTCTSADA=ON;                /* INDICATE REGS OPTION IN     0552 02120000
*                                      WORKAREA              @G33CPHE*/ 02121000
         OI    RTCTSADA(TYPEPTR),B'00100000'                       0552 02122000
*     ELSE                          /* NOT REGS -MUST BE SPLS        */ 02123000
*       IF OPERAND(1:4)='SPLS'      /* MAIN STORAGE SUBPOOLS OPTION ?*/ 02124000
*         THEN                                                     0553 02125000
         B     @RC00551                                            0553 02126000
@RF00551 CLC   OPERAND(4,START),@CC02169                           0553 02127000
         BNE   @RF00553                                            0553 02128000
*         RTCTSADE=ON;              /* INDICATE SPLS OPTION IN     0554 02129000
*                                      WORKAREA              @G33CPHE*/ 02130000
         OI    RTCTSADE(TYPEPTR),B'00000010'                       0554 02131000
*       ELSE                        /* MUST BE MISSPELLED            */ 02132000
*         MSGID=IEE535;             /* INDICATE ERROR        @G33CPHE*/ 02133000
         B     @RC00553                                            0555 02134000
@RF00553 MVI   MSGID,X'3E'                                         0555 02135000
*   ELSE                            /* LENGTH NOT 4                  */ 02136000
*     IF LEN=3                      /* IS SUBPARAMETER 3 BYTES LONG ?*/ 02137000
*       THEN                        /* CHECK FOR PSW,SAH,JPA OR LPA  */ 02138000
         B     @RC00550                                            0556 02139000
@RF00550 CH    LEN,@CH00290                                        0556 02140000
         BNE   @RF00556                                            0556 02141000
*       IF OPERAND(1:3)='SAH'       /* SAVE AREA HEADINGS OPTION ?   */ 02142000
*         THEN                                                     0557 02143000
         CLC   OPERAND(3,START),@CC02170                           0557 02144000
         BNE   @RF00557                                            0557 02145000
*         DO;                                                      0558 02146000
*           RTCTSAD8=ON;            /* INDICATE SAVE AREA OPTION   0559 02147000
*                                                            @G33CPHE*/ 02148000
*           RTCTSAD9=ON;            /* NOT 'ENTIRE' SAVE AREA      0560 02149000
*                                                            @G33CPHE*/ 02150000
         OI    RTCTSAD8(TYPEPTR),B'11000000'                       0560 02151000
*         END;                                                     0561 02152000
*       ELSE                                                       0562 02153000
*         IF OPERAND(1:3)='PSW'     /* PROGRAM STATUS WORD OPTION ?  */ 02154000
*           THEN                                                   0562 02155000
         B     @RC00557                                            0562 02156000
@RF00557 CLC   OPERAND(3,START),@CC02171                           0562 02157000
         BNE   @RF00562                                            0562 02158000
*           RTCTSADD=ON;            /* INDICATE PSW OPTION IN      0563 02159000
*                                      WORKAREA              @G33CPHE*/ 02160000
         OI    RTCTSADD(TYPEPTR),B'00000100'                       0563 02161000
*         ELSE                                                     0564 02162000
*           IF OPERAND(1:3)='JPA'   /* JOB PACK AREA OPTION ?        */ 02163000
*             THEN                  /* YES                           */ 02164000
         B     @RC00562                                            0564 02165000
@RF00562 CLC   OPERAND(3,START),@CC02172                           0564 02166000
         BNE   @RF00564                                            0564 02167000
*             RTCTSADC=ON;          /* INDICATE JPA OPTION IN      0565 02168000
*                                      WORKAREA              @G33CPHE*/ 02169000
         OI    RTCTSADC(TYPEPTR),B'00001000'                       0565 02170000
*           ELSE                                                   0566 02171000
*             IF OPERAND(1:3)='LPA' /* LINK PACK AREA OPTION ?       */ 02172000
*               THEN                /* YES                           */ 02173000
         B     @RC00564                                            0566 02174000
@RF00564 CLC   OPERAND(3,START),@CC02173                           0566 02175000
         BNE   @RF00566                                            0566 02176000
*               RTCTSADB=ON;        /* INDICATE LPA OPTION IN      0567 02177000
*                                      WORKAREA              @G33CPHE*/ 02178000
         OI    RTCTSADB(TYPEPTR),B'00010000'                       0567 02179000
*             ELSE                                                 0568 02180000
*               MSGID=IEE535;       /* INDICATE ERROR        @G33CPHE*/ 02181000
         B     @RC00566                                            0568 02182000
@RF00566 MVI   MSGID,X'3E'                                         0568 02183000
*     ELSE                                                         0569 02184000
*       IF LEN=8&OPERAND(1:8)='ALLPDATA'/* ARE ALL PROGRAM DATA AREAS   02185000
*                                      BEING REQUESTED ?             */ 02186000
*         THEN                      /* YES                           */ 02187000
         B     @RC00556                                            0569 02188000
@RF00556 CH    LEN,@CH00063                                        0569 02189000
         BNE   @RF00569                                            0569 02190000
         CLC   OPERAND(8,START),@CC02174                           0569 02191000
         BNE   @RF00569                                            0569 02192000
*         DO;                                                      0570 02193000
*           RTCTSAPD=RTCTSAPD|PDALL;/* INDICATE ALL PDATA OPTION   0571 02194000
*                                      AREAS IN WORKAREA     @G33CPHE*/ 02195000
         OC    RTCTSAPD(2,TYPEPTR),PDALL                           0571 02196000
*           SETSA='1'B;             /* INDICATE FULL SAVE AREA OPTION   02197000
*                                      THIS INDICATION CAUSES THE  0572 02198000
*                                      SAVE AREA SWITCH TO BE TURNED    02199000
*                                      OFF WHICH INDICATES THE FULL     02200000
*                                      SAVE AREA OPTION              */ 02201000
         OI    SETSA,B'00000010'                                   0572 02202000
*         END;                                                     0573 02203000
*       ELSE                                                       0574 02204000
*         IF LEN=5&OPERAND(1:5)='ALLPA' THEN                       0574 02205000
         B     @RC00569                                            0574 02206000
@RF00569 CH    LEN,@CH00770                                        0574 02207000
         BNE   @RF00574                                            0574 02208000
         CLC   OPERAND(5,START),@CC02175                           0574 02209000
         BNE   @RF00574                                            0574 02210000
*           DO;                                                    0575 02211000
*             RTCTSADB=ON;          /* INDICATE LPA OPTION   @G33CPHE*/ 02212000
*             RTCTSADC=ON;          /* INDICATE JPA OPTION   @G33CPHE*/ 02213000
         OI    RTCTSADB(TYPEPTR),B'00011000'                       0577 02214000
*           END;                                                   0578 02215000
*         ELSE                                                     0579 02216000
*           IF LEN=2&OPERAND(1:2)='SA'/* FULL SAVE AREA ?            */ 02217000
*             THEN                  /* YES                           */ 02218000
         B     @RC00574                                            0579 02219000
@RF00574 CH    LEN,@CH00077                                        0579 02220000
         BNE   @RF00579                                            0579 02221000
         CLC   OPERAND(2,START),@CC02176                           0579 02222000
         BNE   @RF00579                                            0579 02223000
*             DO;                                                  0580 02224000
*               RTCTSAD8=ON;        /* INDICATE SAVE AREA OPTION   0581 02225000
*                                                            @G33CPHE*/ 02226000
         OI    RTCTSAD8(TYPEPTR),B'10000000'                       0581 02227000
*               SETSA='1'B;         /* INDICATE 'SA' OPTION SPECIFIED*/ 02228000
         OI    SETSA,B'00000010'                                   0582 02229000
*             END;                                                 0583 02230000
*           ELSE                                                   0584 02231000
*             MSGID=IEE535;         /* INDICATE ERROR        @G33CPHE*/ 02232000
         B     @RC00579                                            0584 02233000
@RF00579 MVI   MSGID,X'3E'                                         0584 02234000
*   RETURN;                                                        0585 02235000
@EL00010 DS    0H                                                  0585 02236000
@EF00010 DS    0H                                                  0585 02237000
@ER00010 BR    @14                                                 0585 02238000
*   RFY                                                            0586 02239000
*     RTCTMOPT BASED(ADDR(RTCTOPTS));/* RESTORE MAP BASE     @G33CPHE*/ 02240000
*   RFY                                                            0587 02241000
*     TYPEPTR UNRSTD;               /*                       @G33CPHE*/ 02242000
*   END CHDPDATA;                                                  0588 02243000
         B     @EL00010                                            0588 02244000
*CHDSDATA:                                                         0589 02245000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0589 02246000
*                                                                  0589 02247000
CHDSDATA DS    0H                                                  0590 02248000
*   /*****************************************************************/ 02249000
*   /*                                                               */ 02250000
*   /* DETERMINE WHICH SDATA DUMP OPTION HAS BEEN SPECIFIED. VALIDATE*/ 02251000
*   /* AND SET INDICATOR ACCORDINGLY.                                */ 02252000
*   /*                                                               */ 02253000
*   /*****************************************************************/ 02254000
*                                                                  0590 02255000
*   RFY                                                            0590 02256000
*     TYPEPTR RSTD;                 /*                       @G33CPHE*/ 02257000
*   RFY                                                            0591 02258000
*     RTCTMOPT BASED(TYPEPTR);      /* THE MAPPING FOR THE SYSABEND     02259000
*                                      DUMP OPTION BITS IS USED BY 0591 02260000
*                                      THIS RTN TO SET BOTH SYSABEND    02261000
*                                      & SYSUDUMP BITS. TYPEPTR IS 0591 02262000
*                                      ADJUSTED TO DECIDE WHICH BITS    02263000
*                                      ARE TO BE SET         @G33CPHE*/ 02264000
*   TYPEPTR=ADDR(CHNGWORK(DT));     /*                       @G33CPHE*/ 02265000
         LR    TYPEPTR,DT                                          0592 02266000
         SLA   TYPEPTR,2                                           0592 02267000
         LA    TYPEPTR,CHNGWORK-4(TYPEPTR)                         0592 02268000
*   IF LEN=8&OPERAND(1:8)='ALLSDATA' THEN                          0593 02269000
         CH    LEN,@CH00063                                        0593 02270000
         BNE   @RF00593                                            0593 02271000
         CLC   OPERAND(8,START),@CC02183                           0593 02272000
         BNE   @RF00593                                            0593 02273000
*     RTCTSASD=RTCTSASD|SDALL;      /* ALLSDATA OPTIONS SPECIFIED  0594 02274000
*                                                            @G33CPHE*/ 02275000
         OC    RTCTSASD(2,TYPEPTR),SDALL                           0594 02276000
*   ELSE                                                           0595 02277000
*     IF LEN=4&OPERAND(1:4)='LSQA'  /* IS THIS LSQA ?                */ 02278000
*       THEN                                                       0595 02279000
         B     @RC00593                                            0595 02280000
@RF00593 CH    LEN,@CH00057                                        0595 02281000
         BNE   @RF00595                                            0595 02282000
         CLC   OPERAND(4,START),@CC02184                           0595 02283000
         BNE   @RF00595                                            0595 02284000
*       RTCTSAD2=ON;                /* INDICATE LSQA SPECIFIED     0596 02285000
*                                                            @G33CPHE*/ 02286000
         OI    RTCTSAD2(TYPEPTR),B'00100000'                       0596 02287000
*     ELSE                                                         0597 02288000
*       IF LEN=3                    /* CHECK POSSIBLE PARAMETERS WITH   02289000
*                                      A LENGTH OF 3                 */ 02290000
*         THEN                                                     0597 02291000
         B     @RC00595                                            0597 02292000
@RF00595 CH    LEN,@CH00290                                        0597 02293000
         BNE   @RF00597                                            0597 02294000
*         IF OPERAND(1:3)='NUC' THEN                               0598 02295000
         CLC   OPERAND(3,START),@CC02185                           0598 02296000
         BNE   @RF00598                                            0598 02297000
*           RTCTSAD0=ON;            /* INDICATE NUCLEUS OPTION     0599 02298000
*                                                            @G33CPHE*/ 02299000
         OI    RTCTSAD0(TYPEPTR),B'10000000'                       0599 02300000
*         ELSE                                                     0600 02301000
*           IF OPERAND(1:3)='SQA' THEN                             0600 02302000
         B     @RC00598                                            0600 02303000
@RF00598 CLC   OPERAND(3,START),@CC02186                           0600 02304000
         BNE   @RF00600                                            0600 02305000
*             RTCTSAD1=ON;          /* INDICATE SYSTEM QUEUE AREA  0601 02306000
*                                      OPTION                @G33CPHE*/ 02307000
         OI    RTCTSAD1(TYPEPTR),B'01000000'                       0601 02308000
*           ELSE                                                   0602 02309000
*             IF OPERAND(1:3)='TRT' THEN                           0602 02310000
         B     @RC00600                                            0602 02311000
@RF00600 CLC   OPERAND(3,START),@CC02187                           0602 02312000
         BNE   @RF00602                                            0602 02313000
*               RTCTSAD4=ON;        /* INDICATE TRACE OPTION @G33CPHE*/ 02314000
         OI    RTCTSAD4(TYPEPTR),B'00001000'                       0603 02315000
*             ELSE                                                 0604 02316000
*               IF OPERAND(1:3)='ENQ' THEN                         0604 02317000
         B     @RC00602                                            0604 02318000
@RF00602 CLC   OPERAND(3,START),@CC02188                           0604 02319000
         BNE   @RF00604                                            0604 02320000
*                 RTCTSAD6=ON;      /*                       @G33CPHE*/ 02321000
         OI    RTCTSAD6(TYPEPTR),B'00000010'                       0605 02322000
*               ELSE                                               0606 02323000
*                 IF OPERAND(1:3)='SWA' THEN                       0606 02324000
         B     @RC00604                                            0606 02325000
@RF00604 CLC   OPERAND(3,START),@CC02189                           0606 02326000
         BNE   @RF00606                                            0606 02327000
*                   RTCTSAD3=ON;    /*                       @G33CPHE*/ 02328000
         OI    RTCTSAD3(TYPEPTR),B'00010000'                       0607 02329000
*                 ELSE              /*                       @G33CPHE*/ 02330000
*                   IF OPERAND(1:3)='ERR'/* RTM CB           @G33CPHE*/ 02331000
*                     THEN                                         0608 02332000
         B     @RC00606                                            0608 02333000
@RF00606 CLC   OPERAND(3,START),@CC02190                           0608 02334000
         BNE   @RF00608                                            0608 02335000
*                     RTCTSADH=ON;  /*                       @G33CPHE*/ 02336000
         OI    RTCTSADH(TYPEPTR),B'01000000'                       0609 02337000
*                   ELSE                                           0610 02338000
*                     MSGID=IEE535; /* INDICATE ERROR        @G33CPHE*/ 02339000
         B     @RC00608                                            0610 02340000
@RF00608 MVI   MSGID,X'3E'                                         0610 02341000
*       ELSE                                                       0611 02342000
*         IF LEN=2                  /*                       @G33CPHE*/ 02343000
*           THEN                    /*                       @G33CPHE*/ 02344000
         B     @RC00597                                            0611 02345000
@RF00597 CH    LEN,@CH00077                                        0611 02346000
         BNE   @RF00611                                            0611 02347000
*           IF OPERAND(1:2)='CB'    /* CONTROL BLOCKS        @G33CPHE*/ 02348000
*             THEN                                                 0612 02349000
         CLC   OPERAND(2,START),@CC02191                           0612 02350000
         BNE   @RF00612                                            0612 02351000
*             RTCTSAD5=ON;          /*                       @G33CPHE*/ 02352000
         OI    RTCTSAD5(TYPEPTR),B'00000100'                       0613 02353000
*           ELSE                                                   0614 02354000
*             IF OPERAND(1:2)='DM'  /* DATA MANAGEMENT       @G33CPHE*/ 02355000
*               THEN                                               0614 02356000
         B     @RC00612                                            0614 02357000
@RF00612 CLC   OPERAND(2,START),@CC02192                           0614 02358000
         BNE   @RF00614                                            0614 02359000
*               RTCTSAD7=ON;        /*                       @G33CPHE*/ 02360000
         OI    RTCTSAD7(TYPEPTR),B'00000001'                       0615 02361000
*             ELSE                                                 0616 02362000
*               IF OPERAND(1:2)='IO'/* I/O SUPERVISOR        @G33CPHE*/ 02363000
*                 THEN                                             0616 02364000
         B     @RC00614                                            0616 02365000
@RF00614 CLC   OPERAND(2,START),@CC02193                           0616 02366000
         BNE   @RF00616                                            0616 02367000
*                 RTCTSADG=ON;      /*                       @G33CPHE*/ 02368000
         OI    RTCTSADG(TYPEPTR),B'10000000'                       0617 02369000
*               ELSE                                               0618 02370000
*                 MSGID=IEE535;     /*                       @G33CPHE*/ 02371000
         B     @RC00616                                            0618 02372000
@RF00616 MVI   MSGID,X'3E'                                         0618 02373000
*         ELSE                                                     0619 02374000
*           MSGID=IEE535;           /* INDICATE ERROR        @G33CPHE*/ 02375000
         B     @RC00611                                            0619 02376000
@RF00611 MVI   MSGID,X'3E'                                         0619 02377000
*   RETURN;                                                        0620 02378000
@EL00011 DS    0H                                                  0620 02379000
@EF00011 DS    0H                                                  0620 02380000
@ER00011 BR    @14                                                 0620 02381000
*   RFY                                                            0621 02382000
*     RTCTMOPT BASED(ADDR(RTCTOPTS));/* RESTORE MAP BASE     @G33CPHE*/ 02383000
*   RFY                                                            0622 02384000
*     TYPEPTR UNRSTD;               /*                       @G33CPHE*/ 02385000
*   END CHDSDATA;                                                  0623 02386000
         B     @EL00011                                            0623 02387000
*CHDSDUMP:                                                         0624 02388000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0624 02389000
*                                                                  0624 02390000
CHDSDUMP DS    0H                                                  0625 02391000
*   /*****************************************************************/ 02392000
*   /*                                                               */ 02393000
*   /* DETERMINE WHICH OF THE SDUMP DUMP OPTIONS HAS BEEN ISOLATED.  */ 02394000
*   /* CHECK PROPER SYNTAX AND SET INDICATOR ACCORDINGLY.            */ 02395000
*   /*                                                               */ 02396000
*   /*****************************************************************/ 02397000
*                                                                  0625 02398000
*   RFY                                                            0625 02399000
*     RTCTMOPT BASED(ADDR(CHNGWORK));/*                      @G33CPHE*/ 02400000
*   IF LEN=3                        /* INVESTIGATE 3 CHARACTER     0626 02401000
*                                      OPTIONS                       */ 02402000
*     THEN                          /* YES- 3 BYTES LONG             */ 02403000
         CH    LEN,@CH00290                                        0626 02404000
         BNE   @RF00626                                            0626 02405000
*     IF OPERAND(1:3)='SUM'         /* SUMMARY OPTION ?      @G33CPHE*/ 02406000
*       THEN                        /* YES                   @G33CPHE*/ 02407000
         CLC   OPERAND(3,START),@CC02201                           0627 02408000
         BNE   @RF00627                                            0627 02409000
*       IF RTCTSDPB=ON              /* WAS THE OPPOSITE OPTION     0628 02410000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02411000
*         THEN                      /* YES                   @G33CPHE*/ 02412000
         LA    @15,CHNGWORK                                        0628 02413000
         TM    RTCTSDPB(@15),B'00010000'                           0628 02414000
         BNO   @RF00628                                            0628 02415000
*         MSGID=IEE312;             /* INDICATE ERROR MSG    @G33CPHE*/ 02416000
         MVI   MSGID,X'0C'                                         0629 02417000
*       ELSE                        /* GO AHEAD AND SET THE OPTION 0630 02418000
*                                                            @G33CPHE*/ 02419000
*         RTCTSDPA=ON;              /* INDICATE SUM OPTION   @G33CPHE*/ 02420000
         B     @RC00628                                            0630 02421000
@RF00628 LA    @15,CHNGWORK                                        0630 02422000
         OI    RTCTSDPA(@15),B'00100000'                           0630 02423000
*     ELSE                          /* NOT PSA                       */ 02424000
*       IF OPERAND(1:3)='PSA'       /* PREFIX STORAGE OPTION ?       */ 02425000
*         THEN                      /* YES                           */ 02426000
         B     @RC00627                                            0631 02427000
@RF00627 CLC   OPERAND(3,START),@CC02202                           0631 02428000
         BNE   @RF00631                                            0631 02429000
*         RTCTSDP1=ON;              /* INDICATE PSA OPTION   @G33CPHE*/ 02430000
         LA    @15,CHNGWORK                                        0632 02431000
         OI    RTCTSDP1(@15),B'01000000'                           0632 02432000
*       ELSE                        /* NOT PSA                       */ 02433000
*         IF OPERAND(1:3)='NUC'     /* NUCLEUS OPTION ?              */ 02434000
*           THEN                    /* YES                           */ 02435000
         B     @RC00631                                            0633 02436000
@RF00631 CLC   OPERAND(3,START),@CC02185                           0633 02437000
         BNE   @RF00633                                            0633 02438000
*           RTCTSDP2=ON;            /* INDICATE NUC OPTION   @G33CPHE*/ 02439000
         LA    @15,CHNGWORK                                        0634 02440000
         OI    RTCTSDP2(@15),B'00100000'                           0634 02441000
*         ELSE                      /* NOT NUC                       */ 02442000
*           IF OPERAND(1:3)='SQA'   /* SYSTEM QUEUE AREA OPTION ?    */ 02443000
*             THEN                  /* YES                           */ 02444000
         B     @RC00633                                            0635 02445000
@RF00633 CLC   OPERAND(3,START),@CC02186                           0635 02446000
         BNE   @RF00635                                            0635 02447000
*             IF RTCTSDPD=ON        /* WAS THE OPPOSITE OPTION     0636 02448000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02449000
*               THEN                /* YES                   @G33CPHE*/ 02450000
         LA    @15,CHNGWORK                                        0636 02451000
         TM    RTCTSDPD(@15),B'00000100'                           0636 02452000
         BNO   @RF00636                                            0636 02453000
*               MSGID=IEE312;       /* INDICATE ERROR MSG    @G33CPHE*/ 02454000
         MVI   MSGID,X'0C'                                         0637 02455000
*             ELSE                  /* GO AHEAD AND SET THE OPTION 0638 02456000
*                                                            @G33CPHE*/ 02457000
*               RTCTSDP3=ON;        /* INDICATE SQA OPTION   @G33CPHE*/ 02458000
         B     @RC00636                                            0638 02459000
@RF00636 LA    @15,CHNGWORK                                        0638 02460000
         OI    RTCTSDP3(@15),B'00010000'                           0638 02461000
*           ELSE                    /* NOT SQA                       */ 02462000
*             IF OPERAND(1:3)='RGN' /* REGION OPTION ?               */ 02463000
*               THEN                /* YES                           */ 02464000
         B     @RC00635                                            0639 02465000
@RF00635 CLC   OPERAND(3,START),@CC02203                           0639 02466000
         BNE   @RF00639                                            0639 02467000
*               RTCTSDP5=ON;        /* INDICATE RGN OPTION   @G33CPHE*/ 02468000
         LA    @15,CHNGWORK                                        0640 02469000
         OI    RTCTSDP5(@15),B'00000100'                           0640 02470000
*             ELSE                  /* NOT RGN                       */ 02471000
*               IF OPERAND(1:3)='LPA'/* LINK PACK AREA OPTION ?      */ 02472000
*                 THEN              /* YES                           */ 02473000
         B     @RC00639                                            0641 02474000
@RF00639 CLC   OPERAND(3,START),@CC02173                           0641 02475000
         BNE   @RF00641                                            0641 02476000
*                 RTCTSDP6=ON;      /* INDICATE LPA OPTION   @G33CPHE*/ 02477000
         LA    @15,CHNGWORK                                        0642 02478000
         OI    RTCTSDP6(@15),B'00000010'                           0642 02479000
*               ELSE                /* NOT LPA                       */ 02480000
*                 IF OPERAND(1:3)='TRT'/* TRACE OPTION               */ 02481000
*                   THEN            /* YES                           */ 02482000
         B     @RC00641                                            0643 02483000
@RF00641 CLC   OPERAND(3,START),@CC02187                           0643 02484000
         BNE   @RF00643                                            0643 02485000
*                   RTCTSDP7=ON;    /* INDICATE TRT OPTION   @G33CPHE*/ 02486000
         LA    @15,CHNGWORK                                        0644 02487000
         OI    RTCTSDP7(@15),B'00000001'                           0644 02488000
*                 ELSE              /* NOT TRT                       */ 02489000
*                   IF OPERAND(1:3)='CSA'/* COMMON SERVICE AREA    0645 02490000
*                                      OPTION ?                      */ 02491000
*                     THEN                                         0645 02492000
         B     @RC00643                                            0645 02493000
@RF00643 CLC   OPERAND(3,START),@CC02204                           0645 02494000
         BNE   @RF00645                                            0645 02495000
*                     RTCTSDP8=ON;  /* INDICATE CSA          @G33CPHE*/ 02496000
         LA    @15,CHNGWORK                                        0646 02497000
         OI    RTCTSDP8(@15),B'10000000'                           0646 02498000
*                   ELSE            /* NOT CSA                       */ 02499000
*                     IF OPERAND(1:3)='SWA'/* SCHED WORK AREA?       */ 02500000
*                       THEN        /* YES                           */ 02501000
         B     @RC00645                                            0647 02502000
@RF00645 CLC   OPERAND(3,START),@CC02189                           0647 02503000
         BNE   @RF00647                                            0647 02504000
*                       RTCTSDP9=ON;/* INDICATE SWA                  */ 02505000
         LA    @15,CHNGWORK                                        0648 02506000
         OI    RTCTSDP9(@15),B'01000000'                           0648 02507000
*                     ELSE          /* NOT SWA -ERROR                */ 02508000
*                       MSGID=IEE535;/* MESSAGE INDEX FOR INVALID  0649 02509000
*                                      PARAMETER             @G33CPHE*/ 02510000
         B     @RC00647                                            0649 02511000
@RF00647 MVI   MSGID,X'3E'                                         0649 02512000
*   ELSE                            /*                       @G33CPHE*/ 02513000
*     IF LEN=5                      /*                       @G33CPHE*/ 02514000
*       THEN                        /*                       @G33CPHE*/ 02515000
         B     @RC00626                                            0650 02516000
@RF00626 CH    LEN,@CH00770                                        0650 02517000
         BNE   @RF00650                                            0650 02518000
*       IF OPERAND(1:5)='NOALL'     /*                       @G33CPHE*/ 02519000
*         THEN                      /* YES                   @G33CPHE*/ 02520000
         CLC   OPERAND(5,START),@CC02205                           0651 02521000
         BNE   @RF00651                                            0651 02522000
*         IF RTCTSDP0=ON            /* WAS THE OPPOSITE OPTION     0652 02523000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02524000
*           THEN                    /* YES                   @G33CPHE*/ 02525000
         LA    @15,CHNGWORK                                        0652 02526000
         TM    RTCTSDP0(@15),B'10000000'                           0652 02527000
         BNO   @RF00652                                            0652 02528000
*           MSGID=IEE312;           /* INDICATE ERROR MSG    @G33CPHE*/ 02529000
         MVI   MSGID,X'0C'                                         0653 02530000
*         ELSE                      /* GO AHEAD AND SET THE OPTION 0654 02531000
*                                                            @G33CPHE*/ 02532000
*           RTCTSDPC=ON;            /*                       @G33CPHE*/ 02533000
         B     @RC00652                                            0654 02534000
@RF00652 LA    @15,CHNGWORK                                        0654 02535000
         OI    RTCTSDPC(@15),B'00001000'                           0654 02536000
*       ELSE                        /*                       @G33CPHE*/ 02537000
*         IF OPERAND(1:5)='NOSQA'   /*                       @G33CPHE*/ 02538000
*           THEN                    /* YES                   @G33CPHE*/ 02539000
         B     @RC00651                                            0655 02540000
@RF00651 CLC   OPERAND(5,START),@CC02206                           0655 02541000
         BNE   @RF00655                                            0655 02542000
*           IF RTCTSDP3=ON          /* WAS THE OPPOSITE OPTION     0656 02543000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02544000
*             THEN                  /* YES                   @G33CPHE*/ 02545000
         LA    @15,CHNGWORK                                        0656 02546000
         TM    RTCTSDP3(@15),B'00010000'                           0656 02547000
         BNO   @RF00656                                            0656 02548000
*             MSGID=IEE312;         /* INDICATE ERROR MSG    @G33CPHE*/ 02549000
         MVI   MSGID,X'0C'                                         0657 02550000
*           ELSE                    /* GO AHEAD AND SET THE OPTION 0658 02551000
*                                                            @G33CPHE*/ 02552000
*             RTCTSDPD=ON;          /*                       @G33CPHE*/ 02553000
         B     @RC00656                                            0658 02554000
@RF00656 LA    @15,CHNGWORK                                        0658 02555000
         OI    RTCTSDPD(@15),B'00000100'                           0658 02556000
*         ELSE                      /*                       @G33CPHE*/ 02557000
*           IF OPERAND(1:5)='NOSUM' /*                       @G33CPHE*/ 02558000
*             THEN                  /* YES                   @G33CPHE*/ 02559000
         B     @RC00655                                            0659 02560000
@RF00655 CLC   OPERAND(5,START),@CC02207                           0659 02561000
         BNE   @RF00659                                            0659 02562000
*             IF RTCTSDPA=ON        /* WAS THE OPPOSITE OPTION     0660 02563000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02564000
*               THEN                /* YES                   @G33CPHE*/ 02565000
         LA    @15,CHNGWORK                                        0660 02566000
         TM    RTCTSDPA(@15),B'00100000'                           0660 02567000
         BNO   @RF00660                                            0660 02568000
*               MSGID=IEE312;       /* INDICATE ERROR MSG    @G33CPHE*/ 02569000
         MVI   MSGID,X'0C'                                         0661 02570000
*             ELSE                  /* YES                   @G33CPHE*/ 02571000
*               RTCTSDPB=ON;        /*                       @G33CPHE*/ 02572000
         B     @RC00660                                            0662 02573000
@RF00660 LA    @15,CHNGWORK                                        0662 02574000
         OI    RTCTSDPB(@15),B'00010000'                           0662 02575000
*           ELSE                                                   0663 02576000
*             MSGID=IEE535;         /*                       @G33CPHE*/ 02577000
         B     @RC00659                                            0663 02578000
@RF00659 MVI   MSGID,X'3E'                                         0663 02579000
*     ELSE                          /*                       @G33CPHE*/ 02580000
*       IF LEN=7&OPERAND(1:7)='SUMDUMP'/* SUMDUMP OPTION     @G33CPHE*/ 02581000
*         THEN                      /* YES                   @G33CPHE*/ 02582000
         B     @RC00650                                            0664 02583000
@RF00650 CH    LEN,@CH00825                                        0664 02584000
         BNE   @RF00664                                            0664 02585000
         CLC   OPERAND(7,START),@CC02208                           0664 02586000
         BNE   @RF00664                                            0664 02587000
*         IF RTCTSDPB=ON            /* WAS THE OPPOSITE OPTION     0665 02588000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02589000
*           THEN                    /* YES                   @G33CPHE*/ 02590000
         LA    @15,CHNGWORK                                        0665 02591000
         TM    RTCTSDPB(@15),B'00010000'                           0665 02592000
         BNO   @RF00665                                            0665 02593000
*           MSGID=IEE312;           /* INDICATE ERROR MSG    @G33CPHE*/ 02594000
         MVI   MSGID,X'0C'                                         0666 02595000
*         ELSE                      /* YES                   @G33CPHE*/ 02596000
*           RTCTSDPA=ON;            /* INTICATE SUMDUMP      @G33CPHE*/ 02597000
         B     @RC00665                                            0667 02598000
@RF00665 LA    @15,CHNGWORK                                        0667 02599000
         OI    RTCTSDPA(@15),B'00100000'                           0667 02600000
*       ELSE                        /*                       @G33CPHE*/ 02601000
*         IF LEN=9&OPERAND(1:9)='NOSUMDUMP'/* NOSUMDUMP OPTION     0668 02602000
*                                                            @G33CPHE*/ 02603000
*           THEN                    /* YES                   @G33CPHE*/ 02604000
         B     @RC00664                                            0668 02605000
@RF00664 CH    LEN,@CH00789                                        0668 02606000
         BNE   @RF00668                                            0668 02607000
         CLC   OPERAND(9,START),@CC02209                           0668 02608000
         BNE   @RF00668                                            0668 02609000
*           IF RTCTSDPA=ON          /* WAS THE OPPOSITE OPTION     0669 02610000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02611000
*             THEN                  /* YES                   @G33CPHE*/ 02612000
         LA    @15,CHNGWORK                                        0669 02613000
         TM    RTCTSDPA(@15),B'00100000'                           0669 02614000
         BNO   @RF00669                                            0669 02615000
*             MSGID=IEE312;         /* INDICATE ERROR MSG    @G33CPHE*/ 02616000
         MVI   MSGID,X'0C'                                         0670 02617000
*           ELSE                    /* YES                   @G33CPHE*/ 02618000
*             RTCTSDPB=ON;          /* INTICATE NOALLPSA     @G33CPHE*/ 02619000
         B     @RC00669                                            0671 02620000
@RF00669 LA    @15,CHNGWORK                                        0671 02621000
         OI    RTCTSDPB(@15),B'00010000'                           0671 02622000
*         ELSE                      /*                       @G33CPHE*/ 02623000
*           IF LEN=8&OPERAND(1:8)='NOALLPSA'/* NOALLPSA OPTION     0672 02624000
*                                                            @G33CPHE*/ 02625000
*             THEN                  /* YES                   @G33CPHE*/ 02626000
         B     @RC00668                                            0672 02627000
@RF00668 CH    LEN,@CH00063                                        0672 02628000
         BNE   @RF00672                                            0672 02629000
         CLC   OPERAND(8,START),@CC02211                           0672 02630000
         BNE   @RF00672                                            0672 02631000
*             IF RTCTSDP0=ON        /* WAS THE OPPOSITE OPTION     0673 02632000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02633000
*               THEN                /* YES                   @G33CPHE*/ 02634000
         LA    @15,CHNGWORK                                        0673 02635000
         TM    RTCTSDP0(@15),B'10000000'                           0673 02636000
         BNO   @RF00673                                            0673 02637000
*               MSGID=IEE312;       /* INDICATE ERROR MSG    @G33CPHE*/ 02638000
         MVI   MSGID,X'0C'                                         0674 02639000
*             ELSE                  /* YES                   @G33CPHE*/ 02640000
*               RTCTSDPC=ON;        /* INTICATE NOALLPSA     @G33CPHE*/ 02641000
         B     @RC00673                                            0675 02642000
@RF00673 LA    @15,CHNGWORK                                        0675 02643000
         OI    RTCTSDPC(@15),B'00001000'                           0675 02644000
*           ELSE                                                   0676 02645000
*             IF LEN=6&OPERAND(1:6)='ALLPSA'/* ALLPSA OPTION ?       */ 02646000
*               THEN                /* YES                           */ 02647000
         B     @RC00672                                            0676 02648000
@RF00672 CH    LEN,@CH00709                                        0676 02649000
         BNE   @RF00676                                            0676 02650000
         CLC   OPERAND(6,START),@CC02212                           0676 02651000
         BNE   @RF00676                                            0676 02652000
*               IF RTCTSDPC=ON      /* WAS THE OPPOSITE OPTION     0677 02653000
*                                      ALREADY SPECIFIED?    @G33CPHE*/ 02654000
*                 THEN              /* YES                   @G33CPHE*/ 02655000
         LA    @15,CHNGWORK                                        0677 02656000
         TM    RTCTSDPC(@15),B'00001000'                           0677 02657000
         BNO   @RF00677                                            0677 02658000
*                 MSGID=IEE312;     /* INDICATE ERROR MSG    @G33CPHE*/ 02659000
         MVI   MSGID,X'0C'                                         0678 02660000
*               ELSE                /* YES                   @G33CPHE*/ 02661000
*                 DO;                                              0679 02662000
         B     @RC00677                                            0679 02663000
@RF00677 DS    0H                                                  0680 02664000
*                   RTCTSDP0=ON;    /* INDICATE ALLPSA       @G33CPHE*/ 02665000
         LA    @15,CHNGWORK                                        0680 02666000
         OI    RTCTSDP0(@15),B'10000000'                           0680 02667000
*                 END;                                             0681 02668000
*             ELSE                                                 0682 02669000
*               IF LEN=4&OPERAND(1:4)='LSQA'/* LOCAL SYSTEM QUEUE  0682 02670000
*                                      AREA?                         */ 02671000
*                 THEN              /* YES                           */ 02672000
         B     @RC00676                                            0682 02673000
@RF00676 CH    LEN,@CH00057                                        0682 02674000
         BNE   @RF00682                                            0682 02675000
         CLC   OPERAND(4,START),@CC02184                           0682 02676000
         BNE   @RF00682                                            0682 02677000
*                 RTCTSDP4=ON;      /* INDICATE LSQA         @G33CPHE*/ 02678000
         LA    @15,CHNGWORK                                        0683 02679000
         OI    RTCTSDP4(@15),B'00001000'                           0683 02680000
*               ELSE                /* NOT LSQA --ERROR              */ 02681000
*                 MSGID=IEE535;     /* MSG INDEX - INVALID PARM    0684 02682000
*                                                            @G33CPHE*/ 02683000
         B     @RC00682                                            0684 02684000
@RF00682 MVI   MSGID,X'3E'                                         0684 02685000
*   RETURN;                                                        0685 02686000
@EL00012 DS    0H                                                  0685 02687000
@EF00012 DS    0H                                                  0685 02688000
@ER00012 BR    @14                                                 0685 02689000
*   RFY                                                            0686 02690000
*     RTCTMOPT BASED(ADDR(RTCTOPTS));/* RESTORE MAP BASE     @G33CPHE*/ 02691000
*   END CHDSDUMP;                                                  0687 02692000
         B     @EL00012                                            0687 02693000
*CHDSYSM:                                                          0688 02694000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0688 02695000
*                                                                  0688 02696000
CHDSYSM  DS    0H                                                  0689 02697000
*   /*****************************************************************/ 02698000
*   /*                                                               */ 02699000
*   /* DETERMINE WHICH OF THE SYSMDUMP DUMP OPTIONS HAS BEEN         */ 02700000
*   /* ISOLATED. CHECK PROPER SYNTAX AND SET INDICATOR ACCORDINGLY.  */ 02701000
*   /*                                                       @G33CPHE*/ 02702000
*   /*                                                               */ 02703000
*   /*****************************************************************/ 02704000
*                                                                  0689 02705000
*   RFY                                                            0689 02706000
*     RTCTMOPT BASED(ADDR(CHNGWORK));/*                      @G33CPHE*/ 02707000
*   IF LEN=3                        /* INVESTIGATE 3 CHARACTER     0690 02708000
*                                      OPTIONS               @G33CPHE*/ 02709000
*     THEN                          /* YES- 3 BYTES LONG     @G33CPHE*/ 02710000
         CH    LEN,@CH00290                                        0690 02711000
         BNE   @RF00690                                            0690 02712000
*     IF OPERAND(1:3)='NUC'         /* NUCLEUS OPTION ?      @G33CPHE*/ 02713000
*       THEN                        /* YES                   @G33CPHE*/ 02714000
         CLC   OPERAND(3,START),@CC02185                           0691 02715000
         BNE   @RF00691                                            0691 02716000
*       RTCTSDS0=ON;                /* INDICATE NUC OPTION   @G33CPHE*/ 02717000
         LA    @15,CHNGWORK                                        0692 02718000
         OI    RTCTSDS0(@15),B'10000000'                           0692 02719000
*     ELSE                          /* NOT NUC               @G33CPHE*/ 02720000
*       IF OPERAND(1:3)='SQA'       /* SYSTEM QUEUE AREA OPTION    0693 02721000
*                                                            @G33CPHE*/ 02722000
*         THEN                      /* YES                   @G33CPHE*/ 02723000
         B     @RC00691                                            0693 02724000
@RF00691 CLC   OPERAND(3,START),@CC02186                           0693 02725000
         BNE   @RF00693                                            0693 02726000
*         RTCTSDS1=ON;              /* INDICATE SQA OPTION   @G33CPHE*/ 02727000
         LA    @15,CHNGWORK                                        0694 02728000
         OI    RTCTSDS1(@15),B'01000000'                           0694 02729000
*       ELSE                        /* NOT SQA               @G33CPHE*/ 02730000
*         IF OPERAND(1:3)='RGN'     /* REGION OPTION ?       @G33CPHE*/ 02731000
*           THEN                    /* YES                   @G33CPHE*/ 02732000
         B     @RC00693                                            0695 02733000
@RF00693 CLC   OPERAND(3,START),@CC02203                           0695 02734000
         BNE   @RF00695                                            0695 02735000
*           RTCTSDS5=ON;            /* INDICATE RGN OPTION   @G33CPHE*/ 02736000
         LA    @15,CHNGWORK                                        0696 02737000
         OI    RTCTSDS5(@15),B'00000100'                           0696 02738000
*         ELSE                      /* NOT RGN               @G33CPHE*/ 02739000
*           IF OPERAND(1:3)='TRT'   /* TRACE OPTION          @G33CPHE*/ 02740000
*             THEN                  /* YES                   @G33CPHE*/ 02741000
         B     @RC00695                                            0697 02742000
@RF00695 CLC   OPERAND(3,START),@CC02187                           0697 02743000
         BNE   @RF00697                                            0697 02744000
*             RTCTSDS4=ON;          /* INDICATE TRT OPTION   @G33CPHE*/ 02745000
         LA    @15,CHNGWORK                                        0698 02746000
         OI    RTCTSDS4(@15),B'00001000'                           0698 02747000
*           ELSE                    /* NOT TRT               @G33CPHE*/ 02748000
*             IF OPERAND(1:3)='CSA' /* COMMON SERVICE AREA OPTION  0699 02749000
*                                                            @G33CPHE*/ 02750000
*               THEN                /*                       @G33CPHE*/ 02751000
         B     @RC00697                                            0699 02752000
@RF00697 CLC   OPERAND(3,START),@CC02204                           0699 02753000
         BNE   @RF00699                                            0699 02754000
*               RTCTSDS7=ON;        /* INDICATE CSA          @G33CPHE*/ 02755000
         LA    @15,CHNGWORK                                        0700 02756000
         OI    RTCTSDS7(@15),B'00000001'                           0700 02757000
*             ELSE                  /* NOT CSA               @G33CPHE*/ 02758000
*               IF OPERAND(1:3)='SWA'/* SCHED WORK AREA      @G33CPHE*/ 02759000
*                 THEN              /* YES                   @G33CPHE*/ 02760000
         B     @RC00699                                            0701 02761000
@RF00699 CLC   OPERAND(3,START),@CC02189                           0701 02762000
         BNE   @RF00701                                            0701 02763000
*                 RTCTSDS3=ON;      /* INDICATE SWA          @G33CPHE*/ 02764000
         LA    @15,CHNGWORK                                        0702 02765000
         OI    RTCTSDS3(@15),B'00010000'                           0702 02766000
*               ELSE                /* NOT SWA               @G33CPHE*/ 02767000
*                 IF OPERAND(1:3)='LPA'/* LINK PACK AREA     @G33CPHE*/ 02768000
*                   THEN            /* YES                   @G33CPHE*/ 02769000
         B     @RC00701                                            0703 02770000
@RF00701 CLC   OPERAND(3,START),@CC02173                           0703 02771000
         BNE   @RF00703                                            0703 02772000
*                   RTCTSDS6=ON;    /* INDICATE LPA          @G33CPHE*/ 02773000
         LA    @15,CHNGWORK                                        0704 02774000
         OI    RTCTSDS6(@15),B'00000010'                           0704 02775000
*                 ELSE              /* NOT LPA               @G33CPHE*/ 02776000
*                   IF OPERAND(1:3)='ALL'/* ALL              @G33CPHE*/ 02777000
*                     THEN          /* YES                   @G33CPHE*/ 02778000
         B     @RC00703                                            0705 02779000
@RF00703 CLC   OPERAND(3,START),@CC02115                           0705 02780000
         BNE   @RF00705                                            0705 02781000
*                     CHNGWORK(SMDINDEX)=ALLSYSM;/* INDICATE ALL   0706 02782000
*                                                            @G33CPHE*/ 02783000
         XC    CHNGWORK+10(2),CHNGWORK+10                          0706 02784000
         MVC   CHNGWORK+8(2),ALLSYSM                               0706 02785000
*                   ELSE            /* ERROR                 @G33CPHE*/ 02786000
*                     MSGID=IEE535; /* MESSAGE INDEX FOR INVALID   0707 02787000
*                                      PARAMETER             @G33CPHE*/ 02788000
         B     @RC00705                                            0707 02789000
@RF00705 MVI   MSGID,X'3E'                                         0707 02790000
*   ELSE                            /*                       @G33CPHE*/ 02791000
*     IF LEN=4&OPERAND(1:4)='LSQA'  /* LOCAL SYSTEM QUEUE AREA?    0708 02792000
*                                                            @G33CPHE*/ 02793000
*       THEN                        /* YES                   @G33CPHE*/ 02794000
         B     @RC00690                                            0708 02795000
@RF00690 CH    LEN,@CH00057                                        0708 02796000
         BNE   @RF00708                                            0708 02797000
         CLC   OPERAND(4,START),@CC02184                           0708 02798000
         BNE   @RF00708                                            0708 02799000
*       RTCTSDS2=ON;                /* INDICATE LSQA         @G33CPHE*/ 02800000
         LA    @15,CHNGWORK                                        0709 02801000
         OI    RTCTSDS2(@15),B'00100000'                           0709 02802000
*     ELSE                          /* NOT LSQA --ERROR      @G33CPHE*/ 02803000
*       MSGID=IEE535;               /* MSG INDEX - INVALID PARM    0710 02804000
*                                                            @G33CPHE*/ 02805000
         B     @RC00708                                            0710 02806000
@RF00708 MVI   MSGID,X'3E'                                         0710 02807000
*   RETURN;                         /*                       @G33CPHE*/ 02808000
@EL00013 DS    0H                                                  0711 02809000
@EF00013 DS    0H                                                  0711 02810000
@ER00013 BR    @14                                                 0711 02811000
*   RFY                                                            0712 02812000
*     RTCTMOPT BASED(ADDR(RTCTOPTS));/* RESTORE MAP BASE     @G33CPHE*/ 02813000
*   END CHDSYSM;                    /*                       @G33CPHE*/ 02814000
         B     @EL00013                                            0713 02815000
*/* @G33VPHE                                                         */ 02816000
*                                                                  0714 02817000
*   DECLARE                         /* GENERAL PURPOSE REGISTERS     */ 02818000
*     GPR00P PTR(31) REG(0),                                       0714 02819000
*     GPR01P PTR(31) REG(1),                                       0714 02820000
*     GPR11P PTR(31) REG(11),                                      0714 02821000
*     GPR12P PTR(31) REG(12),                                      0714 02822000
*     GPR13P PTR(31) REG(13),                                      0714 02823000
*     GPR14P PTR(31) REG(14),                                      0714 02824000
*     GPR15P PTR(31) REG(15);                                      0714 02825000
*   DECLARE                         /* COMMON VARIABLES              */ 02826000
*     I256C CHAR(256) BASED,                                       0715 02827000
*     I031F FIXED(31) BASED,                                       0715 02828000
*     I031P PTR(31) BASED,                                         0715 02829000
*     I015F FIXED(15) BASED,                                       0715 02830000
*     I015P PTR(15) BASED,                                         0715 02831000
*     I008P PTR(8) BASED,                                          0715 02832000
*     I001C CHAR(1) BASED;                                         0715 02833000
*   END IEEMB815                                                   0716 02834000
*                                                                  0716 02835000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02836000
*/*%INCLUDE SYSLIB  (CHDDCL  )                                       */ 02837000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02838000
*/*%INCLUDE SYSLIB  (IHARTCT )                                       */ 02839000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02840000
*/*%INCLUDE SYSLIB  (IEEXSA  )                                       */ 02841000
*/*%INCLUDE SYSLIB  (IHAPVT  )                                       */ 02842000
*/*%INCLUDE SYSLIB  (IHASMDLR)                                       */ 02843000
*/*%INCLUDE SYSLIB  (IHASDRSB)                                       */ 02844000
*/*%INCLUDE SYSLIB  (IHASMWK )                                       */ 02845000
*/*%INCLUDE SYSLIB  (IHASDWRK)                                       */ 02846000
*/*%INCLUDE SYSLIB  (CHDINIT )                                       */ 02847000
*/*%INCLUDE SYSLIB  (CHDCNTRL)                                       */ 02848000
*/*%INCLUDE SYSLIB  (CHDLPARN)                                       */ 02849000
*/*%INCLUDE SYSLIB  (CHDRPARN)                                       */ 02850000
*/*%INCLUDE SYSLIB  (CHDEQUAL)                                       */ 02851000
*/*%INCLUDE SYSLIB  (CHDCOMMA)                                       */ 02852000
*/*%INCLUDE SYSLIB  (CHDEOCMD)                                       */ 02853000
*/*%INCLUDE SYSLIB  (CHDINVLD)                                       */ 02854000
*/*%INCLUDE SYSLIB  (CHDCSS  )                                       */ 02855000
*/*%INCLUDE SYSUT5  (CHDSAQ  )                                       */ 02856000
*/*%INCLUDE SYSLIB  (CHDPDATA)                                       */ 02857000
*/*%INCLUDE SYSLIB  (CHDSDATA)                                       */ 02858000
*/*%INCLUDE SYSLIB  (CHDSDUMP)                                       */ 02859000
*/*%INCLUDE SYSLIB  (CHDSYSM )                                       */ 02860000
*                                                                  0716 02861000
*       ;                                                          0716 02862000
@DATA    DS    0H                                                       02863000
@CH00065 DC    H'1'                                                     02864000
@CH00077 DC    H'2'                                                     02865000
@CH00290 DC    H'3'                                                     02866000
@CH00057 DC    H'4'                                                     02867000
@CH00770 DC    H'5'                                                     02868000
@CH00709 DC    H'6'                                                     02869000
@CH00825 DC    H'7'                                                     02870000
@CH00063 DC    H'8'                                                     02871000
@CH00789 DC    H'9'                                                     02872000
@CH02249 DC    H'4544'                                                  02873000
@SM02259 MVC   XAV(0,XSAPTR),ERRTXT(@05)                                02874000
@DATD    DSECT                                                          02875000
         DS    0F                                                       02876000
@SA00001 DS    18F                                                      02877000
@TF00001 DS    F                                                        02878000
IEEMB815 CSECT                                                          02879000
         DS    0F                                                       02880000
@CF01975 DC    XL4'80000000'                                            02881000
@CF01988 DC    XL4'00100001'                                            02882000
@CF02038 DC    XL4'00000002'                                            02883000
@CH02038 EQU   @CF02038+2                                               02884000
@CF02040 DC    XL4'FFFFFFFD'                                            02885000
@CF02131 DC    XL4'50000000'                                            02886000
@CF02162 DC    XL4'20000000'                                            02887000
@DATD    DSECT                                                          02888000
         DS    0D                                                       02889000
ERRTXTP  DS    A                                                        02890000
@TS00001 DS    CL4                                                      02891000
WORKAREA DS    CL344                                                    02892000
         ORG   WORKAREA                                                 02893000
PART1    DS    CL88                                                     02894000
         ORG   PART1                                                    02895000
R14SVC34 DS    AL4                                                      02896000
OPTION   DS    AL4                                                      02897000
R14SAVE  DS    AL4                                                      02898000
WORKBITS DS    BL4                                                      02899000
         ORG   WORKBITS                                                 02900000
CDSET    DS    BL1                                                      02901000
CDRESET  EQU   WORKBITS+0                                               02902000
SDATAKEY EQU   WORKBITS+0                                               02903000
PDATAKEY EQU   WORKBITS+0                                               02904000
YESNO    EQU   WORKBITS+0                                               02905000
ADDMODE  EQU   WORKBITS+0                                               02906000
OVERMODE EQU   WORKBITS+0                                               02907000
NODUMP   EQU   WORKBITS+0                                               02908000
PKEY1    DS    BL1                                                      02909000
PKEY2    EQU   WORKBITS+1                                               02910000
KEY3     EQU   WORKBITS+1                                               02911000
KEY31    EQU   WORKBITS+1                                               02912000
LPARAN   EQU   WORKBITS+1                                               02913000
OPTIONX  EQU   WORKBITS+1                                               02914000
SETSA    EQU   WORKBITS+1                                               02915000
         ORG   PART1+16                                                 02916000
FIXCNT   DS    AL2                                                      02917000
         DS    CL2                                                      02918000
VSL      DS    CL8                                                      02919000
         ORG   VSL+0                                                    02920000
VSLOPT   DS    BL1                                                      02921000
VSLBEGA  DS    AL3                                                      02922000
VSLEND   DS    BL1                                                      02923000
VSLENDA  DS    AL3                                                      02924000
         ORG   PART1+44                                                 02925000
ECB      DS    CL4                                                      02926000
         ORG   ECB                                                      02927000
POSTCODE DS    CL1                                                      02928000
         ORG   PART1+48                                                 02929000
MSGID    DS    CL1                                                      02930000
STOPSAVE DS    CL1                                                      02931000
         DS    CL2                                                      02932000
XSASAVE  DS    AL4                                                      02933000
CHNGWORK DS    4BL4                                                     02934000
CHNGUPDT DS    4BL4                                                     02935000
         ORG   WORKAREA+88                                              02936000
PART2    DS    CL256                                                    02937000
         ORG   PART2                                                    02938000
TRANTBL  DS    CL256                                                    02939000
         ORG   WORKAREA+344                                             02940000
IEEMB815 CSECT                                                          02941000
         DS    0F                                                       02942000
@SIZDATD DC    AL1(229)                                                 02943000
         DC    AL3(@ENDDATD-@DATD)                                      02944000
@CV02052 DC    V(IEE2103D)                                              02945000
         DS    0D                                                       02946000
SMWKLEN  DC    AL4(956)                                                 02947000
@CC02209 DC    C'NOSUMDUMP'                                             02948000
@CC02081 DC    C'        '                                              02949000
@CC02098 DC    C'SYSMDUMP'                                              02950000
@CC02107 DC    C'SYSABEND'                                              02951000
@CC02108 DC    C'SYSUDUMP'                                              02952000
@CC02174 DC    C'ALLPDATA'                                              02953000
@CC02183 DC    C'ALLSDATA'                                              02954000
@CC02211 DC    C'NOALLPSA'                                              02955000
@CC02208 DC    C'SUMDUMP'                                               02956000
@CC02118 DC    C'NODUMP'                                                02957000
@CC02212 DC    C'ALLPSA'                                                02958000
@CC02091 DC    C'PDATA'                                                 02959000
@CC02093 DC    C'SDATA'                                                 02960000
@CC02096 DC    C'SDUMP'                                                 02961000
@CC02109 DC    C'RESET'                                                 02962000
@CC02175 DC    C'ALLPA'                                                 02963000
@CC02205 EQU   @CC02211                                                 02964000
@CC02206 DC    C'NOSQA'                                                 02965000
@CC02207 EQU   @CC02209                                                 02966000
@CC02106 DC    C'OVER'                                                  02967000
@CC02168 DC    C'REGS'                                                  02968000
@CC02169 DC    C'SPLS'                                                  02969000
@CC02184 DC    C'LSQA'                                                  02970000
@CC02104 DC    C'YES'                                                   02971000
@CC02105 DC    C'ADD'                                                   02972000
@CC02110 DC    C'SET'                                                   02973000
@CC02111 DC    C'DEL'                                                   02974000
@CC02115 EQU   @CC02174                                                 02975000
@CC02170 DC    C'SAH'                                                   02976000
@CC02171 DC    C'PSW'                                                   02977000
@CC02172 DC    C'JPA'                                                   02978000
@CC02173 DC    C'LPA'                                                   02979000
@CC02185 DC    C'NUC'                                                   02980000
@CC02186 DC    C'SQA'                                                   02981000
@CC02187 DC    C'TRT'                                                   02982000
@CC02188 DC    C'ENQ'                                                   02983000
@CC02189 DC    C'SWA'                                                   02984000
@CC02190 DC    C'ERR'                                                   02985000
@CC02201 EQU   @CC02208                                                 02986000
@CC02202 DC    C'PSA'                                                   02987000
@CC02203 DC    C'RGN'                                                   02988000
@CC02204 DC    C'CSA'                                                   02989000
@CC02103 EQU   @CC02209                                                 02990000
@CC02176 EQU   @CC02170                                                 02991000
@CC02191 DC    C'CB'                                                    02992000
@CC02192 DC    C'DM'                                                    02993000
@CC02193 DC    C'IO'                                                    02994000
@CB02042 DC    X'FFFFFFFE'                                              02995000
PDALL    DC    X'FE00'                                                  02996000
SDALL    DC    X'FFC0'                                                  02997000
ALLSYSM  DC    X'FF00'                                                  02998000
PATCHLOC DC    CL256'PATCH AREA FOR IEEMB815, 256 BYTES LONG'           02999000
         DS    CL1                                                      03000000
SMDWSAG  DC    AL2(6)                                                   03001000
         DC    AL2(7)                                                   03002000
         DC    AL2(8)                                                   03003000
         DC    AL2(9)                                                   03004000
         DC    AL2(10)                                                  03005000
         DC    AL2(11)                                                  03006000
         DC    AL2(12)                                                  03007000
         DC    AL2(13)                                                  03008000
         DC    AL2(14)                                                  03009000
         DC    AL2(15)                                                  03010000
         DC    AL2(16)                                                  03011000
SMDWSAC  DC    AL2(17)                                                  03012000
         DC    AL2(18)                                                  03013000
         DC    AL2(19)                                                  03014000
         DC    AL2(20)                                                  03015000
         DC    AL2(21)                                                  03016000
         DC    AL2(22)                                                  03017000
         DC    AL2(23)                                                  03018000
         DC    AL2(24)                                                  03019000
         DC    AL2(25)                                                  03020000
         DC    AL2(26)                                                  03021000
         DC    AL2(27)                                                  03022000
         DC    AL2(28)                                                  03023000
         DC    AL2(29)                                                  03024000
         DC    AL2(30)                                                  03025000
         DC    AL2(54)                                                  03026000
         DC    AL2(55)                                                  03027000
SMDWSAL  DC    AL2(31)                                                  03028000
         DC    AL2(32)                                                  03029000
         DC    AL2(33)                                                  03030000
         DC    AL2(34)                                                  03031000
         DC    AL2(35)                                                  03032000
         DC    AL2(36)                                                  03033000
         DC    AL2(37)                                                  03034000
         DC    AL2(38)                                                  03035000
         DC    AL2(39)                                                  03036000
         DC    AL2(40)                                                  03037000
         DC    AL2(41)                                                  03038000
         DC    AL2(42)                                                  03039000
         DC    AL2(43)                                                  03040000
         DC    AL2(44)                                                  03041000
         DC    AL2(45)                                                  03042000
         DS    CL2                                                      03043000
BRTABLE  DC    AL4(CHDEQUAL)                                            03044000
         DC    AL4(CHDCOMMA)                                            03045000
         DC    AL4(CHDEOCMD)                                            03046000
         DC    AL4(CHDLPARN)                                            03047000
         DC    AL4(CHDRPARN)                                            03048000
         DC    AL4(CHDUNEXP)                                            03049000
         DC    AL4(CHDINVLD)                                            03050000
IEEMB815 CSECT                                                          03051000
TRTIN   TRT    OPERAND(0,START),TRANTBL                                 03052000
@DATD    DSECT                                                          03053000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                03054000
@ENDDATD EQU   *                                                        03055000
IEEMB815 CSECT                                                          03056000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       03057000
@01      EQU   01                                                       03058000
@02      EQU   02                                                       03059000
@03      EQU   03                                                       03060000
@04      EQU   04                                                       03061000
@05      EQU   05                                                       03062000
@06      EQU   06                                                       03063000
@07      EQU   07                                                       03064000
@08      EQU   08                                                       03065000
@09      EQU   09                                                       03066000
@10      EQU   10                                                       03067000
@11      EQU   11                                                       03068000
@12      EQU   12                                                       03069000
@13      EQU   13                                                       03070000
@14      EQU   14                                                       03071000
@15      EQU   15                                                       03072000
XSAPTR   EQU   @02                                                      03073000
R0       EQU   @00                                                      03074000
R1       EQU   @01                                                      03075000
R4       EQU   @04                                                      03076000
RETCODE  EQU   @15                                                      03077000
ENP      EQU   @01                                                      03078000
STOPPER  EQU   @02                                                      03079000
RTCTREG  EQU   @05                                                      03080000
TYPEPTR  EQU   @05                                                      03081000
LEN      EQU   @03                                                      03082000
COMPREG  EQU   @04                                                      03083000
OPLNTH   EQU   @04                                                      03084000
OPSETPTR EQU   @07                                                      03085000
SWAPREG  EQU   @07                                                      03086000
DT       EQU   @09                                                      03087000
START    EQU   @11                                                      03088000
R14      EQU   @14                                                      03089000
GPR00P   EQU   @00                                                      03090000
GPR01P   EQU   @01                                                      03091000
GPR15P   EQU   @15                                                      03092000
GPR11P   EQU   @11                                                      03093000
GPR12P   EQU   @12                                                      03094000
GPR13P   EQU   @13                                                      03095000
GPR14P   EQU   @14                                                      03096000
PSA      EQU   0                                                        03097000
FLCRNPSW EQU   PSA                                                      03098000
FLCROPSW EQU   PSA+8                                                    03099000
FLCICCW2 EQU   PSA+16                                                   03100000
FLCCVT   EQU   FLCICCW2                                                 03101000
PSAEEPSW EQU   PSA+132                                                  03102000
PSAESPSW EQU   PSA+136                                                  03103000
FLCSVILC EQU   PSAESPSW+1                                               03104000
PSAEPPSW EQU   PSA+140                                                  03105000
FLCPIILC EQU   PSAEPPSW+1                                               03106000
FLCPICOD EQU   PSAEPPSW+2                                               03107000
PSAPICOD EQU   FLCPICOD+1                                               03108000
FLCTEA   EQU   PSAEPPSW+4                                               03109000
FLCPER   EQU   PSA+152                                                  03110000
FLCMCLA  EQU   PSA+168                                                  03111000
FLCIOEL  EQU   FLCMCLA+4                                                03112000
FLCIOA   EQU   FLCMCLA+16                                               03113000
FLCFSA   EQU   FLCMCLA+80                                               03114000
PSASUPER EQU   PSA+552                                                  03115000
PSASUP1  EQU   PSASUPER                                                 03116000
PSASUP2  EQU   PSASUPER+1                                               03117000
PSASUP3  EQU   PSASUPER+2                                               03118000
PSASUP4  EQU   PSASUPER+3                                               03119000
PSACLHT  EQU   PSA+640                                                  03120000
PSALKSA  EQU   PSA+696                                                  03121000
PSAHLHI  EQU   PSA+760                                                  03122000
PSALITA  EQU   PSA+764                                                  03123000
PSADSSFL EQU   PSA+836                                                  03124000
PSADSSF1 EQU   PSADSSFL                                                 03125000
PSADSSF3 EQU   PSADSSFL+2                                               03126000
PSADSSF4 EQU   PSADSSFL+3                                               03127000
PSARSVT  EQU   PSA+896                                                  03128000
CVTMAP   EQU   0                                                        03129000
CVTDAR   EQU   CVTMAP+72                                                03130000
CVTFLGS1 EQU   CVTDAR                                                   03131000
CVTDCB   EQU   CVTMAP+116                                               03132000
CVTIERLC EQU   CVTMAP+144                                               03133000
CVTOPTA  EQU   CVTMAP+182                                               03134000
CVTOPTB  EQU   CVTMAP+183                                               03135000
CVTGTF   EQU   CVTMAP+236                                               03136000
CVTGTFST EQU   CVTGTF                                                   03137000
CVTGTFS  EQU   CVTGTFST                                                 03138000
CVTSTATE EQU   CVTGTFST                                                 03139000
CVTTMODE EQU   CVTGTFST                                                 03140000
CVTFORM  EQU   CVTGTFST                                                 03141000
CVTAQAVT EQU   CVTMAP+240                                               03142000
CVTTCMFG EQU   CVTAQAVT                                                 03143000
CVTVOLM2 EQU   CVTMAP+244                                               03144000
CVTTATA  EQU   CVTVOLM2                                                 03145000
CVTTSKS  EQU   CVTTATA                                                  03146000
CVTVOLF2 EQU   CVTTSKS                                                  03147000
CVTTAT   EQU   CVTTATA+1                                                03148000
CVTATER  EQU   CVTMAP+248                                               03149000
CVTEXT1  EQU   CVTMAP+252                                               03150000
CVTPURG  EQU   CVTMAP+260                                               03151000
CVTQMSG  EQU   CVTMAP+268                                               03152000
CVTDMSR  EQU   CVTMAP+272                                               03153000
CVTRSV37 EQU   CVTDMSR                                                  03154000
CVTDMSRF EQU   CVTRSV37                                                 03155000
CVTERPV  EQU   CVTMAP+316                                               03156000
CVTINTLA EQU   CVTMAP+320                                               03157000
CVTAPF   EQU   CVTMAP+324                                               03158000
CVTEXT2  EQU   CVTMAP+328                                               03159000
CVTHJES  EQU   CVTMAP+332                                               03160000
CVTPGSIA EQU   CVTMAP+348                                               03161000
CVTA1F1  EQU   CVTMAP+356                                               03162000
CVTSYSK  EQU   CVTMAP+357                                               03163000
CVTVOLM1 EQU   CVTMAP+380                                               03164000
CVTVOLF1 EQU   CVTVOLM1                                                 03165000
CVTXTNT1 EQU   0                                                        03166000
CVTXTNT2 EQU   0                                                        03167000
CVTDSSV  EQU   CVTXTNT2                                                 03168000
CVTFLGBT EQU   CVTXTNT2+5                                               03169000
CVTQID   EQU   CVTXTNT2+24                                              03170000
CVTRV400 EQU   CVTXTNT2+52                                              03171000
CVTRV409 EQU   CVTXTNT2+53                                              03172000
CVTATCVT EQU   CVTXTNT2+64                                              03173000
CVTRV429 EQU   CVTXTNT2+84                                              03174000
CVTRV438 EQU   CVTXTNT2+85                                              03175000
CVTRV457 EQU   CVTXTNT2+112                                             03176000
CVTRV466 EQU   CVTXTNT2+113                                             03177000
CVTFIX   EQU   0                                                        03178000
CVTRELNO EQU   CVTFIX+252                                               03179000
RTCT     EQU   0                                                        03180000
RTCTPLIB EQU   RTCT+4                                                   03181000
RTCTSAP  EQU   RTCTPLIB                                                 03182000
RTCTSAP1 EQU   RTCTSAP                                                  03183000
RTCTSAP2 EQU   RTCTSAP+1                                                03184000
RTCTSAP3 EQU   RTCTSAP+2                                                03185000
RTCTSUP  EQU   RTCTPLIB+4                                               03186000
RTCTSUP1 EQU   RTCTSUP                                                  03187000
RTCTSUP2 EQU   RTCTSUP+1                                                03188000
RTCTSUP3 EQU   RTCTSUP+2                                                03189000
RTCTSYD  EQU   RTCTPLIB+8                                               03190000
RTCTSY01 EQU   RTCTSYD                                                  03191000
RTCTSDDS EQU   RTCT+36                                                  03192000
RTCTFLG  EQU   RTCTSDDS+3                                               03193000
RTCTSDPL EQU   RTCT+156                                                 03194000
RTCTRFLG EQU   RTCT+176                                                 03195000
RTCTSDSW EQU   RTCT+180                                                 03196000
RTCTSDWK EQU   RTCT+220                                                 03197000
RTCTERID EQU   RTCT+224                                                 03198000
RTCTOPT  EQU   RTCT+236                                                 03199000
RTCTASO  EQU   RTCT+252                                                 03200000
RTCTASO1 EQU   RTCTASO                                                  03201000
RTCTASO2 EQU   RTCTASO+1                                                03202000
RTCTSDI  EQU   RTCT+254                                                 03203000
RTCTSDF  EQU   RTCT+264                                                 03204000
RTCTSDF1 EQU   RTCTSDF                                                  03205000
RTCTSDF2 EQU   RTCTSDF+1                                                03206000
RTCTSDF3 EQU   RTCT+268                                                 03207000
RTCTSDF4 EQU   RTCTSDF3+2                                               03208000
RTCTMOPT EQU   0                                                        03209000
RTCTMSAO EQU   RTCTMOPT                                                 03210000
RTCTSASD EQU   RTCTMSAO                                                 03211000
RTCTSAO1 EQU   RTCTSASD                                                 03212000
RTCTSAD0 EQU   RTCTSAO1                                                 03213000
RTCTSAD1 EQU   RTCTSAO1                                                 03214000
RTCTSAD2 EQU   RTCTSAO1                                                 03215000
RTCTSAD3 EQU   RTCTSAO1                                                 03216000
RTCTSAD4 EQU   RTCTSAO1                                                 03217000
RTCTSAD5 EQU   RTCTSAO1                                                 03218000
RTCTSAD6 EQU   RTCTSAO1                                                 03219000
RTCTSAD7 EQU   RTCTSAO1                                                 03220000
RTCTSAO2 EQU   RTCTSASD+1                                               03221000
RTCTSADG EQU   RTCTSAO2                                                 03222000
RTCTSADH EQU   RTCTSAO2                                                 03223000
RTCTSAPD EQU   RTCTMSAO+2                                               03224000
RTCTSAO3 EQU   RTCTSAPD                                                 03225000
RTCTSAD8 EQU   RTCTSAO3                                                 03226000
RTCTSAD9 EQU   RTCTSAO3                                                 03227000
RTCTSADA EQU   RTCTSAO3                                                 03228000
RTCTSADB EQU   RTCTSAO3                                                 03229000
RTCTSADC EQU   RTCTSAO3                                                 03230000
RTCTSADD EQU   RTCTSAO3                                                 03231000
RTCTSADE EQU   RTCTSAO3                                                 03232000
RTCTSAO4 EQU   RTCTSAPD+1                                               03233000
RTCTSAMG EQU   RTCTSAO4                                                 03234000
RTCTMSUO EQU   RTCTMOPT+4                                               03235000
RTCTSUSD EQU   RTCTMSUO                                                 03236000
RTCTSUO1 EQU   RTCTSUSD                                                 03237000
RTCTSUO2 EQU   RTCTSUSD+1                                               03238000
RTCTSUPD EQU   RTCTMSUO+2                                               03239000
RTCTSUO3 EQU   RTCTSUPD                                                 03240000
RTCTSUO4 EQU   RTCTSUPD+1                                               03241000
RTCTSUMG EQU   RTCTSUO4                                                 03242000
RTCTMSYO EQU   RTCTMOPT+8                                               03243000
RTCTSD01 EQU   RTCTMSYO                                                 03244000
RTCTSDS0 EQU   RTCTSD01                                                 03245000
RTCTSDS1 EQU   RTCTSD01                                                 03246000
RTCTSDS2 EQU   RTCTSD01                                                 03247000
RTCTSDS3 EQU   RTCTSD01                                                 03248000
RTCTSDS4 EQU   RTCTSD01                                                 03249000
RTCTSDS5 EQU   RTCTSD01                                                 03250000
RTCTSDS6 EQU   RTCTSD01                                                 03251000
RTCTSDS7 EQU   RTCTSD01                                                 03252000
RTCTSD04 EQU   RTCTMSYO+3                                               03253000
RTCTSMMG EQU   RTCTSD04                                                 03254000
RTCTMSDO EQU   RTCTMOPT+12                                              03255000
RTCTSDOD EQU   RTCTMSDO                                                 03256000
RTCTSDO1 EQU   RTCTSDOD                                                 03257000
RTCTSDP0 EQU   RTCTSDO1                                                 03258000
RTCTSDP1 EQU   RTCTSDO1                                                 03259000
RTCTSDP2 EQU   RTCTSDO1                                                 03260000
RTCTSDP3 EQU   RTCTSDO1                                                 03261000
RTCTSDP4 EQU   RTCTSDO1                                                 03262000
RTCTSDP5 EQU   RTCTSDO1                                                 03263000
RTCTSDP6 EQU   RTCTSDO1                                                 03264000
RTCTSDP7 EQU   RTCTSDO1                                                 03265000
RTCTSDO2 EQU   RTCTSDOD+1                                               03266000
RTCTSDP8 EQU   RTCTSDO2                                                 03267000
RTCTSDP9 EQU   RTCTSDO2                                                 03268000
RTCTSDPA EQU   RTCTSDO2                                                 03269000
RTCTSDPB EQU   RTCTSDO2                                                 03270000
RTCTSDPC EQU   RTCTSDO2                                                 03271000
RTCTSDPD EQU   RTCTSDO2                                                 03272000
RTCTSDO3 EQU   RTCTMSDO+2                                               03273000
RTCTSDPG EQU   RTCTSDO3                                                 03274000
RTCTSDPH EQU   RTCTSDO3                                                 03275000
RTCTSDO4 EQU   RTCTMSDO+3                                               03276000
RTCTSDMG EQU   RTCTSDO4                                                 03277000
XSAMAP   EQU   0                                                        03278000
XASVRB   EQU   XSAMAP                                                   03279000
XSA      EQU   XASVRB                                                   03280000
XAD      EQU   XSA+4                                                    03281000
XAX      EQU   XASVRB+8                                                 03282000
@NM00041 EQU   XASVRB+16                                                03283000
XAE      EQU   @NM00041                                                 03284000
@NM00042 EQU   XASVRB+20                                                03285000
XAL      EQU   @NM00042+1                                               03286000
XAV      EQU   XASVRB+24                                                03287000
XAS      EQU   XASVRB+32                                                03288000
XAA      EQU   XASVRB+42                                                03289000
XASAVLOC EQU   XSAMAP+48                                                03290000
XASAVLOX EQU   XASAVLOC                                                 03291000
XASAVSTD EQU   XSAMAP+64                                                03292000
XASAVSTR EQU   XASAVSTD                                                 03293000
@NM00044 EQU   XSAMAP+136                                               03294000
XACMFLGS EQU   @NM00044                                                 03295000
XACMFLGA EQU   XACMFLGS                                                 03296000
XACMFLG1 EQU   XACMFLGA                                                 03297000
XACMFLG2 EQU   XACMFLGA+1                                               03298000
XACMFLGB EQU   XACMFLGS+2                                               03299000
XAWORK   EQU   XSAMAP+152                                               03300000
EEXSAS01 EQU   0                                                        03301000
EEXSAS02 EQU   0                                                        03302000
XADUSWIT EQU   EEXSAS02                                                 03303000
EEXSAS03 EQU   0                                                        03304000
XASDS    EQU   EEXSAS03+2                                               03305000
@NM00046 EQU   EEXSAS03+4                                               03306000
EEXSAS04 EQU   0                                                        03307000
XAXMASK  EQU   EEXSAS04                                                 03308000
EEXSAS05 EQU   0                                                        03309000
XASOPCOD EQU   EEXSAS05                                                 03310000
XASWITCH EQU   EEXSAS05+1                                               03311000
XALTCHG  EQU   XASWITCH                                                 03312000
XACOMPMS EQU   XASWITCH                                                 03313000
XARESV   EQU   EEXSAS05+2                                               03314000
EEXSAS06 EQU   0                                                        03315000
XAAVRANG EQU   EEXSAS06                                                 03316000
XAAVRNG2 EQU   EEXSAS06+1                                               03317000
PVT      EQU   0                                                        03318000
PVTFLAG1 EQU   PVT                                                      03319000
PVTPSIB  EQU   PVT+72                                                   03320000
PVTQS    EQU   PVT+304                                                  03321000
PVTWSAX  EQU   PVT+344                                                  03322000
PVTPCBQS EQU   PVT+1852                                                 03323000
SMDLR    EQU   0                                                        03324000
SMDLRHDR EQU   SMDLR                                                    03325000
SMWKRSCB EQU   0                                                        03326000
SMWKFLGA EQU   SMWKRSCB                                                 03327000
SMWKRSFM EQU   SMWKRSCB+16                                              03328000
SMWK     EQU   0                                                        03329000
SMWKFLGS EQU   SMWK+4                                                   03330000
SMWKFLG1 EQU   SMWKFLGS                                                 03331000
SMWKENTY EQU   SMWK+152                                                 03332000
SMWKSSDE EQU   SMWK+156                                                 03333000
SMWKPFXB EQU   SMWK+160                                                 03334000
SMWKPFXE EQU   SMWK+164                                                 03335000
SMWKPSW  EQU   SMWK+168                                                 03336000
SMWKREGS EQU   SMWK+668                                                 03337000
SDWORK   EQU   0                                                        03338000
SDCNTRL  EQU   SDWORK                                                   03339000
SVCDOPTS EQU   SDCNTRL+100                                              03340000
SVCDOPT1 EQU   SVCDOPTS                                                 03341000
SVCDOPT2 EQU   SVCDOPTS+1                                               03342000
FLAGSONE EQU   SDCNTRL+102                                              03343000
CVRT11   EQU   SDCNTRL+368                                              03344000
CVRT1    EQU   CVRT11+4                                                 03345000
CVRT2    EQU   SDCNTRL+376                                              03346000
SDCVRT4  EQU   CVRT2+2                                                  03347000
SVCNAME  EQU   SDCNTRL+392                                              03348000
SVCNM1T5 EQU   SVCNAME                                                  03349000
SVCNM6T8 EQU   SVCNAME+5                                                03350000
SVCNM7T8 EQU   SVCNM6T8+1                                               03351000
CCWCHAIN EQU   SDCNTRL+400                                              03352000
CCW1     EQU   CCWCHAIN                                                 03353000
FLAGS1   EQU   CCW1+4                                                   03354000
CCW2     EQU   CCWCHAIN+8                                               03355000
FLAGS2   EQU   CCW2+4                                                   03356000
CCW3     EQU   CCWCHAIN+16                                              03357000
FLAGS3   EQU   CCW3+4                                                   03358000
SDOUTBUF EQU   SDWORK+432                                               03359000
RCDCCHH  EQU   SDOUTBUF                                                 03360000
ERRTXT   EQU   0                                                        03361000
OPERAND  EQU   0                                                        03362000
OPSET    EQU   0                                                        03363000
AREA1BEG EQU   0                                                        03364000
AREA1END EQU   0                                                        03365000
AREA2BEG EQU   0                                                        03366000
AREA2END EQU   0                                                        03367000
AREA3BEG EQU   0                                                        03368000
AREA3END EQU   0                                                        03369000
IEAVPSIB EQU   0                                                        03370000
I001C    EQU   0                                                        03371000
I008P    EQU   0                                                        03372000
I015F    EQU   0                                                        03373000
I015P    EQU   0                                                        03374000
I031F    EQU   0                                                        03375000
I031P    EQU   0                                                        03376000
I256C    EQU   0                                                        03377000
CVTPTR   EQU   FLCCVT                                                   03378000
CVTS01   EQU   CVTPGSIA                                                 03379000
CVTPVTP  EQU   CVTS01+8                                                 03380000
CVTLPDIA EQU   CVTS01+12                                                03381000
CVTDIRST EQU   CVTLPDIA                                                 03382000
CVTSLIDA EQU   CVTS01+24                                                03383000
CVTCTLFG EQU   CVTS01+50                                                03384000
CVTRTMCT EQU   CVTS01+224                                               03385000
CVTRV210 EQU   CVTS01+424                                               03386000
CVTRV219 EQU   CVTS01+425                                               03387000
CVTRV228 EQU   CVTS01+426                                               03388000
CVTRV237 EQU   CVTS01+427                                               03389000
CVTMFRTR EQU   CVTS01+452                                               03390000
CVTRV262 EQU   CVTS01+468                                               03391000
CVTRV271 EQU   CVTS01+469                                               03392000
CVTRV280 EQU   CVTS01+470                                               03393000
CVTRV289 EQU   CVTS01+471                                               03394000
CVTGSDA  EQU   CVTS01+600                                               03395000
PSARSVTE EQU   PSARSVT                                                  03396000
PVTPTR   EQU   CVTPVTP                                                  03397000
RTCTOPTS EQU   RTCTOPT                                                  03398000
MODEOPT  EQU   RTCTOPTS+3                                               03399000
RTCTPLB  EQU   RTCTPLIB                                                 03400000
FLC      EQU   PSA                                                      03401000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    03402000
IGNOROPT EQU   RTCTOPTS+3                                               03403000
@NM00067 EQU   RTCTOPTS                                                 03404000
PSARSAV  EQU   PSARSVTE+60                                              03405000
PSARSTK  EQU   PSARSVTE+56                                              03406000
PSAESAV3 EQU   PSARSVTE+52                                              03407000
PSAESTK3 EQU   PSARSVTE+48                                              03408000
PSAESAV2 EQU   PSARSVTE+44                                              03409000
PSAESTK2 EQU   PSARSVTE+40                                              03410000
PSAESAV1 EQU   PSARSVTE+36                                              03411000
PSAESTK1 EQU   PSARSVTE+32                                              03412000
PSAPSAV  EQU   PSARSVTE+28                                              03413000
PSAPSTK  EQU   PSARSVTE+24                                              03414000
PSAMSAV  EQU   PSARSVTE+20                                              03415000
PSAMSTK  EQU   PSARSVTE+16                                              03416000
PSASSAV  EQU   PSARSVTE+12                                              03417000
PSASSTK  EQU   PSARSVTE+8                                               03418000
PSANSTK  EQU   PSARSVTE+4                                               03419000
PSACSTK  EQU   PSARSVTE                                                 03420000
CVTRV628 EQU   CVTS01+728                                               03421000
CVTRV627 EQU   CVTS01+724                                               03422000
CVTRV626 EQU   CVTS01+720                                               03423000
CVTRV625 EQU   CVTS01+716                                               03424000
CVTRV624 EQU   CVTS01+712                                               03425000
CVTRV623 EQU   CVTS01+708                                               03426000
CVTRV622 EQU   CVTS01+704                                               03427000
CVTRV621 EQU   CVTS01+700                                               03428000
CVTIHASU EQU   CVTS01+696                                               03429000
CVTSUSP  EQU   CVTS01+692                                               03430000
CVTT6SVC EQU   CVTS01+688                                               03431000
CVTCDAL  EQU   CVTS01+684                                               03432000
CVTTCTL  EQU   CVTS01+680                                               03433000
CVTRSUME EQU   CVTS01+676                                               03434000
CVTJTERM EQU   CVTS01+672                                               03435000
CVTASMRM EQU   CVTS01+668                                               03436000
CVTTCASP EQU   CVTS01+664                                               03437000
CVT0PT03 EQU   CVTS01+660                                               03438000
CVT0PT0E EQU   CVTS01+656                                               03439000
CVTRV609 EQU   CVTS01+652                                               03440000
CVTCGK   EQU   CVTS01+648                                               03441000
CVTRAC   EQU   CVTS01+644                                               03442000
CVTRV606 EQU   CVTS01+640                                               03443000
CVTRV605 EQU   CVTS01+636                                               03444000
CVTRV604 EQU   CVTS01+632                                               03445000
CVTEFF02 EQU   CVTS01+628                                               03446000
CVTCBBR  EQU   CVTS01+624                                               03447000
CVTSSCR  EQU   CVTS01+620                                               03448000
CVTEVENT EQU   CVTS01+616                                               03449000
CVTCRCA  EQU   CVTS01+612                                               03450000
CVTTPIO  EQU   CVTS01+608                                               03451000
CVTADV   EQU   CVTS01+604                                               03452000
CVTGSDAB EQU   CVTGSDA                                                  03453000
CVTQV3   EQU   CVTS01+596                                               03454000
CVTQV2   EQU   CVTS01+592                                               03455000
CVTQV1   EQU   CVTS01+588                                               03456000
CVTRPT   EQU   CVTS01+584                                               03457000
CVTSSRB  EQU   CVTS01+580                                               03458000
CVTCSDRL EQU   CVTS01+576                                               03459000
CVTEXP1  EQU   CVTS01+572                                               03460000
CVTRMPMT EQU   CVTS01+568                                               03461000
CVTRMPTT EQU   CVTS01+564                                               03462000
CVTVPSA  EQU   CVTS01+560                                               03463000
CVTVSTOP EQU   CVTS01+556                                               03464000
CVTGTFR8 EQU   CVTS01+552                                               03465000
CVTQUIT  EQU   CVTS01+548                                               03466000
CVTVACR  EQU   CVTS01+544                                               03467000
CVTWTCB  EQU   CVTS01+540                                               03468000
CVTSTPRS EQU   CVTS01+536                                               03469000
CVT0PT02 EQU   CVTS01+532                                               03470000
CVTDARCM EQU   CVTS01+528                                               03471000
CVTIRECM EQU   CVTS01+524                                               03472000
CVTJRECM EQU   CVTS01+520                                               03473000
CVTVEMS0 EQU   CVTS01+516                                               03474000
CVTSPFRR EQU   CVTS01+512                                               03475000
CVTRLSTG EQU   CVTS01+508                                               03476000
CVT0TC0A EQU   CVTS01+504                                               03477000
CVTGMBR  EQU   CVTS01+500                                               03478000
CVTLFRM  EQU   CVTS01+496                                               03479000
CVTRMBR  EQU   CVTS01+492                                               03480000
CVTVIOP  EQU   CVTS01+488                                               03481000
CVTRV307 EQU   CVTS01+486                                               03482000
CVTRV306 EQU   CVTS01+484                                               03483000
CVTRV305 EQU   CVTS01+482                                               03484000
CVTRV304 EQU   CVTS01+480                                               03485000
CVTRV303 EQU   CVTS01+478                                               03486000
CVTRV302 EQU   CVTS01+476                                               03487000
CVTTRCA  EQU   CVTS01+472                                               03488000
CVTRV297 EQU   CVTRV289                                                 03489000
CVTRV296 EQU   CVTRV289                                                 03490000
CVTRV295 EQU   CVTRV289                                                 03491000
CVTRV294 EQU   CVTRV289                                                 03492000
CVTRV293 EQU   CVTRV289                                                 03493000
CVTRV292 EQU   CVTRV289                                                 03494000
CVTRV291 EQU   CVTRV289                                                 03495000
CVTRV290 EQU   CVTRV289                                                 03496000
CVTRV288 EQU   CVTRV280                                                 03497000
CVTRV287 EQU   CVTRV280                                                 03498000
CVTRV286 EQU   CVTRV280                                                 03499000
CVTRV285 EQU   CVTRV280                                                 03500000
CVTRV284 EQU   CVTRV280                                                 03501000
CVTRV283 EQU   CVTRV280                                                 03502000
CVTRV282 EQU   CVTRV280                                                 03503000
CVTRV281 EQU   CVTRV280                                                 03504000
CVTRV279 EQU   CVTRV271                                                 03505000
CVTRV278 EQU   CVTRV271                                                 03506000
CVTRV277 EQU   CVTRV271                                                 03507000
CVTRV276 EQU   CVTRV271                                                 03508000
CVTRV275 EQU   CVTRV271                                                 03509000
CVTRV274 EQU   CVTRV271                                                 03510000
CVTRV273 EQU   CVTRV271                                                 03511000
CVTRV272 EQU   CVTRV271                                                 03512000
CVTRV270 EQU   CVTRV262                                                 03513000
CVTRV269 EQU   CVTRV262                                                 03514000
CVTRV268 EQU   CVTRV262                                                 03515000
CVTRV267 EQU   CVTRV262                                                 03516000
CVTRV266 EQU   CVTRV262                                                 03517000
CVTRV265 EQU   CVTRV262                                                 03518000
CVTRV264 EQU   CVTRV262                                                 03519000
CVTRV263 EQU   CVTRV262                                                 03520000
CVTVFP   EQU   CVTS01+464                                               03521000
CVTVSI   EQU   CVTS01+460                                               03522000
CVTVPSIB EQU   CVTS01+456                                               03523000
CVTMFACT EQU   CVTMFRTR                                                 03524000
CVTMFCTL EQU   CVTS01+448                                               03525000
CVTPVBP  EQU   CVTS01+444                                               03526000
CVTPWI   EQU   CVTS01+440                                               03527000
CVTRV254 EQU   CVTS01+438                                               03528000
CVTRV253 EQU   CVTS01+436                                               03529000
CVTRV252 EQU   CVTS01+434                                               03530000
CVTRV251 EQU   CVTS01+433                                               03531000
CVTRV250 EQU   CVTS01+432                                               03532000
CVTRV249 EQU   CVTS01+431                                               03533000
CVTRV248 EQU   CVTS01+430                                               03534000
CVTRV247 EQU   CVTS01+429                                               03535000
CVTRV246 EQU   CVTS01+428                                               03536000
CVTRV245 EQU   CVTRV237                                                 03537000
CVTRV244 EQU   CVTRV237                                                 03538000
CVTRV243 EQU   CVTRV237                                                 03539000
CVTRV242 EQU   CVTRV237                                                 03540000
CVTRV241 EQU   CVTRV237                                                 03541000
CVTRV240 EQU   CVTRV237                                                 03542000
CVTRV239 EQU   CVTRV237                                                 03543000
CVTRV238 EQU   CVTRV237                                                 03544000
CVTRV236 EQU   CVTRV228                                                 03545000
CVTRV235 EQU   CVTRV228                                                 03546000
CVTRV234 EQU   CVTRV228                                                 03547000
CVTRV233 EQU   CVTRV228                                                 03548000
CVTRV232 EQU   CVTRV228                                                 03549000
CVTRV231 EQU   CVTRV228                                                 03550000
CVTRV230 EQU   CVTRV228                                                 03551000
CVTRV229 EQU   CVTRV228                                                 03552000
CVTRV227 EQU   CVTRV219                                                 03553000
CVTRV226 EQU   CVTRV219                                                 03554000
CVTRV225 EQU   CVTRV219                                                 03555000
CVTRV224 EQU   CVTRV219                                                 03556000
CVTRV223 EQU   CVTRV219                                                 03557000
CVTRV222 EQU   CVTRV219                                                 03558000
CVTRV221 EQU   CVTRV219                                                 03559000
CVTRV220 EQU   CVTRV219                                                 03560000
CVTRV218 EQU   CVTRV210                                                 03561000
CVTRV217 EQU   CVTRV210                                                 03562000
CVTRV216 EQU   CVTRV210                                                 03563000
CVTRV215 EQU   CVTRV210                                                 03564000
CVTRV214 EQU   CVTRV210                                                 03565000
CVTRV213 EQU   CVTRV210                                                 03566000
CVTRV212 EQU   CVTRV210                                                 03567000
CVTRV211 EQU   CVTRV210                                                 03568000
CVTLCCAT EQU   CVTS01+420                                               03569000
CVTPCCAT EQU   CVTS01+416                                               03570000
CVTIPCRP EQU   CVTS01+412                                               03571000
CVTIPCRI EQU   CVTS01+408                                               03572000
CVTIPCDS EQU   CVTS01+404                                               03573000
CVTAIDVT EQU   CVTS01+400                                               03574000
CVTSSAP  EQU   CVTS01+396                                               03575000
CVTEHCIR EQU   CVTS01+392                                               03576000
CVTEHDEF EQU   CVTS01+388                                               03577000
CVTDAIR  EQU   CVTS01+384                                               03578000
CVTPERFM EQU   CVTS01+380                                               03579000
CVT044R2 EQU   CVTS01+376                                               03580000
CVTFETCH EQU   CVTS01+372                                               03581000
CVTRSTWD EQU   CVTS01+368                                               03582000
CVTSPOST EQU   CVTS01+364                                               03583000
CVTIOBP  EQU   CVTS01+360                                               03584000
CVTASMVT EQU   CVTS01+356                                               03585000
CVTRECRQ EQU   CVTS01+352                                               03586000
CVTWSAC  EQU   CVTS01+348                                               03587000
CVTRV149 EQU   CVTS01+344                                               03588000
CVTWSAL  EQU   CVTS01+340                                               03589000
CVTSPSA  EQU   CVTS01+336                                               03590000
CVTGLMN  EQU   CVTS01+332                                               03591000
CVTVEAC0 EQU   CVTS01+328                                               03592000
CVT062R1 EQU   CVTS01+324                                               03593000
CVTRPOST EQU   CVTS01+320                                               03594000
CVTDQIQE EQU   CVTS01+316                                               03595000
CVTCSD   EQU   CVTS01+312                                               03596000
CVTLKRMA EQU   CVTS01+308                                               03597000
CVTRSPIE EQU   CVTS01+304                                               03598000
CVTRENQ  EQU   CVTS01+300                                               03599000
CVTLQCB  EQU   CVTS01+296                                               03600000
CVTFQCB  EQU   CVTS01+292                                               03601000
CVTQCS01 EQU   CVTS01+288                                               03602000
CVTAPFT  EQU   CVTS01+284                                               03603000
CVTPARRL EQU   CVTS01+280                                               03604000
CVTVWAIT EQU   CVTS01+276                                               03605000
CVTGSPL  EQU   CVTS01+272                                               03606000
CVTLSMQ  EQU   CVTS01+268                                               03607000
CVTGSMQ  EQU   CVTS01+264                                               03608000
CVTEXPRO EQU   CVTS01+260                                               03609000
CVTOPCTP EQU   CVTS01+256                                               03610000
CVTSIC   EQU   CVTS01+252                                               03611000
CVTTPIOS EQU   CVTS01+248                                               03612000
CVTRTMS  EQU   CVTS01+244                                               03613000
CVTSDBF  EQU   CVTS01+240                                               03614000
CVTSCBP  EQU   CVTS01+236                                               03615000
CVTSDMP  EQU   CVTS01+232                                               03616000
CVTSV60  EQU   CVTS01+228                                               03617000
CVTASCBL EQU   CVTS01+220                                               03618000
CVTASCBH EQU   CVTS01+216                                               03619000
CVTGDA   EQU   CVTS01+212                                               03620000
CVTASVT  EQU   CVTS01+208                                               03621000
CVTVVMDI EQU   CVTS01+204                                               03622000
CVTAQTOP EQU   CVTS01+200                                               03623000
CVTIOSCS EQU   CVTS01+196                                               03624000
CVTSDRM  EQU   CVTS01+192                                               03625000
CVTOPTE  EQU   CVTS01+188                                               03626000
CVTSTXU  EQU   CVTS01+184                                               03627000
CVTQUIS  EQU   CVTS01+180                                               03628000
CVTPARS  EQU   CVTS01+176                                               03629000
CVTS1EE  EQU   CVTS01+172                                               03630000
CVTFRAS  EQU   CVTS01+168                                               03631000
CVTQSAS  EQU   CVTS01+164                                               03632000
CVTCRAS  EQU   CVTS01+160                                               03633000
CVTCRMN  EQU   CVTS01+156                                               03634000
CVTDELCP EQU   CVTS01+152                                               03635000
CVTFRECL EQU   CVTS01+148                                               03636000
CVTGETCL EQU   CVTS01+144                                               03637000
CVTBLDCP EQU   CVTS01+140                                               03638000
CVTAUTHL EQU   CVTS01+136                                               03639000
CVTSCAN  EQU   CVTS01+132                                               03640000
CVTRV144 EQU   CVTS01+130                                               03641000
CVTMAXMP EQU   CVTS01+128                                               03642000
CVTSTCK  EQU   CVTS01+124                                               03643000
CVTRV139 EQU   CVTS01+123                                               03644000
CVTDSSAC EQU   CVTS01+122                                               03645000
CVTRV513 EQU   CVTS01+121                                               03646000
CVTIOSPL EQU   CVTS01+120                                               03647000
CVTPTGT  EQU   CVTS01+116                                               03648000
CVTCSPIE EQU   CVTS01+112                                               03649000
CVTSMFEX EQU   CVTS01+108                                               03650000
CVTOLT0A EQU   CVTS01+104                                               03651000
CVTSRBRT EQU   CVTS01+100                                               03652000
CVTPUTL  EQU   CVTS01+96                                                03653000
CVTASCRL EQU   CVTS01+92                                                03654000
CVTASCRF EQU   CVTS01+88                                                03655000
CVTRV326 EQU   CVTS01+84                                                03656000
CVTRV325 EQU   CVTS01+80                                                03657000
CVTRV324 EQU   CVTS01+76                                                03658000
CVT0VL01 EQU   CVTS01+72                                                03659000
CVTSHRVM EQU   CVTS01+68                                                03660000
CVTRV332 EQU   CVTS01+64                                                03661000
CVTTAS   EQU   CVTS01+60                                                03662000
CVTRSCN  EQU   CVTS01+56                                                03663000
CVTTRAC2 EQU   CVTS01+54                                                03664000
CVTTRACE EQU   CVTS01+52                                                03665000
CVTAPG   EQU   CVTS01+51                                                03666000
CVTSDTRC EQU   CVTCTLFG                                                 03667000
CVTGTRCE EQU   CVTCTLFG                                                 03668000
CVTNOMP  EQU   CVTCTLFG                                                 03669000
CVTRSV79 EQU   CVTCTLFG                                                 03670000
CVTDSTAT EQU   CVTCTLFG                                                 03671000
CVTRSV78 EQU   CVTCTLFG                                                 03672000
CVTRV333 EQU   CVTCTLFG                                                 03673000
CVTRV323 EQU   CVTCTLFG                                                 03674000
CVTSPVLK EQU   CVTS01+49                                                03675000
CVTRSV77 EQU   CVTS01+48                                                03676000
CVTRV331 EQU   CVTS01+44                                                03677000
CVTRV330 EQU   CVTS01+40                                                03678000
CVTRV329 EQU   CVTS01+36                                                03679000
CVTRV328 EQU   CVTS01+32                                                03680000
CVTRV322 EQU   CVTS01+28                                                03681000
CVTSLID  EQU   CVTSLIDA+1                                               03682000
CVTSYLK  EQU   CVTSLIDA                                                 03683000
CVTRV321 EQU   CVTS01+20                                                03684000
CVTRV320 EQU   CVTS01+16                                                03685000
CVTLPDIR EQU   CVTLPDIA+1                                               03686000
CVTRSV69 EQU   CVTDIRST                                                 03687000
CVTRSV68 EQU   CVTDIRST                                                 03688000
CVTRSV67 EQU   CVTDIRST                                                 03689000
CVTRSV66 EQU   CVTDIRST                                                 03690000
CVTRSV65 EQU   CVTDIRST                                                 03691000
CVTRSV64 EQU   CVTDIRST                                                 03692000
CVTRSV63 EQU   CVTDIRST                                                 03693000
CVTDICOM EQU   CVTDIRST                                                 03694000
CVTLPDSR EQU   CVTS01+4                                                 03695000
CVTGETL  EQU   CVTS01                                                   03696000
SDBUFFER EQU   SDWORK+440                                               03697000
DATALEN  EQU   SDOUTBUF+6                                               03698000
KEYLEN   EQU   SDOUTBUF+5                                               03699000
RECORDNO EQU   SDOUTBUF+4                                               03700000
RCDHH    EQU   RCDCCHH+2                                                03701000
RCDCC    EQU   RCDCCHH                                                  03702000
SDSMDECB EQU   SDCNTRL+428                                              03703000
SDSMBUFF EQU   SDCNTRL+424                                              03704000
BYTECNT3 EQU   CCW3+6                                                   03705000
@NM00066 EQU   CCW3+5                                                   03706000
PCI3     EQU   FLAGS3                                                   03707000
SKIP3    EQU   FLAGS3                                                   03708000
SLI3     EQU   FLAGS3                                                   03709000
CC3      EQU   FLAGS3                                                   03710000
CD3      EQU   FLAGS3                                                   03711000
DATAADR3 EQU   CCW3+1                                                   03712000
CMDCODE3 EQU   CCW3                                                     03713000
BYTECNT2 EQU   CCW2+6                                                   03714000
@NM00065 EQU   CCW2+5                                                   03715000
PCI2     EQU   FLAGS2                                                   03716000
SKIP2    EQU   FLAGS2                                                   03717000
SLI2     EQU   FLAGS2                                                   03718000
CC2      EQU   FLAGS2                                                   03719000
CD2      EQU   FLAGS2                                                   03720000
DATAADR2 EQU   CCW2+1                                                   03721000
CMDCODE2 EQU   CCW2                                                     03722000
BYTECNT1 EQU   CCW1+6                                                   03723000
@NM00064 EQU   CCW1+5                                                   03724000
PCI1     EQU   FLAGS1                                                   03725000
SKIP1    EQU   FLAGS1                                                   03726000
SLI1     EQU   FLAGS1                                                   03727000
CMDC1    EQU   FLAGS1                                                   03728000
CD1      EQU   FLAGS1                                                   03729000
DATAADR1 EQU   CCW1+1                                                   03730000
CMDCODE1 EQU   CCW1                                                     03731000
SVCNM8   EQU   SVCNM7T8+1                                               03732000
SVCNM7   EQU   SVCNM7T8                                                 03733000
SVCNM6   EQU   SVCNM6T8                                                 03734000
SVCNM1T4 EQU   SVCNM1T5                                                 03735000
@NM00063 EQU   SDCNTRL+388                                              03736000
SVC994ID EQU   SDCNTRL+384                                              03737000
CVRT2SGN EQU   SDCVRT4+5                                                03738000
@NM00062 EQU   SDCVRT4                                                  03739000
@NM00061 EQU   CVRT2                                                    03740000
SDCVRT1  EQU   CVRT1+2                                                  03741000
@NM00060 EQU   CVRT1                                                    03742000
@NM00059 EQU   CVRT11                                                   03743000
CHCNT    EQU   SDCNTRL+366                                              03744000
TIMCNT   EQU   SDCNTRL+364                                              03745000
DSTINDEX EQU   SDCNTRL+360                                              03746000
SDWRGSV2 EQU   SDCNTRL+288                                              03747000
SDWRGSV1 EQU   SDCNTRL+216                                              03748000
SDRETCOD EQU   SDCNTRL+212                                              03749000
ADDADRWD EQU   SDCNTRL+208                                              03750000
ADDADRWC EQU   SDCNTRL+204                                              03751000
ADDADRWB EQU   SDCNTRL+200                                              03752000
ADDADRWA EQU   SDCNTRL+196                                              03753000
USEEND   EQU   SDCNTRL+192                                              03754000
USESTART EQU   SDCNTRL+188                                              03755000
SPQEADDR EQU   SDCNTRL+184                                              03756000
USERRETA EQU   SDCNTRL+180                                              03757000
PGFRRETA EQU   SDCNTRL+176                                              03758000
SPQERETA EQU   SDCNTRL+172                                              03759000
@NM00058 EQU   SDCNTRL+171                                              03760000
SDWKEY   EQU   SDCNTRL+170                                              03761000
AFFNSAV  EQU   SDCNTRL+168                                              03762000
FREERETA EQU   SDCNTRL+164                                              03763000
LPDERETA EQU   SDCNTRL+160                                              03764000
CDERETA  EQU   SDCNTRL+156                                              03765000
DISPRETA EQU   SDCNTRL+152                                              03766000
SDIORETA EQU   SDCNTRL+148                                              03767000
SVCDLPST EQU   SDCNTRL+136                                              03768000
SVCDMPNM EQU   SDCNTRL+128                                              03769000
ERRORWK  EQU   SDCNTRL+104                                              03770000
FLAGSTWO EQU   SDCNTRL+103                                              03771000
FLGFLAST EQU   FLAGSONE                                                 03772000
FLGTAPEE EQU   FLAGSONE                                                 03773000
FLGRTFUL EQU   FLAGSONE                                                 03774000
SVCDNSQA EQU   SVCDOPT2                                                 03775000
SVCDNAPA EQU   SVCDOPT2                                                 03776000
SVCDNSMD EQU   SVCDOPT2                                                 03777000
SVCDSMDP EQU   SVCDOPT2                                                 03778000
SVCDSWA  EQU   SVCDOPT2                                                 03779000
SVCDCSA  EQU   SVCDOPT2                                                 03780000
SVCDTRT  EQU   SVCDOPT1                                                 03781000
SVCDLPA  EQU   SVCDOPT1                                                 03782000
SVCDRGN  EQU   SVCDOPT1                                                 03783000
SVCDLSQA EQU   SVCDOPT1                                                 03784000
SVCDSQA  EQU   SVCDOPT1                                                 03785000
SVCDNUC  EQU   SVCDOPT1                                                 03786000
SVCDPSA  EQU   SVCDOPT1                                                 03787000
SVCDAPSA EQU   SVCDOPT1                                                 03788000
SDWSDPL  EQU   SDCNTRL+96                                               03789000
SDSRBBAS EQU   SDCNTRL+92                                               03790000
SDSRBADR EQU   SDCNTRL+88                                               03791000
SVCDSRBA EQU   SDCNTRL+84                                               03792000
ENDADRNT EQU   SDCNTRL+80                                               03793000
RANGEPTR EQU   SDCNTRL+76                                               03794000
GLOBADDR EQU   SDCNTRL+72                                               03795000
LOCALADR EQU   SDCNTRL+68                                               03796000
NUCADDR  EQU   SDCNTRL+64                                               03797000
DACHARAD EQU   SDCNTRL+60                                               03798000
LSTESTAE EQU   SDCNTRL+44                                               03799000
SDIOB    EQU   SDCNTRL+4                                                03800000
SDECB    EQU   SDCNTRL                                                  03801000
SMWKPSSE EQU   SMWK+952                                                 03802000
SMWKTQE  EQU   SMWK+824                                                 03803000
@NM00057 EQU   SMWK+820                                                 03804000
SMWKTQEA EQU   SMWK+816                                                 03805000
SMWKSVLN EQU   SMWK+812                                                 03806000
SMWKNDIE EQU   SMWK+810                                                 03807000
SMWKNFRE EQU   SMWK+808                                                 03808000
SMWKNFRI EQU   SMWK+806                                                 03809000
SMWKALEN EQU   SMWK+804                                                 03810000
SMWKSCBF EQU   SMWK+802                                                 03811000
SMWKREGN EQU   SMWK+800                                                 03812000
SMWKIDX2 EQU   SMWK+798                                                 03813000
SMWKIDX1 EQU   SMWK+796                                                 03814000
SMWKSREG EQU   SMWKREGS                                                 03815000
SMWKHEAD EQU   SMWK+656                                                 03816000
SMWKSMVL EQU   SMWK+652                                                 03817000
SMWKSMMV EQU   SMWK+648                                                 03818000
SMWKSMBF EQU   SMWK+644                                                 03819000
SMWKSMLS EQU   SMWK+640                                                 03820000
SMWKSMRG EQU   SMWK+636                                                 03821000
SMWKSMDT EQU   SMWK+632                                                 03822000
SMWKSDMP EQU   SMWK+628                                                 03823000
SMWKSMLK EQU   SMWK+624                                                 03824000
@NM00056 EQU   SMWK+622                                                 03825000
SMWKFRUS EQU   SMWK+620                                                 03826000
SMWKRSIX EQU   SMWK+618                                                 03827000
SMWKNFAV EQU   SMWK+616                                                 03828000
SMWKRFAD EQU   SMWK+612                                                 03829000
SMWKRSM  EQU   SMWK+196                                                 03830000
SMWKCPUS EQU   SMWK+192                                                 03831000
SMWKPEND EQU   SMWK+188                                                 03832000
SMWKSAVA EQU   SMWK+184                                                 03833000
SMWKENDA EQU   SMWK+180                                                 03834000
SMWKVADR EQU   SMWK+176                                                 03835000
SMWKPSWA EQU   SMWKPSW+4                                                03836000
@NM00055 EQU   SMWKPSW+2                                                03837000
SMWKPSWK EQU   SMWKPSW+1                                                03838000
SMWKPSWS EQU   SMWKPSW                                                  03839000
SMWKSAV1 EQU   SMWK+80                                                  03840000
SMWKSAVE EQU   SMWK+8                                                   03841000
SMWKFLG4 EQU   SMWKFLGS+3                                               03842000
SMWKFLG3 EQU   SMWKFLGS+2                                               03843000
SMWKFLG2 EQU   SMWKFLGS+1                                               03844000
@NM00054 EQU   SMWKFLG1                                                 03845000
@NM00053 EQU   SMWKFLG1                                                 03846000
@NM00052 EQU   SMWKFLG1                                                 03847000
@NM00051 EQU   SMWKFLG1                                                 03848000
SMWKRSNM EQU   SMWKFLG1                                                 03849000
SMWKRBFL EQU   SMWKFLG1                                                 03850000
SMWKRBUF EQU   SMWKFLG1                                                 03851000
SMWKSLCK EQU   SMWKFLG1                                                 03852000
SMWKNAME EQU   SMWK                                                     03853000
SMWKFRMA EQU   SMWKRSFM                                                 03854000
SMWKPRSR EQU   SMWKRSCB+12                                              03855000
SMWKTSDS EQU   SMWKRSCB+8                                               03856000
SMWKFRPT EQU   SMWKRSCB+4                                               03857000
SMWKFRHD EQU   SMWKRSCB+2                                               03858000
SMWKFLGB EQU   SMWKRSCB+1                                               03859000
@NM00050 EQU   SMWKFLGA                                                 03860000
SMWKEVRY EQU   SMWKFLGA                                                 03861000
SMDLRDAT EQU   SMDLR+12                                                 03862000
@NM00049 EQU   SMDLRHDR+11                                              03863000
SMDLRMSG EQU   SMDLRHDR+10                                              03864000
SMDLRPL  EQU   SMDLRHDR+8                                               03865000
SMDLRADR EQU   SMDLRHDR+4                                               03866000
SMDLRLEN EQU   SMDLRHDR+2                                               03867000
SMDLRID  EQU   SMDLRHDR                                                 03868000
PVTEND   EQU   PVT+1936                                                 03869000
PVTVCONS EQU   PVT+1896                                                 03870000
PVTPRSB  EQU   PVT+1892                                                 03871000
PVTCIOQL EQU   PVTPCBQS+36                                              03872000
PVTCIOQF EQU   PVTPCBQS+32                                              03873000
PVTGFADL EQU   PVTPCBQS+28                                              03874000
PVTGFADF EQU   PVTPCBQS+24                                              03875000
PVTFPCBL EQU   PVTPCBQS+20                                              03876000
PVTFPCBF EQU   PVTPCBQS+16                                              03877000
PVTPCBQR EQU   PVTPCBQS                                                 03878000
PVTLPAFX EQU   PVT+1850                                                 03879000
PVTLSQAF EQU   PVT+1848                                                 03880000
PVTLPAR  EQU   PVT+1844                                                 03881000
PVTLPAI  EQU   PVT+1840                                                 03882000
PVTLPAFC EQU   PVT+1838                                                 03883000
PVTCHUIC EQU   PVT+1836                                                 03884000
PVTCOMFX EQU   PVT+1834                                                 03885000
PVTSQAFX EQU   PVT+1832                                                 03886000
PVTCNTFX EQU   PVT+1830                                                 03887000
PVTDEFFX EQU   PVT+1828                                                 03888000
PVTFIXOK EQU   PVT+1826                                                 03889000
PVTPEROK EQU   PVT+1824                                                 03890000
PVTMAXFX EQU   PVT+1822                                                 03891000
PVTPERFX EQU   PVT+1820                                                 03892000
PVTRSRB  EQU   PVT+1776                                                 03893000
PVTRESV5 EQU   PVT+1773                                                 03894000
PVTSRBS  EQU   PVT+1772                                                 03895000
PVTSSRB  EQU   PVT+1768                                                 03896000
PVTACA   EQU   PVTWSAX+1400                                             03897000
PVTSAVE  EQU   PVTWSAX+1328                                             03898000
PVTWSA18 EQU   PVTWSAX+1256                                             03899000
PVTWSA17 EQU   PVTWSAX+1184                                             03900000
PVTWSA16 EQU   PVTWSAX+1112                                             03901000
PVTWSA15 EQU   PVTWSAX+1040                                             03902000
PVTWSA14 EQU   PVTWSAX+968                                              03903000
PVTWSA13 EQU   PVTWSAX+896                                              03904000
PVTWSA12 EQU   PVTWSAX+824                                              03905000
PVTWSA11 EQU   PVTWSAX+752                                              03906000
PVTWSA10 EQU   PVTWSAX+672                                              03907000
PVTWSA9  EQU   PVTWSAX+592                                              03908000
PVTWSA8  EQU   PVTWSAX+504                                              03909000
PVTWSA7  EQU   PVTWSAX+432                                              03910000
PVTWSA6  EQU   PVTWSAX+360                                              03911000
PVTWSA5  EQU   PVTWSAX+288                                              03912000
PVTWSA4  EQU   PVTWSAX+216                                              03913000
PVTWSA3  EQU   PVTWSAX+144                                              03914000
PVTWSA2  EQU   PVTWSAX+72                                               03915000
PVTWSA1  EQU   PVTWSAX                                                  03916000
PVTPFTQR EQU   PVTQS+20                                                 03917000
PVTRSBQL EQU   PVTQS+18                                                 03918000
PVTRSBQF EQU   PVTQS+16                                                 03919000
PVTSQAQL EQU   PVTQS+14                                                 03920000
PVTSQAQF EQU   PVTQS+12                                                 03921000
PVTCFQL  EQU   PVTQS+10                                                 03922000
PVTCFQF  EQU   PVTQS+8                                                  03923000
PVTRSRVL EQU   PVTQS+6                                                  03924000
PVTRSRVF EQU   PVTQS+4                                                  03925000
PVTAFQL  EQU   PVTQS+2                                                  03926000
PVTAFQF  EQU   PVTQS                                                    03927000
PVTSPFR  EQU   PVT+302                                                  03928000
PVTCFMCT EQU   PVT+300                                                  03929000
PVTSPREC EQU   PVT+296                                                  03930000
PVTCAREC EQU   PVT+292                                                  03931000
PVTCAOUT EQU   PVT+288                                                  03932000
PVTCAIN  EQU   PVT+284                                                  03933000
PVTNSWPS EQU   PVT+280                                                  03934000
PVTNPREC EQU   PVT+276                                                  03935000
PVTSPOUT EQU   PVT+272                                                  03936000
PVTSPIN  EQU   PVT+268                                                  03937000
PVTVAMR  EQU   PVT+264                                                  03938000
PVTVAMO  EQU   PVT+260                                                  03939000
PVTVAMI  EQU   PVT+256                                                  03940000
PVTNPOUT EQU   PVT+252                                                  03941000
PVTNPIN  EQU   PVT+248                                                  03942000
PVTPRSET EQU   PVT+244                                                  03943000
PVTFRSLT EQU   PVT+240                                                  03944000
PVTPAGIO EQU   PVT+236                                                  03945000
PVTSWPIO EQU   PVT+232                                                  03946000
PVTPSWPP EQU   PVT+228                                                  03947000
PVTPPREF EQU   PVT+224                                                  03948000
PVTPOPBR EQU   PVT+220                                                  03949000
PVTPRELF EQU   PVT+216                                                  03950000
PVTPRELV EQU   PVT+212                                                  03951000
PVTPFREE EQU   PVT+208                                                  03952000
PVTPRELS EQU   PVT+204                                                  03953000
PVTPOUT  EQU   PVT+200                                                  03954000
PVTPFXLD EQU   PVT+196                                                  03955000
PVTPITAS EQU   PVT+192                                                  03956000
PVTPSRBP EQU   PVT+188                                                  03957000
PVTPDSEG EQU   PVT+184                                                  03958000
PVTPCSGB EQU   PVT+180                                                  03959000
PVTPCSEG EQU   PVT+176                                                  03960000
PVTPINV  EQU   PVT+172                                                  03961000
PVTPSWPC EQU   PVT+168                                                  03962000
PVTPSOUT EQU   PVT+164                                                  03963000
PVTPSWIN EQU   PVT+160                                                  03964000
PVTPRCV  EQU   PVT+156                                                  03965000
PVTPRCFI EQU   PVT+152                                                  03966000
PVTPRCF  EQU   PVT+148                                                  03967000
PVTPVRC  EQU   PVT+144                                                  03968000
PVTPVRIN EQU   PVT+140                                                  03969000
PVTPVRLS EQU   PVT+136                                                  03970000
PVTPVEQR EQU   PVT+132                                                  03971000
PVTPPIOI EQU   PVT+128                                                  03972000
PVTPVRPO EQU   PVT+124                                                  03973000
PVTPRFR  EQU   PVT+120                                                  03974000
PVTPFP2  EQU   PVT+116                                                  03975000
PVTPFP   EQU   PVT+112                                                  03976000
PVTPFTE  EQU   PVT+108                                                  03977000
PVTPCB   EQU   PVT+104                                                  03978000
PVTREP2  EQU   PVT+100                                                  03979000
PVTPIOCP EQU   PVT+96                                                   03980000
PVTPIOP  EQU   PVT+92                                                   03981000
PVTPGFAD EQU   PVT+88                                                   03982000
PVTPGFA  EQU   PVT+84                                                   03983000
PVTPSQA  EQU   PVT+80                                                   03984000
PVTPSINT EQU   PVT+76                                                   03985000
PVTSRBID EQU   PVT+68                                                   03986000
PVTPCIWA EQU   PVT+64                                                   03987000
PVTHQSA  EQU   PVT+62                                                   03988000
PVTLQSA  EQU   PVT+60                                                   03989000
PVTOROOT EQU   PVT+56                                                   03990000
PVTPRCA  EQU   PVT+52                                                   03991000
PVTREUS  EQU   PVT+48                                                   03992000
PVTRESV4 EQU   PVT+47                                                   03993000
PVTVRDFC EQU   PVT+46                                                   03994000
PVTRSUS  EQU   PVT+44                                                   03995000
PVTVROOT EQU   PVT+40                                                   03996000
PVTPCBLO EQU   PVT+38                                                   03997000
PVTPCBCT EQU   PVT+36                                                   03998000
PVTDFRS  EQU   PVT+34                                                   03999000
PVTRSQA  EQU   PVT+32                                                   04000000
PVTPTLB  EQU   PVT+31                                                   04001000
PVTPCBNO EQU   PVT+30                                                   04002000
PVTSRBNO EQU   PVT+29                                                   04003000
PVTSQDC  EQU   PVT+28                                                   04004000
PVTLCSA  EQU   PVT+26                                                   04005000
PVTLPRIV EQU   PVT+24                                                   04006000
PVTLVR   EQU   PVT+22                                                   04007000
PVTFVR   EQU   PVT+20                                                   04008000
PVTLPFN  EQU   PVT+18                                                   04009000
PVTFPFN  EQU   PVT+16                                                   04010000
PVTPFTP  EQU   PVT+12                                                   04011000
PVTSSPIN EQU   PVT+11                                                   04012000
PVTPCBS  EQU   PVT+10                                                   04013000
PVTPOOL  EQU   PVT+8                                                    04014000
PVTAFCOK EQU   PVT+6                                                    04015000
PVTAFCLO EQU   PVT+4                                                    04016000
PVTAFC   EQU   PVT+2                                                    04017000
PVTFLAG2 EQU   PVT+1                                                    04018000
PVTDUMP  EQU   PVTFLAG1                                                 04019000
PVTSIT   EQU   PVTFLAG1                                                 04020000
PVTLSI   EQU   PVTFLAG1                                                 04021000
PVTRESV1 EQU   PVTFLAG1                                                 04022000
PVTPCBLT EQU   PVTFLAG1                                                 04023000
PVTSRBIU EQU   PVTFLAG1                                                 04024000
PVTBGMS  EQU   PVTFLAG1                                                 04025000
PVTPMSG  EQU   PVTFLAG1                                                 04026000
XAARNG16 EQU   XAAVRNG2                                                 04027000
XAARNG15 EQU   XAAVRNG2                                                 04028000
XAARNG14 EQU   XAAVRNG2                                                 04029000
XAARNG13 EQU   XAAVRNG2                                                 04030000
XAARNG12 EQU   XAAVRNG2                                                 04031000
XAARNG11 EQU   XAAVRNG2                                                 04032000
XAARNG10 EQU   XAAVRNG2                                                 04033000
XAARNG9  EQU   XAAVRNG2                                                 04034000
XAARNG8  EQU   XAAVRANG                                                 04035000
XAARNG7  EQU   XAAVRANG                                                 04036000
XAARNG6  EQU   XAAVRANG                                                 04037000
XAARNG5  EQU   XAAVRANG                                                 04038000
XAARNG4  EQU   XAAVRANG                                                 04039000
XAARNG3  EQU   XAAVRANG                                                 04040000
XAARNG2  EQU   XAAVRANG                                                 04041000
XAARNG1  EQU   XAAVRANG                                                 04042000
XARTCODE EQU   EEXSAS05+6                                               04043000
XACMDATH EQU   EEXSAS05+4                                               04044000
XALTPTR  EQU   EEXSAS05+3                                               04045000
XACRT2   EQU   XARESV                                                   04046000
XACENDCK EQU   XARESV                                                   04047000
XARES1   EQU   XASWITCH                                                 04048000
XASMF44  EQU   XASWITCH                                                 04049000
XASMF42  EQU   XASWITCH                                                 04050000
XAHRDREQ EQU   XASWITCH                                                 04051000
XASTHDCP EQU   XACOMPMS                                                 04052000
XAINHDCP EQU   XALTCHG                                                  04053000
XAHRDCMD EQU   XASWITCH                                                 04054000
XAROUT   EQU   XASWITCH                                                 04055000
XALTCON  EQU   XASOPCOD                                                 04056000
XACMD    EQU   XASOPCOD                                                 04057000
XALTCOM  EQU   XASOPCOD                                                 04058000
XARESB   EQU   XASOPCOD                                                 04059000
XAOFF    EQU   XASOPCOD                                                 04060000
XAON     EQU   XASOPCOD                                                 04061000
XARESA   EQU   XASOPCOD                                                 04062000
XACON    EQU   XASOPCOD                                                 04063000
XAXSACB  EQU   EEXSAS04+4                                               04064000
XAXUTME  EQU   EEXSAS04+2                                               04065000
XAXFREE  EQU   EEXSAS04+1                                               04066000
@NM00048 EQU   XAXMASK                                                  04067000
XAXTSL   EQU   XAXMASK                                                  04068000
XAXTS    EQU   XAXMASK                                                  04069000
@NM00047 EQU   XAXMASK                                                  04070000
XAXJOBSL EQU   XAXMASK                                                  04071000
XAXJOBS  EQU   XAXMASK                                                  04072000
XASOPTR  EQU   @NM00046+1                                               04073000
XASTSAVE EQU   @NM00046                                                 04074000
XASPLS3  EQU   EEXSAS03+3                                               04075000
XASSDS8  EQU   XASDS                                                    04076000
XASSDS7  EQU   XASDS                                                    04077000
XASSDS6  EQU   XASDS                                                    04078000
XASSDS5  EQU   XASDS                                                    04079000
XASSDS4  EQU   XASDS                                                    04080000
XASSDS3  EQU   XASDS                                                    04081000
XASSDS2  EQU   XASDS                                                    04082000
XASSDS1  EQU   XASDS                                                    04083000
XASDID   EQU   EEXSAS03+1                                               04084000
XASCID   EQU   EEXSAS03                                                 04085000
XACAHOLD EQU   EEXSAS02+2                                               04086000
XADRES1  EQU   EEXSAS02+1                                               04087000
XAUBLANK EQU   XADUSWIT                                                 04088000
XAOUNIT  EQU   XADUSWIT                                                 04089000
XAIOCOMP EQU   XADUSWIT                                                 04090000
XARES3   EQU   XADUSWIT                                                 04091000
XAUDVC   EQU   XADUSWIT                                                 04092000
XARES2   EQU   XADUSWIT                                                 04093000
XAIPAREN EQU   XADUSWIT                                                 04094000
XAXPAREN EQU   XADUSWIT                                                 04095000
@NM00045 EQU   EEXSAS01+44                                              04096000
XAT      EQU   EEXSAS01+20                                              04097000
XAF      EQU   EEXSAS01+12                                              04098000
XAI      EQU   EEXSAS01+4                                               04099000
XAH      EQU   EEXSAS01                                                 04100000
XAWORKH  EQU   XAWORK+28                                                04101000
XAWORKG  EQU   XAWORK+24                                                04102000
XAWORKF  EQU   XAWORK+20                                                04103000
XAWORKE  EQU   XAWORK+16                                                04104000
XAWORKD  EQU   XAWORK+12                                                04105000
XAWORKC  EQU   XAWORK+8                                                 04106000
XAWORKB  EQU   XAWORK+4                                                 04107000
XAWORKA  EQU   XAWORK                                                   04108000
XARESRZ  EQU   @NM00044+12                                              04109000
XARESRY  EQU   @NM00044+8                                               04110000
XARESRX  EQU   @NM00044+4                                               04111000
XACMFLG4 EQU   XACMFLGB+1                                               04112000
XACMFLG3 EQU   XACMFLGB                                                 04113000
XACMF28  EQU   XACMFLG2                                                 04114000
XACMF27  EQU   XACMFLG2                                                 04115000
XACMF26  EQU   XACMFLG2                                                 04116000
XACMF25  EQU   XACMFLG2                                                 04117000
XACMF24  EQU   XACMFLG2                                                 04118000
XACMF23  EQU   XACMFLG2                                                 04119000
XACMF22  EQU   XACMFLG2                                                 04120000
XACMF21  EQU   XACMFLG2                                                 04121000
XACMF18  EQU   XACMFLG1                                                 04122000
XACMF17  EQU   XACMFLG1                                                 04123000
XACMF16  EQU   XACMFLG1                                                 04124000
XACMF15  EQU   XACMFLG1                                                 04125000
XACMF14  EQU   XACMFLG1                                                 04126000
XACMF13  EQU   XACMFLG1                                                 04127000
XACMF12  EQU   XACMFLG1                                                 04128000
XACMF11  EQU   XACMFLG1                                                 04129000
XASAVSDR EQU   XASAVSTR+68                                              04130000
XASAVSDQ EQU   XASAVSTR+64                                              04131000
XASAVSDP EQU   XASAVSTR+60                                              04132000
XASAVSDO EQU   XASAVSTR+56                                              04133000
XASAVSDN EQU   XASAVSTR+52                                              04134000
XASAVSDM EQU   XASAVSTR+48                                              04135000
XASAVSDL EQU   XASAVSTR+44                                              04136000
XASAVSDK EQU   XASAVSTR+40                                              04137000
XASAVSDJ EQU   XASAVSTR+36                                              04138000
XASAVSDI EQU   XASAVSTR+32                                              04139000
XASAVSDH EQU   XASAVSTR+28                                              04140000
XASAVSDG EQU   XASAVSTR+24                                              04141000
XASAVSDF EQU   XASAVSTR+20                                              04142000
XASAVSDE EQU   XASAVSTR+16                                              04143000
XASAVSDD EQU   XASAVSTR+12                                              04144000
XASAVSDC EQU   XASAVSTR+8                                               04145000
XASAVSDB EQU   XASAVSTR+4                                               04146000
XASAVSDA EQU   XASAVSTR                                                 04147000
XASAVLC4 EQU   XASAVLOX+12                                              04148000
XASAVLC3 EQU   XASAVLOX+8                                               04149000
XASAVLC2 EQU   XASAVLOX+4                                               04150000
XASAVLC1 EQU   XASAVLOX                                                 04151000
XAK      EQU   XASVRB+44                                                04152000
@NM00043 EQU   XASVRB+41                                                04153000
XAU      EQU   XASVRB+40                                                04154000
XAN      EQU   @NM00042                                                 04155000
XAR      EQU   @NM00041+1                                               04156000
XAP      EQU   XSA                                                      04157000
RTCTISVC EQU   RTCTSDO4                                                 04158000
RTCTSDOV EQU   RTCTSDMG                                                 04159000
@NM00016 EQU   RTCTSDO4                                                 04160000
@NM00015 EQU   RTCTSDO3                                                 04161000
@NM00014 EQU   RTCTSDO2                                                 04162000
RTCTISYM EQU   RTCTSD04                                                 04163000
RTCTSMOV EQU   RTCTSMMG                                                 04164000
@NM00013 EQU   RTCTSD04                                                 04165000
RTCTSD03 EQU   RTCTMSYO+2                                               04166000
RTCTSD02 EQU   RTCTMSYO+1                                               04167000
RTCTISYU EQU   RTCTSUO4                                                 04168000
RTCTSUOV EQU   RTCTSUMG                                                 04169000
@NM00012 EQU   RTCTSUO4                                                 04170000
RTCTSYDF EQU   RTCTSUO3                                                 04171000
RTCTSYDE EQU   RTCTSUO3                                                 04172000
RTCTSYDD EQU   RTCTSUO3                                                 04173000
RTCTSYDC EQU   RTCTSUO3                                                 04174000
RTCTSYDB EQU   RTCTSUO3                                                 04175000
RTCTSYDA EQU   RTCTSUO3                                                 04176000
RTCTSYD9 EQU   RTCTSUO3                                                 04177000
RTCTSYD8 EQU   RTCTSUO3                                                 04178000
@NM00011 EQU   RTCTSUO2                                                 04179000
RTCTSYDH EQU   RTCTSUO2                                                 04180000
RTCTSYDG EQU   RTCTSUO2                                                 04181000
RTCTSYD7 EQU   RTCTSUO1                                                 04182000
RTCTSYD6 EQU   RTCTSUO1                                                 04183000
RTCTSYD5 EQU   RTCTSUO1                                                 04184000
RTCTSYD4 EQU   RTCTSUO1                                                 04185000
RTCTSYD3 EQU   RTCTSUO1                                                 04186000
RTCTSYD2 EQU   RTCTSUO1                                                 04187000
RTCTSYD1 EQU   RTCTSUO1                                                 04188000
RTCTSYD0 EQU   RTCTSUO1                                                 04189000
RTCTISAB EQU   RTCTSAO4                                                 04190000
RTCTSAOV EQU   RTCTSAMG                                                 04191000
@NM00010 EQU   RTCTSAO4                                                 04192000
RTCTSADF EQU   RTCTSAO3                                                 04193000
@NM00009 EQU   RTCTSAO2                                                 04194000
RTCTZZZ5 EQU   RTCT+340                                                 04195000
RTCTZZZ4 EQU   RTCT+336                                                 04196000
RTCTMRMQ EQU   RTCT+332                                                 04197000
RTCTSDF5 EQU   RTCTSDF3+3                                               04198000
RTCTSDDO EQU   RTCTSDF4                                                 04199000
RTCTSDEN EQU   RTCTSDF4                                                 04200000
RTCTSDEQ EQU   RTCTSDF4                                                 04201000
RTCTSDTR EQU   RTCTSDF4                                                 04202000
RTCTSDRM EQU   RTCTSDF4                                                 04203000
RTCTSDAN EQU   RTCTSDF4                                                 04204000
RTCTSDNC EQU   RTCTSDF4                                                 04205000
RTCTSDSS EQU   RTCTSDF4                                                 04206000
RTCTSDAS EQU   RTCTSDF3                                                 04207000
RTCTZZZ3 EQU   RTCT+266                                                 04208000
@NM00008 EQU   RTCTSDF2                                                 04209000
RTCTSDRW EQU   RTCTSDF2                                                 04210000
RTCTSDSL EQU   RTCTSDF2                                                 04211000
RTCTSDWF EQU   RTCTSDF2                                                 04212000
RTCTSDLA EQU   RTCTSDF2                                                 04213000
RTCTSDDI EQU   RTCTSDF2                                                 04214000
RTCTSDTQ EQU   RTCTSDF2                                                 04215000
RTCTSDMR EQU   RTCTSDF2                                                 04216000
RTCTSDSC EQU   RTCTSDF1                                                 04217000
RTCTSDRS EQU   RTCTSDF1                                                 04218000
RTCTSDSD EQU   RTCTSDF1                                                 04219000
RTCTSDEP EQU   RTCTSDF1                                                 04220000
RTCTSDMA EQU   RTCTSDF1                                                 04221000
RTCTSDSH EQU   RTCTSDF1                                                 04222000
RTCTSDND EQU   RTCTSDF1                                                 04223000
RTCTSDNO EQU   RTCTSDF1                                                 04224000
RTCTZZZ2 EQU   RTCT+257                                                 04225000
RTCTSDPR EQU   RTCTSDI+2                                                04226000
RTCTINDX EQU   RTCTSDI+1                                                04227000
RTCTSDNA EQU   RTCTSDI                                                  04228000
@NM00007 EQU   RTCTASO2                                                 04229000
RTCTASNQ EQU   RTCTASO2                                                 04230000
RTCTASNA EQU   RTCTASO2                                                 04231000
RTCTASNS EQU   RTCTASO2                                                 04232000
RTCTASSU EQU   RTCTASO2                                                 04233000
RTCTASSW EQU   RTCTASO2                                                 04234000
RTCTASCS EQU   RTCTASO2                                                 04235000
RTCTASTR EQU   RTCTASO1                                                 04236000
RTCTASLP EQU   RTCTASO1                                                 04237000
RTCTASRG EQU   RTCTASO1                                                 04238000
RTCTASLS EQU   RTCTASO1                                                 04239000
RTCTASSQ EQU   RTCTASO1                                                 04240000
RTCTASNU EQU   RTCTASO1                                                 04241000
RTCTASPS EQU   RTCTASO1                                                 04242000
RTCTASAL EQU   RTCTASO1                                                 04243000
RTCTSDO  EQU   RTCTOPT+12                                               04244000
RTCTSYO  EQU   RTCTOPT+8                                                04245000
RTCTSUO  EQU   RTCTOPT+4                                                04246000
RTCTSAO  EQU   RTCTOPT                                                  04247000
RTCTXXX2 EQU   RTCT+234                                                 04248000
RTCTETIM EQU   RTCTERID+6                                               04249000
RTCTEASD EQU   RTCTERID+4                                               04250000
RTCTECPU EQU   RTCTERID+2                                               04251000
RTCTESEQ EQU   RTCTERID                                                 04252000
RTCTTDCB EQU   RTCT+184                                                 04253000
RTCTSEQ# EQU   RTCT+178                                                 04254000
RTCTXXX1 EQU   RTCT+177                                                 04255000
@NM00006 EQU   RTCTRFLG                                                 04256000
RTCTRSTF EQU   RTCTRFLG                                                 04257000
RTCTRPER EQU   RTCTRFLG                                                 04258000
RTCTRTER EQU   RTCTRFLG                                                 04259000
RTCTTEST EQU   RTCT+172                                                 04260000
RTCTMSRB EQU   RTCT+168                                                 04261000
RTCTMLCK EQU   RTCT+164                                                 04262000
RTCTFMT  EQU   RTCT+160                                                 04263000
RTCTSDIP EQU   RTCTSDPL                                                 04264000
RTCTDEV  EQU   RTCTSDDS+8                                               04265000
RTCTDCB  EQU   RTCTSDDS+4                                               04266000
@NM00005 EQU   RTCTFLG                                                  04267000
RTCTDETP EQU   RTCTFLG                                                  04268000
RTCTDSUS EQU   RTCTFLG                                                  04269000
RTCTDSST EQU   RTCTFLG                                                  04270000
RTCTDSNM EQU   RTCTSDDS                                                 04271000
RTCTRCB  EQU   RTCT+32                                                  04272000
RTCTRECB EQU   RTCT+28                                                  04273000
RTCTFASB EQU   RTCT+24                                                  04274000
RTCTMECB EQU   RTCT+20                                                  04275000
RTCTSDID EQU   RTCT+18                                                  04276000
RTCTYYY1 EQU   RTCT+16                                                  04277000
RTCTSY04 EQU   RTCTSYD+3                                                04278000
RTCTSY03 EQU   RTCTSYD+2                                                04279000
RTCTSY02 EQU   RTCTSYD+1                                                04280000
RTCTSYM7 EQU   RTCTSY01                                                 04281000
RTCTSYM6 EQU   RTCTSY01                                                 04282000
RTCTSYM5 EQU   RTCTSY01                                                 04283000
RTCTSYM4 EQU   RTCTSY01                                                 04284000
RTCTSYM3 EQU   RTCTSY01                                                 04285000
RTCTSYM2 EQU   RTCTSY01                                                 04286000
RTCTSYM1 EQU   RTCTSY01                                                 04287000
RTCTSYM0 EQU   RTCTSY01                                                 04288000
RTCTSUP4 EQU   RTCTSUP+3                                                04289000
RTCTSUDF EQU   RTCTSUP3                                                 04290000
RTCTSUDE EQU   RTCTSUP3                                                 04291000
RTCTSUDD EQU   RTCTSUP3                                                 04292000
RTCTSUDC EQU   RTCTSUP3                                                 04293000
RTCTSUDB EQU   RTCTSUP3                                                 04294000
RTCTSUDA EQU   RTCTSUP3                                                 04295000
RTCTSUD9 EQU   RTCTSUP3                                                 04296000
RTCTSUD8 EQU   RTCTSUP3                                                 04297000
@NM00004 EQU   RTCTSUP2                                                 04298000
RTCTSUDH EQU   RTCTSUP2                                                 04299000
RTCTSUDG EQU   RTCTSUP2                                                 04300000
RTCTSUD7 EQU   RTCTSUP1                                                 04301000
RTCTSUD6 EQU   RTCTSUP1                                                 04302000
RTCTSUD5 EQU   RTCTSUP1                                                 04303000
RTCTSUD4 EQU   RTCTSUP1                                                 04304000
RTCTSUD3 EQU   RTCTSUP1                                                 04305000
RTCTSUD2 EQU   RTCTSUP1                                                 04306000
RTCTSUD1 EQU   RTCTSUP1                                                 04307000
RTCTSUD0 EQU   RTCTSUP1                                                 04308000
RTCTSAP4 EQU   RTCTSAP+3                                                04309000
RTCTSABF EQU   RTCTSAP3                                                 04310000
RTCTSABE EQU   RTCTSAP3                                                 04311000
RTCTSABD EQU   RTCTSAP3                                                 04312000
RTCTSABC EQU   RTCTSAP3                                                 04313000
RTCTSABB EQU   RTCTSAP3                                                 04314000
RTCTSABA EQU   RTCTSAP3                                                 04315000
RTCTSAB9 EQU   RTCTSAP3                                                 04316000
RTCTSAB8 EQU   RTCTSAP3                                                 04317000
@NM00003 EQU   RTCTSAP2                                                 04318000
RTCTSABH EQU   RTCTSAP2                                                 04319000
RTCTSABG EQU   RTCTSAP2                                                 04320000
RTCTSAB7 EQU   RTCTSAP1                                                 04321000
RTCTSAB6 EQU   RTCTSAP1                                                 04322000
RTCTSAB5 EQU   RTCTSAP1                                                 04323000
RTCTSAB4 EQU   RTCTSAP1                                                 04324000
RTCTSAB3 EQU   RTCTSAP1                                                 04325000
RTCTSAB2 EQU   RTCTSAP1                                                 04326000
RTCTSAB1 EQU   RTCTSAP1                                                 04327000
RTCTSAB0 EQU   RTCTSAP1                                                 04328000
RTCTNAME EQU   RTCT                                                     04329000
CVTLEVL  EQU   CVTRELNO+2                                               04330000
CVTNUMB  EQU   CVTRELNO                                                 04331000
CVTMDL   EQU   CVTFIX+250                                               04332000
@NM00002 EQU   CVTFIX+248                                               04333000
@NM00001 EQU   CVTFIX                                                   04334000
CVTRV482 EQU   CVTXTNT2+128                                             04335000
CVTRV481 EQU   CVTXTNT2+124                                             04336000
CVTRV480 EQU   CVTXTNT2+120                                             04337000
CVTRV479 EQU   CVTXTNT2+118                                             04338000
CVTRV478 EQU   CVTXTNT2+117                                             04339000
CVTRV477 EQU   CVTXTNT2+116                                             04340000
CVTRV476 EQU   CVTXTNT2+115                                             04341000
CVTRV475 EQU   CVTXTNT2+114                                             04342000
CVTRV474 EQU   CVTRV466                                                 04343000
CVTRV473 EQU   CVTRV466                                                 04344000
CVTRV472 EQU   CVTRV466                                                 04345000
CVTRV471 EQU   CVTRV466                                                 04346000
CVTRV470 EQU   CVTRV466                                                 04347000
CVTRV469 EQU   CVTRV466                                                 04348000
CVTRV468 EQU   CVTRV466                                                 04349000
CVTRV467 EQU   CVTRV466                                                 04350000
CVTRV465 EQU   CVTRV457                                                 04351000
CVTRV464 EQU   CVTRV457                                                 04352000
CVTRV463 EQU   CVTRV457                                                 04353000
CVTRV462 EQU   CVTRV457                                                 04354000
CVTRV461 EQU   CVTRV457                                                 04355000
CVTRV460 EQU   CVTRV457                                                 04356000
CVTRV459 EQU   CVTRV457                                                 04357000
CVTRV458 EQU   CVTRV457                                                 04358000
CVTRV456 EQU   CVTXTNT2+108                                             04359000
CVTRV455 EQU   CVTXTNT2+104                                             04360000
CVTRV454 EQU   CVTXTNT2+100                                             04361000
CVTRV453 EQU   CVTXTNT2+96                                              04362000
CVTRV452 EQU   CVTXTNT2+94                                              04363000
CVTRV451 EQU   CVTXTNT2+92                                              04364000
CVTRV450 EQU   CVTXTNT2+90                                              04365000
CVTRV449 EQU   CVTXTNT2+88                                              04366000
CVTRV448 EQU   CVTXTNT2+87                                              04367000
CVTRV447 EQU   CVTXTNT2+86                                              04368000
CVTRV446 EQU   CVTRV438                                                 04369000
CVTRV445 EQU   CVTRV438                                                 04370000
CVTRV444 EQU   CVTRV438                                                 04371000
CVTRV443 EQU   CVTRV438                                                 04372000
CVTRV442 EQU   CVTRV438                                                 04373000
CVTRV441 EQU   CVTRV438                                                 04374000
CVTRV440 EQU   CVTRV438                                                 04375000
CVTRV439 EQU   CVTRV438                                                 04376000
CVTRV437 EQU   CVTRV429                                                 04377000
CVTRV436 EQU   CVTRV429                                                 04378000
CVTRV435 EQU   CVTRV429                                                 04379000
CVTRV434 EQU   CVTRV429                                                 04380000
CVTRV433 EQU   CVTRV429                                                 04381000
CVTRV432 EQU   CVTRV429                                                 04382000
CVTRV431 EQU   CVTRV429                                                 04383000
CVTRV430 EQU   CVTRV429                                                 04384000
CVTRV428 EQU   CVTXTNT2+80                                              04385000
CVTRV427 EQU   CVTXTNT2+76                                              04386000
CVTRV426 EQU   CVTXTNT2+72                                              04387000
CVTRV425 EQU   CVTXTNT2+68                                              04388000
CVTATACT EQU   CVTATCVT                                                 04389000
CVTRV423 EQU   CVTXTNT2+62                                              04390000
CVTRV422 EQU   CVTXTNT2+60                                              04391000
CVTRV421 EQU   CVTXTNT2+58                                              04392000
CVTRV420 EQU   CVTXTNT2+56                                              04393000
CVTRV419 EQU   CVTXTNT2+55                                              04394000
CVTRV418 EQU   CVTXTNT2+54                                              04395000
CVTRV417 EQU   CVTRV409                                                 04396000
CVTRV416 EQU   CVTRV409                                                 04397000
CVTRV415 EQU   CVTRV409                                                 04398000
CVTRV414 EQU   CVTRV409                                                 04399000
CVTRV413 EQU   CVTRV409                                                 04400000
CVTRV412 EQU   CVTRV409                                                 04401000
CVTRV411 EQU   CVTRV409                                                 04402000
CVTRV410 EQU   CVTRV409                                                 04403000
CVTRV408 EQU   CVTRV400                                                 04404000
CVTRV407 EQU   CVTRV400                                                 04405000
CVTRV406 EQU   CVTRV400                                                 04406000
CVTRV405 EQU   CVTRV400                                                 04407000
CVTRV404 EQU   CVTRV400                                                 04408000
CVTRV403 EQU   CVTRV400                                                 04409000
CVTRV402 EQU   CVTRV400                                                 04410000
CVTRV401 EQU   CVTRV400                                                 04411000
CVTICB   EQU   CVTXTNT2+48                                              04412000
CVTSKTA  EQU   CVTXTNT2+44                                              04413000
CVTRSV99 EQU   CVTXTNT2+40                                              04414000
CVTRSV98 EQU   CVTXTNT2+36                                              04415000
CVTRSV97 EQU   CVTXTNT2+34                                              04416000
CVTRSV96 EQU   CVTXTNT2+32                                              04417000
CVTOLTEP EQU   CVTXTNT2+28                                              04418000
CVTQIDA  EQU   CVTQID+1                                                 04419000
CVTRSV95 EQU   CVTQID                                                   04420000
CVTRSV94 EQU   CVTXTNT2+20                                              04421000
CVTRSV93 EQU   CVTXTNT2+16                                              04422000
CVTRSV92 EQU   CVTXTNT2+12                                              04423000
CVTDEBVR EQU   CVTXTNT2+8                                               04424000
CVTRSV91 EQU   CVTXTNT2+6                                               04425000
CVTRSV9H EQU   CVTFLGBT                                                 04426000
CVTRSV9G EQU   CVTFLGBT                                                 04427000
CVTRSV9F EQU   CVTFLGBT                                                 04428000
CVTRSV9E EQU   CVTFLGBT                                                 04429000
CVTRSV9D EQU   CVTFLGBT                                                 04430000
CVTBAH   EQU   CVTFLGBT                                                 04431000
CVTVME   EQU   CVTFLGBT                                                 04432000
CVTNPE   EQU   CVTFLGBT                                                 04433000
CVTNUCLS EQU   CVTXTNT2+4                                               04434000
CVTDSSVA EQU   CVTDSSV+1                                                04435000
CVTRSV89 EQU   CVTDSSV                                                  04436000
CVTRSV88 EQU   CVTXTNT1+8                                               04437000
CVTRSV87 EQU   CVTXTNT1+4                                               04438000
CVTFACHN EQU   CVTXTNT1                                                 04439000
CVTRV488 EQU   CVTMAP+412                                               04440000
CVTRV487 EQU   CVTMAP+408                                               04441000
CVTRV486 EQU   CVTMAP+404                                               04442000
CVTRV485 EQU   CVTMAP+400                                               04443000
CVTACTAP EQU   CVTMAP+396                                               04444000
CVTAUTH  EQU   CVTMAP+392                                               04445000
CVTRV490 EQU   CVTMAP+388                                               04446000
CVTRSV61 EQU   CVTMAP+384                                               04447000
CVTVOLT1 EQU   CVTVOLM1+1                                               04448000
CVTVOLI1 EQU   CVTVOLF1                                                 04449000
CVTSTOA  EQU   CVTMAP+376                                               04450000
CVTRSV58 EQU   CVTMAP+374                                               04451000
CVTRSV57 EQU   CVTMAP+372                                               04452000
CVTDDCE  EQU   CVTMAP+368                                               04453000
CVTPNWFR EQU   CVTMAP+364                                               04454000
CVTSMF   EQU   CVTMAP+360                                               04455000
CVTSULK  EQU   CVTMAP+358                                               04456000
CVTSLKO  EQU   CVTSYSK                                                  04457000
CVTSLKP  EQU   CVTSYSK                                                  04458000
CVTSLKQ  EQU   CVTSYSK                                                  04459000
CVTSLKR  EQU   CVTSYSK                                                  04460000
CVTRSV56 EQU   CVTSYSK                                                  04461000
CVTRSV55 EQU   CVTSYSK                                                  04462000
CVTRSV54 EQU   CVTSYSK                                                  04463000
CVTRSV53 EQU   CVTSYSK                                                  04464000
CVTRSV52 EQU   CVTA1F1                                                  04465000
CVTRSV51 EQU   CVTA1F1                                                  04466000
CVTRSV50 EQU   CVTA1F1                                                  04467000
CVTRSV49 EQU   CVTA1F1                                                  04468000
CVTRSV48 EQU   CVTA1F1                                                  04469000
CVTRSV47 EQU   CVTA1F1                                                  04470000
CVTSRSW  EQU   CVTA1F1                                                  04471000
CVTPFSW  EQU   CVTA1F1                                                  04472000
CVTPCVT  EQU   CVTMAP+352                                               04473000
CVTRSV46 EQU   CVTMAP+344                                               04474000
CVTRSV45 EQU   CVTMAP+340                                               04475000
CVTRSV44 EQU   CVTMAP+338                                               04476000
CVTRSV43 EQU   CVTMAP+336                                               04477000
CVTHJESA EQU   CVTHJES+1                                                04478000
CVTRSV42 EQU   CVTHJES                                                  04479000
CVTEXT2A EQU   CVTEXT2+1                                                04480000
CVTRSV41 EQU   CVTEXT2                                                  04481000
CVTAPFA  EQU   CVTAPF+1                                                 04482000
CVTRSV40 EQU   CVTAPF                                                   04483000
CVTRV518 EQU   CVTINTLA                                                 04484000
CVTRV517 EQU   CVTERPV                                                  04485000
CVTEORM  EQU   CVTMAP+312                                               04486000
CVTMCHPR EQU   CVTMAP+308                                               04487000
CVTTZ    EQU   CVTMAP+304                                               04488000
CVTJEPS  EQU   CVTMAP+300                                               04489000
CVTJESCT EQU   CVTMAP+296                                               04490000
CVTMODE  EQU   CVTMAP+292                                               04491000
CVTPTRV  EQU   CVTMAP+288                                               04492000
CVTREAL  EQU   CVTMAP+284                                               04493000
CVTRSV39 EQU   CVTMAP+280                                               04494000
CVTRSV38 EQU   CVTMAP+276                                               04495000
CVTDMSRA EQU   CVTDMSR+1                                                04496000
CVTRV634 EQU   CVTDMSRF                                                 04497000
CVTRV633 EQU   CVTDMSRF                                                 04498000
CVTRV632 EQU   CVTDMSRF                                                 04499000
CVTRV631 EQU   CVTDMSRF                                                 04500000
CVTRV630 EQU   CVTDMSRF                                                 04501000
CVTRV629 EQU   CVTDMSRF                                                 04502000
CVTUDUMP EQU   CVTDMSRF                                                 04503000
CVTSDUMP EQU   CVTDMSRF                                                 04504000
CVTQMSGA EQU   CVTQMSG+1                                                04505000
CVTRSV36 EQU   CVTQMSG                                                  04506000
CVTAMFF  EQU   CVTMAP+264                                               04507000
CVTPURGA EQU   CVTPURG+1                                                04508000
CVTRSV35 EQU   CVTPURG                                                  04509000
CVTCBSP  EQU   CVTMAP+256                                               04510000
CVTATERA EQU   CVTATER+1                                                04511000
CVTSYST  EQU   CVTATER                                                  04512000
CVTVOLT2 EQU   CVTTAT                                                   04513000
CVTVOLI2 EQU   CVTVOLF2                                                 04514000
CVTAQAVB EQU   CVTAQAVT+1                                               04515000
CVTRSV34 EQU   CVTTCMFG                                                 04516000
CVTRSV33 EQU   CVTTCMFG                                                 04517000
CVTRSV32 EQU   CVTTCMFG                                                 04518000
CVTRSV31 EQU   CVTTCMFG                                                 04519000
CVTRSV30 EQU   CVTTCMFG                                                 04520000
CVTRSV29 EQU   CVTTCMFG                                                 04521000
CVTLDEV  EQU   CVTTCMFG                                                 04522000
CVTTCRDY EQU   CVTTCMFG                                                 04523000
CVTGTFA  EQU   CVTGTF+1                                                 04524000
CVTRSV27 EQU   CVTGTFST                                                 04525000
CVTRNIO  EQU   CVTGTFST                                                 04526000
CVTUSR   EQU   CVTGTFST                                                 04527000
CVTRV318 EQU   CVTFORM                                                  04528000
CVTRV317 EQU   CVTTMODE                                                 04529000
CVTRV316 EQU   CVTSTATE                                                 04530000
CVTRV315 EQU   CVTGTFS                                                  04531000
CVTGTFAV EQU   CVTGTFS                                                  04532000
CVT0SCR1 EQU   CVTMAP+232                                               04533000
CVTRV515 EQU   CVTMAP+228                                               04534000
CVTRMS   EQU   CVTMAP+224                                               04535000
CVTPATCH EQU   CVTMAP+220                                               04536000
CVTTSCE  EQU   CVTMAP+216                                               04537000
CVTLNKSC EQU   CVTMAP+214                                               04538000
CVTQABST EQU   CVTMAP+212                                               04539000
CVTMDLDS EQU   CVTMAP+208                                               04540000
CVTUSER  EQU   CVTMAP+204                                               04541000
CVTABEND EQU   CVTMAP+200                                               04542000
CVTSMCA  EQU   CVTMAP+196                                               04543000
CVTRSV18 EQU   CVTMAP+192                                               04544000
CVTQLPAQ EQU   CVTMAP+188                                               04545000
CVTQCDSR EQU   CVTMAP+184                                               04546000
CVTRSV17 EQU   CVTOPTB                                                  04547000
CVTVS1A  EQU   CVTOPTB                                                  04548000
CVTFP    EQU   CVTOPTB                                                  04549000
CVTAPTHR EQU   CVTOPTB                                                  04550000
CVTNLOG  EQU   CVTOPTB                                                  04551000
CVTTOD   EQU   CVTOPTB                                                  04552000
CVTCTIMS EQU   CVTOPTB                                                  04553000
CVTPROT  EQU   CVTOPTB                                                  04554000
CVTXPFP  EQU   CVTOPTA                                                  04555000
CVTASCII EQU   CVTOPTA                                                  04556000
CVTRSV13 EQU   CVTOPTA                                                  04557000
CVTRSV12 EQU   CVTOPTA                                                  04558000
CVTNIP   EQU   CVTOPTA                                                  04559000
CVTDDR   EQU   CVTOPTA                                                  04560000
CVTAPR   EQU   CVTOPTA                                                  04561000
CVTCCH   EQU   CVTOPTA                                                  04562000
CVTSNCTR EQU   CVTMAP+180                                               04563000
CVTQMWR  EQU   CVTMAP+176                                               04564000
CVTQOCR  EQU   CVTMAP+172                                               04565000
CVT1EF00 EQU   CVTMAP+168                                               04566000
CVTMZ00  EQU   CVTMAP+164                                               04567000
CVTHEAD  EQU   CVTMAP+160                                               04568000
CVTRSV11 EQU   CVTMAP+156                                               04569000
CVT0PT01 EQU   CVTMAP+152                                               04570000
CVTMSER  EQU   CVTMAP+148                                               04571000
CVTRV516 EQU   CVTIERLC                                                 04572000
CVTILCH  EQU   CVTMAP+140                                               04573000
CVT0DS   EQU   CVTMAP+136                                               04574000
CVTFBOSV EQU   CVTMAP+132                                               04575000
CVTNUCB  EQU   CVTMAP+128                                               04576000
CVTIXAVL EQU   CVTMAP+124                                               04577000
CVTIOQET EQU   CVTMAP+120                                               04578000
CVTDCBA  EQU   CVTMAP+117                                               04579000
CVTMVS2  EQU   CVTDCB                                                   04580000
CVT6DAT  EQU   CVTDCB                                                   04581000
CVT4MPS  EQU   CVTDCB                                                   04582000
CVTRSV09 EQU   CVTDCB                                                   04583000
CVT4MS1  EQU   CVTDCB                                                   04584000
CVT2SPS  EQU   CVTDCB                                                   04585000
CVT1SSS  EQU   CVTDCB                                                   04586000
CVTRSV08 EQU   CVTDCB                                                   04587000
CVTSTB   EQU   CVTMAP+112                                               04588000
CVTQTD00 EQU   CVTMAP+108                                               04589000
CVTQTE00 EQU   CVTMAP+104                                               04590000
CVTCUCB  EQU   CVTMAP+100                                               04591000
CVTSJQ   EQU   CVTMAP+96                                                04592000
CVTPBLDL EQU   CVTMAP+92                                                04593000
CVTTPC   EQU   CVTMAP+88                                                04594000
CVTSVDCB EQU   CVTMAP+84                                                04595000
CVTBRET  EQU   CVTMAP+82                                                04596000
CVTEXIT  EQU   CVTMAP+80                                                04597000
CVT0FN00 EQU   CVTMAP+76                                                04598000
CVTDARA  EQU   CVTDAR+1                                                 04599000
CVTRSV07 EQU   CVTFLGS1                                                 04600000
CVTRSV06 EQU   CVTFLGS1                                                 04601000
CVTRSV05 EQU   CVTFLGS1                                                 04602000
CVTRSV04 EQU   CVTFLGS1                                                 04603000
CVTRSV03 EQU   CVTFLGS1                                                 04604000
CVTRSV02 EQU   CVTFLGS1                                                 04605000
CVTRSV01 EQU   CVTFLGS1                                                 04606000
CVTDMPLK EQU   CVTFLGS1                                                 04607000
CVTXITP  EQU   CVTMAP+68                                                04608000
CVTZDTAB EQU   CVTMAP+64                                                04609000
CVTMSLT  EQU   CVTMAP+60                                                04610000
CVTDATE  EQU   CVTMAP+56                                                04611000
CVTBTERM EQU   CVTMAP+52                                                04612000
CVTSYSAD EQU   CVTMAP+48                                                04613000
CVTXTLER EQU   CVTMAP+44                                                04614000
CVTILK2  EQU   CVTMAP+40                                                04615000
CVTILK1  EQU   CVTMAP+36                                                04616000
CVTPRLTV EQU   CVTMAP+32                                                04617000
CVTPCNVT EQU   CVTMAP+28                                                04618000
CVT0VL00 EQU   CVTMAP+24                                                04619000
CVTXAPG  EQU   CVTMAP+20                                                04620000
CVTBUF   EQU   CVTMAP+16                                                04621000
CVTJOB   EQU   CVTMAP+12                                                04622000
CVTLINK  EQU   CVTMAP+8                                                 04623000
CVT0EF00 EQU   CVTMAP+4                                                 04624000
CVTTCBP  EQU   CVTMAP                                                   04625000
CVT      EQU   CVTMAP                                                   04626000
@NM00040 EQU   PSA+3668                                                 04627000
PSASTAK  EQU   PSA+3072                                                 04628000
@NM00039 EQU   PSA+1048                                                 04629000
PSAUSEND EQU   PSA+1048                                                 04630000
PSARV062 EQU   PSA+1044                                                 04631000
PSACDAL  EQU   PSA+1040                                                 04632000
PSAWTCOD EQU   PSA+1036                                                 04633000
PSAATCVT EQU   PSA+1032                                                 04634000
PSAPCPSW EQU   PSA+1024                                                 04635000
PSAPIR2  EQU   PSA+1020                                                 04636000
PSARV059 EQU   PSA+1018                                                 04637000
PSASVC13 EQU   PSA+1016                                                 04638000
PSALSFCC EQU   PSA+1012                                                 04639000
PSASFACC EQU   PSA+1008                                                 04640000
PSASTOP  EQU   PSA+992                                                  04641000
PSASTART EQU   PSA+976                                                  04642000
PSARSPSW EQU   PSA+968                                                  04643000
PSASRPSW EQU   PSA+960                                                  04644000
PSARV045 EQU   PSA+892                                                  04645000
PSARV044 EQU   PSA+888                                                  04646000
PSARV043 EQU   PSA+884                                                  04647000
PSARV042 EQU   PSA+880                                                  04648000
PSARV041 EQU   PSA+876                                                  04649000
PSARV040 EQU   PSA+872                                                  04650000
PSARV025 EQU   PSA+868                                                  04651000
PSADSSED EQU   PSA+868                                                  04652000
PSADSSPR EQU   PSA+864                                                  04653000
PSADSSFW EQU   PSA+860                                                  04654000
PSADSS14 EQU   PSA+856                                                  04655000
PSADSSPP EQU   PSA+848                                                  04656000
PSADSSRP EQU   PSA+840                                                  04657000
PSADSS05 EQU   PSADSSF4                                                 04658000
PSADSS10 EQU   PSADSSF4                                                 04659000
PSADSSVE EQU   PSADSSF4                                                 04660000
PSADSSDE EQU   PSADSSF4                                                 04661000
PSADSSC0 EQU   PSADSSF4                                                 04662000
PSADSSIE EQU   PSADSSF4                                                 04663000
PSADSS12 EQU   PSADSSF4                                                 04664000
PSADSSRC EQU   PSADSSF4                                                 04665000
PSARV057 EQU   PSADSSF3                                                 04666000
PSARV056 EQU   PSADSSF3                                                 04667000
PSARV055 EQU   PSADSSF3                                                 04668000
PSADSSMC EQU   PSADSSF3                                                 04669000
PSADSSRW EQU   PSADSSF3                                                 04670000
PSADSSNM EQU   PSADSSF3                                                 04671000
PSADSSES EQU   PSADSSF3                                                 04672000
PSADSSGP EQU   PSADSSF3                                                 04673000
PSADSSF2 EQU   PSADSSFL+1                                               04674000
PSADSSPI EQU   PSADSSF1                                                 04675000
PSADSSOI EQU   PSADSSF1                                                 04676000
PSADSSSP EQU   PSADSSF1                                                 04677000
PSADSSTP EQU   PSADSSF1                                                 04678000
PSADSSDW EQU   PSADSSF1                                                 04679000
PSADSSDD EQU   PSADSSF1                                                 04680000
PSADSSDM EQU   PSADSSF1                                                 04681000
PSADSSMV EQU   PSADSSF1                                                 04682000
PSADSSTS EQU   PSA+816                                                  04683000
PSADSSWK EQU   PSA+812                                                  04684000
PSADSSR3 EQU   PSA+808                                                  04685000
PSADSSR2 EQU   PSA+804                                                  04686000
PSADSSRS EQU   PSA+800                                                  04687000
PSASTOR  EQU   PSA+796                                                  04688000
PSACPUSA EQU   PSA+794                                                  04689000
PSAVSTAP EQU   PSA+792                                                  04690000
PSAWKVAP EQU   PSA+788                                                  04691000
PSAWKRAP EQU   PSA+784                                                  04692000
PSAMCHIC EQU   PSA+783                                                  04693000
PSARV061 EQU   PSA+782                                                  04694000
PSASYMSK EQU   PSA+781                                                  04695000
PSAMCHFL EQU   PSA+780                                                  04696000
PSACR0   EQU   PSA+776                                                  04697000
PSAPSWSV EQU   PSA+768                                                  04698000
PSACLHS  EQU   PSAHLHI                                                  04699000
PSALKR15 EQU   PSALKSA+60                                               04700000
PSALKR14 EQU   PSALKSA+56                                               04701000
PSALKR13 EQU   PSALKSA+52                                               04702000
PSALKR12 EQU   PSALKSA+48                                               04703000
PSALKR11 EQU   PSALKSA+44                                               04704000
PSALKR10 EQU   PSALKSA+40                                               04705000
PSALKR9  EQU   PSALKSA+36                                               04706000
PSALKR8  EQU   PSALKSA+32                                               04707000
PSALKR7  EQU   PSALKSA+28                                               04708000
PSALKR6  EQU   PSALKSA+24                                               04709000
PSALKR5  EQU   PSALKSA+20                                               04710000
PSALKR4  EQU   PSALKSA+16                                               04711000
PSALKR3  EQU   PSALKSA+12                                               04712000
PSALKR2  EQU   PSALKSA+8                                                04713000
PSALKR1  EQU   PSALKSA+4                                                04714000
PSALKR0  EQU   PSALKSA                                                  04715000
PSARV023 EQU   PSACLHT+52                                               04716000
PSALOCAL EQU   PSACLHT+48                                               04717000
PSACMSL  EQU   PSACLHT+44                                               04718000
PSAOPTL  EQU   PSACLHT+40                                               04719000
PSATPACL EQU   PSACLHT+36                                               04720000
PSATPDNL EQU   PSACLHT+32                                               04721000
PSATPNCL EQU   PSACLHT+28                                               04722000
PSAIOSLL EQU   PSACLHT+24                                               04723000
PSAIOSUL EQU   PSACLHT+20                                               04724000
PSAIOSCL EQU   PSACLHT+16                                               04725000
PSAIOSSL EQU   PSACLHT+12                                               04726000
PSASALCL EQU   PSACLHT+8                                                04727000
PSAASML  EQU   PSACLHT+4                                                04728000
PSADISPL EQU   PSACLHT                                                  04729000
PSASRSA  EQU   PSA+636                                                  04730000
PSARV050 EQU   PSA+634                                                  04731000
PSADSSGO EQU   PSA+633                                                  04732000
PSARECUR EQU   PSA+632                                                  04733000
PSAHLHIS EQU   PSA+628                                                  04734000
PSAIPCSA EQU   PSA+624                                                  04735000
@NM00038 EQU   PSA+621                                                  04736000
PSAIPCDM EQU   PSA+620                                                  04737000
PSAIPCD  EQU   PSA+616                                                  04738000
@NM00037 EQU   PSA+613                                                  04739000
PSAIPCRM EQU   PSA+612                                                  04740000
PSAIPCR  EQU   PSA+608                                                  04741000
PSAMCHEX EQU   PSA+600                                                  04742000
PSAMPSW  EQU   PSA+592                                                  04743000
PSAEXPS2 EQU   PSA+584                                                  04744000
PSAEXPS1 EQU   PSA+576                                                  04745000
PSAPIREG EQU   PSA+572                                                  04746000
PSARSREG EQU   PSA+568                                                  04747000
PSAGPREG EQU   PSA+556                                                  04748000
PSARV022 EQU   PSASUP4                                                  04749000
PSARV021 EQU   PSASUP4                                                  04750000
PSARV020 EQU   PSASUP4                                                  04751000
PSARV019 EQU   PSASUP4                                                  04752000
PSARV018 EQU   PSASUP4                                                  04753000
PSARV017 EQU   PSASUP4                                                  04754000
PSARV016 EQU   PSASUP4                                                  04755000
PSARV015 EQU   PSASUP4                                                  04756000
PSARV014 EQU   PSASUP3                                                  04757000
PSARV013 EQU   PSASUP3                                                  04758000
PSARV012 EQU   PSASUP3                                                  04759000
PSAESTA  EQU   PSASUP3                                                  04760000
PSASPR   EQU   PSASUP3                                                  04761000
PSAPSREG EQU   PSASUP3                                                  04762000
PSAPI2   EQU   PSASUP3                                                  04763000
PSAIOSUP EQU   PSASUP3                                                  04764000
PSALCR   EQU   PSASUP2                                                  04765000
PSARTM   EQU   PSASUP2                                                  04766000
PSAACR   EQU   PSASUP2                                                  04767000
PSAIPCE2 EQU   PSASUP2                                                  04768000
PSAIPCES EQU   PSASUP2                                                  04769000
PSAIPCEC EQU   PSASUP2                                                  04770000
PSAGTF   EQU   PSASUP2                                                  04771000
PSAIPCRI EQU   PSASUP2                                                  04772000
PSATYPE6 EQU   PSASUP1                                                  04773000
PSATCTL  EQU   PSASUP1                                                  04774000
PSADISP  EQU   PSASUP1                                                  04775000
PSALOCK  EQU   PSASUP1                                                  04776000
PSAPI    EQU   PSASUP1                                                  04777000
PSAEXT   EQU   PSASUP1                                                  04778000
PSASVC   EQU   PSASUP1                                                  04779000
PSAIO    EQU   PSASUP1                                                  04780000
PSAAOLD  EQU   PSA+548                                                  04781000
PSAANEW  EQU   PSA+544                                                  04782000
PSATOLD  EQU   PSA+540                                                  04783000
PSATNEW  EQU   PSA+536                                                  04784000
PSALCCAR EQU   PSA+532                                                  04785000
PSALCCAV EQU   PSA+528                                                  04786000
PSAPCCAR EQU   PSA+524                                                  04787000
PSAPCCAV EQU   PSA+520                                                  04788000
PSACPULA EQU   PSA+518                                                  04789000
PSACPUPA EQU   PSA+516                                                  04790000
PSAPSA   EQU   PSA+512                                                  04791000
FLCHDEND EQU   PSA+512                                                  04792000
FLCCRSAV EQU   FLCMCLA+280                                              04793000
FLCGRSAV EQU   FLCMCLA+216                                              04794000
FLCFPSAV EQU   FLCMCLA+184                                              04795000
FLCFLA   EQU   FLCMCLA+88                                               04796000
FLCRGNCD EQU   FLCMCLA+84                                               04797000
FLCFSAA  EQU   FLCFSA+1                                                 04798000
@NM00036 EQU   FLCFSA                                                   04799000
@NM00035 EQU   FLCMCLA+72                                               04800000
FLCMCIC  EQU   FLCMCLA+64                                               04801000
@NM00034 EQU   FLCMCLA+20                                               04802000
FLCIOAA  EQU   FLCIOA+1                                                 04803000
@NM00033 EQU   FLCIOA                                                   04804000
@NM00032 EQU   FLCMCLA+15                                               04805000
@NM00031 EQU   FLCMCLA+14                                               04806000
@NM00030 EQU   FLCMCLA+12                                               04807000
FLCLCL   EQU   FLCMCLA+8                                                04808000
FLCIOELA EQU   FLCIOEL+1                                                04809000
@NM00029 EQU   FLCIOEL                                                  04810000
FLCCHNID EQU   FLCMCLA                                                  04811000
@NM00028 EQU   PSA+160                                                  04812000
FLCMTRCD EQU   PSA+157                                                  04813000
@NM00027 EQU   PSA+156                                                  04814000
FLCPERA  EQU   FLCPER+1                                                 04815000
@NM00026 EQU   FLCPER                                                   04816000
@NM00025 EQU   PSA+151                                                  04817000
FLCPERCD EQU   PSA+150                                                  04818000
FLCMCNUM EQU   PSA+149                                                  04819000
@NM00024 EQU   PSA+148                                                  04820000
FLCTEAA  EQU   FLCTEA+1                                                 04821000
@NM00023 EQU   FLCTEA                                                   04822000
PSAPIPC  EQU   PSAPICOD                                                 04823000
PSAPIMC  EQU   PSAPICOD                                                 04824000
PSAPIPER EQU   PSAPICOD                                                 04825000
PSARV049 EQU   FLCPICOD                                                 04826000
FLCPILCB EQU   FLCPIILC                                                 04827000
@NM00022 EQU   FLCPIILC                                                 04828000
@NM00021 EQU   PSAEPPSW                                                 04829000
FLCSVCN  EQU   PSAESPSW+2                                               04830000
FLCSILCB EQU   FLCSVILC                                                 04831000
@NM00020 EQU   FLCSVILC                                                 04832000
@NM00019 EQU   PSAESPSW                                                 04833000
FLCEICOD EQU   PSAEEPSW+2                                               04834000
PSASPAD  EQU   PSAEEPSW                                                 04835000
@NM00018 EQU   PSA+128                                                  04836000
FLCINPSW EQU   PSA+120                                                  04837000
FLCMNPSW EQU   PSA+112                                                  04838000
FLCPNPSW EQU   PSA+104                                                  04839000
FLCSNPSW EQU   PSA+96                                                   04840000
FLCENPSW EQU   PSA+88                                                   04841000
FLCTRACE EQU   PSA+84                                                   04842000
FLCTIMER EQU   PSA+80                                                   04843000
FLCCVT2  EQU   PSA+76                                                   04844000
FLCCAW   EQU   PSA+72                                                   04845000
FLCCSW   EQU   PSA+64                                                   04846000
FLCIOPSW EQU   PSA+56                                                   04847000
FLCMOPSW EQU   PSA+48                                                   04848000
FLCPOPSW EQU   PSA+40                                                   04849000
FLCSOPSW EQU   PSA+32                                                   04850000
FLCEOPSW EQU   PSA+24                                                   04851000
@NM00017 EQU   FLCICCW2+4                                               04852000
FLCICCW1 EQU   FLCROPSW                                                 04853000
FLCIPPSW EQU   FLCRNPSW                                                 04854000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      04855000
@RC00185 EQU   @RC00162                                                 04856000
@RC00163 EQU   @RC00162                                                 04857000
@RC00245 EQU   @RC00212                                                 04858000
@RC00241 EQU   @RC00212                                                 04859000
@RC00225 EQU   @RC00212                                                 04860000
@RT00223 EQU   @RC00212                                                 04861000
@RC00215 EQU   @RC00212                                                 04862000
@RC00253 EQU   @RC00251                                                 04863000
@RC00271 EQU   @RC00251                                                 04864000
@RC00263 EQU   @RC00251                                                 04865000
@RC00299 EQU   @EL00005                                                 04866000
@RC00319 EQU   @RC00314                                                 04867000
@RC00315 EQU   @RC00314                                                 04868000
@RC00329 EQU   @RC00324                                                 04869000
@RT00327 EQU   @RC00324                                                 04870000
@RC00346 EQU   @RC00345                                                 04871000
@RC00350 EQU   @RC00349                                                 04872000
@RF00349 EQU   P2DT                                                     04873000
@RF00354 EQU   @EL00006                                                 04874000
@RT00465 EQU   IMPRESET                                                 04875000
@RC00476 EQU   @RC00471                                                 04876000
@RC00472 EQU   @RC00471                                                 04877000
@RT00503 EQU   IMPRESET                                                 04878000
@RC00579 EQU   @EL00010                                                 04879000
@RC00574 EQU   @EL00010                                                 04880000
@RC00569 EQU   @EL00010                                                 04881000
@RC00556 EQU   @EL00010                                                 04882000
@RC00550 EQU   @EL00010                                                 04883000
@RC00611 EQU   @EL00011                                                 04884000
@RC00597 EQU   @EL00011                                                 04885000
@RC00595 EQU   @EL00011                                                 04886000
@RC00593 EQU   @EL00011                                                 04887000
@RC00682 EQU   @EL00012                                                 04888000
@RC00676 EQU   @EL00012                                                 04889000
@RC00672 EQU   @EL00012                                                 04890000
@RC00668 EQU   @EL00012                                                 04891000
@RC00664 EQU   @EL00012                                                 04892000
@RC00650 EQU   @EL00012                                                 04893000
@RC00626 EQU   @EL00012                                                 04894000
@RC00708 EQU   @EL00013                                                 04895000
@RC00690 EQU   @EL00013                                                 04896000
@RC00181 EQU   @RC00163                                                 04897000
@RC00166 EQU   @RC00163                                                 04898000
@RC00195 EQU   @RC00185                                                 04899000
@RC00190 EQU   @RC00185                                                 04900000
@RF00220 EQU   @RC00215                                                 04901000
@RC00233 EQU   @RC00225                                                 04902000
@RC00226 EQU   @RC00225                                                 04903000
@RC00242 EQU   @RC00241                                                 04904000
@RC00246 EQU   @RC00245                                                 04905000
@RC00268 EQU   @RC00263                                                 04906000
@RC00266 EQU   @RC00263                                                 04907000
@RC00264 EQU   @RC00263                                                 04908000
@RC00316 EQU   @RC00315                                                 04909000
@RC00320 EQU   @RC00319                                                 04910000
@RC00332 EQU   @RC00329                                                 04911000
@RC00330 EQU   @RC00329                                                 04912000
@RC00473 EQU   @RC00472                                                 04913000
@RC00553 EQU   @RC00550                                                 04914000
@RC00551 EQU   @RC00550                                                 04915000
@RC00566 EQU   @RC00556                                                 04916000
@RC00564 EQU   @RC00556                                                 04917000
@RC00562 EQU   @RC00556                                                 04918000
@RC00557 EQU   @RC00556                                                 04919000
@RC00608 EQU   @RC00597                                                 04920000
@RC00606 EQU   @RC00597                                                 04921000
@RC00604 EQU   @RC00597                                                 04922000
@RC00602 EQU   @RC00597                                                 04923000
@RC00600 EQU   @RC00597                                                 04924000
@RC00598 EQU   @RC00597                                                 04925000
@RC00616 EQU   @RC00611                                                 04926000
@RC00614 EQU   @RC00611                                                 04927000
@RC00612 EQU   @RC00611                                                 04928000
@RC00647 EQU   @RC00626                                                 04929000
@RC00645 EQU   @RC00626                                                 04930000
@RC00643 EQU   @RC00626                                                 04931000
@RC00641 EQU   @RC00626                                                 04932000
@RC00639 EQU   @RC00626                                                 04933000
@RC00635 EQU   @RC00626                                                 04934000
@RC00633 EQU   @RC00626                                                 04935000
@RC00631 EQU   @RC00626                                                 04936000
@RC00627 EQU   @RC00626                                                 04937000
@RC00659 EQU   @RC00650                                                 04938000
@RC00655 EQU   @RC00650                                                 04939000
@RC00651 EQU   @RC00650                                                 04940000
@RC00665 EQU   @RC00664                                                 04941000
@RC00669 EQU   @RC00668                                                 04942000
@RC00673 EQU   @RC00672                                                 04943000
@RC00677 EQU   @RC00676                                                 04944000
@RC00705 EQU   @RC00690                                                 04945000
@RC00703 EQU   @RC00690                                                 04946000
@RC00701 EQU   @RC00690                                                 04947000
@RC00699 EQU   @RC00690                                                 04948000
@RC00697 EQU   @RC00690                                                 04949000
@RC00695 EQU   @RC00690                                                 04950000
@RC00693 EQU   @RC00690                                                 04951000
@RC00691 EQU   @RC00690                                                 04952000
@RC00174 EQU   @RC00166                                                 04953000
@RC00169 EQU   @RC00166                                                 04954000
@RC00227 EQU   @RC00226                                                 04955000
@RC00234 EQU   @RC00233                                                 04956000
@RC00337 EQU   @RC00332                                                 04957000
@RC00335 EQU   @RC00332                                                 04958000
@RC00333 EQU   @RC00332                                                 04959000
@RC00628 EQU   @RC00627                                                 04960000
@RC00636 EQU   @RC00635                                                 04961000
@RC00652 EQU   @RC00651                                                 04962000
@RC00656 EQU   @RC00655                                                 04963000
@RC00660 EQU   @RC00659                                                 04964000
@ENDDATA EQU   *                                                        04965000
         END   IEEMB815,(C'PLS2022',0701,77047)                         04966000
./  ADD  SSI=33300614,NAME=IEEVDUMY
         TITLE 'IEEVDUMY - MISSING MP CODE REPLACEMENT MODULE          *00001000
                        '                                               00002000
*                                                                  0001 00003000
IEEVDUMY CSECT ,                                                   0001 00004000
@MAINENT BALR  @15,0                                               0001 00005000
         USING *,@15                                               0001 00006000
         B     @PROLOG                                             0001 00007000
         DC    AL2(@EP00001-@MAINENT-2)                                 00008000
IEAVTACR BALR  @15,0                                               0001 00009000
         USING *,@15                                               0001 00010000
         B     @PROLOG                                             0001 00011000
         DC    AL2(@EP00002-IEAVTACR-2)                                 00012000
         ENTRY IEAVTACR                                                 00013000
IEAVTCR1 BALR  @15,0                                               0001 00014000
         USING *,@15                                               0001 00015000
         B     @PROLOG                                             0001 00016000
         DC    AL2(@EP00003-IEAVTCR1-2)                                 00017000
         ENTRY IEAVTCR1                                                 00018000
IGFPXMFA BALR  @15,0                                               0001 00019000
         USING *,@15                                               0001 00020000
         B     @PROLOG                                             0001 00021000
         DC    AL2(@EP00004-IGFPXMFA-2)                                 00022000
         ENTRY IGFPXMFA                                                 00023000
IGFPTAIM BALR  @15,0                                               0001 00024000
         USING *,@15                                               0001 00025000
         B     @PROLOG                                             0001 00026000
         DC    AL2(@EP00005-IGFPTAIM-2)                                 00027000
         ENTRY IGFPTAIM                                                 00028000
         DROP  @15                                                      00029000
@PROLOG  BALR  @12,0                                               0001 00030000
@PSTART  DS    0H                                                  0001 00031000
         USING @PSTART,@12                                         0001 00032000
         AH    @15,4(,@15)                                         0001 00033000
         BR    @15                                                 0001 00034000
@EP00001 DS    0H                                                  0002 00035000
*/*A-000000-999999                                            @Y02703*/ 00036000
*                                                                  0002 00037000
*IEAVTACR:                                                         0002 00038000
*   ENTRY;                                                         0002 00039000
@EP00002 DS    0H                                                  0003 00040000
*IEAVTCR1:                                                         0003 00041000
*   ENTRY;                                                         0003 00042000
@EP00003 DS    0H                                                  0004 00043000
*IGFPXMFA:                                                         0004 00044000
*   ENTRY;                                                         0004 00045000
@EP00004 DS    0H                                                  0005 00046000
*IGFPTAIM:                                                         0005 00047000
*   ENTRY;                                                         0005 00048000
@EP00005 DS    0H                                                  0006 00049000
*                                                                  0006 00050000
*/*********************************************************        0006 00051000
*                                                                  0006 00052000
*          R M S  L O G R E C  R E C O R D  M A C R O              0006 00053000
*                                                                  0006 00054000
*    STATUS                                                        0006 00055000
*        OS/VS2 REL 2-LEVEL 2 - 8/6/73 (PTM-02577)                 0006 00056000
*                                                                  0006 00057000
*    METHOD OF ACCESS                                              0006 00058000
*                                                                  0006 00059000
*        PL/S - DCL  LRBPTR  PTR                                   0006 00060000
*               IF CHANNEL CHECK HANDLER SECTION IS TO BE USED     0006 00061000
*               POINTER LRBCVPTR (NOTE: ANY NAME MAY BE USED, LRBCVPTR  00062000
*               IS JUST AN EXAMPLE) MUST BE SET BY USER AS FOLLOWS:     00063000
*               DCL LRBCVPTR PTR                                   0006 00064000
*               LRBCVPTR = ADDR(LRBCCLOG) + LRBCLOGL               0006 00065000
*               RESPECIFY LRBCVAR BASED (LRBCVPTR)                 0006 00066000
*        BAL - IHALRB  (MARCO CALL)                                0006 00067000
*              USING     LRB,REGA                                  0006 00068000
*              LOAD REGA WITH LRB ADDRESS                          0006 00069000
*              IF CHANNEL CHECK HANDLER SECTION IS TO BE USED      0006 00070000
*              THE FOLLOWING MUST BE DONE BY THE USER              0006 00071000
*                                                                  0006 00072000
*              LA  REGB,LRBCCLOG      OBTAIN ADDRESS OF LRBCCLOG   0006 00073000
*              LH  REGC,LRBCLOGL      OBTAIN LENGTH OF LOGOUT      0006 00074000
*              AR  REGB,REGC          ADD LENGTH TO STARTING ADDRESS    00075000
*              USING  LRBCFT,REGB                                  0006 00076000
*                                                                  0006 00077000
*              WHERE REGA AND REGB ARE ANY REGISTER OTHER THAN 0,  0006 00078000
*                                                                  0006 00079000
*    F.E.'S                                                        0006 00080000
*        MICROFICHE LISTINGS - IHALRB                              0006 00081000
*                                                                  0006 00082000
*    DEVELOPERS                                                    0006 00083000
*        BAL LISTING  - SPECIFY LIST=YES ON MACRO CALL             0006 00084000
*        PL/S LISTING - SPECIFY %IHALIST='YES' BEFORE INCLUDE      0006 00085000
*                                                                  0006 00086000
*        FOR INTEGRATION, A LISTING MUST NOT BE REQUESTED UNLESS   0006 00087000
*        YOUR MODULE CREATES THE MACRO.                            0006 00088000
************************************************************         */ 00089000
*                                                                  0006 00090000
*                                                                  0006 00091000
*   /*****************************************************************/ 00092000
*   /*                                                               */ 00093000
*   /* COMMON HEADER SECTION                                         */ 00094000
*   /*                                                               */ 00095000
*   /*****************************************************************/ 00096000
*                                                                  0006 00097000
*   DCL                                                            0006 00098000
*     1 LRB BASED(LRBPTR) BDY(DWORD),                              0006 00099000
*      2 LRBHTYPE CHAR(1),          /* TYPE OF RECORD                */ 00100000
*      2 LRBHREL FIXED(8),          /* RELEASE NUMBER                */ 00101000
*       3 LRBHSYS CHAR(1),          /* SYSTEM TYPE                   */ 00102000
*        4 LRBHSYSB BIT(3),         /* ACTUAL SYSTEM BITS            */ 00103000
*        4 * BIT(5),                /* ACTUAL RELEASE BITS           */ 00104000
*      2 LRBHSW0 CHAR(1),           /* INDEPENDENT SWITCH BYTE       */ 00105000
*       3 LRBHMORE BIT(1),          /* MULTIPLE RECORDS              */ 00106000
*       3 LRBHNS BIT(1),            /* NS MACHINE                    */ 00107000
*       3 * BIT(2),                 /* RESERVED                      */ 00108000
*       3 LRBHTMC BIT(1),           /* TIME MACRO USED               */ 00109000
*       3 * BIT(3),                 /* RESERVED                      */ 00110000
*      2 LRBHSW1 CHAR(1),           /* DEPENDENT SWITCH BYTE 0       */ 00111000
*      2 LRBHSW2 CHAR(1),           /* DEPENDENT SWITCH BYTE 1       */ 00112000
*       3 LRBMACT CHAR(1),          /* MCH BUFFER ACTIVE FLAG        */ 00113000
*        4 LRBNCEM BIT(1),          /* PENDING CHANNEL END           */ 00114000
*        4 LRBNDEM BIT(1),          /* PENDING DEVICE END            */ 00115000
*      2 LRBHSW3 CHAR(1),           /* DEPENDENT SWITCH BYTE 2       */ 00116000
*       3 LRBMCLB CHAR(1),          /* LOGREC CLOBBER FLAG (INDICATES   00117000
*                                      LOGREC BUFFER OVERLAYED)      */ 00118000
*      2 LRBHCNT CHAR(1),           /* PHYSICAL RECORDS PER LOGICAL     00119000
*                                      REC CNT                       */ 00120000
*      2 * CHAR(1),                                                0006 00121000
*      2 LRBHDATE CHAR(4),          /* DATE                          */ 00122000
*      2 LRBHTIME CHAR(4),          /* TIME                          */ 00123000
*      2 LRBHCPID CHAR(8) BDY(DWORD),/* STIDP OPERAND FIELD          */ 00124000
*       3 * CHAR(1),                /* RESERVED                      */ 00125000
*       3 LRBHCSER CHAR(3),         /* CPU SERIAL NUMBER             */ 00126000
*       3 LRBHMDL CHAR(2),          /* CPU MODEL NUMBER              */ 00127000
*       3 LRBHMCEL FIXED(16),       /* MAXIMUM MCEL LENGTH           */ 00128000
*      2 LRBBASE CHAR(*) BDY(WORD); /* DEPENDENT SECTION STARTS      */ 00129000
*/*                                                                  */ 00130000
*/*                SWITCH  BYTE 0 OVERLAYED (LRBHSW1)                */ 00131000
*/*                                                                  */ 00132000
*                                                                  0007 00133000
*   DCL                                                            0007 00134000
*     1 LRBHRSW1 DEF(LRBHSW1),                                     0007 00135000
*      2 LRBRPRIM BIT(1),           /* DDR PRIMARY STORAGE RECONFIG  */ 00136000
*      2 LRBRSEC BIT(1),            /* DDR SEC STORAGE RECONFIG      */ 00137000
*      2 LRBROPER BIT(1),           /* DDR OPERATOR REQUEST RECONFIG */ 00138000
*      2 LRBRSYSI BIT(1),           /* DDR PERMANENT ERROR REQUEST   */ 00139000
*      2 * BIT(4);                  /* RESERVED                      */ 00140000
*   DCL                                                            0008 00141000
*     1 LRBHCSW1 DEF(LRBHSW1),                                     0008 00142000
*      2 LRBCMESG BIT(1),           /* MESSAGE REQUEST               */ 00143000
*      2 LRBCINCO BIT(1),           /* RECORD INCOMPLETE             */ 00144000
*      2 * BIT(1),                                                 0008 00145000
*      2 LRBCNOSP BIT(1),           /* CHANNEL NOT SUPPORTED         */ 00146000
*      2 LRBCICUA BIT(1),           /* ILLEGAL CUA                   */ 00147000
*      2 LRBCDATA BIT(1),           /* DATA OVERLAYED                */ 00148000
*      2 LRBCERPP BIT(1),           /* ERP IN PROGRESS               */ 00149000
*      2 * BIT(1);                                                 0008 00150000
*   DCL                                                            0009 00151000
*     1 LRBHMSW1 DEF(LRBHSW1),                                     0009 00152000
*      2 * BIT(2),                  /* RESERVED                      */ 00153000
*      2 LRBMSYST BIT(1),           /* SYSTEM TERMINATED             */ 00154000
*      2 * BIT(5);                  /* RESERVED                      */ 00155000
*/*                                                                  */ 00156000
*/*    RECORD TYPE EQUATES (LRBHTYPE)                                */ 00157000
*/*                                                                  */ 00158000
*                                                                  0010 00159000
*   DCL                                                            0010 00160000
*     LRBHREC BIT(8) CONSTANT('60'X);                              0010 00161000
*   DCL                                                            0011 00162000
*     LRBHMDR BIT(8) CONSTANT('90'X);                              0011 00163000
*   DCL                                                            0012 00164000
*     LRBHMIH BIT(8) CONSTANT('70'X);                              0012 00165000
*   DCL                                                            0013 00166000
*     LRBHCCH BIT(8) CONSTANT('21'X);                              0013 00167000
*   DCL                                                            0014 00168000
*     LRBHMCH BIT(8) CONSTANT('13'X);                              0014 00169000
*   DCL                                                            0015 00170000
*     LRBHTER BIT(8) CONSTANT('81'X);                              0015 00171000
*                                                                  0015 00172000
*/*   SYSTEM TYPE EQUATES (LRBHSYS)                                  */ 00173000
*                                                                  0016 00174000
*   DCL                                                            0016 00175000
*     LRBHOS BIT(3) CONSTANT('000'B);                              0016 00176000
*   DCL                                                            0017 00177000
*     LRBHDOS BIT(3) CONSTANT('001'B);                             0017 00178000
*   DCL                                                            0018 00179000
*     LRBHVS1 BIT(3) CONSTANT('010'B);                             0018 00180000
*   DCL                                                            0019 00181000
*     LRBHCP67 BIT(3) CONSTANT('011'B);                            0019 00182000
*   DCL                                                            0020 00183000
*     LRBHVS2 BIT(3) CONSTANT('100'B);                             0020 00184000
*                                                                  0020 00185000
*/*    MDR EQUATES FOR SWITCH BYTE 2 (LRBHSW2)                       */ 00186000
*                                                                  0021 00187000
*   DCL                                                            0021 00188000
*     LRBD3330 BIT(8) CONSTANT('01'X);                             0021 00189000
*   DCL                                                            0022 00190000
*     LRBD3211 BIT(8) CONSTANT('04'X);                             0022 00191000
*   DCL                                                            0023 00192000
*     LRBD3340 BIT(8) CONSTANT('09'X);                             0023 00193000
*   DCL                                                            0024 00194000
*     LRBDICE BIT(8) CONSTANT('07'X);                              0024 00195000
*   DCL                                                            0025 00196000
*     LRBD2946 BIT(8) CONSTANT('F0'X);                             0025 00197000
*   DCL                                                            0026 00198000
*     LRBD2948 BIT(8) CONSTANT('F1'X);                             0026 00199000
*   DCL                                                            0027 00200000
*     LRBD1006 BIT(8) CONSTANT('F2'X);                             0027 00201000
*   DCL                                                            0028 00202000
*     LRBD2703 BIT(8) CONSTANT('F3'X);                             0028 00203000
*   DCL                                                            0029 00204000
*     LRBD2969 BIT(8) CONSTANT('F4'X);                             0029 00205000
*                                                                  0029 00206000
*   /*****************************************************************/ 00207000
*   /*                                                               */ 00208000
*   /* MACHINE CHECK HANDLER RECORD                                  */ 00209000
*   /*                                                               */ 00210000
*   /*****************************************************************/ 00211000
*                                                                  0030 00212000
*   DCL                                                            0030 00213000
*     1 LRBMMCH DEF(LRBBASE) BDY(WORD),                            0030 00214000
*      2 LRBMLNH FIXED(31),         /* LENGTH OF LOGREC RECORD       */ 00215000
*      2 LRBMWSC CHAR(4),           /* WAIT STATE CODE               */ 00216000
*      2 LRBMCEIA CHAR(4),          /* MACHINE CHECK ERROR INDICATOR    00217000
*                                      AREA                          */ 00218000
*       3 LRBMTERM CHAR(1),         /* TERMINAL ERROR FLAGS          */ 00219000
*        4 * BIT(3),                /* RESERVED                      */ 00220000
*        4 LRBMTSEC BIT(1),         /* SECONDARY ERROR FLAG          */ 00221000
*        4 LRBMTCKS BIT(1),         /* CHECK STOP FLAG               */ 00222000
*        4 LRBMTWRN BIT(1),         /* POWER WARNING FLAG            */ 00223000
*        4 LRBMTDMG BIT(1),         /* SYSTEM DAMAGE FLAG            */ 00224000
*        4 LRBMTINV BIT(1),         /* INVALID LOGOUT FLAG (SET WHEN    00225000
*                                      LRBMCIC = 0 )                 */ 00226000
*       3 LRBMHARD CHAR(1),         /* HARD MACHINE ERROR FLAGS      */ 00227000
*        4 LRBMHHRD BIT(1),         /* ASSUMED HARD ERROR FLAG       */ 00228000
*        4 * BIT(3),                /* RESERVED                      */ 00229000
*        4 LRBMHINV BIT(1),         /* REGISTER OR PSW INVALID FLAG  */ 00230000
*        4 LRBMHSTO BIT(1),         /* HARD STORAGE FAILURE FLAG     */ 00231000
*        4 LRBMHSPF BIT(1),         /* HARD PROTECTION KEY ERROR FLAG*/ 00232000
*        4 LRBMHIPD BIT(1),         /* INSTRUCTION PROCESSING DAMAGE    00233000
*                                      FLAG                          */ 00234000
*       3 LRBMINTM CHAR(1),         /* INTERMEDIATE ERROR FLAGS      */ 00235000
*        4 * BIT(4),                /* RESERVED                      */ 00236000
*        4 LRBMITOD BIT(1),         /* TOD CLOCK ERROR FLAG          */ 00237000
*        4 LRBMICKC BIT(1),         /* CLOCK COMPARATOR ERROR FLAG   */ 00238000
*        4 LRBMICTM BIT(1),         /* CPU TIMER ERROR FLAG          */ 00239000
*        4 LRBMIL80 BIT(1),         /* INTERVAL TIMER ERROR FLAG     */ 00240000
*       3 LRBMSOFT CHAR(1),         /* SOFT MACHINE ERROR FLAGS      */ 00241000
*        4 LRBMSSFT BIT(1),         /* ASSUMED SOFT ERROR FLAG       */ 00242000
*        4 * BIT(3),                /* RESERVED                      */ 00243000
*        4 LRBMSEXD BIT(1),         /* EXTERNAL DAMAGE FLAG          */ 00244000
*        4 LRBMSECC BIT(1),         /* ECC CORRECTED STORAGE ERROR 0030 00245000
*                                      FLAG                          */ 00246000
*        4 LRBMSHIR BIT(1),         /* HIR CORRECTED PROCESSOR ERROR    00247000
*                                      FLAG                          */ 00248000
*        4 LRBMSBUF BIT(1),         /* BUFFER ERROR FLAG             */ 00249000
*      2 LRBMPDAR CHAR(1),          /* PDAR DATA (SUPPLIED BY RTM)   */ 00250000
*       3 * BIT(3),                 /* RESERVED                      */ 00251000
*       3 LRBMINVP BIT(1),          /* STORAGE RECONFIGURED - PAGE 0030 00252000
*                                      INVALIDATED                   */ 00253000
*       3 LRBMRSRC BIT(1),          /* STORAGE RECONFIGURATION STATUS   00254000
*                                      AVAILABLE (FOLLOWING TWO BYTES   00255000
*                                      ARE MEANINGFULL)              */ 00256000
*       3 LRBMRSRF BIT(1),          /* STORAGE RECONFIGURATION NOT 0030 00257000
*                                      ATTEMPTED                     */ 00258000
*       3 * BIT(2),                 /* RESERVED                      */ 00259000
*      2 LRBMRSR1 CHAR(1),          /* STORAGE RECONFIGURATION STATUS   00260000
*                                      BYTE 1                        */ 00261000
*       3 * BIT(6),                 /* RESERVED                      */ 00262000
*       3 LRBMSER BIT(1),           /* STORAGE ERROR WAS ALREADY SET    00263000
*                                      IN FRAME                      */ 00264000
*       3 LRBMCHNG BIT(1),          /* FRAME HAD CHANGE INDICATOR ON */ 00265000
*      2 LRBMRSR2 CHAR(1),          /* STORAGE RECONFIGURATION STATUS   00266000
*                                      BYTE 2                        */ 00267000
*       3 LRBMOFLN BIT(1),          /* FRAME IS OFFLINE OR SCHEDULED    00268000
*                                      TO GO OFFLINE                 */ 00269000
*       3 LRBMINTC BIT(1),          /* INTERCEPT - FRAME IS SCHEDULED   00270000
*                                      TO GO OFFLINE, HAS A PERMANENT   00271000
*                                      STORAGE ERROR, OR IS SCHEDULED   00272000
*                                      FOR V=R STATUS                */ 00273000
*       3 LRBMSPER BIT(1),          /* PERMANENT ERROR OCCURS IN   0030 00274000
*                                      FRAME                         */ 00275000
*       3 LRBMNUCL BIT(1),          /* FRAME CONTAINS PERMANENTLY  0030 00276000
*                                      RESIDENT SYSTEM STORAGE       */ 00277000
*       3 LRBMFSQA BIT(1),          /* FRAME IS IN USE FOR SQA       */ 00278000
*       3 LRBMLSQA BIT(1),          /* FRAME IS IN USE FOR LSQA      */ 00279000
*       3 LRBMPGFX BIT(1),          /* FRAME CONTAINS PAGE FIXED DATA*/ 00280000
*       3 LRBMVEQR BIT(1),          /* FRAME IS IN USE FOR V=R OR IS    00281000
*                                      SCHEDULED FOR V=R             */ 00282000
*      2 LRBMPWL FIXED(8) UNSIGNED, /* PHYSICAL WORD LENGTH (CHECKING   00283000
*                                      BLOCK SIZE)                   */ 00284000
*      2 LRBMMOSW CHAR(8),          /* MACHINE CHECK OLD PSW (FROM 0030 00285000
*                                      STORAGE LOCATIONS 48-55)      */ 00286000
*      2 LRBMFLO CHAR(280) BDY(WORD),/* MACHINE CHECK FIXED LOGOUT 0030 00287000
*                                      AREA (MOVED FROM STORAGE    0030 00288000
*                                      LOCATIONS 232-511)            */ 00289000
*       3 LRBMCIC CHAR(8) BDY(WORD),/* MACHINE CHECK INTERRUPT CODE     00290000
*                                      (MOVED FROM STORAGE LOCATIONS    00291000
*                                      232-239)                      */ 00292000
*        4 * CHAR(1),               /* 1ST BYTE OF LRBMCIC           */ 00293000
*         5 LRBMFSD BIT(1),         /* SYSTEM DAMAGE                 */ 00294000
*         5 LRBMFPD BIT(1),         /* PROCESSING DAMAGE             */ 00295000
*         5 LRBMFSR BIT(1),         /* SYSTEM RECOVERY               */ 00296000
*         5 LRBMFTD BIT(1),         /* TIMER DAMAGE                  */ 00297000
*         5 LRBMFCD BIT(1),         /* CLOCK DAMAGE                  */ 00298000
*         5 LRBMFED BIT(1),         /* EXTERNAL DAMAGE               */ 00299000
*         5 * BIT(1),               /* RESERVED                      */ 00300000
*         5 LRBMFDG BIT(1),         /* DEGRADATION                   */ 00301000
*        4 * CHAR(1),               /* 2ND BYTE OF LRBMCIC           */ 00302000
*         5 LRBMFWN BIT(1),         /* POWER WARNING                 */ 00303000
*         5 * BIT(5),               /* RESERVED                      */ 00304000
*         5 LRBMIBU BIT(1),         /* BACK UP INDICATOR             */ 00305000
*         5 LRBMIDY BIT(1),         /* DELAYED                       */ 00306000
*        4 * CHAR(1),               /* 3RD BYTE OF LRBMCIC           */ 00307000
*         5 LRBMFSE BIT(1),         /* STORAGE ERROR                 */ 00308000
*         5 LRBMFSC BIT(1),         /* STORAGE ERROR CORRECTED       */ 00309000
*         5 LRBMFKE BIT(1),         /* KEY ERROR                     */ 00310000
*         5 * BIT(1),               /* RESERVED                      */ 00311000
*         5 LRBMVWP BIT(1),         /* PSW EMWP VALIDITY             */ 00312000
*         5 LRBMVMS BIT(1),         /* PSW MASKS AND KEY VALIDITY    */ 00313000
*         5 LRBMVPM BIT(1),         /* PROGRAM MASKS AND CONDITION 0030 00314000
*                                      CODE VALIDITY                 */ 00315000
*         5 LRBMVIA BIT(1),         /* INSTRUCTION ADDRESS VALIDITY  */ 00316000
*        4 * CHAR(1),               /* 4TH BYTE OF LRBMCIC           */ 00317000
*         5 LRBMVFA BIT(1),         /* FAILING STORAGE ADDR VALIDITY */ 00318000
*         5 LRBMVRC BIT(1),         /* REGION CODE VALIDITY          */ 00319000
*         5 * BIT(1),               /* RESERVED                      */ 00320000
*         5 LRBMVFP BIT(1),         /* FLOATING POINT REG VALIDITY   */ 00321000
*         5 LRBMVGR BIT(1),         /* GENERAL PURPOSE REG VALIDITY  */ 00322000
*         5 LRBMVCR BIT(1),         /* CONTROL REG VALIDITY          */ 00323000
*         5 LRBMVLG BIT(1),         /* LOGOUT (MCEL) VALIDITY        */ 00324000
*         5 LRBMVST BIT(1),         /* STORAGE LOGICAL VALIDITY      */ 00325000
*        4 * CHAR(1),               /* 5TH BYTE OF LRBMCIC (RESERVED)*/ 00326000
*        4 * CHAR(1),               /* 6TH BYTE OF LRBMCIC           */ 00327000
*         5 * BIT(6),               /* RESERVED                      */ 00328000
*         5 LRBMVPT BIT(1),         /* PROCESSOR TIMER VALIDITY      */ 00329000
*         5 LRBMVCC BIT(1),         /* CLOCK COMPARATOR VALIDITY     */ 00330000
*        4 LRBMCELL FIXED(16) UNSIGNED,/* MACHINE CHECK EXTENDED   0030 00331000
*                                      LOGOUT LENGTH (ACTUAL LENGTH     00332000
*                                      OF MCEL DATA STORED FOR THIS     00333000
*                                      MACHINE CHECK INTERRUPTION)   */ 00334000
*       3 * CHAR(8),                /* DATA MOVED FROM STORAGE     0030 00335000
*                                      LOCATIONS 240-247             */ 00336000
*       3 LRBMFSA PTR(31),          /* FAILING STORAGE ADDRESS (MOVED   00337000
*                                      FROM STORAGE LOCATIONS 248-251*/ 00338000
*       3 * CHAR(260),              /* DATA MOVED FROM STORAGE     0030 00339000
*                                      LOCATIONS 252-511             */ 00340000
*      2 LRBMCEL CHAR(*);           /* MACHINE CHECK EXTENDED LOGOUT    00341000
*                                      AREA (LENGTH IS MODEL       0030 00342000
*                                      DEPENDENT AND VARIES FROM   0030 00343000
*                                      MACHINE CHECK TO MACHINE CHECK   00344000
*                                      FOR A GIVEN MODEL - THE ACTUAL   00345000
*                                      LENGTH IS CONTAINED IN THE  0030 00346000
*                                      HALFWORD FIELD 'LRBMCELL', THE   00347000
*                                      MAXIMUM LENGTH IS CONTAINED IN   00348000
*                                      THE HALFWORD FIELD 'LRBHMCEL',   00349000
*                                      AND THE MINIMUM LENGTH IS   0030 00350000
*                                      ZERO)                         */ 00351000
*                                                                  0030 00352000
*   /*****************************************************************/ 00353000
*   /*                                                               */ 00354000
*   /* RECONFIGURATION (DDR) RECORD                                  */ 00355000
*   /*                                                               */ 00356000
*   /*****************************************************************/ 00357000
*                                                                  0031 00358000
*   DCL                                                            0031 00359000
*     1 LRBRDDR DEF(LRBBASE) BDY(WORD),                            0031 00360000
*      2 LRBRJOB CHAR(8),           /* 'FROM' DEVICE USER'S JOB NAME */ 00361000
*      2 LRBRVOL1 CHAR(6),          /* VOLUME MOUNTED ON 'FROM'    0031 00362000
*                                      DEVICE                        */ 00363000
*      2 LRBRVOL2 CHAR(6),          /* VOLUME MOUNTED ON 'TO' DEVICE */ 00364000
*      2 LRBRPH1 CHAR(1),           /* PHYSICAL ID OF DEVICE         */ 00365000
*      2 LRBRCUA1 CHAR(3),          /* PRIMARY CUA OF 'FROM'DEVICE   */ 00366000
*      2 LRBRDEV1 CHAR(4),          /* 'FROM' DEVICE TYPE            */ 00367000
*      2 LRBRPH2 CHAR(1),           /* PHYSICAL ID OF 'TO' DEVICE    */ 00368000
*      2 LRBRCUA2 CHAR(3),          /* PRIMARY CUA OF 'TO' DEVICE    */ 00369000
*      2 LRBRDEV2 CHAR(4);          /* 'TO' DEVICE TYPE              */ 00370000
*                                                                  0031 00371000
*   /*****************************************************************/ 00372000
*   /*                                                               */ 00373000
*   /* CHANNEL CHECK HANDLER RECORD                                  */ 00374000
*   /*                                                               */ 00375000
*   /*****************************************************************/ 00376000
*                                                                  0032 00377000
*   DCL                                                            0032 00378000
*     1 LRBCCCH DEF(LRBBASE) BDY(WORD),                            0032 00379000
*      2 LRBCJOB CHAR(8),           /* JOBNAME OF JOB WHOSE I/O    0032 00380000
*                                      RESULTED IN A CHANNEL ERROR   */ 00381000
*      2 LRBCAIO(8) CHAR(2),        /* ADDRESSES OF ACTIVE I/O (2  0032 00382000
*                                      BYTES PER ADDRESS)            */ 00383000
*      2 LRBCFCCW CHAR(8),          /* FAILING CCW                   */ 00384000
*      2 LRBCFCSW CHAR(8),          /* CSW STORED AT FAILURE         */ 00385000
*      2 LRBCECSW CHAR(4),          /* EXTENDED CSW                  */ 00386000
*      2 LRBCDEVT CHAR(4),          /* DEVICE TYPE (FROM UCB)        */ 00387000
*      2 LRBCCHID CHAR(1),          /* ID OF FAILING CHANNEL         */ 00388000
*/*                                    00 UNKNOWN TYPE             0032 00389000
*                                      01 INTEGRATED MULTIPLEXOR   0032 00390000
*                                      02 INTEGRATED SELECTOR      0032 00391000
*                                      03 INTEGRATED BLOCK         0032 00392000
*                                         MULTIPLEXOR              0032 00393000
*                                      04 RESERVED                 0032 00394000
*                                      05 2860 SELECTOR            0032 00395000
*                                      06 2870 MULTIPLEXOR         0032 00396000
*                                      07 2880 BLOCK MULTIPLEXOR   0032 00397000
*                                      08 NS SELECTOR              0032 00398000
*                                      09 RESERVED                 0032 00399000
*                                      0A INTEGRATED FILE ADAPTER  0032 00400000
*                                      0B-FF RESERVED                */ 00401000
*                                                                  0032 00402000
*      2 LRBCCUA CHAR(3),           /* ADDRESS OF CHANNEL AND UNIT IN   00403000
*                                      USE AT TIME OF FAILURE        */ 00404000
*       3 * CHAR(1),                                               0032 00405000
*       3 LRBCCUA2 CHAR(2),         /* 2 BYTE CHANNEL AND UNIT     0032 00406000
*                                      ADDRESS AT TIME OF FAILURE    */ 00407000
*      2 LRBCHCUA CHAR(2),          /* CHANNEL AND UNIT ADDRESS    0032 00408000
*                                      LOGGED BY HARDWARE            */ 00409000
*      2 LRBCLOGL CHAR(2),          /* LENGTH OF CHANNEL LOGOUT      */ 00410000
*      2 LRBCCLOG CHAR(*);          /* CHANNEL LOGOUT. LENGTH      0032 00411000
*                                      DEPENDANT UPON CHANNEL TYPE   */ 00412000
*   DCL                                                            0033 00413000
*     1 LRBCVAR BASED,              /* CCH VARIABLE POSITION DATA    */ 00414000
*      2 LRBCFT CHAR(2),            /* CCH FOOTPRINTS                */ 00415000
*      2 LRBCRESD CHAR(2),          /* RESERVED                      */ 00416000
*      2 LRBCMPF1 CHAR(1),          /* MP INFORMATION FLAG BYTE ,  0033 00417000
*                                      RESERVED                      */ 00418000
*      2 LRBCMPF2 CHAR(1),          /* MP INFORMATION FLAG BYTE ,  0033 00419000
*                                      RESERVED                      */ 00420000
*      2 LRBCMPNO CHAR(2),          /* NUMBER OF ACTIVE PROCESSORS   */ 00421000
*      2 LRBCMP(*),                 /* MP CPU ID AND CHANNEL STATUS     00422000
*                                      (FOUR BYTES PER CPU)          */ 00423000
*       3 LRBCMPPA CHAR(2),         /* ADDRESS OF CPU WITH A CHANNEL    00424000
*                                      DETECTED ERROR                */ 00425000
*       3 LRBCMPCS CHAR(2);         /* CHANNEL STATUS (ONLINE OR   0033 00426000
*                                      OFFLINE). OFFLINE=1, BIT 0 =     00427000
*                                      CHANNEL 0 ETC.                */ 00428000
*                                                                  0033 00429000
*   /*****************************************************************/ 00430000
*   /*                                                               */ 00431000
*   /* MISCELLANEOUS DATA RECORDER (MDR) RECORD                      */ 00432000
*   /*                                                               */ 00433000
*   /*****************************************************************/ 00434000
*                                                                  0034 00435000
*   DCL                                                            0034 00436000
*     1 LRBDMDR DEF(LRBBASE) BDY(WORD),                            0034 00437000
*      2 LRBDCUA1 CHAR(2),          /* PRIMARY DEVICE CUA            */ 00438000
*      2 LRBDVOL CHAR(6),           /* VOLUME SERIAL NUMBER          */ 00439000
*      2 LRBDSENS CHAR(24);         /* DEVICE SENSE DATA             */ 00440000
*                                                                  0034 00441000
*   /*****************************************************************/ 00442000
*   /*                                                               */ 00443000
*   /* MISSING INTERRUPTION HANDLER (MIH) RECORD                     */ 00444000
*   /*                                                               */ 00445000
*   /*****************************************************************/ 00446000
*                                                                  0035 00447000
*   DCL                                                            0035 00448000
*     1 LRBNMIH DEF(LRBBASE) BDY(WORD),                            0035 00449000
*      2 LRBNJOB CHAR(8),           /* I/O REQUEST PENDING JOBNAME   */ 00450000
*      2 LRBNCUA2 CHAR(3),          /* DEVICE CUA                    */ 00451000
*      2 LRBNCUA1 CHAR(3),          /* PRIMARY DEVICE CUA            */ 00452000
*      2 LRBNVOL CHAR(6),           /* VOLUME SERIAL NUMBER          */ 00453000
*      2 LRBNDEVT CHAR(4),          /* DEVICE UCB TYPE               */ 00454000
*      2 LRBNINT CHAR(8);           /* TIME INTERVAL                 */ 00455000
*                                                                  0035 00456000
*   /*****************************************************************/ 00457000
*   /*                                                               */ 00458000
*   /* SYSTEM TERMINATION RECORD                                     */ 00459000
*   /*                                                               */ 00460000
*   /*****************************************************************/ 00461000
*                                                                  0036 00462000
*   DCL                                                            0036 00463000
*     1 LRBTTER DEF(LRBBASE) BDY(WORD),                            0036 00464000
*      2 LRBTLNH FIXED(31),         /* LOGREC RECORD LENGTH          */ 00465000
*      2 LRBTWSC CHAR(4),           /* WAIT STATE CODE               */ 00466000
*      2 LRBTUSR CHAR(*);           /* USER DATA FIELD             0036 00467000
*                                                                    */ 00468000
*                                                                  0037 00469000
*/* **************************************************************** */ 00470000
*/*                                                                  */ 00471000
*/*            PREFIXED SAVE AREA                                    */ 00472000
*/*                                                                  */ 00473000
*/*  OS/VS2 RELEASE 2, 11/15/73, LEVEL=24                            */ 00474000
*/*                                                                  */ 00475000
*/*  METHOD OF ACCESS                                                */ 00476000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 00477000
*/*             USING ON PSA GIVES ADDRESSABILITY FOR ALL SYMBOLS.   */ 00478000
*/*      PL/S - PSA WILL BE BASED(0) FOR PL/S I OR LOCATION(0) FOR   */ 00479000
*/*             PL/S II UNLESS %PSABASE IS SET TO SOME OTHER VALUE   */ 00480000
*/*             BEFORE INCLUDE FOR MACRO.                            */ 00481000
*/*                                                                  */ 00482000
*/*  NOTE                                                            */ 00483000
*/*      THE LABELS BEGINNING WITH PSA OR FLC ARE THE PROPER LABELS  */ 00484000
*/*      TO USE.  THE OTHER LABELS ARE GIVEN AS ALIAS NAMES FOR      */ 00485000
*/*      COMPATIBILITY WITH LABELS USED FOR SYSTEM 360 LOW CORE.     */ 00486000
*/*                                                                  */ 00487000
*/* **************************************************************** */ 00488000
*                                                                  0037 00489000
*   DECLARE                                                        0037 00490000
*     1 PSA LOCATION(0) BDY(DWORD),                                0037 00491000
*      2 FLCRNPSW CHAR(8) BDY(DWORD),/* RESTART NEW PSW (AFTER IPL)  */ 00492000
*       3 FLCIPPSW CHAR(8) BDY(DWORD),/* IPL PSW                     */ 00493000
*      2 FLCROPSW CHAR(8) BDY(DWORD),/* RESTART OLD PSW (AFTER IPL)  */ 00494000
*       3 FLCICCW1 CHAR(8) BDY(DWORD),/* IPL CCW1                    */ 00495000
*      2 FLCICCW2 CHAR(8) BDY(DWORD),/* IPL CCW2                     */ 00496000
*       3 FLCCVT PTR(31),           /* ADDRESS OF CVT (AFTER IPL)    */ 00497000
*       3 * CHAR(4),                /* RESERVED (AFTER IPL)          */ 00498000
*      2 FLCEOPSW CHAR(8) BDY(DWORD),/* EXTERNAL OLD PSW             */ 00499000
*      2 FLCSOPSW CHAR(8) BDY(DWORD),/* SVC OLD PSW                  */ 00500000
*      2 FLCPOPSW CHAR(8) BDY(DWORD),/* PROGRAM CHECK OLD PSW        */ 00501000
*      2 FLCMOPSW CHAR(8) BDY(DWORD),/* MACHINE CHECK OLD PSW        */ 00502000
*      2 FLCIOPSW CHAR(8) BDY(DWORD),/* INPUT/OUTPUT OLD PSW         */ 00503000
*      2 FLCCSW CHAR(8) BDY(DWORD), /* CHANNEL STATUS WORD           */ 00504000
*      2 FLCCAW CHAR(4) BDY(WORD),  /* CHANNEL ADDRESS WORD          */ 00505000
*      2 FLCCVT2 PTR(31),           /* ADDRESS OF CVT - USED BY DUMP    00506000
*                                      ROUTINES ICB319               */ 00507000
*      2 FLCTIMER CHAR(4),          /* TIMER                         */ 00508000
*      2 FLCTRACE PTR(31),          /* ADDRESS OF TRACE TABLE HEADER */ 00509000
*      2 FLCENPSW CHAR(8) BDY(DWORD),/* EXTERNAL NEW PSW             */ 00510000
*      2 FLCSNPSW CHAR(8) BDY(DWORD),/* SVC NEW PSW                  */ 00511000
*      2 FLCPNPSW CHAR(8) BDY(DWORD),/* PROGRAM CHECK NEW PSW        */ 00512000
*      2 FLCMNPSW CHAR(8) BDY(DWORD),/* MACHINE CHECK NEW PSW        */ 00513000
*      2 FLCINPSW CHAR(8) BDY(DWORD),/* INPUT/OUTPUT NEW PSW         */ 00514000
*      2 * CHAR(4),                 /* RESERVED                      */ 00515000
*      2 PSAEEPSW CHAR(4) BDY(WORD),/* EXTENDED PSW DATA STORED ON 0037 00516000
*                                      EXTERNAL INTERRUPT MDC084     */ 00517000
*       3 PSASPAD FIXED(15),        /* ISSUING PROCESSOR'S PHYSICAL     00518000
*                                      ADDRESS ON EMS OR EXTERNAL  0037 00519000
*                                      CALL INTERRUPT MDC046         */ 00520000
*       3 FLCEICOD FIXED(15),       /* EXTERNAL INTERRUPTION CODE    */ 00521000
*      2 PSAESPSW CHAR(4) BDY(WORD),/* EXTENDED PSW DATA STORED ON 0037 00522000
*                                      SVC INTERRUPT MDC085          */ 00523000
*       3 * CHAR(1),                /* RESERVED - SET TO ZERO        */ 00524000
*       3 FLCSVILC PTR(8),          /* SVC INSTRUCTION LENGTH COUNTER   00525000
*                                      - NUMBER OF BYTES MDC079      */ 00526000
*        4 * BIT(5),                /* ALWAYS ZERO                   */ 00527000
*        4 FLCSILCB BIT(3),         /* SIGNIFICANT BITS IN ILC FIELD    00528000
*                                      - LAST BIT IS ALWAYS ZERO   0037 00529000
*                                      MDC080                        */ 00530000
*       3 FLCSVCN FIXED(15),        /* SVC INTERRUPTION CODE - SVC 0037 00531000
*                                      NUMBER MDC081                 */ 00532000
*      2 PSAEPPSW CHAR(8) BDY(WORD),/* EXTENDED PSW FOR PROGRAM    0037 00533000
*                                      INTERRUPT MDC086              */ 00534000
*       3 * CHAR(1),                /* RESERVED - SET TO ZERO        */ 00535000
*       3 FLCPIILC PTR(8),          /* PROGRAM INSTRUCTION LENGTH  0037 00536000
*                                      COUNTER - NUMBER OF BYTES IN     00537000
*                                      INSTRUCTION CAUSING PROGRAM 0037 00538000
*                                      INTERRUPTION MDC082           */ 00539000
*        4 * BIT(5),                /* ALWAYS ZERO                   */ 00540000
*        4 FLCPILCB BIT(3),         /* SIGNIFICANT BITS IN ILC FIELD    00541000
*                                      - LAST BIT IS ALWAYS ZERO   0037 00542000
*                                      MDC083                        */ 00543000
*       3 FLCPICOD FIXED(15),       /* PROGRAM INTERRUPTION CODE     */ 00544000
*        4 PSARV049 CHAR(1),        /* RESERVED FOR IMPRECISE      0037 00545000
*                                      INTERRUPTS MDC087             */ 00546000
*        4 PSAPICOD PTR(8),         /* 8-BIT INTERRUPT CODE MDC088   */ 00547000
*         5 PSAPIPER BIT(1),        /* PER INTERRUPT OCCURRED MDC089 */ 00548000
*         5 PSAPIMC BIT(1),         /* MONITOR CALL INTERRUPT      0037 00549000
*                                      OCCURRED MDC090               */ 00550000
*         5 PSAPIPC BIT(6),         /* AN UNSOLICITED PROGRAM CHECK     00551000
*                                      HAS OCCURRED IF ANY OF THESE 6   00552000
*                                      BITS ARE ON MDC091            */ 00553000
*       3 FLCTEA PTR(31),           /* TRANSLATION EXCEPTION ADDRESS */ 00554000
*        4 * CHAR(1),               /* RESERVED - SET TO ZERO        */ 00555000
*        4 FLCTEAA PTR(24),         /* TRANSLATION EXCEPTION ADDRESS */ 00556000
*      2 * CHAR(1),                 /* RESERVED - SET TO ZERO        */ 00557000
*      2 FLCMCNUM PTR(8),           /* MONITOR CLASS NUMBER          */ 00558000
*      2 FLCPERCD CHAR(1),          /* PROGRAM EVENT RECORDING CODE  */ 00559000
*      2 * CHAR(1),                 /* RESERVED - SET TO ZERO        */ 00560000
*      2 FLCPER PTR(31),            /* PER ADDRESS                   */ 00561000
*       3 * CHAR(1),                /* RESERVED - SET TO ZERO        */ 00562000
*       3 FLCPERA PTR(24),          /* PER ADDRESS                   */ 00563000
*      2 * CHAR(1),                 /* RESERVED - SET TO ZERO        */ 00564000
*      2 FLCMTRCD CHAR(3),          /* MONITOR CODE                  */ 00565000
*      2 * CHAR(8),                 /* RESERVED                      */ 00566000
*      2 FLCMCLA CHAR(344) BDY(DWORD),/* MACHINE CHECK LOGOUT AREA   */ 00567000
*       3 FLCCHNID CHAR(4),         /* CHANNEL ID                    */ 00568000
*       3 FLCIOEL PTR(31),          /* SAME AS FLCIOELA BELOW        */ 00569000
*        4 * CHAR(1),               /* RESERVED                      */ 00570000
*        4 FLCIOELA PTR(24),        /* I/O EXTENDED LOGOUT (IOEL)  0037 00571000
*                                      POINTER                       */ 00572000
*       3 FLCLCL CHAR(4),           /* LIMITED CHANNEL LOGOUT (ECSW) */ 00573000
*       3 * CHAR(2),                /* RESERVED                      */ 00574000
*       3 * CHAR(1),                /* RESERVED MDC051               */ 00575000
*       3 * CHAR(1),                /* RESERVED MDC052               */ 00576000
*       3 FLCIOA PTR(31),           /* I/O ADDRESS                   */ 00577000
*        4 * CHAR(1),               /* RESERVED                      */ 00578000
*        4 FLCIOAA PTR(24),         /* I/O ADDRESS                   */ 00579000
*       3 * CHAR(44),               /* RESERVED                      */ 00580000
*       3 FLCMCIC CHAR(8),          /* MACHINE-CHECK INTERRUPTION  0037 00581000
*                                      CODE                          */ 00582000
*       3 * CHAR(8),                /* RESERVED                      */ 00583000
*       3 FLCFSA PTR(31),           /* FAILING STORAGE ADDRESS       */ 00584000
*        4 * CHAR(1),               /* ZEROES                        */ 00585000
*        4 FLCFSAA PTR(24),         /* FAILING STORAGE ADDRESS       */ 00586000
*       3 FLCRGNCD CHAR(4),         /* REGION CODE                   */ 00587000
*       3 FLCFLA CHAR(96) BDY(WORD),/* FIXED LOGOUT AREA             */ 00588000
*       3 FLCFPSAV CHAR(32) BDY(DWORD),/* FLOATING POINT REGISTER  0037 00589000
*                                      SAVE AREA                     */ 00590000
*       3 FLCGRSAV(16) FIXED(31),   /* GENERAL REGISTER SAVE AREA    */ 00591000
*       3 FLCCRSAV(16) FIXED(31),   /* CONTROL REGISTER SAVE AREA    */ 00592000
*      2 FLCHDEND CHAR(0) BDY(DWORD),/* END OF HARDWARE ASSIGNMENTS  */ 00593000
*      2 PSAPSA CHAR(4) BDY(WORD),  /* CONTROL BLOCK ACRONYM IN    0037 00594000
*                                      EBCDIC                        */ 00595000
*      2 PSACPUPA PTR(15),          /* PHYSICAL CPU ADDRESS (CHANGED    00596000
*                                      DURING ACR) (MDC130)    YM3489*/ 00597000
*      2 PSACPULA PTR(15),          /* LOGICAL CPU ADDRESS           */ 00598000
*      2 PSAPCCAV PTR(31),          /* VIRTUAL ADDRESS OF PCCA       */ 00599000
*      2 PSAPCCAR PTR(31),          /* REAL ADDRESS OF PCCA          */ 00600000
*      2 PSALCCAV PTR(31),          /* VIRTUAL ADDRESS OF LCCA       */ 00601000
*      2 PSALCCAR PTR(31),          /* REAL ADDRESS OF LCCA          */ 00602000
*      2 PSATNEW PTR(31),           /* TCB NEW POINTER               */ 00603000
*      2 PSATOLD PTR(31),           /* TCB OLD POINTER               */ 00604000
*      2 PSAANEW PTR(31),           /* ASCB NEW POINTER              */ 00605000
*      2 PSAAOLD PTR(31),           /* ASCB OLD POINTER              */ 00606000
*      2 PSASUPER CHAR(4) BDY(WORD),/* SUPERVISOR CONTROL WORD       */ 00607000
*       3 PSASUP1 BIT(8),           /* FIRST BYTE OF PSASUPER        */ 00608000
*        4 PSAIO BIT(1),            /* I/O FLIH                      */ 00609000
*        4 PSASVC BIT(1),           /* SVC FLIH                      */ 00610000
*        4 PSAEXT BIT(1),           /* EXTERNAL FLIH                 */ 00611000
*        4 PSAPI BIT(1),            /* PROGRAM CHECK FLIH            */ 00612000
*        4 PSALOCK BIT(1),          /* LOCK ROUTINE                  */ 00613000
*        4 PSADISP BIT(1),          /* DISPATCHER                    */ 00614000
*        4 PSAIPCDR BIT(1),         /* SIGP - DIRECT                 */ 00615000
*        4 PSAIPCRP BIT(1),         /* SIGP - REMOTE PENDING         */ 00616000
*       3 PSASUP2 BIT(8),           /* SECOND BYTE OF PSASUPER       */ 00617000
*        4 PSAIPCRI BIT(1),         /* SIGP - REMOTE IMMEDIATE       */ 00618000
*        4 PSAGTF BIT(1),           /* GTF GIVEN CONTROL FROM FLIH   */ 00619000
*        4 PSAIPCEC BIT(1),         /* EXTERNAL CALL SLIH IS ACTIVE     00620000
*                                      MDC047                        */ 00621000
*        4 PSAIPCES BIT(1),         /* EMERGENCY SIGNAL SLIH IS    0037 00622000
*                                      ACTIVE MDC048                 */ 00623000
*        4 PSAIPCE2 BIT(1),         /* EMERGENCY SIGNAL (EMS) SLIH 0037 00624000
*                                      RECURSIVE ENTRY FLAG MDC110   */ 00625000
*        4 PSAACR BIT(1),           /* AUTOMATIC CPU RECONFIGURATION    00626000
*                                      (ACR) IN CONTROL MDC119       */ 00627000
*        4 PSARTM BIT(1),           /* RECOVERY TERMINATION MONITOR     00628000
*                                      (RTM) IN CONTROL MDC120       */ 00629000
*        4 PSALCR BIT(1),           /* LOW CORE REFRESH ROUTINE IS 0037 00630000
*                                      ACTIVE MDC126                 */ 00631000
*       3 PSASUP3 BIT(8),           /* THIRD BYTE OF PSASUPER        */ 00632000
*        4 PSAIOSUP BIT(1),         /* IF ON, A MAINLINE IOS       0037 00633000
*                                      COMPONENT SUCH AS CHANNEL   0037 00634000
*                                      SCHEDULER HAS ENTERED A     0037 00635000
*                                      PHYSICALLY DISABLED STATE   0037 00636000
*                                      WITHOUT REGARD TO LOCKING   0037 00637000
*                                      REQUIREMENTS MDC127           */ 00638000
*        4 PSARV008 BIT(1),         /* RESERVED                      */ 00639000
*        4 PSARV009 BIT(1),         /* RESERVED                      */ 00640000
*        4 PSARV010 BIT(1),         /* RESERVED                      */ 00641000
*        4 PSARV011 BIT(1),         /* RESERVED                      */ 00642000
*        4 PSARV012 BIT(1),         /* RESERVED                      */ 00643000
*        4 PSARV013 BIT(1),         /* RESERVED                      */ 00644000
*        4 PSARV014 BIT(1),         /* RESERVED                      */ 00645000
*       3 PSASUP4 BIT(8),           /* FOURTH BYTE OF PSASUPER       */ 00646000
*        4 PSARV015 BIT(1),         /* RESERVED                      */ 00647000
*        4 PSARV016 BIT(1),         /* RESERVED                      */ 00648000
*        4 PSARV017 BIT(1),         /* RESERVED                      */ 00649000
*        4 PSARV018 BIT(1),         /* RESERVED                      */ 00650000
*        4 PSARV019 BIT(1),         /* RESERVED                      */ 00651000
*        4 PSARV020 BIT(1),         /* RESERVED                      */ 00652000
*        4 PSARV021 BIT(1),         /* RESERVED                      */ 00653000
*        4 PSARV022 BIT(1),         /* RESERVED                      */ 00654000
*      2 PSAGPREG(3) FIXED(31),     /* REGISTER SAVE AREA FOR I/O  0037 00655000
*                                      FLIH, SVC FLIH, EXTERNAL FLIH    00656000
*                                      AND SYSTEM TRACE              */ 00657000
*      2 PSARSREG FIXED(31),        /* RESTART FLIH REGISTER SAVE    */ 00658000
*      2 PSAPIREG FIXED(31),        /* PROGRAM CHECK FLIH REGISTER 0037 00659000
*                                      SAVE                          */ 00660000
*      2 PSAEXPS1 CHAR(8) BDY(DWORD),/* EXTERNAL FLIH PSW SAVE AREA 1*/ 00661000
*      2 PSAEXPS2 CHAR(8) BDY(DWORD),/* EXTERNAL FLIH PSW SAVE AREA 2*/ 00662000
*      2 PSAMPSW CHAR(8) BDY(DWORD),/* SETLOCK MODEL PSW             */ 00663000
*      2 PSAMCHEX CHAR(8) BDY(DWORD),/* MCH EXIT PSW                 */ 00664000
*      2 PSAIPCR CHAR(4) BDY(WORD), /* IPC INSTRUCTION TO BE EXECUTED*/ 00665000
*      2 PSAIPCRM CHAR(1),          /* BYTE USED BY ABOVE IPC      0037 00666000
*                                      INSTRUCTION                   */ 00667000
*      2 * CHAR(3),                 /* RESERVED                      */ 00668000
*      2 PSAIPCD CHAR(4) BDY(WORD), /* IPC INSTRUCTION TO BE EXECUTED*/ 00669000
*      2 PSAIPCDM CHAR(1),          /* BYTE USED BY ABOVE IPC      0037 00670000
*                                      INSTRUCTION                   */ 00671000
*      2 * CHAR(3),                 /* RESERVED                      */ 00672000
*      2 PSAIPCSA FIXED(31),        /* IPC REGISTER SAVE AREA MDC049 */ 00673000
*      2 PSAHLHIS FIXED(31),        /* SAVE AREA FOR PSAHLHI MDC050  */ 00674000
*      2 PSARECUR CHAR(1),          /* RESTART FLIH RECURSION      0037 00675000
*                                      INDICATOR. IF X'00', FLIH NOT    00676000
*                                      IN CONTROL. IF X'FF', FLIH IN    00677000
*                                      CONTROL, ENTRY IS RECURSIVE 0037 00678000
*                                      MDC093                        */ 00679000
*      2 PSADSSGO PTR(8),           /* INITIALIZE DSS FLAG, SET BY 0037 00680000
*                                      OPERATOR. IF X'00', DSS NOT TO   00681000
*                                      BE ACTIVATED. IF NOT X'00', 0037 00682000
*                                      NEXT RESTART INTERRUPT FROM 0037 00683000
*                                      CONSOLE SHOULD INITIALIZE DSS.   00684000
*                                      MDC094                        */ 00685000
*      2 PSARV050 FIXED(15),        /* RESERVED                      */ 00686000
*      2 PSASRSA PTR(31),           /* REAL ADDRESS OF SAVE AREA USED   00687000
*                                      DURING STOP AND RESTART     0037 00688000
*                                      SUBROUTINE MDC095             */ 00689000
*      2 PSACLHT CHAR(56) BDY(WORD),/* CPU LOCKS HELD TABLE.       0037 00690000
*                                      INITIALIZED TO ZERO. IF LOCK     00691000
*                                      IS HELD, WORD REPRESENTING  0037 00692000
*                                      LOCK HAS ITS ADDRESS.         */ 00693000
*       3 PSADISPL PTR(31),         /* GLOBAL DISPATCHER LOCK        */ 00694000
*       3 PSAASML PTR(31),          /* AUXILIARY STORAGE MANAGEMENT     00695000
*                                      (ASM) LOCK MDC002             */ 00696000
*       3 PSASALCL PTR(31),         /* SPACE ALLOCATION LOCK MDC003  */ 00697000
*       3 PSAIOSSL PTR(31),         /* IOS SYNCHRONIZATION LOCK    0037 00698000
*                                      MDC010                        */ 00699000
*       3 PSAIOSCL PTR(31),         /* IOS CHANNEL AVAILABLE TABLE 0037 00700000
*                                      LOCK MDC004                   */ 00701000
*       3 PSAIOSUL PTR(31),         /* IOS UNIT CONTROL BLOCK LOCK 0037 00702000
*                                      MDC005                        */ 00703000
*       3 PSAIOSLL PTR(31),         /* IOS LOGICAL CHANNEL QUEUE LOCK   00704000
*                                      MDC006                        */ 00705000
*       3 PSATPNCL PTR(31),         /* TCAM'S TPNCP LOCK MDC007      */ 00706000
*       3 PSATPDNL PTR(31),         /* TCAM'S TPDNCB LOCK MDC008     */ 00707000
*       3 PSATPACL PTR(31),         /* TCAM'S TPACBDEB LOCK MDC009   */ 00708000
*       3 PSAOPTL PTR(31),          /* OPTIMIZER LOCK                */ 00709000
*       3 PSACMSL PTR(31),          /* CROSS MEMORY SERVICES LOCK    */ 00710000
*       3 PSALOCAL PTR(31),         /* LOCAL LOCK                    */ 00711000
*       3 PSARV023 PTR(31),         /* RESERVED LOCK                 */ 00712000
*      2 PSALKSA CHAR(64) BDY(WORD),/* SETLOCK REGISTER SAVE AREA    */ 00713000
*       3 PSALKR0 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 0 */ 00714000
*       3 PSALKR1 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 1 */ 00715000
*       3 PSALKR2 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 2 */ 00716000
*       3 PSALKR3 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 3 */ 00717000
*       3 PSALKR4 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 4 */ 00718000
*       3 PSALKR5 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 5 */ 00719000
*       3 PSALKR6 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 6 */ 00720000
*       3 PSALKR7 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 7 */ 00721000
*       3 PSALKR8 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 8 */ 00722000
*       3 PSALKR9 FIXED(31),        /* SETLOCK'S CALLER'S REGISTER 9 */ 00723000
*       3 PSALKR10 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 10*/ 00724000
*       3 PSALKR11 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 11*/ 00725000
*       3 PSALKR12 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 12*/ 00726000
*       3 PSALKR13 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 13*/ 00727000
*       3 PSALKR14 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 14*/ 00728000
*       3 PSALKR15 FIXED(31),       /* SETLOCK'S CALLER'S REGISTER 15*/ 00729000
*      2 PSAHLHI CHAR(4) BDY(WORD), /* HIGHEST LOCK HELD INDICATOR   */ 00730000
*       3 PSACLHS BIT(32) BDY(WORD),/* CPU LOCKS HELD STRING MDC122  */ 00731000
*      2 PSALITA PTR(31),           /* ADDRESS OF LOCK INTERFACE   0037 00732000
*                                      TABLE                         */ 00733000
*      2 PSAPSWSV CHAR(8) BDY(DWORD),/* PSW SAVE AREA FOR DISPATCHER    00734000
*                                      AND ACR                       */ 00735000
*      2 PSACR0 FIXED(31),          /* SAVE AREA FOR CONTROL REGISTER   00736000
*                                      0                             */ 00737000
*      2 PSAMCHFL BIT(8),           /* MCH RECURSION FLAGS           */ 00738000
*      2 PSASYMSK CHAR(1),          /* THIS FIELD WILL BE USED IN  0037 00739000
*                                      CONJUNCTION WITH THE STNSM  0037 00740000
*                                      INSTRUCTION TO PLACE IOS    0037 00741000
*                                      CHANNEL SCHEDULER INTO A    0037 00742000
*                                      DISABLED STATE AND          0037 00743000
*                                      SIMULTANEOUSLY SAVE THE SYSTEM   00744000
*                                      MASK OF THE CALLER MDC022     */ 00745000
*      2 PSARV061 CHAR(1),          /* RESERVED (MDC060)       YM4244*/ 00746000
*      2 PSAMCHIC CHAR(1),          /* MCH INITIALIZATION COMPLETE 0037 00747000
*                                      FLAGS MDC098                  */ 00748000
*      2 PSAWKRAP PTR(31),          /* REAL ADDRESS OF VARY CPU    0037 00749000
*                                      PARAMETER LIST MDC106         */ 00750000
*      2 PSAWKVAP PTR(31),          /* VIRTUAL ADDRESS OF VARY CPU 0037 00751000
*                                      PARAMETER LIST MDC107         */ 00752000
*      2 PSAVSTAP FIXED(15),        /* WORK AREA FOR VARY CPU MDC108 */ 00753000
*      2 PSACPUSA PTR(15),          /* PHYSICAL CPU ADDRESS (STATIC)    00754000
*                                      (MDC131)                YM3489*/ 00755000
*      2 PSASTOR FIXED(31),         /* MASTER MEMORY'S SEGMENT TABLE    00756000
*                                      ORIGIN REGISTER (STOR) VALUE  */ 00757000
*      2 PSADSSRS FIXED(31),        /* REGISTER SAVE FOR DSS PROGRAM    00758000
*                                      AND SVC INTERRUPT HANDLERS  0037 00759000
*                                      MDC053                        */ 00760000
*      2 PSADSSR2 FIXED(31),        /* REGISTER SAVE AREA FOR DSS I/O   00761000
*                                      AND EXTERNAL INTERRUPT      0037 00762000
*                                      HANDLERS MDC054               */ 00763000
*      2 PSADSSR3 FIXED(31),        /* REGISTER SAVE AREA FOR DSS  0037 00764000
*                                      ERROR RECOVERY ROUTINE MDC055 */ 00765000
*      2 PSADSSWK FIXED(31),        /* WORK AREA FOR DSS INTERRUPT 0037 00766000
*                                      HANDLERS MDC056               */ 00767000
*      2 PSADSSTS(5) FIXED(31),     /* REGISTER SAVE FOR DSS MODULES    00768000
*                                      MAKING CALLS TO IQATSS MDC023 */ 00769000
*      2 PSADSSFL CHAR(4) BDY(WORD),/* DSS FLAG BYTES MDC024         */ 00770000
*       3 PSADSSF1 BIT(8),          /* DSS STATUS BYTE MDC029        */ 00771000
*        4 PSADSSMV BIT(1),         /* DSS MONITORING, VS2 RUNNING 0037 00772000
*                                      MDC030                        */ 00773000
*        4 PSADSSDM BIT(1),         /* DSS IN VS2-2 VM MDC031        */ 00774000
*        4 PSADSSDD BIT(1),         /* DSS IN DSS VM MDC032          */ 00775000
*        4 PSADSSDW BIT(1),         /* DSS IN DSS WAIT MDC033        */ 00776000
*        4 PSADSSTP BIT(1),         /* DSS PROCESSING SIGP MDC034    */ 00777000
*        4 PSADSSSP BIT(1),         /* DSS SIGP PENDING MDC035       */ 00778000
*        4 PSADSSOI BIT(1),         /* DSS EXECUTING OVERLAID      0037 00779000
*                                      INSTRUCTION MDC036            */ 00780000
*        4 PSADSSPI BIT(1),         /* DSS EXECUTING PRIVILEGED    0037 00781000
*                                      INSTRUCTION MDC037            */ 00782000
*       3 PSADSSF2 CHAR(1),         /* SYSTEM STATUS BYTE MDC038     */ 00783000
*       3 PSADSSF3 BIT(8),          /* DSS FLAG BYTE MDC099          */ 00784000
*        4 PSADSSGP BIT(1),         /* DSS SIGP INDICATOR MDC100     */ 00785000
*        4 PSADSSES BIT(1),         /* ERROR SHORT SAVE INDICATOR  0037 00786000
*                                      MDC113                        */ 00787000
*        4 PSADSSNM BIT(1),         /* NON-MONITORABLE CODE INDICATOR   00788000
*                                      MDC114                        */ 00789000
*        4 PSADSSRW BIT(1),         /* DSS OWNS CVTRSTWD MDC117      */ 00790000
*        4 PSARV054 BIT(1),         /* RESERVED FOR DSS MDC100       */ 00791000
*        4 PSARV055 BIT(1),         /* RESERVED FOR DSS MDC100       */ 00792000
*        4 PSARV056 BIT(1),         /* RESERVED FOR DSS MDC100       */ 00793000
*        4 PSARV057 BIT(1),         /* RESERVED FOR DSS MDC100       */ 00794000
*       3 PSADSSF4 BIT(8),          /* DSS RECURSION FLAGS MDC101    */ 00795000
*        4 PSADSSRC BIT(1),         /* PROGRAM-SVC RECURSION FLAG  0037 00796000
*                                      MDC057                        */ 00797000
*        4 PSADSS12 BIT(1),         /* PROGRAM INTERRUPT 12 RECURSION   00798000
*                                      FLAG MDC058                   */ 00799000
*        4 PSADSSIE BIT(1),         /* I/O-EXTERNAL RECURSION FLAG 0037 00800000
*                                      MDC059                        */ 00801000
*        4 PSADSSC0 BIT(1),         /* CONTROL REGISTER 0 INVALID  0037 00802000
*                                      FLAG MDC092                   */ 00803000
*        4 PSADSSDE BIT(1),         /* DAT ERROR WHILE DSS RUNNING IN   00804000
*                                      VS2 VM MDC102                 */ 00805000
*        4 PSADSSVE BIT(1),         /* DAT ERROR WHILE DSS RUNNING IN   00806000
*                                      DSS VM MDC103                 */ 00807000
*        4 PSADSS10 BIT(1),         /* SEGMENT EXCEPTION RECURSION 0037 00808000
*                                      FLAG MDC104                   */ 00809000
*        4 PSADSS05 BIT(1),         /* ADDRESSING EXCEPTION RECURSION   00810000
*                                      FLAG MDC105                   */ 00811000
*      2 PSADSSRP CHAR(8) BDY(DWORD),/* DSS TO VS2-2 RESUME PSW    0037 00812000
*                                      MDC025                        */ 00813000
*      2 PSADSSPP CHAR(8) BDY(DWORD),/* DSS PSW FOR RETURNING CONTROL   00814000
*                                      FROM PRIVILEGED INSTRUCTION 0037 00815000
*                                      STREAM TO VS2 MDC026          */ 00816000
*      2 PSADSS14 FIXED(31),        /* RESTART SECOND LEVEL INTERRUPT   00817000
*                                      HANDLER CONTROL REGISTER 14 0037 00818000
*                                      SAVE AREA MDC115              */ 00819000
*      2 PSADSSFW FIXED(31),        /* FULL-WORD DSS WORK AREA MDC116*/ 00820000
*      2 PSADSSPR FIXED(31),        /* DSS REGISTER SAVE FOR       0037 00821000
*                                      PRIVILEGED INSTRUCTION STREAM    00822000
*                                      MDC028                        */ 00823000
*      2 PSADSSED CHAR(0) BDY(WORD),/* END OF DSS FIELDS MDC045      */ 00824000
*      2 PSARV025 FIXED(31),        /* RESERVED FOR DSS              */ 00825000
*      2 PSARV040 PTR(31),          /* RESERVED FOR DSS              */ 00826000
*      2 PSARV041 PTR(31),          /* RESERVED FOR DSS              */ 00827000
*      2 PSARV042 PTR(31),          /* RESERVED FOR DSS              */ 00828000
*      2 PSARV043 PTR(31),          /* RESERVED FOR DSS              */ 00829000
*      2 PSARV044 PTR(31),          /* RESERVED FOR DSS              */ 00830000
*      2 PSARV045 PTR(31),          /* RESERVED FOR DSS              */ 00831000
*      2 PSARSVT(16) PTR(31),       /* RECOVERY STACK VECTOR TABLE 0037 00832000
*                                      (EACH ELEMENT MAPPED BELOW) 0037 00833000
*                                      MDC064                        */ 00834000
*      2 PSASRPSW CHAR(8) BDY(DWORD),/* RESUME PSW FOR STOP AND    0037 00835000
*                                      RESTART SUBROUTINE MDC096     */ 00836000
*      2 PSARSPSW CHAR(8) BDY(DWORD),/* RESUME PSW FIELD FOR RESTART    00837000
*                                      INTERRUPT HANDLER MDC097      */ 00838000
*      2 PSASTART CHAR(16) BDY(DWORD),/* START FATHOM RECORDING    0037 00839000
*                                      MDC111                        */ 00840000
*      2 PSASTOP CHAR(16) BDY(DWORD),/* STOP FATHOM RECORDING MDC112 */ 00841000
*      2 PSASFACC CHAR(4) BDY(WORD),/* SETFRR ABEND COMPLETION CODE     00842000
*                                      USED WHEN A SETFRR ADD IS   0037 00843000
*                                      ISSUED AGAINST A FULL FRR   0037 00844000
*                                      STACK MDC123                  */ 00845000
*      2 PSALSFCC CHAR(4) BDY(WORD),/* A LOAD INSTRUCTION TO PRIME 0037 00846000
*                                      REGISTER 1 WITH THE SETFRR  0037 00847000
*                                      ABEND COMPLETION CODE IN    0037 00848000
*                                      PSASFACC MDC124               */ 00849000
*      2 PSASVC13 CHAR(2),          /* AN SVC 13 INSTRUCTION MDC125  */ 00850000
*      2 PSARV059 FIXED(15),        /* RESERVED                      */ 00851000
*      2 PSARV060 FIXED(31),        /* RESERVED                      */ 00852000
*      2 PSAPCPSW CHAR(8) BDY(DWORD),/* TEMPORARY OLD PSW STORAGE FOR   00853000
*                                      PROGRAM FLIH (MDC129)   YM0943*/ 00854000
*      2 PSAUSEND CHAR(0) BDY(DWORD),/* END OF ASSIGNED FIELDS MDC109*/ 00855000
*      2 * CHAR(2040) BDY(DWORD),   /* RESERVED                      */ 00856000
*      2 PSASTAK CHAR(340) BDY(DWORD),/* NORMAL FRR STACK MDC118     */ 00857000
*      2 * CHAR(684);               /* RESERVED FOR EXPANSION OF   0037 00858000
*                                      PSASTAK MDC118                */ 00859000
*   DECLARE                                                        0038 00860000
*     FLC DEF(PSA) CHAR(LENGTH(PSA)) BDY(DWORD);                   0038 00861000
*   DECLARE                                                        0039 00862000
*     1 PSARSVTE CHAR(64) DEF(PSARSVT) BDY(WORD),/* RECOVERY STACK 0039 00863000
*                                      VECTOR TABLE MDC065           */ 00864000
*      2 PSACSTK PTR(31),           /* ADDRESS OF CURRENTLY USED   0039 00865000
*                                      FUNCTIONAL RECOVERY ROUTINE 0039 00866000
*                                      (FRR) STACK MDC061            */ 00867000
*      2 PSANSTK PTR(31),           /* ADDRESS OF NORMAL FRR STACK 0039 00868000
*                                      MDC062                        */ 00869000
*      2 PSASSTK PTR(31),           /* ADDRESS OF SVC-I/O- DISPATCHER   00870000
*                                      FRR STACK MDC063              */ 00871000
*      2 PSASSAV PTR(31),           /* ADDRESS OF INTERRUPTED STACK     00872000
*                                      SAVED BY SVC-I/O- DISPATCHER     00873000
*                                      MDC066                        */ 00874000
*      2 PSAMSTK PTR(31),           /* ADDRESS OF MCH FRR STACK    0039 00875000
*                                      MDC067                        */ 00876000
*      2 PSAMSAV PTR(31),           /* ADDRESS OF INTERRUPTED STACK     00877000
*                                      SAVED BY MCH MDC068           */ 00878000
*      2 PSAPSTK PTR(31),           /* ADDRESS OF PROGRAM CHECK FLIH    00879000
*                                      FRR STACK MDC069              */ 00880000
*      2 PSAPSAV PTR(31),           /* ADDRESS OF INTERRUPTED STACK     00881000
*                                      SAVED BY PROGRAM CHECK FLIH 0039 00882000
*                                      MDC070                        */ 00883000
*      2 PSAESTK1 PTR(31),          /* ADDRESS OF EXTERNAL FLIH FRR     00884000
*                                      STACK FOR NON- RECURSIVE    0039 00885000
*                                      ENTRIES MDC071                */ 00886000
*      2 PSAESAV1 PTR(31),          /* ADDRESS OF INTERRUPTED STACK     00887000
*                                      SAVED BY NON- RECURSIVE     0039 00888000
*                                      ENTRIES MDC072                */ 00889000
*      2 PSAESTK2 PTR(31),          /* ADDRESS OF EXTERNAL FLIH FRR     00890000
*                                      STACK FOR FIRST LEVEL       0039 00891000
*                                      RECURSIONS MDC073             */ 00892000
*      2 PSAESAV2 PTR(31),          /* ADDRESS OF INTERRUPTED STACK     00893000
*                                      SAVED BY EXTERNAL FLIH FOR  0039 00894000
*                                      FIRST LEVEL RECURSIONS MDC074 */ 00895000
*      2 PSAESTK3 PTR(31),          /* ADDRESS OF EXTERNAL FLIH FRR     00896000
*                                      STACK FOR SECOND LEVEL      0039 00897000
*                                      RECURSIONS AND ACR MDC075     */ 00898000
*      2 PSAESAV3 PTR(31),          /* ADDRESS OF INTERRUPTED STACK     00899000
*                                      SAVED BY EXTERNAL FLIH (ACR)     00900000
*                                      FOR SECOND LEVEL RECURSIONS 0039 00901000
*                                      MDC076                        */ 00902000
*      2 PSARSTK PTR(31),           /* ADDRESS OF RESTART FLIH FRR 0039 00903000
*                                      STACK MDC077                  */ 00904000
*      2 PSARSAV PTR(31);           /* ADDRESS OF INTERRUPTED STACK     00905000
*                                      SAVED BY RESTART FLIH MDC078     00906000
*                                                                    */ 00907000
*                                                                  0040 00908000
*/* **************************************************************** */ 00909000
*/*                                                                  */ 00910000
*/*            PHYSICAL CONFIGURATION COMMUNICATION AREA             */ 00911000
*/*                                                                  */ 00912000
*/*  OS/VS2 RELEASE 2, 12/22/72, LEVEL=5                             */ 00913000
*/*                                                                  */ 00914000
*/*  METHOD OF ACCESS                                                */ 00915000
*/*      BAL  - DSECT IS PRODUCED UNLESS DSECT=NO IS SPECIFIED.      */ 00916000
*/*             USING ON PCCA GIVES ADDRESSABILITY FOR ALL SYMBOLS.  */ 00917000
*/*      PL/S - DCL PCCAPTR PTR                                      */ 00918000
*/*                                                                  */ 00919000
*/* **************************************************************** */ 00920000
*                                                                  0040 00921000
*   DECLARE                                                        0040 00922000
*     1 PCCA BASED(PCCAPTR) BDY(DWORD),                            0040 00923000
*      2 PCCAPCCA CHAR(4) BDY(WORD),/* CONTROL BLOCK ACRONYM IN    0040 00924000
*                                      EBCDIC                        */ 00925000
*      2 PCCACPID CHAR(12) BDY(WORD),/* CPU ID (CONTAINS SERIAL    0040 00926000
*                                      NUMBER)                       */ 00927000
*      2 PCCACPUA PTR(15),          /* PHYSICAL CPU ADDRESS          */ 00928000
*      2 PCCACAFM BIT(16) BDY(WORD,3),/* BIT MASK CORRESPONDING TO 0040 00929000
*                                      PHYSICAL CPU ADDRESS          */ 00930000
*      2 PCCATQEP PTR(31),          /* TQE POINTER                   */ 00931000
*      2 PCCAPSAV PTR(31),          /* VIRTUAL ADDRESS OF PSA        */ 00932000
*      2 PCCAPSAR PTR(31),          /* REAL ADDRESS OF PSA           */ 00933000
*      2 PCCARV81 PTR(31),          /* RESERVED MDC005               */ 00934000
*      2 PCCARV82 PTR(31),          /* RESERVED MDC005               */ 00935000
*      2 PCCARV83 PTR(31),          /* RESERVED MDC005               */ 00936000
*      2 PCCARV84 PTR(31),          /* RESERVED MDC005               */ 00937000
*      2 PCCARV85 PTR(31),          /* RESERVED MDC005               */ 00938000
*      2 PCCARV86 PTR(31),          /* RESERVED MDC005               */ 00939000
*      2 PCCARV87 PTR(31),          /* RESERVED MDC005               */ 00940000
*      2 PCCARV88 PTR(31),          /* RESERVED MDC005               */ 00941000
*      2 PCCARV89 PTR(31),          /* RESERVED MDC005               */ 00942000
*      2 PCCARV90 PTR(31),          /* RESERVED MDC005               */ 00943000
*      2 PCCARV91 PTR(31),          /* RESERVED MDC005               */ 00944000
*      2 PCCARV92 PTR(31),          /* RESERVED MDC005               */ 00945000
*      2 PCCARV93 PTR(31),          /* RESERVED MDC005               */ 00946000
*      2 PCCARV94 PTR(31),          /* RESERVED MDC005               */ 00947000
*      2 PCCARV95 PTR(31),          /* RESERVED MDC005               */ 00948000
*      2 PCCARV96 PTR(31),          /* RESERVED MDC005               */ 00949000
*      2 PCCARV97 PTR(31),          /* RESERVED MDC005               */ 00950000
*      2 PCCARV98 PTR(31),          /* RESERVED MDC005               */ 00951000
*      2 PCCARV99 PTR(31),          /* RESERVED MDC005               */ 00952000
*      2 PCCARV9A PTR(31),          /* RESERVED MDC005               */ 00953000
*      2 PCCARV9B PTR(31),          /* RESERVED MDC005               */ 00954000
*      2 PCCARV9C PTR(31),          /* RESERVED MDC005               */ 00955000
*      2 PCCARV9D PTR(31),          /* RESERVED MDC005               */ 00956000
*      2 PCCARV9E PTR(31),          /* RESERVED MDC005               */ 00957000
*      2 PCCATMST CHAR(4) BDY(WORD),/* TIMER STATUS BYTES            */ 00958000
*       3 PCCATMFL BIT(8),          /* FIRST BYTE OF PCCATMST        */ 00959000
*        4 PCCAINIT BIT(1),         /* ENTRY HAS BEEN INITIALIZED    */ 00960000
*        4 PCCASYNC BIT(1),         /* CLOCK OUT OF SYNCHRONIZATION  */ 00961000
*        4 PCCAVKIL BIT(1),         /* VARY CPU SHOULD BE CANCELLED  */ 00962000
*        4 PCCAMCC BIT(1),          /* PROCESSING FOR PERMANENTLY  0040 00963000
*                                      DAMAGED CLOCK COMPARATOR MUST    00964000
*                                      BE DONE                       */ 00965000
*        4 PCCAMINT BIT(1),         /* PROCESSING FOR CPU TIMER MUST    00966000
*                                      BE DONE                       */ 00967000
*        4 PCCARV02 BIT(1),         /* RESERVED                      */ 00968000
*        4 PCCARV03 BIT(1),         /* RESERVED                      */ 00969000
*        4 PCCARV04 BIT(1),         /* RESERVED                      */ 00970000
*       3 PCCATODE PTR(8),          /* TOD CLOCK ERROR FLAGS         */ 00971000
*        4 PCCANUTD BIT(1),         /* CLOCK CANNOT BE USED          */ 00972000
*        4 PCCANFTD BIT(1),         /* CLOCK SHOULD NOT BE RESET     */ 00973000
*        4 PCCACTTD BIT(6),         /* ERROR COUNT                   */ 00974000
*       3 PCCACCE PTR(8),           /* FLAGS FOR CLOCK COMPARATOR    */ 00975000
*        4 PCCANUCC BIT(1),         /* CLOCK COMPARATOR CANNOT BE  0040 00976000
*                                      USED                          */ 00977000
*        4 PCCANFCC BIT(1),         /* CLOCK COMPARATOR SHOULD NOT BE   00978000
*                                      RESET                         */ 00979000
*        4 PCCACTCC BIT(6),         /* ERROR COUNT                   */ 00980000
*       3 PCCAINTE PTR(8),          /* FLAGS FOR CPU TIMER           */ 00981000
*        4 PCCANUIN BIT(1),         /* CPU TIMER CANNOT BE USED      */ 00982000
*        4 PCCANFIN BIT(1),         /* CPU TIMER SHOULD NOT BE RESET */ 00983000
*        4 PCCACTIN BIT(6),         /* ERROR COUNT                   */ 00984000
*      2 PCCARPB FIXED(31),         /* EXTERNAL CALL SIGP BUFFER     */ 00985000
*      2 PCCAEMSB CHAR(16) BDY(DWORD),/* EMERGENCY SIGNAL SIGP BUFFER*/ 00986000
*       3 PCCAEMSI CHAR(4) BDY(WORD),/* FIRST WORD OF EMS BUFFER     */ 00987000
*        4 PCCARISP BIT(8),         /* CONTAINS PARALLEL/SERIAL    0040 00988000
*                                      REQUEST INDICATOR FOR REMOTE     00989000
*                                      IMMEDIATE SIGNAL              */ 00990000
*         5 PCCAPARL BIT(1),        /* PARALLEL REQUEST MDC002       */ 00991000
*         5 PCCASERL BIT(1),        /* SERIAL REQUEST MDC003         */ 00992000
*         5 PCCARV06 BIT(1),        /* RESERVED                      */ 00993000
*         5 PCCARV07 BIT(1),        /* RESERVED                      */ 00994000
*         5 PCCARV08 BIT(1),        /* RESERVED                      */ 00995000
*         5 PCCARV09 BIT(1),        /* RESERVED                      */ 00996000
*         5 PCCARV10 BIT(1),        /* RESERVED                      */ 00997000
*         5 PCCARV11 BIT(1),        /* RESERVED                      */ 00998000
*        4 PCCAEMS2 BIT(8),         /* SECOND BYTE OF PCCAEMSI       */ 00999000
*         5 PCCARV12 BIT(1),        /* RESERVED                      */ 01000000
*         5 PCCARV13 BIT(1),        /* RESERVED                      */ 01001000
*         5 PCCARV14 BIT(1),        /* RESERVED                      */ 01002000
*         5 PCCARV15 BIT(1),        /* RESERVED                      */ 01003000
*         5 PCCARV16 BIT(1),        /* RESERVED                      */ 01004000
*         5 PCCARV17 BIT(1),        /* RESERVED                      */ 01005000
*         5 PCCARV18 BIT(1),        /* RESERVED                      */ 01006000
*         5 PCCARV19 BIT(1),        /* RESERVED                      */ 01007000
*        4 PCCAEMS3 BIT(8),         /* THIRD BYTE OF PCCAEMSI        */ 01008000
*         5 PCCARV20 BIT(1),        /* RESERVED                      */ 01009000
*         5 PCCARV21 BIT(1),        /* RESERVED                      */ 01010000
*         5 PCCARV22 BIT(1),        /* RESERVED                      */ 01011000
*         5 PCCARV23 BIT(1),        /* RESERVED                      */ 01012000
*         5 PCCARV24 BIT(1),        /* RESERVED                      */ 01013000
*         5 PCCARV25 BIT(1),        /* RESERVED                      */ 01014000
*         5 PCCARV26 BIT(1),        /* RESERVED                      */ 01015000
*         5 PCCARV27 BIT(1),        /* RESERVED                      */ 01016000
*        4 PCCARMSB BIT(8),         /* CONTAINS RMS INDICATOR        */ 01017000
*         5 PCCARV28 BIT(1),        /* RESERVED                      */ 01018000
*         5 PCCARV29 BIT(1),        /* RESERVED                      */ 01019000
*         5 PCCARV30 BIT(1),        /* RESERVED                      */ 01020000
*         5 PCCARV31 BIT(1),        /* RESERVED                      */ 01021000
*         5 PCCARV32 BIT(1),        /* RESERVED                      */ 01022000
*         5 PCCARV33 BIT(1),        /* RESERVED                      */ 01023000
*         5 PCCARV34 BIT(1),        /* RESERVED                      */ 01024000
*         5 PCCARMS BIT(1),         /* SIGP WAS ISSUED VIA RMS       */ 01025000
*       3 PCCAEMSP PTR(31),         /* REMOTE IMMEDIATE SIGNAL     0040 01026000
*                                      PARAMETER ADDRESS             */ 01027000
*       3 PCCAEMSE PTR(31),         /* REMOTE IMMEDIATE SIGNAL     0040 01028000
*                                      RECEIVING ROUTINE ENTRY POINT    01029000
*                                      ADDRESS                       */ 01030000
*       3 PCCAEMSA PTR(31),         /* PCCA ADDRESS OF THE RECEIVING    01031000
*                                      ROUTINE                       */ 01032000
*      2 PCCAPWAV PTR(31),          /* VIRTUAL ADDRESS OF MCH      0040 01033000
*                                      PROCESSOR WORK AREA           */ 01034000
*      2 PCCAPWAR PTR(31),          /* REAL ADDRESS OF MCH PROCESSOR    01035000
*                                      WORK AREA                     */ 01036000
*      2 PCCALRBV PTR(31),          /* VIRTUAL ADDRESS OF MCH LOGREC    01037000
*                                      BUFFER                        */ 01038000
*      2 PCCALRBR PTR(31),          /* REAL ADDRESS OF MCH LOGREC  0040 01039000
*                                      BUFFER                        */ 01040000
*      2 PCCACHEL CHAR(112) BDY(DWORD),/* CHANNEL LOGOUT AREA FOR  0040 01041000
*                                      2880 OR M/145                 */ 01042000
*      2 PCCAWERP CHAR(8) BDY(DWORD),/* WORK ERPIB FOR CCH           */ 01043000
*       3 PCCACHUB PTR(31),         /* UCB ADDRESS OF THE DEVICE IN     01044000
*                                      USE WHEN THE CHANNEL- DETECTED   01045000
*                                      ERROR OCCURRED. THIS FIELD IS    01046000
*                                      ZERO IF CCH HAS NOT CREATED AN   01047000
*                                      ERPIB FOR THE ERP'S.          */ 01048000
*       3 PCCACHPF BIT(8),          /* PROGRAM FLAGS. INDICATES THE     01049000
*                                      SELECTION OR INTERRUPTION   0040 01050000
*                                      SEQUENCE WHEN THE CSW WAS   0040 01051000
*                                      STORED.                       */ 01052000
*        4 PCCACSIO BIT(1),         /* THE CSW WAS STORED AFTER A  0040 01053000
*                                      START I/O INSTRUCTION WAS   0040 01054000
*                                      EXECUTED                      */ 01055000
*        4 PCCACINT BIT(1),         /* THE CSW WAS STORED AFTER AN 0040 01056000
*                                      I/O INTERRUPTION              */ 01057000
*        4 PCCACTIO BIT(1),         /* THE CSW WAS STORED AFTER A  0040 01058000
*                                      TEST I/O INSTRUCTION WAS    0040 01059000
*                                      EXECUTED                      */ 01060000
*        4 PCCACHIO BIT(1),         /* THE CSW WAS STORED AFTER A  0040 01061000
*                                      HALT I/O INSTRUCTION WAS    0040 01062000
*                                      EXECUTED                      */ 01063000
*        4 PCCARV37 BIT(1),         /* RESERVED                      */ 01064000
*        4 PCCACSNS BIT(1),         /* THE SENSE DATA WAS      STORED*/ 01065000
*        4 PCCACCNT BIT(1),         /* THE CSW COUNT IS VALID        */ 01066000
*        4 PCCACNOR BIT(1),         /* NO RETRY IS TO BE ATTEMPTED 0040 01067000
*                                      UNDER ANY CONDITIONS          */ 01068000
*       3 PCCACHBL BIT(8),          /* PROBABLE SOURCE OF ERROR      */ 01069000
*        4 PCCACCPU BIT(1),         /* CPU ERROR                     */ 01070000
*        4 PCCACCHA BIT(1),         /* CHANNEL ERROR                 */ 01071000
*        4 PCCACSCU BIT(1),         /* STORAGE CONTROL UNIT ERROR    */ 01072000
*        4 PCCACSTG BIT(1),         /* STORAGE ERROR                 */ 01073000
*        4 PCCACCUE BIT(1),         /* CONTROL UNIT ERROR            */ 01074000
*        4 PCCARV38 BIT(1),         /* RESERVED                      */ 01075000
*        4 PCCARV39 BIT(1),         /* RESERVED                      */ 01076000
*        4 PCCARV40 BIT(1),         /* RESERVED                      */ 01077000
*       3 PCCACHVA BIT(8),          /* VALIDITY INDICATORS. WHEN THE    01078000
*                                      DESIGNATED FIELD IS STORED BY    01079000
*                                      THE CHANNEL WITH THE CORRECT     01080000
*                                      CONTENTS THE VALIDITY BIT IS     01081000
*                                      ONE. THE VALIDITY BIT FOR   0040 01082000
*                                      NON-STORED FIELDS IS        0040 01083000
*                                      MEANINGLESS.                  */ 01084000
*        4 PCCACITF BIT(1),         /* INTERFACE ADDRESS IS VALID    */ 01085000
*        4 PCCARV41 BIT(1),         /* RESERVED                      */ 01086000
*        4 PCCARV42 BIT(1),         /* RESERVED                      */ 01087000
*        4 PCCACSQV BIT(1),         /* SEQUENCE CODE IS VALID        */ 01088000
*        4 PCCACUNS BIT(1),         /* UNIT STATUS IS VALID          */ 01089000
*        4 PCCACCMD BIT(1),         /* COMMAND ADDRESS IS VALID. THE    01090000
*                                      CSW CONTAINS A VALID COMMAND     01091000
*                                      ADDRESS.                      */ 01092000
*        4 PCCACCHV BIT(1),         /* CHANNEL ADDRESS IS VALID      */ 01093000
*        4 PCCACDAV BIT(1),         /* DEVICE ADDRESS IS VALID       */ 01094000
*       3 PCCACHTS BIT(8),          /* TERMINATION AND SEQUENCE    0040 01095000
*                                      (RETRY) CODES                 */ 01096000
*        4 PCCACTEC BIT(2),         /* TERMINATION CODE. THIS CODE 0040 01097000
*                                      SPECIFIES THE TERMINATION   0040 01098000
*                                      SIGNALS USED ON THE I/O     0040 01099000
*                                      INTERFACE AFTER THE CHANNEL 0040 01100000
*                                      DETECTED THE ERROR. THIS FIELD   01101000
*                                      HAS MEANING ONLY WHEN ICC OR     01102000
*                                      CCC IS INDICATED IN THE CSW.  */ 01103000
*        4 PCCARV43 BIT(1),         /* RESERVED                      */ 01104000
*        4 PCCARV44 BIT(1),         /* RESERVED                      */ 01105000
*        4 PCCACDIN BIT(1),         /* I/O ERROR ALERT               */ 01106000
*        4 PCCACSEQ BIT(3),         /* SEQUENCE CODE. THESE CODES  0040 01107000
*                                      HAVE CHANNEL- DEPENDENT     0040 01108000
*                                      MEANINGS.                     */ 01109000
*      2 PCCACHS1 BIT(8),           /* CCH INTERNAL SWITCH 1         */ 01110000
*       3 PCCACCMP BIT(1),          /* COMMAND REGISTER PARITY IS  0040 01111000
*                                      VALID                         */ 01112000
*       3 PCCACNRE BIT(1),          /* CCH WILL NOT CREATE A RECORD     01113000
*                                      FOR THIS ERROR MDC006         */ 01114000
*       3 PCCACFRR BIT(1),          /* THE CCH FRR IS IN THE STACK 0040 01115000
*                                      MDC007                        */ 01116000
*       3 PCCACNLS BIT(1),          /* CCH IS TO PERFORM THE RECORD     01117000
*                                      FUNCTION ONLY. AN ERPIB IS NOT   01118000
*                                      TO BE PLACED IN THE EWA.      */ 01119000
*       3 PCCACAND BIT(1),          /* ATTENTION HAS BEEN PRESENTED  */ 01120000
*       3 PCCACIBC BIT(1),          /* AN ERPIB FOR THIS ERROR HAS 0040 01121000
*                                      ALREADY BEEN CREATED          */ 01122000
*       3 PCCACUCB BIT(1),          /* UCB INVALID BIT               */ 01123000
*       3 PCCARV47 BIT(1),          /* RESERVED                      */ 01124000
*      2 PCCACHS2 BIT(8),           /* CCH INTERNAL SWITCH 2         */ 01125000
*       3 PCCACIOR BIT(1),          /* I/O RESTART FUNCTION REQUIRED */ 01126000
*       3 PCCACALT BIT(1),          /* THE ALTERNATE RETURN TO IOS IS   01127000
*                                      TO BE USED                    */ 01128000
*       3 PCCACMOD BIT(1),          /* NO MODULE IS AVAILABLE TO   0040 01129000
*                                      ANALYZE THE CHANNEL LOGOUT    */ 01130000
*       3 PCCACNLG BIT(1),          /* CCH DETECTED A FAILURE TO LOG    01131000
*                                      OR FAILURE TO STORE AN ECSW 0040 01132000
*                                      CONDITION                     */ 01133000
*       3 PCCACURC BIT(1),          /* THE STIDC FIELD OF THE CAT  0040 01134000
*                                      ENTRY IS VALID BUT NOT THAT OF   01135000
*                                      A SUPPORTED CHANNEL MDC011    */ 01136000
*       3 PCCARV49 BIT(1),          /* RESERVED                      */ 01137000
*       3 PCCARV50 BIT(1),          /* RESERVED                      */ 01138000
*       3 PCCARV51 BIT(1),          /* RESERVED                      */ 01139000
*      2 PCCACHRB BIT(8),           /* CCH RECORD BYTE               */ 01140000
*       3 PCCACSIB BIT(1),          /* ERROR ON SIO                  */ 01141000
*       3 PCCACINB BIT(1),          /* ERROR ON INTERRUPT            */ 01142000
*       3 PCCACTIB BIT(1),          /* ERROR ON TIO                  */ 01143000
*       3 PCCACHIB BIT(1),          /* ERROR ON HIO                  */ 01144000
*       3 PCCARV52 BIT(1),          /* RESERVED                      */ 01145000
*       3 PCCACSNB BIT(1),          /* SENSE DATA STORED             */ 01146000
*       3 PCCACCVB BIT(1),          /* COUNT VALID                   */ 01147000
*       3 PCCACNRB BIT(1),          /* NO RETRY                      */ 01148000
*      2 PCCAIOSI CHAR(1),          /* IOS INTERCEPT BYTE            */ 01149000
*      2 PCCACHW1 FIXED(31),        /* CCH WORK AREA 1               */ 01150000
*      2 PCCACHW2 FIXED(31),        /* CCH WORK AREA 2               */ 01151000
*      2 PCCARV80 FIXED(15),        /* RESERVED MDC004               */ 01152000
*      2 PCCALOGL PTR(8),           /* LENGTH OF CHANNEL LOGOUT      */ 01153000
*      2 PCCALGP1 CHAR(1),          /* LOGOUT PARITY AREA 1          */ 01154000
*      2 PCCALGP2 CHAR(1),          /* LOGOUT PARITY AREA 2          */ 01155000
*      2 PCCACHPB PTR(8),           /* LOGOUT PARITY BYTE COUNT      */ 01156000
*      2 PCCARV05 CHAR(2),          /* RESERVED FOR CCH              */ 01157000
*      2 PCCACHF1 BIT(8),           /* CCH FOOTPRINT BYTE 1          */ 01158000
*       3 PCCACF11 BIT(1),          /* IOS GPR'S SAVED               */ 01159000
*       3 PCCACF12 BIT(1),          /* UCB ADDRESS IS ZERO           */ 01160000
*       3 PCCACF13 BIT(1),          /* ERPIB EXISTS                  */ 01161000
*       3 PCCACF14 BIT(1),          /* IGFCCHSI ENTERED              */ 01162000
*       3 PCCACF15 BIT(1),          /* IGFCCHII ENTERED              */ 01163000
*       3 PCCACF16 BIT(1),          /* IGFCCHFE ENTERED              */ 01164000
*       3 PCCACF17 BIT(1),          /* IGFC60 ENTERED                */ 01165000
*       3 PCCACF18 BIT(1),          /* IGFC70 ENTERED                */ 01166000
*      2 PCCACHF2 BIT(8),           /* CCH FOOTPRINT BYTE 2          */ 01167000
*       3 PCCACF21 BIT(1),          /* IGFC80 ENTERED                */ 01168000
*       3 PCCACF22 BIT(1),          /* IGFCIC ENTERED                */ 01169000
*       3 PCCACF23 BIT(1),          /* IGFCCHRD ENTERED MDC008       */ 01170000
*       3 PCCACF24 BIT(1),          /* IGFCCHMP ENTERED              */ 01171000
*       3 PCCACF25 BIT(1),          /* IGFCCHUC ENTERED              */ 01172000
*       3 PCCACF26 BIT(1),          /* IGFCCHAS ENTERED MDC009       */ 01173000
*       3 PCCACF27 BIT(1),          /* IGFCCHIO ENTERED              */ 01174000
*       3 PCCACF28 BIT(1),          /* EXIT CCH                      */ 01175000
*      2 PCCACHF3 BIT(8),           /* CCH FOOTPRINT BYTE 3          */ 01176000
*       3 PCCARV64 BIT(1),          /* RESERVED                      */ 01177000
*       3 PCCARV65 BIT(1),          /* RESERVED                      */ 01178000
*       3 PCCARV66 BIT(1),          /* RESERVED                      */ 01179000
*       3 PCCARV67 BIT(1),          /* RESERVED                      */ 01180000
*       3 PCCARV68 BIT(1),          /* RESERVED                      */ 01181000
*       3 PCCARV69 BIT(1),          /* RESERVED                      */ 01182000
*       3 PCCARV70 BIT(1),          /* RESERVED                      */ 01183000
*       3 PCCARV71 BIT(1),          /* RESERVED                      */ 01184000
*      2 PCCACHF4 BIT(8),           /* CCH FOOTPRINT BYTE 4          */ 01185000
*       3 PCCARV72 BIT(1),          /* RESERVED                      */ 01186000
*       3 PCCARV73 BIT(1),          /* RESERVED                      */ 01187000
*       3 PCCARV74 BIT(1),          /* RESERVED                      */ 01188000
*       3 PCCARV75 BIT(1),          /* RESERVED                      */ 01189000
*       3 PCCARV76 BIT(1),          /* RESERVED                      */ 01190000
*       3 PCCARV77 BIT(1),          /* RESERVED                      */ 01191000
*       3 PCCARV78 BIT(1),          /* RESERVED                      */ 01192000
*       3 PCCARV79 BIT(1),          /* RESERVED                      */ 01193000
*      2 PCCACHSV(3) FIXED(31),     /* CCH INTERNAL SAVE AREA. FIRST    01194000
*                                      WORD CONTAINS THE ADDRESS OF     01195000
*                                      THE CURRENT CCH RECORD BUFFER    01196000
*                                      MDC010                        */ 01197000
*      2 PCCACHID CHAR(8) BDY(WORD),/* STORE CHANNEL ID WORK AREA    */ 01198000
*      2 PCCALOGA PTR(31),          /* ADDRESS OF CHANNEL LOGOUT   0040 01199000
*                                      MDC004                        */ 01200000
*      2 PCCARV54 PTR(31),          /* RESERVED                      */ 01201000
*      2 PCCARV55 PTR(31),          /* RESERVED                      */ 01202000
*      2 PCCARV56 PTR(31),          /* RESERVED                      */ 01203000
*      2 PCCARV57 PTR(31),          /* RESERVED                      */ 01204000
*      2 PCCARV58 PTR(31),          /* RESERVED                      */ 01205000
*      2 PCCARV59 PTR(31),          /* RESERVED                      */ 01206000
*      2 PCCARV60 PTR(31),          /* RESERVED                      */ 01207000
*      2 PCCARV61 PTR(31),          /* RESERVED                      */ 01208000
*      2 PCCARV62 PTR(31),          /* RESERVED                      */ 01209000
*      2 PCCARV63 PTR(31),          /* RESERVED                      */ 01210000
*      2 PCCACPUM CHAR(1),          /* INDICATOR THAT DEAD CPU HAD A    01211000
*                                      MALFUNCTION                   */ 01212000
*      2 PCCARV01 CHAR(1),          /* RESERVED                      */ 01213000
*      2 PCCARV35 FIXED(15),        /* RESERVED                      */ 01214000
*      2 PCCARV36 FIXED(31),        /* RESERVED                      */ 01215000
*      2 PCCACAT CHAR(128) BDY(DWORD),/* CHANNEL AVAILABILITY TABLE     01216000
*                                      (16 CHANNELS, 8 BYTES PER   0040 01217000
*                                      CHANNEL) MDC005               */ 01218000
*      2 * CHAR(72) BDY(DWORD);     /* RESERVED                      */ 01219000
*                                                                  0040 01220000
*   /*****************************************************************/ 01221000
*   /*                                                               */ 01222000
*   /* LABELS                                                        */ 01223000
*   /*                                                               */ 01224000
*   /*****************************************************************/ 01225000
*                                                                  0041 01226000
*   DCL                                                            0041 01227000
*     IGFPTERM ENTRY EXTERNAL;      /* SYSTEM TERMINATION FACILITY   */ 01228000
*                                                                  0041 01229000
*   /*****************************************************************/ 01230000
*   /*                                                               */ 01231000
*   /* VARIABLES                                                     */ 01232000
*   /*                                                               */ 01233000
*   /*****************************************************************/ 01234000
*                                                                  0042 01235000
*   DCL                                                            0042 01236000
*     1 STPARM,                     /* PARAMS. FOR SYSTEM TERM. FAC. */ 01237000
*       3 STMSGP PTR(31),           /* REAL ADDR OF MESSAGE          */ 01238000
*       3 STLRBP PTR(31);           /* REAL ADDR OF LRB              */ 01239000
*   DECLARE                         /* WTO PARAMETER LIST            */ 01240000
*     1 MGTXT STATIC LOCAL BDY(WORD),                              0043 01241000
*      2 MGTXT01 FIXED(15) INIT(52),/* TEXT LENGTH                   */ 01242000
*      2 MGTXT02 BIT(16) INIT('1000000000000000'B),/* MCS FLAG       */ 01243000
*      2 MGTXT03 CHAR(48) INIT(                                    0043 01244000
*            'IEE770W ATTEMPTED EXECUTION OF DELETED MP MODULE'),/*     01245000
*                                      MESSAGE TEXT                  */ 01246000
*      2 MGTXT04 BIT(16) INIT('1000000000000000'B),/* DESCRIPTOR   0043 01247000
*                                      CODES                         */ 01248000
*      2 MGTXT05 BIT(16) INIT('1000000000000000'B);/* ROUTING CODES     01249000
*                                                            @YM02690*/ 01250000
*   DCL                                                            0044 01251000
*     1 TERMPSW BDY(DWORD) STATIC LOCAL,/* PSW TO ENTER SYSTERM      */ 01252000
*       3 * CHAR(1) INIT('00'X),    /* DAT OFF - INTRPTS MASKED OFF  */ 01253000
*       3 * CHAR(1) INIT('0C'X),    /* MC ENABLED / EC MODE          */ 01254000
*       3 * CHAR(1) INIT('00'X),    /* CC, PROG MASK                 */ 01255000
*       3 * CHAR(1) INIT('00'X),    /* RESERVED                      */ 01256000
*       3 * PTR(31) INIT(ADDR(IGFPTERM));/* SYSTERM ENTRY            */ 01257000
*   DCL                                                            0045 01258000
*     LRBPTR PTR(31) REG(4) RSTD;                                  0045 01259000
*   DCL                                                            0046 01260000
*     REG1 PTR(31) REG(1) RSTD;                                    0046 01261000
*   DCL                                                            0047 01262000
*     PCCAPTR PTR(31) BASED;                                       0047 01263000
*   LRBPTR=PSAPCCAV->PCCALRBV;      /* GET ADDR OF LRB               */ 01264000
         L     @15,PSAPCCAV                                        0048 01265000
         L     LRBPTR,PCCALRBV(,@15)                               0048 01266000
*   LRBMWSC='0000001A'X;            /* SET WAIT STATE CODE IN LRB    */ 01267000
         MVC   LRBMWSC(4,LRBPTR),@CB00839                          0049 01268000
*   LRBHTYPE='81'X;                 /* INDICATE SYSTEM TERMINATION 0050 01269000
*                                      RECORD TYPE           @YM04283*/ 01270000
         MVI   LRBHTYPE(LRBPTR),X'81'                              0050 01271000
*   GEN REFS(LRBPTR)(LRA LRBPTR,0(LRBPTR));/* REAL ADDR OF LRB       */ 01272000
         LRA LRBPTR,0(LRBPTR)                                           01273000
*   STLRBP=LRBPTR;                  /* LRB REAL ADDR TO PARM LIST    */ 01274000
         ST    LRBPTR,STLRBP                                       0052 01275000
*   REG1=ADDR(MGTXT);               /* VIRT. ADDR OF MSG             */ 01276000
         LA    REG1,MGTXT                                          0053 01277000
*   GEN REFS(REG1)(LRA REG1,0(REG1));/* REAL ADDR OF MSG             */ 01278000
         LRA REG1,0(REG1)                                               01279000
*   STMSGP=REG1;                    /* MSG REAL ADDR TO PARM LIST    */ 01280000
         ST    REG1,STMSGP                                         0055 01281000
*   REG1=ADDR(STPARM);              /* VIRT ADDR OF PARMS            */ 01282000
         LA    REG1,STPARM                                         0056 01283000
*   GEN REFS(REG1)(LRA REG1,0(REG1));/* REAL ADDR OF PARMS           */ 01284000
         LRA REG1,0(REG1)                                               01285000
*   LPSW(TERMPSW);                  /* GO TO SYSTEM TERMINATION      */ 01286000
         LPSW  TERMPSW                                             0058 01287000
*   END                                                            0059 01288000
*                                                                  0059 01289000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 01290000
*/*%INCLUDE SYSLIB  (UMYSPEC )                                       */ 01291000
*/*%INCLUDE SYSLIB  (UMYDCL  )                                       */ 01292000
*/*%INCLUDE SYSLIB  (IHALRB  )                                       */ 01293000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 01294000
*/*%INCLUDE SYSLIB  (IHAPCCA )                                       */ 01295000
*                                                                  0059 01296000
*       ;                                                          0059 01297000
@EL00001 DS    0H                                                  0059 01298000
@EF00001 DS    0H                                                  0059 01299000
@ER00001 BR    @14                                                 0059 01300000
@DATA    DS    0H                                                       01301000
         DS    0F                                                       01302000
         DS    0F                                                       01303000
@CV00811 DC    V(IGFPTERM)                                              01304000
         DS    0D                                                       01305000
@CB00839 DC    X'0000001A'                                              01306000
STPARM   DS    CL8                                                      01307000
         ORG   STPARM                                                   01308000
STMSGP   DS    AL4                                                      01309000
STLRBP   DS    AL4                                                      01310000
         ORG   STPARM+8                                                 01311000
MGTXT    DS    CL56                                                     01312000
         ORG   MGTXT                                                    01313000
MGTXT01  DC    H'52'                                                    01314000
MGTXT02  DC    B'1000000000000000'                                      01315000
MGTXT03  DC    CL48'IEE770W ATTEMPTED EXECUTION OF DELETED MP MODULE'   01316000
MGTXT04  DC    B'1000000000000000'                                      01317000
MGTXT05  DC    B'1000000000000000'                                      01318000
         ORG   MGTXT+56                                                 01319000
         DS    CL4                                                      01320000
TERMPSW  DS    CL8                                                      01321000
         ORG   TERMPSW                                                  01322000
@NM00057 DC    X'00'                                                    01323000
@NM00058 DC    X'0C'                                                    01324000
@NM00059 DC    X'00'                                                    01325000
@NM00060 DC    X'00'                                                    01326000
@NM00061 DC    VL4(IGFPTERM)                                            01327000
         ORG   TERMPSW+8                                                01328000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01329000
@01      EQU   01                                                       01330000
@02      EQU   02                                                       01331000
@03      EQU   03                                                       01332000
@04      EQU   04                                                       01333000
@05      EQU   05                                                       01334000
@06      EQU   06                                                       01335000
@07      EQU   07                                                       01336000
@08      EQU   08                                                       01337000
@09      EQU   09                                                       01338000
@10      EQU   10                                                       01339000
@11      EQU   11                                                       01340000
@12      EQU   12                                                       01341000
@13      EQU   13                                                       01342000
@14      EQU   14                                                       01343000
@15      EQU   15                                                       01344000
LRBPTR   EQU   @04                                                      01345000
REG1     EQU   @01                                                      01346000
PSA      EQU   0                                                        01347000
FLCRNPSW EQU   PSA                                                      01348000
FLCROPSW EQU   PSA+8                                                    01349000
FLCICCW2 EQU   PSA+16                                                   01350000
PSAEEPSW EQU   PSA+132                                                  01351000
PSAESPSW EQU   PSA+136                                                  01352000
FLCSVILC EQU   PSAESPSW+1                                               01353000
PSAEPPSW EQU   PSA+140                                                  01354000
FLCPIILC EQU   PSAEPPSW+1                                               01355000
FLCPICOD EQU   PSAEPPSW+2                                               01356000
PSAPICOD EQU   FLCPICOD+1                                               01357000
FLCTEA   EQU   PSAEPPSW+4                                               01358000
FLCPER   EQU   PSA+152                                                  01359000
FLCMCLA  EQU   PSA+168                                                  01360000
FLCIOEL  EQU   FLCMCLA+4                                                01361000
FLCIOA   EQU   FLCMCLA+16                                               01362000
FLCFSA   EQU   FLCMCLA+80                                               01363000
PSAPCCAV EQU   PSA+520                                                  01364000
PSASUPER EQU   PSA+552                                                  01365000
PSASUP1  EQU   PSASUPER                                                 01366000
PSASUP2  EQU   PSASUPER+1                                               01367000
PSASUP3  EQU   PSASUPER+2                                               01368000
PSASUP4  EQU   PSASUPER+3                                               01369000
PSACLHT  EQU   PSA+640                                                  01370000
PSALKSA  EQU   PSA+696                                                  01371000
PSAHLHI  EQU   PSA+760                                                  01372000
PSADSSFL EQU   PSA+836                                                  01373000
PSADSSF1 EQU   PSADSSFL                                                 01374000
PSADSSF3 EQU   PSADSSFL+2                                               01375000
PSADSSF4 EQU   PSADSSFL+3                                               01376000
PSARSVT  EQU   PSA+896                                                  01377000
LRB      EQU   0                                                        01378000
LRBHTYPE EQU   LRB                                                      01379000
LRBHREL  EQU   LRB+1                                                    01380000
LRBHSYS  EQU   LRBHREL                                                  01381000
LRBHSW0  EQU   LRB+2                                                    01382000
LRBHSW1  EQU   LRB+3                                                    01383000
LRBHSW2  EQU   LRB+4                                                    01384000
LRBMACT  EQU   LRBHSW2                                                  01385000
LRBHSW3  EQU   LRB+5                                                    01386000
LRBHCPID EQU   LRB+16                                                   01387000
LRBBASE  EQU   LRB+24                                                   01388000
LRBCVAR  EQU   0                                                        01389000
LRBCMP   EQU   LRBCVAR+8                                                01390000
PCCA     EQU   0                                                        01391000
PCCATMST EQU   PCCA+128                                                 01392000
PCCATMFL EQU   PCCATMST                                                 01393000
PCCATODE EQU   PCCATMST+1                                               01394000
PCCACCE  EQU   PCCATMST+2                                               01395000
PCCAINTE EQU   PCCATMST+3                                               01396000
PCCAEMSB EQU   PCCA+136                                                 01397000
PCCAEMSI EQU   PCCAEMSB                                                 01398000
PCCARISP EQU   PCCAEMSI                                                 01399000
PCCAEMS2 EQU   PCCAEMSI+1                                               01400000
PCCAEMS3 EQU   PCCAEMSI+2                                               01401000
PCCARMSB EQU   PCCAEMSI+3                                               01402000
PCCALRBV EQU   PCCA+160                                                 01403000
PCCAWERP EQU   PCCA+280                                                 01404000
PCCACHPF EQU   PCCAWERP+4                                               01405000
PCCACHBL EQU   PCCAWERP+5                                               01406000
PCCACHVA EQU   PCCAWERP+6                                               01407000
PCCACHTS EQU   PCCAWERP+7                                               01408000
PCCACHS1 EQU   PCCA+288                                                 01409000
PCCACHS2 EQU   PCCA+289                                                 01410000
PCCACHRB EQU   PCCA+290                                                 01411000
PCCACHF1 EQU   PCCA+308                                                 01412000
PCCACHF2 EQU   PCCA+309                                                 01413000
PCCACHF3 EQU   PCCA+310                                                 01414000
PCCACHF4 EQU   PCCA+311                                                 01415000
PCCAPTR  EQU   0                                                        01416000
LRBHRSW1 EQU   LRBHSW1                                                  01417000
LRBHCSW1 EQU   LRBHSW1                                                  01418000
LRBHMSW1 EQU   LRBHSW1                                                  01419000
LRBMMCH  EQU   LRBBASE                                                  01420000
LRBMWSC  EQU   LRBMMCH+4                                                01421000
LRBMCEIA EQU   LRBMMCH+8                                                01422000
LRBMTERM EQU   LRBMCEIA                                                 01423000
LRBMHARD EQU   LRBMCEIA+1                                               01424000
LRBMINTM EQU   LRBMCEIA+2                                               01425000
LRBMSOFT EQU   LRBMCEIA+3                                               01426000
LRBMPDAR EQU   LRBMMCH+12                                               01427000
LRBMRSR1 EQU   LRBMMCH+13                                               01428000
LRBMRSR2 EQU   LRBMMCH+14                                               01429000
LRBMFLO  EQU   LRBMMCH+24                                               01430000
LRBMCIC  EQU   LRBMFLO                                                  01431000
@NM00018 EQU   LRBMCIC                                                  01432000
@NM00020 EQU   LRBMCIC+1                                                01433000
@NM00022 EQU   LRBMCIC+2                                                01434000
@NM00024 EQU   LRBMCIC+3                                                01435000
@NM00027 EQU   LRBMCIC+5                                                01436000
LRBRDDR  EQU   LRBBASE                                                  01437000
LRBCCCH  EQU   LRBBASE                                                  01438000
LRBCCUA  EQU   LRBCCCH+49                                               01439000
LRBDMDR  EQU   LRBBASE                                                  01440000
LRBNMIH  EQU   LRBBASE                                                  01441000
LRBTTER  EQU   LRBBASE                                                  01442000
PSARSVTE EQU   PSARSVT                                                  01443000
FLC      EQU   PSA                                                      01444000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01445000
PSARSAV  EQU   PSARSVTE+60                                              01446000
PSARSTK  EQU   PSARSVTE+56                                              01447000
PSAESAV3 EQU   PSARSVTE+52                                              01448000
PSAESTK3 EQU   PSARSVTE+48                                              01449000
PSAESAV2 EQU   PSARSVTE+44                                              01450000
PSAESTK2 EQU   PSARSVTE+40                                              01451000
PSAESAV1 EQU   PSARSVTE+36                                              01452000
PSAESTK1 EQU   PSARSVTE+32                                              01453000
PSAPSAV  EQU   PSARSVTE+28                                              01454000
PSAPSTK  EQU   PSARSVTE+24                                              01455000
PSAMSAV  EQU   PSARSVTE+20                                              01456000
PSAMSTK  EQU   PSARSVTE+16                                              01457000
PSASSAV  EQU   PSARSVTE+12                                              01458000
PSASSTK  EQU   PSARSVTE+8                                               01459000
PSANSTK  EQU   PSARSVTE+4                                               01460000
PSACSTK  EQU   PSARSVTE                                                 01461000
LRBTUSR  EQU   LRBTTER+8                                                01462000
LRBTWSC  EQU   LRBTTER+4                                                01463000
LRBTLNH  EQU   LRBTTER                                                  01464000
LRBNINT  EQU   LRBNMIH+24                                               01465000
LRBNDEVT EQU   LRBNMIH+20                                               01466000
LRBNVOL  EQU   LRBNMIH+14                                               01467000
LRBNCUA1 EQU   LRBNMIH+11                                               01468000
LRBNCUA2 EQU   LRBNMIH+8                                                01469000
LRBNJOB  EQU   LRBNMIH                                                  01470000
LRBDSENS EQU   LRBDMDR+8                                                01471000
LRBDVOL  EQU   LRBDMDR+2                                                01472000
LRBDCUA1 EQU   LRBDMDR                                                  01473000
LRBCCLOG EQU   LRBCCCH+56                                               01474000
LRBCLOGL EQU   LRBCCCH+54                                               01475000
LRBCHCUA EQU   LRBCCCH+52                                               01476000
LRBCCUA2 EQU   LRBCCUA+1                                                01477000
@NM00031 EQU   LRBCCUA                                                  01478000
LRBCCHID EQU   LRBCCCH+48                                               01479000
LRBCDEVT EQU   LRBCCCH+44                                               01480000
LRBCECSW EQU   LRBCCCH+40                                               01481000
LRBCFCSW EQU   LRBCCCH+32                                               01482000
LRBCFCCW EQU   LRBCCCH+24                                               01483000
LRBCAIO  EQU   LRBCCCH+8                                                01484000
LRBCJOB  EQU   LRBCCCH                                                  01485000
LRBRDEV2 EQU   LRBRDDR+32                                               01486000
LRBRCUA2 EQU   LRBRDDR+29                                               01487000
LRBRPH2  EQU   LRBRDDR+28                                               01488000
LRBRDEV1 EQU   LRBRDDR+24                                               01489000
LRBRCUA1 EQU   LRBRDDR+21                                               01490000
LRBRPH1  EQU   LRBRDDR+20                                               01491000
LRBRVOL2 EQU   LRBRDDR+14                                               01492000
LRBRVOL1 EQU   LRBRDDR+8                                                01493000
LRBRJOB  EQU   LRBRDDR                                                  01494000
LRBMCEL  EQU   LRBMMCH+304                                              01495000
@NM00030 EQU   LRBMFLO+20                                               01496000
LRBMFSA  EQU   LRBMFLO+16                                               01497000
@NM00029 EQU   LRBMFLO+8                                                01498000
LRBMCELL EQU   LRBMCIC+6                                                01499000
LRBMVCC  EQU   @NM00027                                                 01500000
LRBMVPT  EQU   @NM00027                                                 01501000
@NM00028 EQU   @NM00027                                                 01502000
@NM00026 EQU   LRBMCIC+4                                                01503000
LRBMVST  EQU   @NM00024                                                 01504000
LRBMVLG  EQU   @NM00024                                                 01505000
LRBMVCR  EQU   @NM00024                                                 01506000
LRBMVGR  EQU   @NM00024                                                 01507000
LRBMVFP  EQU   @NM00024                                                 01508000
@NM00025 EQU   @NM00024                                                 01509000
LRBMVRC  EQU   @NM00024                                                 01510000
LRBMVFA  EQU   @NM00024                                                 01511000
LRBMVIA  EQU   @NM00022                                                 01512000
LRBMVPM  EQU   @NM00022                                                 01513000
LRBMVMS  EQU   @NM00022                                                 01514000
LRBMVWP  EQU   @NM00022                                                 01515000
@NM00023 EQU   @NM00022                                                 01516000
LRBMFKE  EQU   @NM00022                                                 01517000
LRBMFSC  EQU   @NM00022                                                 01518000
LRBMFSE  EQU   @NM00022                                                 01519000
LRBMIDY  EQU   @NM00020                                                 01520000
LRBMIBU  EQU   @NM00020                                                 01521000
@NM00021 EQU   @NM00020                                                 01522000
LRBMFWN  EQU   @NM00020                                                 01523000
LRBMFDG  EQU   @NM00018                                                 01524000
@NM00019 EQU   @NM00018                                                 01525000
LRBMFED  EQU   @NM00018                                                 01526000
LRBMFCD  EQU   @NM00018                                                 01527000
LRBMFTD  EQU   @NM00018                                                 01528000
LRBMFSR  EQU   @NM00018                                                 01529000
LRBMFPD  EQU   @NM00018                                                 01530000
LRBMFSD  EQU   @NM00018                                                 01531000
LRBMMOSW EQU   LRBMMCH+16                                               01532000
LRBMPWL  EQU   LRBMMCH+15                                               01533000
LRBMVEQR EQU   LRBMRSR2                                                 01534000
LRBMPGFX EQU   LRBMRSR2                                                 01535000
LRBMLSQA EQU   LRBMRSR2                                                 01536000
LRBMFSQA EQU   LRBMRSR2                                                 01537000
LRBMNUCL EQU   LRBMRSR2                                                 01538000
LRBMSPER EQU   LRBMRSR2                                                 01539000
LRBMINTC EQU   LRBMRSR2                                                 01540000
LRBMOFLN EQU   LRBMRSR2                                                 01541000
LRBMCHNG EQU   LRBMRSR1                                                 01542000
LRBMSER  EQU   LRBMRSR1                                                 01543000
@NM00017 EQU   LRBMRSR1                                                 01544000
@NM00016 EQU   LRBMPDAR                                                 01545000
LRBMRSRF EQU   LRBMPDAR                                                 01546000
LRBMRSRC EQU   LRBMPDAR                                                 01547000
LRBMINVP EQU   LRBMPDAR                                                 01548000
@NM00015 EQU   LRBMPDAR                                                 01549000
LRBMSBUF EQU   LRBMSOFT                                                 01550000
LRBMSHIR EQU   LRBMSOFT                                                 01551000
LRBMSECC EQU   LRBMSOFT                                                 01552000
LRBMSEXD EQU   LRBMSOFT                                                 01553000
@NM00014 EQU   LRBMSOFT                                                 01554000
LRBMSSFT EQU   LRBMSOFT                                                 01555000
LRBMIL80 EQU   LRBMINTM                                                 01556000
LRBMICTM EQU   LRBMINTM                                                 01557000
LRBMICKC EQU   LRBMINTM                                                 01558000
LRBMITOD EQU   LRBMINTM                                                 01559000
@NM00013 EQU   LRBMINTM                                                 01560000
LRBMHIPD EQU   LRBMHARD                                                 01561000
LRBMHSPF EQU   LRBMHARD                                                 01562000
LRBMHSTO EQU   LRBMHARD                                                 01563000
LRBMHINV EQU   LRBMHARD                                                 01564000
@NM00012 EQU   LRBMHARD                                                 01565000
LRBMHHRD EQU   LRBMHARD                                                 01566000
LRBMTINV EQU   LRBMTERM                                                 01567000
LRBMTDMG EQU   LRBMTERM                                                 01568000
LRBMTWRN EQU   LRBMTERM                                                 01569000
LRBMTCKS EQU   LRBMTERM                                                 01570000
LRBMTSEC EQU   LRBMTERM                                                 01571000
@NM00011 EQU   LRBMTERM                                                 01572000
LRBMLNH  EQU   LRBMMCH                                                  01573000
@NM00010 EQU   LRBHMSW1                                                 01574000
LRBMSYST EQU   LRBHMSW1                                                 01575000
@NM00009 EQU   LRBHMSW1                                                 01576000
@NM00008 EQU   LRBHCSW1                                                 01577000
LRBCERPP EQU   LRBHCSW1                                                 01578000
LRBCDATA EQU   LRBHCSW1                                                 01579000
LRBCICUA EQU   LRBHCSW1                                                 01580000
LRBCNOSP EQU   LRBHCSW1                                                 01581000
@NM00007 EQU   LRBHCSW1                                                 01582000
LRBCINCO EQU   LRBHCSW1                                                 01583000
LRBCMESG EQU   LRBHCSW1                                                 01584000
@NM00006 EQU   LRBHRSW1                                                 01585000
LRBRSYSI EQU   LRBHRSW1                                                 01586000
LRBROPER EQU   LRBHRSW1                                                 01587000
LRBRSEC  EQU   LRBHRSW1                                                 01588000
LRBRPRIM EQU   LRBHRSW1                                                 01589000
@NM00056 EQU   PCCA+512                                                 01590000
PCCACAT  EQU   PCCA+384                                                 01591000
PCCARV36 EQU   PCCA+380                                                 01592000
PCCARV35 EQU   PCCA+378                                                 01593000
PCCARV01 EQU   PCCA+377                                                 01594000
PCCACPUM EQU   PCCA+376                                                 01595000
PCCARV63 EQU   PCCA+372                                                 01596000
PCCARV62 EQU   PCCA+368                                                 01597000
PCCARV61 EQU   PCCA+364                                                 01598000
PCCARV60 EQU   PCCA+360                                                 01599000
PCCARV59 EQU   PCCA+356                                                 01600000
PCCARV58 EQU   PCCA+352                                                 01601000
PCCARV57 EQU   PCCA+348                                                 01602000
PCCARV56 EQU   PCCA+344                                                 01603000
PCCARV55 EQU   PCCA+340                                                 01604000
PCCARV54 EQU   PCCA+336                                                 01605000
PCCALOGA EQU   PCCA+332                                                 01606000
PCCACHID EQU   PCCA+324                                                 01607000
PCCACHSV EQU   PCCA+312                                                 01608000
PCCARV79 EQU   PCCACHF4                                                 01609000
PCCARV78 EQU   PCCACHF4                                                 01610000
PCCARV77 EQU   PCCACHF4                                                 01611000
PCCARV76 EQU   PCCACHF4                                                 01612000
PCCARV75 EQU   PCCACHF4                                                 01613000
PCCARV74 EQU   PCCACHF4                                                 01614000
PCCARV73 EQU   PCCACHF4                                                 01615000
PCCARV72 EQU   PCCACHF4                                                 01616000
PCCARV71 EQU   PCCACHF3                                                 01617000
PCCARV70 EQU   PCCACHF3                                                 01618000
PCCARV69 EQU   PCCACHF3                                                 01619000
PCCARV68 EQU   PCCACHF3                                                 01620000
PCCARV67 EQU   PCCACHF3                                                 01621000
PCCARV66 EQU   PCCACHF3                                                 01622000
PCCARV65 EQU   PCCACHF3                                                 01623000
PCCARV64 EQU   PCCACHF3                                                 01624000
PCCACF28 EQU   PCCACHF2                                                 01625000
PCCACF27 EQU   PCCACHF2                                                 01626000
PCCACF26 EQU   PCCACHF2                                                 01627000
PCCACF25 EQU   PCCACHF2                                                 01628000
PCCACF24 EQU   PCCACHF2                                                 01629000
PCCACF23 EQU   PCCACHF2                                                 01630000
PCCACF22 EQU   PCCACHF2                                                 01631000
PCCACF21 EQU   PCCACHF2                                                 01632000
PCCACF18 EQU   PCCACHF1                                                 01633000
PCCACF17 EQU   PCCACHF1                                                 01634000
PCCACF16 EQU   PCCACHF1                                                 01635000
PCCACF15 EQU   PCCACHF1                                                 01636000
PCCACF14 EQU   PCCACHF1                                                 01637000
PCCACF13 EQU   PCCACHF1                                                 01638000
PCCACF12 EQU   PCCACHF1                                                 01639000
PCCACF11 EQU   PCCACHF1                                                 01640000
PCCARV05 EQU   PCCA+306                                                 01641000
PCCACHPB EQU   PCCA+305                                                 01642000
PCCALGP2 EQU   PCCA+304                                                 01643000
PCCALGP1 EQU   PCCA+303                                                 01644000
PCCALOGL EQU   PCCA+302                                                 01645000
PCCARV80 EQU   PCCA+300                                                 01646000
PCCACHW2 EQU   PCCA+296                                                 01647000
PCCACHW1 EQU   PCCA+292                                                 01648000
PCCAIOSI EQU   PCCA+291                                                 01649000
PCCACNRB EQU   PCCACHRB                                                 01650000
PCCACCVB EQU   PCCACHRB                                                 01651000
PCCACSNB EQU   PCCACHRB                                                 01652000
PCCARV52 EQU   PCCACHRB                                                 01653000
PCCACHIB EQU   PCCACHRB                                                 01654000
PCCACTIB EQU   PCCACHRB                                                 01655000
PCCACINB EQU   PCCACHRB                                                 01656000
PCCACSIB EQU   PCCACHRB                                                 01657000
PCCARV51 EQU   PCCACHS2                                                 01658000
PCCARV50 EQU   PCCACHS2                                                 01659000
PCCARV49 EQU   PCCACHS2                                                 01660000
PCCACURC EQU   PCCACHS2                                                 01661000
PCCACNLG EQU   PCCACHS2                                                 01662000
PCCACMOD EQU   PCCACHS2                                                 01663000
PCCACALT EQU   PCCACHS2                                                 01664000
PCCACIOR EQU   PCCACHS2                                                 01665000
PCCARV47 EQU   PCCACHS1                                                 01666000
PCCACUCB EQU   PCCACHS1                                                 01667000
PCCACIBC EQU   PCCACHS1                                                 01668000
PCCACAND EQU   PCCACHS1                                                 01669000
PCCACNLS EQU   PCCACHS1                                                 01670000
PCCACFRR EQU   PCCACHS1                                                 01671000
PCCACNRE EQU   PCCACHS1                                                 01672000
PCCACCMP EQU   PCCACHS1                                                 01673000
PCCACSEQ EQU   PCCACHTS                                                 01674000
PCCACDIN EQU   PCCACHTS                                                 01675000
PCCARV44 EQU   PCCACHTS                                                 01676000
PCCARV43 EQU   PCCACHTS                                                 01677000
PCCACTEC EQU   PCCACHTS                                                 01678000
PCCACDAV EQU   PCCACHVA                                                 01679000
PCCACCHV EQU   PCCACHVA                                                 01680000
PCCACCMD EQU   PCCACHVA                                                 01681000
PCCACUNS EQU   PCCACHVA                                                 01682000
PCCACSQV EQU   PCCACHVA                                                 01683000
PCCARV42 EQU   PCCACHVA                                                 01684000
PCCARV41 EQU   PCCACHVA                                                 01685000
PCCACITF EQU   PCCACHVA                                                 01686000
PCCARV40 EQU   PCCACHBL                                                 01687000
PCCARV39 EQU   PCCACHBL                                                 01688000
PCCARV38 EQU   PCCACHBL                                                 01689000
PCCACCUE EQU   PCCACHBL                                                 01690000
PCCACSTG EQU   PCCACHBL                                                 01691000
PCCACSCU EQU   PCCACHBL                                                 01692000
PCCACCHA EQU   PCCACHBL                                                 01693000
PCCACCPU EQU   PCCACHBL                                                 01694000
PCCACNOR EQU   PCCACHPF                                                 01695000
PCCACCNT EQU   PCCACHPF                                                 01696000
PCCACSNS EQU   PCCACHPF                                                 01697000
PCCARV37 EQU   PCCACHPF                                                 01698000
PCCACHIO EQU   PCCACHPF                                                 01699000
PCCACTIO EQU   PCCACHPF                                                 01700000
PCCACINT EQU   PCCACHPF                                                 01701000
PCCACSIO EQU   PCCACHPF                                                 01702000
PCCACHUB EQU   PCCAWERP                                                 01703000
PCCACHEL EQU   PCCA+168                                                 01704000
PCCALRBR EQU   PCCA+164                                                 01705000
PCCAPWAR EQU   PCCA+156                                                 01706000
PCCAPWAV EQU   PCCA+152                                                 01707000
PCCAEMSA EQU   PCCAEMSB+12                                              01708000
PCCAEMSE EQU   PCCAEMSB+8                                               01709000
PCCAEMSP EQU   PCCAEMSB+4                                               01710000
PCCARMS  EQU   PCCARMSB                                                 01711000
PCCARV34 EQU   PCCARMSB                                                 01712000
PCCARV33 EQU   PCCARMSB                                                 01713000
PCCARV32 EQU   PCCARMSB                                                 01714000
PCCARV31 EQU   PCCARMSB                                                 01715000
PCCARV30 EQU   PCCARMSB                                                 01716000
PCCARV29 EQU   PCCARMSB                                                 01717000
PCCARV28 EQU   PCCARMSB                                                 01718000
PCCARV27 EQU   PCCAEMS3                                                 01719000
PCCARV26 EQU   PCCAEMS3                                                 01720000
PCCARV25 EQU   PCCAEMS3                                                 01721000
PCCARV24 EQU   PCCAEMS3                                                 01722000
PCCARV23 EQU   PCCAEMS3                                                 01723000
PCCARV22 EQU   PCCAEMS3                                                 01724000
PCCARV21 EQU   PCCAEMS3                                                 01725000
PCCARV20 EQU   PCCAEMS3                                                 01726000
PCCARV19 EQU   PCCAEMS2                                                 01727000
PCCARV18 EQU   PCCAEMS2                                                 01728000
PCCARV17 EQU   PCCAEMS2                                                 01729000
PCCARV16 EQU   PCCAEMS2                                                 01730000
PCCARV15 EQU   PCCAEMS2                                                 01731000
PCCARV14 EQU   PCCAEMS2                                                 01732000
PCCARV13 EQU   PCCAEMS2                                                 01733000
PCCARV12 EQU   PCCAEMS2                                                 01734000
PCCARV11 EQU   PCCARISP                                                 01735000
PCCARV10 EQU   PCCARISP                                                 01736000
PCCARV09 EQU   PCCARISP                                                 01737000
PCCARV08 EQU   PCCARISP                                                 01738000
PCCARV07 EQU   PCCARISP                                                 01739000
PCCARV06 EQU   PCCARISP                                                 01740000
PCCASERL EQU   PCCARISP                                                 01741000
PCCAPARL EQU   PCCARISP                                                 01742000
PCCARPB  EQU   PCCA+132                                                 01743000
PCCACTIN EQU   PCCAINTE                                                 01744000
PCCANFIN EQU   PCCAINTE                                                 01745000
PCCANUIN EQU   PCCAINTE                                                 01746000
PCCACTCC EQU   PCCACCE                                                  01747000
PCCANFCC EQU   PCCACCE                                                  01748000
PCCANUCC EQU   PCCACCE                                                  01749000
PCCACTTD EQU   PCCATODE                                                 01750000
PCCANFTD EQU   PCCATODE                                                 01751000
PCCANUTD EQU   PCCATODE                                                 01752000
PCCARV04 EQU   PCCATMFL                                                 01753000
PCCARV03 EQU   PCCATMFL                                                 01754000
PCCARV02 EQU   PCCATMFL                                                 01755000
PCCAMINT EQU   PCCATMFL                                                 01756000
PCCAMCC  EQU   PCCATMFL                                                 01757000
PCCAVKIL EQU   PCCATMFL                                                 01758000
PCCASYNC EQU   PCCATMFL                                                 01759000
PCCAINIT EQU   PCCATMFL                                                 01760000
PCCARV9E EQU   PCCA+124                                                 01761000
PCCARV9D EQU   PCCA+120                                                 01762000
PCCARV9C EQU   PCCA+116                                                 01763000
PCCARV9B EQU   PCCA+112                                                 01764000
PCCARV9A EQU   PCCA+108                                                 01765000
PCCARV99 EQU   PCCA+104                                                 01766000
PCCARV98 EQU   PCCA+100                                                 01767000
PCCARV97 EQU   PCCA+96                                                  01768000
PCCARV96 EQU   PCCA+92                                                  01769000
PCCARV95 EQU   PCCA+88                                                  01770000
PCCARV94 EQU   PCCA+84                                                  01771000
PCCARV93 EQU   PCCA+80                                                  01772000
PCCARV92 EQU   PCCA+76                                                  01773000
PCCARV91 EQU   PCCA+72                                                  01774000
PCCARV90 EQU   PCCA+68                                                  01775000
PCCARV89 EQU   PCCA+64                                                  01776000
PCCARV88 EQU   PCCA+60                                                  01777000
PCCARV87 EQU   PCCA+56                                                  01778000
PCCARV86 EQU   PCCA+52                                                  01779000
PCCARV85 EQU   PCCA+48                                                  01780000
PCCARV84 EQU   PCCA+44                                                  01781000
PCCARV83 EQU   PCCA+40                                                  01782000
PCCARV82 EQU   PCCA+36                                                  01783000
PCCARV81 EQU   PCCA+32                                                  01784000
PCCAPSAR EQU   PCCA+28                                                  01785000
PCCAPSAV EQU   PCCA+24                                                  01786000
PCCATQEP EQU   PCCA+20                                                  01787000
PCCACAFM EQU   PCCA+18                                                  01788000
PCCACPUA EQU   PCCA+16                                                  01789000
PCCACPID EQU   PCCA+4                                                   01790000
PCCAPCCA EQU   PCCA                                                     01791000
LRBCMPCS EQU   LRBCMP+2                                                 01792000
LRBCMPPA EQU   LRBCMP                                                   01793000
LRBCMPNO EQU   LRBCVAR+6                                                01794000
LRBCMPF2 EQU   LRBCVAR+5                                                01795000
LRBCMPF1 EQU   LRBCVAR+4                                                01796000
LRBCRESD EQU   LRBCVAR+2                                                01797000
LRBCFT   EQU   LRBCVAR                                                  01798000
LRBHMCEL EQU   LRBHCPID+6                                               01799000
LRBHMDL  EQU   LRBHCPID+4                                               01800000
LRBHCSER EQU   LRBHCPID+1                                               01801000
@NM00005 EQU   LRBHCPID                                                 01802000
LRBHTIME EQU   LRB+12                                                   01803000
LRBHDATE EQU   LRB+8                                                    01804000
@NM00004 EQU   LRB+7                                                    01805000
LRBHCNT  EQU   LRB+6                                                    01806000
LRBMCLB  EQU   LRBHSW3                                                  01807000
LRBNDEM  EQU   LRBMACT                                                  01808000
LRBNCEM  EQU   LRBMACT                                                  01809000
@NM00003 EQU   LRBHSW0                                                  01810000
LRBHTMC  EQU   LRBHSW0                                                  01811000
@NM00002 EQU   LRBHSW0                                                  01812000
LRBHNS   EQU   LRBHSW0                                                  01813000
LRBHMORE EQU   LRBHSW0                                                  01814000
@NM00001 EQU   LRBHSYS                                                  01815000
LRBHSYSB EQU   LRBHSYS                                                  01816000
@NM00055 EQU   PSA+3412                                                 01817000
PSASTAK  EQU   PSA+3072                                                 01818000
@NM00054 EQU   PSA+1032                                                 01819000
PSAUSEND EQU   PSA+1032                                                 01820000
PSAPCPSW EQU   PSA+1024                                                 01821000
PSARV060 EQU   PSA+1020                                                 01822000
PSARV059 EQU   PSA+1018                                                 01823000
PSASVC13 EQU   PSA+1016                                                 01824000
PSALSFCC EQU   PSA+1012                                                 01825000
PSASFACC EQU   PSA+1008                                                 01826000
PSASTOP  EQU   PSA+992                                                  01827000
PSASTART EQU   PSA+976                                                  01828000
PSARSPSW EQU   PSA+968                                                  01829000
PSASRPSW EQU   PSA+960                                                  01830000
PSARV045 EQU   PSA+892                                                  01831000
PSARV044 EQU   PSA+888                                                  01832000
PSARV043 EQU   PSA+884                                                  01833000
PSARV042 EQU   PSA+880                                                  01834000
PSARV041 EQU   PSA+876                                                  01835000
PSARV040 EQU   PSA+872                                                  01836000
PSARV025 EQU   PSA+868                                                  01837000
PSADSSED EQU   PSA+868                                                  01838000
PSADSSPR EQU   PSA+864                                                  01839000
PSADSSFW EQU   PSA+860                                                  01840000
PSADSS14 EQU   PSA+856                                                  01841000
PSADSSPP EQU   PSA+848                                                  01842000
PSADSSRP EQU   PSA+840                                                  01843000
PSADSS05 EQU   PSADSSF4                                                 01844000
PSADSS10 EQU   PSADSSF4                                                 01845000
PSADSSVE EQU   PSADSSF4                                                 01846000
PSADSSDE EQU   PSADSSF4                                                 01847000
PSADSSC0 EQU   PSADSSF4                                                 01848000
PSADSSIE EQU   PSADSSF4                                                 01849000
PSADSS12 EQU   PSADSSF4                                                 01850000
PSADSSRC EQU   PSADSSF4                                                 01851000
PSARV057 EQU   PSADSSF3                                                 01852000
PSARV056 EQU   PSADSSF3                                                 01853000
PSARV055 EQU   PSADSSF3                                                 01854000
PSARV054 EQU   PSADSSF3                                                 01855000
PSADSSRW EQU   PSADSSF3                                                 01856000
PSADSSNM EQU   PSADSSF3                                                 01857000
PSADSSES EQU   PSADSSF3                                                 01858000
PSADSSGP EQU   PSADSSF3                                                 01859000
PSADSSF2 EQU   PSADSSFL+1                                               01860000
PSADSSPI EQU   PSADSSF1                                                 01861000
PSADSSOI EQU   PSADSSF1                                                 01862000
PSADSSSP EQU   PSADSSF1                                                 01863000
PSADSSTP EQU   PSADSSF1                                                 01864000
PSADSSDW EQU   PSADSSF1                                                 01865000
PSADSSDD EQU   PSADSSF1                                                 01866000
PSADSSDM EQU   PSADSSF1                                                 01867000
PSADSSMV EQU   PSADSSF1                                                 01868000
PSADSSTS EQU   PSA+816                                                  01869000
PSADSSWK EQU   PSA+812                                                  01870000
PSADSSR3 EQU   PSA+808                                                  01871000
PSADSSR2 EQU   PSA+804                                                  01872000
PSADSSRS EQU   PSA+800                                                  01873000
PSASTOR  EQU   PSA+796                                                  01874000
PSACPUSA EQU   PSA+794                                                  01875000
PSAVSTAP EQU   PSA+792                                                  01876000
PSAWKVAP EQU   PSA+788                                                  01877000
PSAWKRAP EQU   PSA+784                                                  01878000
PSAMCHIC EQU   PSA+783                                                  01879000
PSARV061 EQU   PSA+782                                                  01880000
PSASYMSK EQU   PSA+781                                                  01881000
PSAMCHFL EQU   PSA+780                                                  01882000
PSACR0   EQU   PSA+776                                                  01883000
PSAPSWSV EQU   PSA+768                                                  01884000
PSALITA  EQU   PSA+764                                                  01885000
PSACLHS  EQU   PSAHLHI                                                  01886000
PSALKR15 EQU   PSALKSA+60                                               01887000
PSALKR14 EQU   PSALKSA+56                                               01888000
PSALKR13 EQU   PSALKSA+52                                               01889000
PSALKR12 EQU   PSALKSA+48                                               01890000
PSALKR11 EQU   PSALKSA+44                                               01891000
PSALKR10 EQU   PSALKSA+40                                               01892000
PSALKR9  EQU   PSALKSA+36                                               01893000
PSALKR8  EQU   PSALKSA+32                                               01894000
PSALKR7  EQU   PSALKSA+28                                               01895000
PSALKR6  EQU   PSALKSA+24                                               01896000
PSALKR5  EQU   PSALKSA+20                                               01897000
PSALKR4  EQU   PSALKSA+16                                               01898000
PSALKR3  EQU   PSALKSA+12                                               01899000
PSALKR2  EQU   PSALKSA+8                                                01900000
PSALKR1  EQU   PSALKSA+4                                                01901000
PSALKR0  EQU   PSALKSA                                                  01902000
PSARV023 EQU   PSACLHT+52                                               01903000
PSALOCAL EQU   PSACLHT+48                                               01904000
PSACMSL  EQU   PSACLHT+44                                               01905000
PSAOPTL  EQU   PSACLHT+40                                               01906000
PSATPACL EQU   PSACLHT+36                                               01907000
PSATPDNL EQU   PSACLHT+32                                               01908000
PSATPNCL EQU   PSACLHT+28                                               01909000
PSAIOSLL EQU   PSACLHT+24                                               01910000
PSAIOSUL EQU   PSACLHT+20                                               01911000
PSAIOSCL EQU   PSACLHT+16                                               01912000
PSAIOSSL EQU   PSACLHT+12                                               01913000
PSASALCL EQU   PSACLHT+8                                                01914000
PSAASML  EQU   PSACLHT+4                                                01915000
PSADISPL EQU   PSACLHT                                                  01916000
PSASRSA  EQU   PSA+636                                                  01917000
PSARV050 EQU   PSA+634                                                  01918000
PSADSSGO EQU   PSA+633                                                  01919000
PSARECUR EQU   PSA+632                                                  01920000
PSAHLHIS EQU   PSA+628                                                  01921000
PSAIPCSA EQU   PSA+624                                                  01922000
@NM00053 EQU   PSA+621                                                  01923000
PSAIPCDM EQU   PSA+620                                                  01924000
PSAIPCD  EQU   PSA+616                                                  01925000
@NM00052 EQU   PSA+613                                                  01926000
PSAIPCRM EQU   PSA+612                                                  01927000
PSAIPCR  EQU   PSA+608                                                  01928000
PSAMCHEX EQU   PSA+600                                                  01929000
PSAMPSW  EQU   PSA+592                                                  01930000
PSAEXPS2 EQU   PSA+584                                                  01931000
PSAEXPS1 EQU   PSA+576                                                  01932000
PSAPIREG EQU   PSA+572                                                  01933000
PSARSREG EQU   PSA+568                                                  01934000
PSAGPREG EQU   PSA+556                                                  01935000
PSARV022 EQU   PSASUP4                                                  01936000
PSARV021 EQU   PSASUP4                                                  01937000
PSARV020 EQU   PSASUP4                                                  01938000
PSARV019 EQU   PSASUP4                                                  01939000
PSARV018 EQU   PSASUP4                                                  01940000
PSARV017 EQU   PSASUP4                                                  01941000
PSARV016 EQU   PSASUP4                                                  01942000
PSARV015 EQU   PSASUP4                                                  01943000
PSARV014 EQU   PSASUP3                                                  01944000
PSARV013 EQU   PSASUP3                                                  01945000
PSARV012 EQU   PSASUP3                                                  01946000
PSARV011 EQU   PSASUP3                                                  01947000
PSARV010 EQU   PSASUP3                                                  01948000
PSARV009 EQU   PSASUP3                                                  01949000
PSARV008 EQU   PSASUP3                                                  01950000
PSAIOSUP EQU   PSASUP3                                                  01951000
PSALCR   EQU   PSASUP2                                                  01952000
PSARTM   EQU   PSASUP2                                                  01953000
PSAACR   EQU   PSASUP2                                                  01954000
PSAIPCE2 EQU   PSASUP2                                                  01955000
PSAIPCES EQU   PSASUP2                                                  01956000
PSAIPCEC EQU   PSASUP2                                                  01957000
PSAGTF   EQU   PSASUP2                                                  01958000
PSAIPCRI EQU   PSASUP2                                                  01959000
PSAIPCRP EQU   PSASUP1                                                  01960000
PSAIPCDR EQU   PSASUP1                                                  01961000
PSADISP  EQU   PSASUP1                                                  01962000
PSALOCK  EQU   PSASUP1                                                  01963000
PSAPI    EQU   PSASUP1                                                  01964000
PSAEXT   EQU   PSASUP1                                                  01965000
PSASVC   EQU   PSASUP1                                                  01966000
PSAIO    EQU   PSASUP1                                                  01967000
PSAAOLD  EQU   PSA+548                                                  01968000
PSAANEW  EQU   PSA+544                                                  01969000
PSATOLD  EQU   PSA+540                                                  01970000
PSATNEW  EQU   PSA+536                                                  01971000
PSALCCAR EQU   PSA+532                                                  01972000
PSALCCAV EQU   PSA+528                                                  01973000
PSAPCCAR EQU   PSA+524                                                  01974000
PSACPULA EQU   PSA+518                                                  01975000
PSACPUPA EQU   PSA+516                                                  01976000
PSAPSA   EQU   PSA+512                                                  01977000
FLCHDEND EQU   PSA+512                                                  01978000
FLCCRSAV EQU   FLCMCLA+280                                              01979000
FLCGRSAV EQU   FLCMCLA+216                                              01980000
FLCFPSAV EQU   FLCMCLA+184                                              01981000
FLCFLA   EQU   FLCMCLA+88                                               01982000
FLCRGNCD EQU   FLCMCLA+84                                               01983000
FLCFSAA  EQU   FLCFSA+1                                                 01984000
@NM00051 EQU   FLCFSA                                                   01985000
@NM00050 EQU   FLCMCLA+72                                               01986000
FLCMCIC  EQU   FLCMCLA+64                                               01987000
@NM00049 EQU   FLCMCLA+20                                               01988000
FLCIOAA  EQU   FLCIOA+1                                                 01989000
@NM00048 EQU   FLCIOA                                                   01990000
@NM00047 EQU   FLCMCLA+15                                               01991000
@NM00046 EQU   FLCMCLA+14                                               01992000
@NM00045 EQU   FLCMCLA+12                                               01993000
FLCLCL   EQU   FLCMCLA+8                                                01994000
FLCIOELA EQU   FLCIOEL+1                                                01995000
@NM00044 EQU   FLCIOEL                                                  01996000
FLCCHNID EQU   FLCMCLA                                                  01997000
@NM00043 EQU   PSA+160                                                  01998000
FLCMTRCD EQU   PSA+157                                                  01999000
@NM00042 EQU   PSA+156                                                  02000000
FLCPERA  EQU   FLCPER+1                                                 02001000
@NM00041 EQU   FLCPER                                                   02002000
@NM00040 EQU   PSA+151                                                  02003000
FLCPERCD EQU   PSA+150                                                  02004000
FLCMCNUM EQU   PSA+149                                                  02005000
@NM00039 EQU   PSA+148                                                  02006000
FLCTEAA  EQU   FLCTEA+1                                                 02007000
@NM00038 EQU   FLCTEA                                                   02008000
PSAPIPC  EQU   PSAPICOD                                                 02009000
PSAPIMC  EQU   PSAPICOD                                                 02010000
PSAPIPER EQU   PSAPICOD                                                 02011000
PSARV049 EQU   FLCPICOD                                                 02012000
FLCPILCB EQU   FLCPIILC                                                 02013000
@NM00037 EQU   FLCPIILC                                                 02014000
@NM00036 EQU   PSAEPPSW                                                 02015000
FLCSVCN  EQU   PSAESPSW+2                                               02016000
FLCSILCB EQU   FLCSVILC                                                 02017000
@NM00035 EQU   FLCSVILC                                                 02018000
@NM00034 EQU   PSAESPSW                                                 02019000
FLCEICOD EQU   PSAEEPSW+2                                               02020000
PSASPAD  EQU   PSAEEPSW                                                 02021000
@NM00033 EQU   PSA+128                                                  02022000
FLCINPSW EQU   PSA+120                                                  02023000
FLCMNPSW EQU   PSA+112                                                  02024000
FLCPNPSW EQU   PSA+104                                                  02025000
FLCSNPSW EQU   PSA+96                                                   02026000
FLCENPSW EQU   PSA+88                                                   02027000
FLCTRACE EQU   PSA+84                                                   02028000
FLCTIMER EQU   PSA+80                                                   02029000
FLCCVT2  EQU   PSA+76                                                   02030000
FLCCAW   EQU   PSA+72                                                   02031000
FLCCSW   EQU   PSA+64                                                   02032000
FLCIOPSW EQU   PSA+56                                                   02033000
FLCMOPSW EQU   PSA+48                                                   02034000
FLCPOPSW EQU   PSA+40                                                   02035000
FLCSOPSW EQU   PSA+32                                                   02036000
FLCEOPSW EQU   PSA+24                                                   02037000
@NM00032 EQU   FLCICCW2+4                                               02038000
FLCCVT   EQU   FLCICCW2                                                 02039000
FLCICCW1 EQU   FLCROPSW                                                 02040000
FLCIPPSW EQU   FLCRNPSW                                                 02041000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02042000
@ENDDATA EQU   *                                                        02043000
         END   IEEVDUMY                                                 02044000
