./  ADD  SSI=80700004,NAME=BLSVTCB
XTCB     TITLE 'BLSVTCB --SCAN TASK CONTROL BLOCK (TCB)                *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPLK                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSVTCB  CSECT ,                                                   0002 00006000
@MAINENT DS    0H                                                  0002 00007000
         USING *,@15                                               0002 00008000
         B     @PROLOG                                             0002 00009000
         DC    AL1(16)                                             0002 00010000
         DC    C'BLSVTCB   78.070'                                 0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00013000
         BALR  @12,0                                               0002 00014000
@PSTART  DS    0H                                                  0002 00015000
         USING @PSTART,@12                                         0002 00016000
         L     @00,@SIZDATD                                        0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                             0002 00019000
         LA    @10,4095(,@11)                                      0002 00020000
         USING @DATD,@11                                           0002 00021000
         USING @DATD+4095,@10                                      0002 00022000
         ST    @13,@SA00001+4                                      0002 00023000
         LM    @00,@01,20(@13)                                     0002 00024000
         ST    @11,8(,@13)                                         0002 00025000
         LR    @13,@11                                             0002 00026000
         MVC   @PC00001(12),0(@01)                                 0002 00027000
*/********************************************************************/ 00028000
*/*                                                                  */ 00029000
*/* BLSVTCB --SCAN TASK CONTROL BLOCK (TCB)                          */ 00030000
*/*                                                                  */ 00031000
*/********************************************************************/ 00032000
*                                                                  0169 00033000
*   /*****************************************************************/ 00034000
*   /*                                                               */ 00035000
*   /* BLSV1--SCAN EXIT SETUP                                        */ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                                  0169 00039000
*   DO;                             /* BLSV1                         */ 00040000
*     RESPECIFY                                                    0170 00041000
*      (RF) RESTRICTED;             /* RETURN CODES                  */ 00042000
*     RETC=ZZZFLAGI;                /* RETURN CODE                   */ 00043000
         SLR   RETC,RETC                                           0171 00044000
*     SABAPTR=ADDR(SAPA);           /* ->SABA (ALIAS FOR SAPA        */ 00045000
         L     SABAPTR,@PC00001+4                                  0172 00046000
*     IF SABASF1=ZZZ1 THEN          /* SCAN STARTED                  */ 00047000
         TM    SABASF1(SABAPTR),B'10000000'                        0173 00048000
         BNO   @RF00173                                            0173 00049000
*       IF                          /* IMAGE RETRIEVAL REQUIRED      */ 00050000
*           SABASF9=ZZZ0|           /* SCAN NOT COMPLETE             */ 00051000
*           (SABASFS=ZZZ1&ZZ2ASE<=SABASRC) THEN/* IMAGE USED FOR   0174 00052000
*                                      MESSAGES                      */ 00053000
         TM    SABASF9(SABAPTR),B'01000000'                        0174 00054000
         BZ    @RT00174                                            0174 00055000
         TM    SABASFS(SABAPTR),B'00010000'                        0174 00056000
         BNO   @RF00174                                            0174 00057000
         CLC   ZZ2ASE(1,R9),SABASRC(SABAPTR)                       0174 00058000
         BNH   @RT00174                                            0174 00059000
*         GO TO LBLSCAN2;           /* IMAGE RETRIEVAL               */ 00060000
*       ELSE                        /* NO IMAGE RETRIEVAL            */ 00061000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00062000
         B     LBLSCAN8                                            0176 00063000
*     SABAGMT=ZZ2TOD;               /* REQUEST DATA BASE UPDATE      */ 00064000
@RF00173 MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0177 00065000
*     SABACL=(LENGTH(ERRF)/8)*DIM(ERRF);/* LENGTH OF SABACT          */ 00066000
*                                                                  0178 00067000
         MVC   SABACL(2,SABAPTR),@CH01867                          0178 00068000
*     /***************************************************************/ 00069000
*     /*                                                             */ 00070000
*     /* CLEAR ALL ERROR FLAGS                                       */ 00071000
*     /*                                                             */ 00072000
*     /***************************************************************/ 00073000
*                                                                  0179 00074000
*     DO ERRFNDX=1 TO DIM(ERRF);    /* CLEAR ALL ERROR FLAGS         */ 00075000
         LA    ERRFNDX,1                                           0179 00076000
@DL00179 DS    0H                                                  0180 00077000
*       ERRF(ERRFNDX)='00'X;        /* ONE BYTE AT A TIME            */ 00078000
         LR    @14,SABAPTR                                         0180 00079000
         ALR   @14,ERRFNDX                                         0180 00080000
         MVI   ERRF-1(@14),X'00'                                   0180 00081000
*     END;                          /* CLEAR ALL ERROR FLAGS         */ 00082000
         AL    ERRFNDX,@CF00051                                    0181 00083000
         C     ERRFNDX,@CF01867                                    0181 00084000
         BNH   @DL00179                                            0181 00085000
*     IF SABALAD//8¬=0 THEN         /* UNALIGNED                     */ 00086000
*                                                                  0182 00087000
         L     @14,SABALAD(,SABAPTR)                               0182 00088000
         N     @14,@CF00442                                        0182 00089000
         LTR   @14,@14                                             0182 00090000
         BZ    @RF00182                                            0182 00091000
*       /*************************************************************/ 00092000
*       /*                                                           */ 00093000
*       /* UNALIGNED                                                 */ 00094000
*       /*                                                           */ 00095000
*       /*************************************************************/ 00096000
*                                                                  0183 00097000
*       DO;                         /* UNALIGNED                     */ 00098000
*         ERRFB(TST051)=ZZZ1;       /* UNALIGNED STORAGE ERROR       */ 00099000
         OI    ERRFB(SABAPTR),B'10000000'                          0184 00100000
*         SABASRC=ZZZFLAGS;         /* SCAN RETURN CODE              */ 00101000
         MVI   SABASRC(SABAPTR),X'0C'                              0185 00102000
*         SABASF1=ZZZ1;             /* SCAN STARTED                  */ 00103000
*         SABASF9=ZZZ1;             /* SCAN COMPLETED                */ 00104000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00105000
         OI    SABASF1(SABAPTR),B'11100000'                        0188 00106000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00107000
         B     LBLSCAN8                                            0189 00108000
*       END;                        /* UNALIGNED                     */ 00109000
*   END;                            /* BLSV1                         */ 00110000
@RF00182 DS    0H                                                  0192 00111000
*   DO;                             /* BLSVM0 MF(EXECUTE,TST052)     */ 00112000
*     IF SABALAD<8192 THEN                                         0193 00113000
         CLC   SABALAD(4,SABAPTR),@CF00046                         0193 00114000
         BNL   @RF00193                                            0193 00115000
*       DO;                         /* INITIAL ANALYSIS ERROR        */ 00116000
*         ERRFB(TST052)=ZZZ1;                                      0195 00117000
         OI    ERRFB+2(SABAPTR),B'10000000'                        0195 00118000
*         SABASRC=MAX(SABASRC,MSGLEVEL(TST052));                   0196 00119000
         SLR   @14,@14                                             0196 00120000
         IC    @14,SABASRC(,SABAPTR)                               0196 00121000
         SLR   @08,@08                                             0196 00122000
         IC    @08,MSGLEVEL+2                                      0196 00123000
         CR    @14,@08                                             0196 00124000
         BNL   *+6                                                      00125000
         LR    @14,@08                                             0196 00126000
         STC   @14,SABASRC(,SABAPTR)                               0196 00127000
*         SABASF1=ZZZ1;             /* ANALYSIS STARTED              */ 00128000
*         SABASF9=ZZZ1;             /* ANALYSIS COMPLETE             */ 00129000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00130000
         OI    SABASF1(SABAPTR),B'11100000'                        0199 00131000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00132000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0200 00133000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00134000
         B     LBLSCAN8                                            0201 00135000
*       END;                        /* INITIAL ANALYSIS ERROR        */ 00136000
*   END;                            /* BLSVM0 MF(EXECUTE,TST052)     */ 00137000
@RF00193 DS    0H                                                  0204 00138000
*   IF SABAAST=ZZZASTCV THEN        /* IF VIRTUAL STORAGE            */ 00139000
         CLC   SABAAST(2,SABAPTR),@CC00083                         0204 00140000
         BNE   @RF00204                                            0204 00141000
*     DO;                           /* BLSVM0 MF(EXECUTE,TST053)     */ 00142000
*       IF SABALAD>=ZZ6DCAP THEN                                   0206 00143000
         L     @14,ZZ2AZZ6P(,R9)                                   0206 00144000
         CLC   SABALAD(4,SABAPTR),ZZ6DCAP(@14)                     0206 00145000
         BL    @RF00206                                            0206 00146000
*         DO;                       /* INITIAL ANALYSIS ERROR        */ 00147000
*           ERRFB(TST053)=ZZZ1;                                    0208 00148000
         OI    ERRFB+3(SABAPTR),B'10000000'                        0208 00149000
*           SABASRC=MAX(SABASRC,MSGLEVEL(TST053));                 0209 00150000
         SLR   @14,@14                                             0209 00151000
         IC    @14,SABASRC(,SABAPTR)                               0209 00152000
         SLR   @08,@08                                             0209 00153000
         IC    @08,MSGLEVEL+3                                      0209 00154000
         CR    @14,@08                                             0209 00155000
         BNL   *+6                                                      00156000
         LR    @14,@08                                             0209 00157000
         STC   @14,SABASRC(,SABAPTR)                               0209 00158000
*           SABASF1=ZZZ1;           /* ANALYSIS STARTED              */ 00159000
*           SABASF9=ZZZ1;           /* ANALYSIS COMPLETE             */ 00160000
*           SABASFI=ZZZ1;           /* INITIAL ANALYSIS ERROR        */ 00161000
         OI    SABASF1(SABAPTR),B'11100000'                        0212 00162000
*           SABAGMT=ZZ2TOD;         /* REQUEST DATA BASE UPDATE      */ 00163000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0213 00164000
*           GO TO LBLSCAN8;         /* TRANSMIT SCAN MESSAGE(S)      */ 00165000
         B     LBLSCAN8                                            0214 00166000
*         END;                      /* INITIAL ANALYSIS ERROR        */ 00167000
*     END;                          /* BLSVM0 MF(EXECUTE,TST053)     */ 00168000
*                                                                  0216 00169000
@RF00206 DS    0H                                                  0217 00170000
*   /*****************************************************************/ 00171000
*   /*                                                               */ 00172000
*   /* BLSV2--RETRIEVE IMAGE OF BLOCK TO BE SCANNED                  */ 00173000
*   /*                                                               */ 00174000
*   /*****************************************************************/ 00175000
*                                                                  0217 00176000
*LBLSCAN2:                                                         0217 00177000
*   DO;                             /* BLSV2                         */ 00178000
@RF00204 DS    0H                                                  0217 00179000
LBLSCAN2 DS    0H                                                  0218 00180000
*     ESAU(1:LENGTH(ESCO))=ESCO;    /* INITIALIZE ES RECORD          */ 00181000
         L     @14,ZZ2ESSYP(,R9)                                   0218 00182000
         MVC   ESAU(182),ESCO(@14)                                 0218 00183000
*     ESAUAS=SABAAS;                /* ADDRESS SPACE                 */ 00184000
         MVC   ESAUAS(16),SABAAS(SABAPTR)                          0219 00185000
*     ESAULAD=SABALAD;              /* LOGICAL ADDRESS               */ 00186000
         L     @14,SABALAD(,SABAPTR)                               0220 00187000
         ST    @14,ESAULAD                                         0220 00188000
*     ESAUDT=SABADT;                /* DATA TYPE                     */ 00189000
         MVC   ESAUDT(34),SABADT(SABAPTR)                          0221 00190000
*     ESAUDOF=-LENGTH(TCBFIX);      /* DATA OFFSET                   */ 00191000
         MVC   ESAUDOF(4),@CF01949                                 0222 00192000
*     ESAUDLE=LENGTH(BUF);          /* LENGTH                        */ 00193000
         MVC   ESAUDLE(4),@CF01950                                 0223 00194000
*     CALL BLSRACCQ(ZZ2,ESAU,BUF);  /* RETRIEVE STORAGE              */ 00195000
         ST    R9,@AL00001                                         0224 00196000
         LA    @14,ESAU                                            0224 00197000
         ST    @14,@AL00001+4                                      0224 00198000
         LA    @14,BUF                                             0224 00199000
         ST    @14,@AL00001+8                                      0224 00200000
         L     @08,ZZ2RVTP(,R9)                                    0224 00201000
         L     @15,RVTACCQP(,@08)                                  0224 00202000
         LA    @01,@AL00001                                        0224 00203000
         BALR  @14,@15                                             0224 00204000
*     IF ESAUFSM=ZZZ1 THEN          /* STORAGE NOT AVAILABLE         */ 00205000
*                                                                  0225 00206000
         TM    ESAUFSM,B'00100000'                                 0225 00207000
         BNO   @RF00225                                            0225 00208000
*       /*************************************************************/ 00209000
*       /*                                                           */ 00210000
*       /* STORAGE NOT AVAILABLE                                     */ 00211000
*       /*                                                           */ 00212000
*       /*************************************************************/ 00213000
*                                                                  0226 00214000
*       DO;                         /* STORAGE NOT AVAILABLE         */ 00215000
*         IF ZZ1EVEP=ZZZ1 THEN      /* EARLY TERMINATION REQUESTED   */ 00216000
*                                                                  0227 00217000
         L     @14,ZZ2ZZ1P(,R9)                                    0227 00218000
         TM    ZZ1EVEP(@14),B'01000000'                            0227 00219000
         BNO   @RF00227                                            0227 00220000
*           /*********************************************************/ 00221000
*           /*                                                       */ 00222000
*           /* EARLY TERMINATION REQUESTED                           */ 00223000
*           /*                                                       */ 00224000
*           /*********************************************************/ 00225000
*                                                                  0228 00226000
*           DO;                     /* EARLY TERMINATION REQUESTED   */ 00227000
*             RETC=ZZZFLAGS;        /* RETURN CODE                   */ 00228000
         LA    RETC,12                                             0229 00229000
*             GO TO EXIT;           /* COMMON EXIT PATH              */ 00230000
         B     EXIT                                                0230 00231000
*           END;                    /* EARLY TERMINATION REQUESTED   */ 00232000
*         ERRFB(TST050)=ZZZ1;       /* STORAGE NOT AVAILABLE         */ 00233000
@RF00227 OI    ERRFB+1(SABAPTR),B'10000000'                        0232 00234000
*         SABASRC=MAX(SABASRC,ZZZFLAGW);/* SCAN RETURN CODE          */ 00235000
         SLR   @14,@14                                             0233 00236000
         IC    @14,SABASRC(,SABAPTR)                               0233 00237000
         LA    @08,4                                               0233 00238000
         CR    @14,@08                                             0233 00239000
         BNL   *+6                                                      00240000
         LR    @14,@08                                             0233 00241000
         STC   @14,SABASRC(,SABAPTR)                               0233 00242000
*         SABASF1=ZZZ1;             /* SCAN STARTED                  */ 00243000
*         SABASF9=ZZZ1;             /* SCAN COMPLETE                 */ 00244000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00245000
         OI    SABASF1(SABAPTR),B'11100000'                        0236 00246000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00247000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0237 00248000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00249000
         B     LBLSCAN8                                            0238 00250000
*       END;                        /* STORAGE NOT AVAILABLE         */ 00251000
*     TCBPTR=ADDR(BUF)-ESAUDOF;     /* ->IMAGE                       */ 00252000
@RF00225 LA    TCBPTR,BUF                                          0240 00253000
         SL    TCBPTR,ESAUDOF                                      0240 00254000
*     FVAL(1)=TCBRBP;               /* POINTER 1                     */ 00255000
         L     @14,TCBRBP(,TCBPTR)                                 0241 00256000
         ST    @14,FVAL                                            0241 00257000
*     FVAL(2)=TCBDEB;               /* POINTER 2                     */ 00258000
         L     @14,TCBDEB(,TCBPTR)                                 0242 00259000
         ST    @14,FVAL+4                                          0242 00260000
*     FVAL(3)=TCBTIO;               /* POINTER 3                     */ 00261000
         L     @14,TCBTIO(,TCBPTR)                                 0243 00262000
         ST    @14,FVAL+8                                          0243 00263000
*     FVAL(4)=TCBMSS;               /* POINTER 4                     */ 00264000
         L     @14,TCBMSS(,TCBPTR)                                 0244 00265000
         ST    @14,FVAL+12                                         0244 00266000
*     FVAL(5)=TCBJLB;               /* POINTER 5                     */ 00267000
         L     @14,TCBJLB(,TCBPTR)                                 0245 00268000
         ST    @14,FVAL+16                                         0245 00269000
*     FVAL(6)=TCBTCB;               /* POINTER 6                     */ 00270000
         L     @14,TCBTCB(,TCBPTR)                                 0246 00271000
         ST    @14,FVAL+20                                         0246 00272000
*     FVAL(7)=TCBJSTCB;             /* POINTER 7                     */ 00273000
         L     @14,TCBJSTCB(,TCBPTR)                               0247 00274000
         ST    @14,FVAL+24                                         0247 00275000
*     FVAL(8)=TCBNTC;               /* POINTER 8                     */ 00276000
         L     @14,TCBNTC(,TCBPTR)                                 0248 00277000
         ST    @14,FVAL+28                                         0248 00278000
*     FVAL(9)=TCBOTC;               /* POINTER 9                     */ 00279000
         L     @14,TCBOTC(,TCBPTR)                                 0249 00280000
         ST    @14,FVAL+32                                         0249 00281000
*     FVAL(10)=TCBLTC;              /* POINTER 10                    */ 00282000
         L     @14,TCBLTC(,TCBPTR)                                 0250 00283000
         ST    @14,FVAL+36                                         0250 00284000
*     FVAL(11)=TCBIQE;              /* POINTER 11                    */ 00285000
         L     @14,TCBIQE(,TCBPTR)                                 0251 00286000
         ST    @14,FVAL+40                                         0251 00287000
*     FVAL(12)=TCBJPQ;              /* POINTER 12                    */ 00288000
         L     @14,TCBJPQ(,TCBPTR)                                 0252 00289000
         ST    @14,FVAL+44                                         0252 00290000
*     FVAL(13)=TCBJSCB;             /* POINTER 13                    */ 00291000
         L     @14,TCBJSCB(,TCBPTR)                                0253 00292000
         ST    @14,FVAL+48                                         0253 00293000
*     FVAL(14)=TCBBACK;             /* POINTER 14                    */ 00294000
         L     @14,TCBBACK(,TCBPTR)                                0254 00295000
         ST    @14,FVAL+52                                         0254 00296000
*     FVAL(15)=TCBRTWA;             /* POINTER 15                    */ 00297000
         L     @14,TCBRTWA(,TCBPTR)                                0255 00298000
         ST    @14,FVAL+56                                         0255 00299000
*     IF SABASF9=ZZZ1 THEN          /* SCAN COMPLETED                */ 00300000
         TM    SABASF9(SABAPTR),B'01000000'                        0256 00301000
         BO    @RT00256                                            0256 00302000
*       GO TO LBLSCAN8;             /* TRANSMIT SCAN MESSAGE(S)      */ 00303000
*     SABASF9=ZZZ1;                 /* SCAN COMPLETED                */ 00304000
         OI    SABASF9(SABAPTR),B'01000000'                        0258 00305000
*     IF SABASF1=ZZZ1 THEN          /* SCAN STARTED                  */ 00306000
         TM    SABASF1(SABAPTR),B'10000000'                        0259 00307000
         BO    @RT00259                                            0259 00308000
*       GO TO LBLSCAN7;             /* ANALYZE LOCATOR DATA          */ 00309000
*   END;                            /* BLSV2                         */ 00310000
*   SABAF=ESAUD;                    /* SET STORAGE ATTRIBUTES        */ 00311000
         MVC   SABAF(60,SABAPTR),ESAUD                             0262 00312000
*   DO;                             /* BLSVM0 MF(EXECUTE,TST054)     */ 00313000
*     IF TCBTCBID¬='TCB ' THEN                                     0264 00314000
         CLC   TCBTCBID(4,TCBPTR),@CC01909                         0264 00315000
         BE    @RF00264                                            0264 00316000
*       DO;                         /* INITIAL ANALYSIS ERROR        */ 00317000
*         ERRFB(TST054)=ZZZ1;                                      0266 00318000
         OI    ERRFB+4(SABAPTR),B'10000000'                        0266 00319000
*         SABASRC=MAX(SABASRC,MSGLEVEL(TST054));                   0267 00320000
         SLR   @14,@14                                             0267 00321000
         IC    @14,SABASRC(,SABAPTR)                               0267 00322000
         SLR   @08,@08                                             0267 00323000
         IC    @08,MSGLEVEL+4                                      0267 00324000
         CR    @14,@08                                             0267 00325000
         BNL   *+6                                                      00326000
         LR    @14,@08                                             0267 00327000
         STC   @14,SABASRC(,SABAPTR)                               0267 00328000
*         SABASF1=ZZZ1;             /* ANALYSIS STARTED              */ 00329000
*         SABASF9=ZZZ1;             /* ANALYSIS COMPLETE             */ 00330000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00331000
         OI    SABASF1(SABAPTR),B'11100000'                        0270 00332000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00333000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0271 00334000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00335000
         B     LBLSCAN8                                            0272 00336000
*       END;                        /* INITIAL ANALYSIS ERROR        */ 00337000
*   END;                            /* BLSVM0 MF(EXECUTE,TST054)     */ 00338000
@RF00264 DS    0H                                                  0275 00339000
*   DO;                             /* BLSVM1 MF(EXECUTE,TST055)     */ 00340000
*     IF TCBZERO¬='0000'B THEN                                     0276 00341000
         TM    TCBZERO(TCBPTR),B'00001111'                         0276 00342000
         BZ    @RF00276                                            0276 00343000
*       DO;                         /* MAIN ANALYSIS ERROR           */ 00344000
*         ERRFB(TST055)=ZZZ1;                                      0278 00345000
         OI    ERRFB+5(SABAPTR),B'10000000'                        0278 00346000
*         SABASRC=MAX(SABASRC,MSGLEVEL(TST055));                   0279 00347000
         SLR   @14,@14                                             0279 00348000
         IC    @14,SABASRC(,SABAPTR)                               0279 00349000
         SLR   @08,@08                                             0279 00350000
         IC    @08,MSGLEVEL+5                                      0279 00351000
         CR    @14,@08                                             0279 00352000
         BNL   *+6                                                      00353000
         LR    @14,@08                                             0279 00354000
         STC   @14,SABASRC(,SABAPTR)                               0279 00355000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00356000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0280 00357000
*       END;                        /* MAIN ANALYSIS ERROR           */ 00358000
*   END;                            /* BLSVM1 MF(EXECUTE,TST055)     */ 00359000
@RF00276 DS    0H                                                  0283 00360000
*   IF TCBJSTCB=SABALAD THEN        /* THIS TCB IS A JOB STEP TCB    */ 00361000
         CLC   TCBJSTCB(4,TCBPTR),SABALAD(SABAPTR)                 0283 00362000
         BNE   @RF00283                                            0283 00363000
*     DO;                           /* BLSVM2 MF(EXECUTE,TSTJSTCB)   */ 00364000
*       ERRFD(DIM(MSGPTR)+TSTJSTCB)=ZZZ1;/* TEST COMPLETED           */ 00365000
*       ERRFS(DIM(MSGPTR)+TSTJSTCB)=ZZZ1;/* SPECIAL TEST PERFORMED   */ 00366000
         OI    ERRFD+12(SABAPTR),B'01010000'                       0286 00367000
*       SABAGMT=ZZ2TOD;             /* REQUEST DATA BASE UPDATE      */ 00368000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0287 00369000
*     END;                          /* BLSVM2 MF(EXECUTE,TSTJSTCB)   */ 00370000
*LBLSCAN7:                          /* ANALYZE LOCATOR DATA          */ 00371000
*   IF SABAAST¬=ZZZASTCV|           /* IF VIRTUAL STORAGE OR         */ 00372000
*       (ZZ6DFAB='0'B&ZZ6DQ1¬=1&SABALAD<ZZ6DPRP) THEN              0289 00373000
@RF00283 DS    0H                                                  0289 00374000
LBLSCAN7 CLC   SABAAST(2,SABAPTR),@CC00083                         0289 00375000
         BNE   @RT00289                                            0289 00376000
         L     @14,ZZ2AZZ6P(,R9)                                   0289 00377000
         TM    ZZ6DFAB(@14),B'00010000'                            0289 00378000
         BNZ   @RF00289                                            0289 00379000
         CLC   ZZ6DQ1(4,@14),@CF00051                              0289 00380000
         BE    @RF00289                                            0289 00381000
         CLC   SABALAD(4,SABAPTR),ZZ6DPRP(@14)                     0289 00382000
         BL    @RT00289                                            0289 00383000
*     GO TO LBLSCAN8;               /* TRANSMIT SCAN MESSAGE(S)      */ 00384000
*                                                                  0290 00385000
*   /*****************************************************************/ 00386000
*   /*                                                               */ 00387000
*   /* BLSV79--SCAN EXIT LOCATOR ANALYSIS, MESSAGE TRANSMISSION, AND */ 00388000
*   /* EPILOG                                                        */ 00389000
*   /*                                                               */ 00390000
*   /*****************************************************************/ 00391000
*                                                                  0291 00392000
*   DO;                             /* BLSV79                        */ 00393000
*                                                                  0291 00394000
@RF00289 DS    0H                                                  0292 00395000
*     /***************************************************************/ 00396000
*     /*                                                             */ 00397000
*     /* BLSV7--ANALYZE LOCATOR DATA                                 */ 00398000
*     /*                                                             */ 00399000
*     /***************************************************************/ 00400000
*                                                                  0292 00401000
*     DO;                           /* BLSV7                         */ 00402000
*       ERRFNDX=DIM(MSGPTR)+1;      /* ERROR INDEX                   */ 00403000
         LA    ERRFNDX,7                                           0293 00404000
*       SAAUAS=SABAAS;              /* ADDRESS SPACE                 */ 00405000
         MVC   SAAUAS(16),SABAAS(SABAPTR)                          0294 00406000
*       SAAUDTY=ZZZDTYM;            /* DATA TYPE CODE                */ 00407000
         MVI   SAAUDTY,C'M'                                        0295 00408000
*       SAAUDTD=ZZZSYM40;           /* RESET DATA NAME               */ 00409000
         MVC   SAAUDTD(31),@CC00183                                0296 00410000
*       SAAUDTD(1:LENGTH('RB'))='RB';/* DATA NAME                    */ 00411000
         MVC   SAAUDTD(2),@CC01912                                 0297 00412000
*       CALL BLSRPCK1;              /* POINTER TEST 1                */ 00413000
         BAL   @14,BLSRPCK1                                        0298 00414000
*       SAAUDTD(1:LENGTH('DEB'))='DEB';/* DATA NAME                  */ 00415000
         MVC   SAAUDTD(3),@CC01914                                 0299 00416000
*       CALL BLSRPCK2;              /* POINTER TEST 2                */ 00417000
         BAL   @14,BLSRPCK2                                        0300 00418000
*       SAAUDTD(1:LENGTH('TIOT'))='TIOT';/* DATA NAME                */ 00419000
         MVC   SAAUDTD(4),@CC01916                                 0301 00420000
*       CALL BLSRPCK2;              /* POINTER TEST 3                */ 00421000
         BAL   @14,BLSRPCK2                                        0302 00422000
*       SAAUDTD(1:LENGTH('SPQE'))='SPQE';/* DATA NAME                */ 00423000
         MVC   SAAUDTD(4),@CC01917                                 0303 00424000
*       CALL BLSRPCK2;              /* POINTER TEST 4                */ 00425000
         BAL   @14,BLSRPCK2                                        0304 00426000
*       SAAUDTD=ZZZSYM40;           /* RESET DATA NAME               */ 00427000
         MVC   SAAUDTD(31),@CC00183                                0305 00428000
*       SAAUDTD(1:LENGTH('DCB'))='DCB';/* DATA NAME                  */ 00429000
         MVC   SAAUDTD(3),@CC01918                                 0306 00430000
*       CALL BLSRPCK2;              /* POINTER TEST 5                */ 00431000
         BAL   @14,BLSRPCK2                                        0307 00432000
*       SAAUDTD(1:LENGTH('TCB'))='TCB';/* DATA NAME                  */ 00433000
         MVC   SAAUDTD(3),@CC01919                                 0308 00434000
*       CALL BLSRPCK2;              /* POINTER TEST 6                */ 00435000
         BAL   @14,BLSRPCK2                                        0309 00436000
*       CALL BLSRPCK1;              /* POINTER TEST 7                */ 00437000
         BAL   @14,BLSRPCK1                                        0310 00438000
*       CALL BLSRPCK2;              /* POINTER TEST 8                */ 00439000
         BAL   @14,BLSRPCK2                                        0311 00440000
*       CALL BLSRPCK2;              /* POINTER TEST 9                */ 00441000
         BAL   @14,BLSRPCK2                                        0312 00442000
*       CALL BLSRPCK2;              /* POINTER TEST 10               */ 00443000
         BAL   @14,BLSRPCK2                                        0313 00444000
*       SAAUDTD(1:LENGTH('IQE'))='IQE';/* DATA NAME                  */ 00445000
         MVC   SAAUDTD(3),@CC01920                                 0314 00446000
*       CALL BLSRPCK2;              /* POINTER TEST 11               */ 00447000
         BAL   @14,BLSRPCK2                                        0315 00448000
*       SAAUDTD(1:LENGTH('CDE'))='CDE';/* DATA NAME                  */ 00449000
         MVC   SAAUDTD(3),@CC01921                                 0316 00450000
*       CALL BLSRPCK2;              /* POINTER TEST 12               */ 00451000
         BAL   @14,BLSRPCK2                                        0317 00452000
*       SAAUDTD(1:LENGTH('JSCB'))='JSCB';/* DATA NAME                */ 00453000
         MVC   SAAUDTD(4),@CC01922                                 0318 00454000
*       CALL BLSRPCK2;              /* POINTER TEST 13               */ 00455000
         BAL   @14,BLSRPCK2                                        0319 00456000
*       SAAUDTD=ZZZSYM40;           /* RESET DATA NAME               */ 00457000
         MVC   SAAUDTD(31),@CC00183                                0320 00458000
*       SAAUDTD(1:LENGTH('TCB'))='TCB';/* DATA NAME                  */ 00459000
         MVC   SAAUDTD(3),@CC01919                                 0321 00460000
*       CALL BLSRPCK2;              /* POINTER TEST 14               */ 00461000
         BAL   @14,BLSRPCK2                                        0322 00462000
*       SAAUDTD(1:LENGTH('RTM2WA'))='RTM2WA';/* DATA NAME            */ 00463000
         MVC   SAAUDTD(6),@CC01923                                 0323 00464000
*       CALL BLSRPCK2;              /* POINTER TEST 15               */ 00465000
         BAL   @14,BLSRPCK2                                        0324 00466000
*     END;                          /* BLSV7                         */ 00467000
*                                                                  0325 00468000
*     /***************************************************************/ 00469000
*     /*                                                             */ 00470000
*     /* BLSV8--TRANSMIT SCAN MESSAGE(S)                             */ 00471000
*     /*                                                             */ 00472000
*     /***************************************************************/ 00473000
*                                                                  0326 00474000
*LBLSCAN8:                                                         0326 00475000
*     DO;                           /* BLSV8                         */ 00476000
LBLSCAN8 DS    0H                                                  0327 00477000
*       SABASF1=ZZZ1;               /* SCAN STARTED                  */ 00478000
         OI    SABASF1(SABAPTR),B'10000000'                        0327 00479000
*       IF SABASRC=ZZZFLAGI|SABASRC<ZZ2ASE|ZZ1EVEP=ZZZ1 THEN       0328 00480000
         CLI   SABASRC(SABAPTR),0                                  0328 00481000
         BE    @RT00328                                            0328 00482000
         CLC   SABASRC(1,SABAPTR),ZZ2ASE(R9)                       0328 00483000
         BL    @RT00328                                            0328 00484000
         L     @14,ZZ2ZZ1P(,R9)                                    0328 00485000
         TM    ZZ1EVEP(@14),B'01000000'                            0328 00486000
         BO    @RT00328                                            0328 00487000
*         GO TO EXIT;               /* COMMON EXIT PATH              */ 00488000
*       CALL BLSRSAPC(ZZ2,SABA,SABK);/* IDENTIFY DAMAGED AREA        */ 00489000
*                                                                  0330 00490000
         ST    R9,@AL00001                                         0330 00491000
         ST    SABAPTR,@AL00001+4                                  0330 00492000
         L     @14,@PC00001+8                                      0330 00493000
         ST    @14,@AL00001+8                                      0330 00494000
         L     @08,ZZ2RVTP(,R9)                                    0330 00495000
         L     @15,RVTSAPCP(,@08)                                  0330 00496000
         LA    @01,@AL00001                                        0330 00497000
         BALR  @14,@15                                             0330 00498000
*       /*************************************************************/ 00499000
*       /*                                                           */ 00500000
*       /* PROCESS UNIQUE MESSAGES                                   */ 00501000
*       /*                                                           */ 00502000
*       /*************************************************************/ 00503000
*                                                                  0331 00504000
*       DO ERRFNDX=1 TO DIM(MSGPTR);/* PROCESS UNIQUE MESSAGES       */ 00505000
         LA    ERRFNDX,1                                           0331 00506000
@DL00331 DS    0H                                                  0332 00507000
*         IF ERRFB(ERRFNDX)=ZZZ1&MSGLEVEL(ERRFNDX)>=ZZ2ASE THEN    0332 00508000
         LR    @14,SABAPTR                                         0332 00509000
         ALR   @14,ERRFNDX                                         0332 00510000
         TM    ERRFB-1(@14),B'10000000'                            0332 00511000
         BNO   @RF00332                                            0332 00512000
         SLR   @14,@14                                             0332 00513000
         IC    @14,MSGLEVEL-1(ERRFNDX)                             0332 00514000
         SLR   @08,@08                                             0332 00515000
         IC    @08,ZZ2ASE(,R9)                                     0332 00516000
         CR    @14,@08                                             0332 00517000
         BL    @RF00332                                            0332 00518000
*           CALL BLSUPUTV(ZZ2,MSGPTR(ERRFNDX)->VRBA);              0333 00519000
         ST    R9,@AL00001                                         0333 00520000
         LR    @14,ERRFNDX                                         0333 00521000
         SLA   @14,2                                               0333 00522000
         L     @14,MSGPTR-4(@14)                                   0333 00523000
         ST    @14,@AL00001+4                                      0333 00524000
         L     @08,ZZ2BVTP(,R9)                                    0333 00525000
         L     @15,BVTPUTVP(,@08)                                  0333 00526000
         LA    @01,@AL00001                                        0333 00527000
         BALR  @14,@15                                             0333 00528000
*       END;                        /* PROCESS UNIQUE MESSAGES       */ 00529000
@RF00332 AL    ERRFNDX,@CF00051                                    0334 00530000
         C     ERRFNDX,@CF00587                                    0334 00531000
         BNH   @DL00331                                            0334 00532000
*       IF ZZ2ASE<=8&SABASFS=ZZZ1 THEN                             0335 00533000
*                                                                  0335 00534000
         CLI   ZZ2ASE(R9),8                                        0335 00535000
         BH    @RF00335                                            0335 00536000
         TM    SABASFS(SABAPTR),B'00010000'                        0335 00537000
         BNO   @RF00335                                            0335 00538000
*         /***********************************************************/ 00539000
*         /*                                                         */ 00540000
*         /* DIAGNOSE DAMAGED POINTER(S)                             */ 00541000
*         /*                                                         */ 00542000
*         /***********************************************************/ 00543000
*                                                                  0336 00544000
*         DO ERRFNDX=DIM(MSGPTR)+1 TO DIM(MSGPTR)+DIM(FVAL);       0336 00545000
         LA    ERRFNDX,7                                           0336 00546000
@DL00336 DS    0H                                                  0337 00547000
*           IF ERRFB(ERRFNDX)=ZZZ1 THEN/* DAMAGED POINTER            */ 00548000
*                                                                  0337 00549000
         LR    @14,SABAPTR                                         0337 00550000
         ALR   @14,ERRFNDX                                         0337 00551000
         TM    ERRFB-1(@14),B'10000000'                            0337 00552000
         BNO   @RF00337                                            0337 00553000
*             /*******************************************************/ 00554000
*             /*                                                     */ 00555000
*             /* DAMAGED POINTER                                     */ 00556000
*             /*                                                     */ 00557000
*             /*******************************************************/ 00558000
*                                                                  0338 00559000
*             DO;                   /* DAMAGED POINTER               */ 00560000
*               FNAMENDX=ERRFNDX-DIM(MSGPTR);/* FNAME/FVAL INDEX     */ 00561000
         LR    FNAMENDX,ERRFNDX                                    0339 00562000
         SL    FNAMENDX,@CF00587                                   0339 00563000
*               MV99B=MV99S;        /* MESSAGE MV99 LITERAL TEXT     */ 00564000
         MVC   MV99B(60),MV99S                                     0340 00565000
*               MV99BTD=FNAME(FNAMENDX);/* NAME OF DAMAGED POINTER   */ 00566000
         LR    @14,FNAMENDX                                        0341 00567000
         SLA   @14,3                                               0341 00568000
         LA    @08,FNAME-8(@14)                                    0341 00569000
         MVC   MV99BTD(8),0(@08)                                   0341 00570000
*               DO;                 /* BLRCNVPC(FVAL(FNAMENDX)) FROM(   00571000
*                                      POINTER)TO(CHARACTER)SET(MV99B   00572000
*                                      TF)REMARK(CONTENTS OF DAMAGED    00573000
*                                      POINTER)TR(ZZ1TRHEX)          */ 00574000
*                                                                  0342 00575000
*                 /***************************************************/ 00576000
*                 /*                                                 */ 00577000
*                 /* CONTENTS OF DAMAGED POINTER                     */ 00578000
*                 /*                                                 */ 00579000
*                 /***************************************************/ 00580000
*                                                                  0343 00581000
*                 PTRPTR=FVAL(FNAMENDX);/* SOURCE TO BIT/POINTER   0343 00582000
*                                      INTERMEDIATE                  */ 00583000
         LR    @14,FNAMENDX                                        0343 00584000
         SLA   @14,2                                               0343 00585000
         L     @14,FVAL-4(@14)                                     0343 00586000
         ST    @14,PTRPTR                                          0343 00587000
*                 UNPK(MV99BTF(1:LENGTH(MV99BTF)-1),PTRBIT);/*     0344 00588000
*                                      BIT=>ZONED HEXADECIMAL        */ 00589000
         UNPK  MV99BTF(7),PTRBIT(4)                                0344 00590000
*                 MV99BTF(LENGTH(MV99BTF):LENGTH(MV99BTF))=PTRBIT(25:32 00591000
*                     );            /* FINAL ZONED HEXADECIMAL DIGIT */ 00592000
         MVC   MV99BTF+7(1),PTRBIT+3                               0345 00593000
*                 TR(MV99BTF,ZZ1TRHEX);/* ZONED HEXADECIMAL=>EBCDIC  */ 00594000
         L     @14,ZZ2ZZ1P(,R9)                                    0346 00595000
         TR    MV99BTF(8),ZZ1TRHEX(@14)                            0346 00596000
*               END;                /* BLRCNVPC(FVAL(FNAMENDX)) FROM(   00597000
*                                      POINTER)TO(CHARACTER)SET(MV99B   00598000
*                                      TF)REMARK(CONTENTS OF DAMAGED    00599000
*                                      POINTER)TR(ZZ1TRHEX)          */ 00600000
*               CALL BLSUMPKN(ZZ2,MV99B,LENGTH(MV99BTA)+LENGTH(MV99BTB) 00601000
*                   );              /* COMPRESS MESSAGE MV99         */ 00602000
         ST    R9,@AL00001                                         0348 00603000
         LA    @14,MV99B                                           0348 00604000
         ST    @14,@AL00001+4                                      0348 00605000
         LA    @14,@CF00037                                        0348 00606000
         ST    @14,@AL00001+8                                      0348 00607000
         L     @08,ZZ2BVTP(,R9)                                    0348 00608000
         L     @15,BVTMPKNP(,@08)                                  0348 00609000
         LA    @01,@AL00001                                        0348 00610000
         BALR  @14,@15                                             0348 00611000
*               CALL BLSUPUTV(ZZ2,MV99B);/* DISPLAY MESSAGE MV99     */ 00612000
         ST    R9,@AL00001                                         0349 00613000
         LA    @14,MV99B                                           0349 00614000
         ST    @14,@AL00001+4                                      0349 00615000
         L     @08,ZZ2BVTP(,R9)                                    0349 00616000
         L     @15,BVTPUTVP(,@08)                                  0349 00617000
         LA    @01,@AL00001                                        0349 00618000
         BALR  @14,@15                                             0349 00619000
*             END;                  /* DAMAGED POINTER               */ 00620000
*         END;                      /* DIAGNOSE DAMAGED POINTERS     */ 00621000
@RF00337 AL    ERRFNDX,@CF00051                                    0351 00622000
         C     ERRFNDX,@CF01867                                    0351 00623000
         BNH   @DL00336                                            0351 00624000
*     END;                          /* BLSV8                         */ 00625000
*                                                                  0352 00626000
@RF00335 DS    0H                                                  0353 00627000
*     /***************************************************************/ 00628000
*     /*                                                             */ 00629000
*     /* BLSV9--SCAN EPILOG                                          */ 00630000
*     /*                                                             */ 00631000
*     /***************************************************************/ 00632000
*                                                                  0353 00633000
*EXIT:                                                             0353 00634000
*     RETURN CODE(RETC);                                           0353 00635000
EXIT     L     @13,4(,@13)                                         0353 00636000
         L     @00,@SIZDATD                                        0353 00637000
         LR    @01,@11                                             0353 00638000
         BLSUFRES R,LV=(0),A=(1)                                        00639000
         LR    @15,@05                                             0353 00640000
         L     @14,12(,@13)                                        0353 00641000
         LM    @00,@12,20(@13)                                     0353 00642000
         BR    @14                                                 0353 00643000
*   END;                            /* BLSV79                        */ 00644000
         EJECT                                                          00645000
*                                                                  0355 00646000
*/*------------------------------------------------------------------*/ 00647000
*/* BLSRPCK1--EVALUATE A REQUIRED LOCATOR                            */ 00648000
*/*------------------------------------------------------------------*/ 00649000
*                                                                  0355 00650000
*BLSRPCK1:                          /* EVALUATE A REQUIRED LOCATOR   */ 00651000
*   PROCEDURE;                                                     0355 00652000
BLSRPCK1 STM   @14,@03,@SA00002                                    0355 00653000
         STM   @05,@12,@SA00002+24                                 0355 00654000
*   DECLARE                                                        0356 00655000
*     1 PCHK POINTER DEFINED(SAAULAD),/* LOCATOR VALIDATION DATA     */ 00656000
*      2 PCHK24IG BIT(8),           /* IGNORED IN 24-BIT ADDRESS     */ 00657000
*      2 PCHK24 POINTER(24);        /* 24-BIT INTERPRETATION         */ 00658000
*   ERLF=ERRF(ERRFNDX);             /* ERROR FLAGS                   */ 00659000
         LR    @14,SABAPTR                                         0357 00660000
         ALR   @14,ERRFNDX                                         0357 00661000
         MVC   ERLF(1),ERRF-1(@14)                                 0357 00662000
*   IF ERLFD=ZZZ1 THEN              /* LOCATOR TEST COMPLETE         */ 00663000
         TM    ERLFD,B'01000000'                                   0358 00664000
         BO    @RT00358                                            0358 00665000
*     GO TO PCHKEXIT;               /* COMMON EXIT PATH              */ 00666000
*   SAAULAD=FVAL(ERRFNDX-DIM(MSGPTR));/* INSERT VALUE                */ 00667000
         LR    @14,ERRFNDX                                         0360 00668000
         SLA   @14,2                                               0360 00669000
         L     @14,FVAL-28(@14)                                    0360 00670000
         ST    @14,SAAULAD                                         0360 00671000
*   IF PCHK24=0 THEN                /* NULL LOCATOR                  */ 00672000
*                                                                  0361 00673000
         L     @14,PCHK24-1                                        0361 00674000
         LA    @14,0(,@14)                                         0361 00675000
         LTR   @14,@14                                             0361 00676000
         BNZ   @RF00361                                            0361 00677000
*     /***************************************************************/ 00678000
*     /*                                                             */ 00679000
*     /* NULL LOCATOR                                                */ 00680000
*     /*                                                             */ 00681000
*     /***************************************************************/ 00682000
*                                                                  0362 00683000
*     DO;                           /* NULL LOCATOR                  */ 00684000
*       SABASRC=ZZZFLAGE;           /* SCAN RETURN CODE              */ 00685000
         MVI   SABASRC(SABAPTR),X'08'                              0363 00686000
*       SABASFS=ZZZ1;               /* STORAGE REQUIRED FOR        0364 00687000
*                                      MESSAGE(S)                    */ 00688000
         OI    SABASFS(SABAPTR),B'00010000'                        0364 00689000
*       ERLFB=ZZZ1;                 /* ERROR FLAG                    */ 00690000
*       ERLFN=ZZZ1;                 /* NULL LOCATOR                  */ 00691000
*       ERLFD=ZZZ1;                 /* LOCATOR TEST COMPLETE         */ 00692000
         OI    ERLFB,B'11100000'                                   0367 00693000
*       SABAGMT=ZZ2TOD;             /* REQUEST DATA BASE UPDATE      */ 00694000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0368 00695000
*       GO TO PCHKEXIT;             /* COMMON EXIT PATH              */ 00696000
         B     PCHKEXIT                                            0369 00697000
*     END;                          /* NULL LOCATOR                  */ 00698000
         SPACE 1                                                        00699000
*                                                                  0371 00700000
*/*------------------------------------------------------------------*/ 00701000
*/* BLSRPCK2--EVALUATE AN OPTIONAL LOCATOR                           */ 00702000
*/*------------------------------------------------------------------*/ 00703000
*                                                                  0371 00704000
*BLSRPCK2:                          /* EVALUATE AN OPTIONAL LOCATOR  */ 00705000
*   ENTRY;                                                         0371 00706000
         B     @EC00371                                            0371 00707000
BLSRPCK2 STM   @14,@03,@SA00002                                    0371 00708000
         STM   @05,@12,@SA00002+24                                 0371 00709000
@EC00371 DS    0H                                                  0372 00710000
*   ERLF=ERRF(ERRFNDX);             /* ERROR FLAGS                   */ 00711000
         LR    @14,SABAPTR                                         0372 00712000
         ALR   @14,ERRFNDX                                         0372 00713000
         MVC   ERLF(1),ERRF-1(@14)                                 0372 00714000
*   IF ERLFD=ZZZ1 THEN              /* LOCATOR TEST COMPLETE         */ 00715000
         TM    ERLFD,B'01000000'                                   0373 00716000
         BO    @RT00373                                            0373 00717000
*     GO TO PCHKEXIT;               /* COMMON EXIT PATH              */ 00718000
*   SAAULAD=FVAL(ERRFNDX-DIM(MSGPTR));/* INSERT VALUE                */ 00719000
         LR    @14,ERRFNDX                                         0375 00720000
         SLA   @14,2                                               0375 00721000
         L     @14,FVAL-28(@14)                                    0375 00722000
         ST    @14,SAAULAD                                         0375 00723000
*   IF PCHK24=0 THEN                /* NULL LOCATOR                  */ 00724000
         L     @14,PCHK24-1                                        0376 00725000
         LA    @14,0(,@14)                                         0376 00726000
         LTR   @14,@14                                             0376 00727000
         BNZ   @RF00376                                            0376 00728000
*     ERLFN=ZZZ1;                   /* NULL LOCATOR                  */ 00729000
         OI    ERLFN,B'00100000'                                   0377 00730000
*   ELSE                            /* LOCATOR NOT NULL              */ 00731000
*                                                                  0378 00732000
*     /***************************************************************/ 00733000
*     /*                                                             */ 00734000
*     /* LOCATOR NOT NULL                                            */ 00735000
*     /*                                                             */ 00736000
*     /***************************************************************/ 00737000
*                                                                  0378 00738000
*     DO;                           /* LOCATOR NOT NULL              */ 00739000
         B     @RC00376                                            0378 00740000
@RF00376 DS    0H                                                  0379 00741000
*       PCHK24IG='00'X;             /* ELIMINATE EXTRANEOUS BITS     */ 00742000
         MVI   PCHK24IG,X'00'                                      0379 00743000
*       CALL BLSRSAG(ZZ2,SAAU,SABA);/* PROCESS THE SA RECORD         */ 00744000
         ST    R9,@AL00001                                         0380 00745000
         LA    @14,SAAU                                            0380 00746000
         ST    @14,@AL00001+4                                      0380 00747000
         ST    SABAPTR,@AL00001+8                                  0380 00748000
         L     @08,ZZ2RVTP(,R9)                                    0380 00749000
         L     @15,RVTRSAGP(,@08)                                  0380 00750000
         LA    @01,@AL00001                                        0380 00751000
         BALR  @14,@15                                             0380 00752000
*       IF SAAUSF1=ZZZ0 THEN        /* SCAN STARTED                  */ 00753000
*                                                                  0381 00754000
         TM    SAAUSF1,B'10000000'                                 0381 00755000
         BNZ   @RF00381                                            0381 00756000
*         /***********************************************************/ 00757000
*         /*                                                         */ 00758000
*         /* LOCATOR TEST INCOMPLETE                                 */ 00759000
*         /*                                                         */ 00760000
*         /***********************************************************/ 00761000
*                                                                  0382 00762000
*         DO;                       /* LOCATOR TEST INCOMPLETE       */ 00763000
*           SABASF9=ZZZ0;           /* SCAN NOT COMPLETE             */ 00764000
         NI    SABASF9(SABAPTR),B'10111111'                        0383 00765000
*           GO TO PCHKEXIT;         /* COMMON EXIT PATH              */ 00766000
         B     PCHKEXIT                                            0384 00767000
*         END;                      /* LOCATOR TEST INCOMPLETE       */ 00768000
*       IF SAAUSRC>ZZZFLAGE THEN    /* LOCATOR ERROR                 */ 00769000
*                                                                  0386 00770000
@RF00381 CLI   SAAUSRC,8                                           0386 00771000
         BNH   @RF00386                                            0386 00772000
*         /***********************************************************/ 00773000
*         /*                                                         */ 00774000
*         /* LOCATOR ERROR                                           */ 00775000
*         /*                                                         */ 00776000
*         /***********************************************************/ 00777000
*                                                                  0387 00778000
*         DO;                       /* LOCATOR ERROR                 */ 00779000
*           SABASRC=ZZZFLAGE;       /* SCAN RETURN CODE              */ 00780000
         MVI   SABASRC(SABAPTR),X'08'                              0388 00781000
*           SABASFS=ZZZ1;           /* STORAGE REQUIRED FOR        0389 00782000
*                                      MESSAGE(S)                    */ 00783000
         OI    SABASFS(SABAPTR),B'00010000'                        0389 00784000
*           ERLFB=ZZZ1;             /* LOCATOR ERROR                 */ 00785000
         OI    ERLFB,B'10000000'                                   0390 00786000
*         END;                      /* LOCATOR ERROR                 */ 00787000
*     END;                          /* LOCATOR NOT NULL              */ 00788000
@RF00386 DS    0H                                                  0393 00789000
*   ERLFD=ZZZ1;                     /* LOCATOR TEST COMPLETE         */ 00790000
@RC00376 OI    ERLFD,B'01000000'                                   0393 00791000
*   SABAGMT=ZZ2TOD;                 /* REQUEST DATA BASE UPDATE      */ 00792000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0394 00793000
*PCHKEXIT:                          /* COMMON EXIT PATH              */ 00794000
*   ERRF(ERRFNDX)=ERLF;             /* ERROR FLAGS                   */ 00795000
PCHKEXIT LR    @14,SABAPTR                                         0395 00796000
         ALR   @14,ERRFNDX                                         0395 00797000
         MVC   ERRF-1(1,@14),ERLF                                  0395 00798000
*   ERRFNDX=ERRFNDX+1;              /* ERROR INDEX                   */ 00799000
         AL    ERRFNDX,@CF00051                                    0396 00800000
*   RETURN;                                                        0397 00801000
@EL00002 DS    0H                                                  0397 00802000
@EF00002 DS    0H                                                  0397 00803000
@ER00002 LM    @14,@03,@SA00002                                    0397 00804000
         LM    @05,@12,@SA00002+24                                 0397 00805000
         BR    @14                                                 0397 00806000
*   END BLSRPCK1;                                                  0398 00807000
*                                                                  0398 00808000
*/*BLSVPEND--SCAN EXIT                                               */ 00809000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00810000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00811000
*                                                                  0399 00812000
*   DECLARE                         /* DATA FOR AHB MACROS           */ 00813000
*     PTRBIT BIT(32) BOUNDARY(WORD),/* DATA CONVERSION WORK AREA FOR    00814000
*                                      POINTER DATA                  */ 00815000
*     PTRPTR POINTER DEFINED(PTRBIT);/* DATA CONVERSION WORK AREA FOR   00816000
*                                      POINTER DATA                  */ 00817000
*   DECLARE                         /* COMMON VARIABLES              */ 00818000
*     I256C CHAR(256) BASED,                                       0400 00819000
*     I031F FIXED(31) BASED,                                       0400 00820000
*     I031P PTR(31) BASED,                                         0400 00821000
*     I015F FIXED(15) BASED,                                       0400 00822000
*     I015P PTR(15) BASED,                                         0400 00823000
*     I008P PTR(8) BASED,                                          0400 00824000
*     I001C CHAR(1) BASED;                                         0400 00825000
*   GENERATE NODEFS NOREFS DATA;                                   0401 00826000
*   END BLSVTCB                     /* BLRPEND(BLSVTCB)              */ 00827000
*                                                                  0402 00828000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00829000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00830000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00831000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00832000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00833000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00834000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00835000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00836000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00837000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00838000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00839000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00840000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00841000
*                                                                  0402 00842000
*       ;                                                          0402 00843000
@EL00001 L     @13,4(,@13)                                         0402 00844000
@EF00001 L     @00,@SIZDATD                                        0402 00845000
         LR    @01,@11                                             0402 00846000
         BLSUFRES R,LV=(0),A=(1)                                        00847000
@ER00001 LM    @14,@12,12(@13)                                     0402 00848000
         BR    @14                                                 0402 00849000
@DATA    DS    0H                                                       00850000
@DATD    DSECT                                                          00851000
         DS    0F                                                       00852000
@SA00001 DS    18F                                                      00853000
@PC00001 DS    3F                                                       00854000
@SA00002 DS    14F                                                      00855000
@AL00001 DS    3A                                                       00856000
BLSVTCB  CSECT                                                          00857000
         DS    0F                                                       00858000
@CF00051 DC    F'1'                                                     00859000
@CF00587 DC    F'6'                                                     00860000
@CF00442 DC    F'7'                                                     00861000
@CF00037 DC    F'12'                                                    00862000
@CF01867 DC    F'21'                                                    00863000
@CH01867 EQU   @CF01867+2                                               00864000
@CF01950 DC    F'360'                                                   00865000
@CF00046 DC    F'8192'                                                  00866000
@CF01949 DC    F'-32'                                                   00867000
@DATD    DSECT                                                          00868000
         DS    0D                                                       00869000
ESAU     DS    CL694                                                    00870000
         ORG   ESAU                                                     00871000
ESAURID  DS    CL2                                                      00872000
@NM00031 DS    BL6                                                      00873000
@NM00032 DS    CL8                                                      00874000
@NM00033 DS    BL8                                                      00875000
ESAURDX  DS    FL4                                                      00876000
ESAUSYM  DS    CL31                                                     00877000
ESAUELK  DS    0C                                                       00878000
ESAURV1  DS    CL1                                                      00879000
ESAUAS   DS    CL16                                                     00880000
         ORG   ESAUAS                                                   00881000
ESAUAS0  DS    0C                                                       00882000
ESAUAST  DS    CL2                                                      00883000
@NM00034 DS    BL2                                                      00884000
ESAUAS1  DS    FL4                                                      00885000
ESAUAS2  DS    FL4                                                      00886000
@NM00035 DS    BL4                                                      00887000
ESAUAS9  DS    0C                                                       00888000
         ORG   ESAU+76                                                  00889000
ESAULAD  DS    AL4                                                      00890000
ESAUD    DS    CL60                                                     00891000
         ORG   ESAUD                                                    00892000
ESAUD00  DS    0C                                                       00893000
ESAUDOF  DS    FL4                                                      00894000
ESAUDLE  DS    FL4                                                      00895000
ESAUDOB  DS    FL1                                                      00896000
ESAUDLB  DS    FL1                                                      00897000
ESAUDT   DS    CL34                                                     00898000
         ORG   ESAUDT                                                   00899000
ESAUDT0  DS    0C                                                       00900000
ESAUDTY  DS    CL1                                                      00901000
@NM00036 DS    BL1                                                      00902000
ESAUDTD  DS    CL31                                                     00903000
ESAUDTE  DS    CL1                                                      00904000
ESAUDT9  DS    0C                                                       00905000
         ORG   ESAUD+44                                                 00906000
ESAUDIM  DS    FL4                                                      00907000
ESAUDIL  DS    FL4                                                      00908000
ESAUDF   DS    BL4                                                      00909000
         ORG   ESAUDF                                                   00910000
ESAUDFA  DS    BL1                                                      00911000
@NM00037 EQU   ESAUDF+0                                                 00912000
         ORG   ESAUD+56                                                 00913000
@NM00038 DS    BL4                                                      00914000
ESAUD99  DS    0C                                                       00915000
         ORG   ESAU+140                                                 00916000
ESAUMAD  DS    AL4                                                      00917000
@NM00039 DS    BL16                                                     00918000
ESAUKEY  DS    BL1                                                      00919000
ESAUF    DS    BL3                                                      00920000
         ORG   ESAUF                                                    00921000
ESAUFS   DS    BL1                                                      00922000
         ORG   ESAUFS                                                   00923000
ESAUFSC  DS    BL1                                                      00924000
ESAUFS2  EQU   ESAUFS+0                                                 00925000
ESAUFSM  EQU   ESAUFS+0                                                 00926000
ESAUFSA  EQU   ESAUFS+0                                                 00927000
ESAUFSP  EQU   ESAUFS+0                                                 00928000
ESAUFSR  EQU   ESAUFS+0                                                 00929000
ESAUFSX  EQU   ESAUFS+0                                                 00930000
ESAUFSS  EQU   ESAUFS+0                                                 00931000
         ORG   ESAUF+1                                                  00932000
ESAUFC   DS    BL1                                                      00933000
         ORG   ESAUFC                                                   00934000
ESAUFCD  DS    BL1                                                      00935000
@NM00040 EQU   ESAUFC+0                                                 00936000
         ORG   ESAUF+2                                                  00937000
@NM00041 DS    BL1                                                      00938000
         ORG   ESAU+164                                                 00939000
ESAUABS  DS    FL4                                                      00940000
@NM00042 DS    BL12                                                     00941000
ESAUR    DS    CL514                                                    00942000
         ORG   ESAUR                                                    00943000
ESAURL   DS    FL2                                                      00944000
ESAURT   DS    CL512                                                    00945000
         ORG   ESAURT                                                   00946000
ESAURT1  DS    CL512                                                    00947000
         ORG   ESAU+694                                                 00948000
ESAU999  DS    0C                                                       00949000
         ORG   ESAU+694                                                 00950000
         DS    CL2                                                      00951000
SAAU     DS    CL3072                                                   00952000
         ORG   SAAU                                                     00953000
SAAURID  DS    CL2                                                      00954000
@NM00142 DS    BL6                                                      00955000
SAAURDX  DS    FL4                                                      00956000
SAAUAS   DS    CL16                                                     00957000
         ORG   SAAUAS                                                   00958000
SAAUAS0  DS    0C                                                       00959000
SAAUAST  DS    CL2                                                      00960000
@NM00143 DS    BL2                                                      00961000
SAAUAS1  DS    FL4                                                      00962000
SAAUAS2  DS    FL4                                                      00963000
@NM00144 DS    BL4                                                      00964000
SAAUAS9  DS    0C                                                       00965000
         ORG   SAAU+28                                                  00966000
SAAULAD  DS    AL4                                                      00967000
SAAUDT   DS    CL34                                                     00968000
         ORG   SAAUDT                                                   00969000
SAAUDT0  DS    0C                                                       00970000
SAAUDTY  DS    CL1                                                      00971000
@NM00145 DS    BL1                                                      00972000
SAAUDTD  DS    CL31                                                     00973000
SAAUDTE  DS    CL1                                                      00974000
SAAUDT9  DS    0C                                                       00975000
         ORG   SAAU+66                                                  00976000
SAAUELK  DS    0C                                                       00977000
@NM00146 DS    BL2                                                      00978000
SAAUF    DS    CL60                                                     00979000
         ORG   SAAUF                                                    00980000
SAAUF00  DS    0C                                                       00981000
SAAUFOF  DS    FL4                                                      00982000
SAAUFLE  DS    FL4                                                      00983000
SAAUFOB  DS    FL1                                                      00984000
SAAUFLB  DS    FL1                                                      00985000
SAAUFT   DS    CL34                                                     00986000
         ORG   SAAUFT                                                   00987000
SAAUFT0  DS    0C                                                       00988000
SAAUFTY  DS    CL1                                                      00989000
@NM00147 DS    BL1                                                      00990000
SAAUFTD  DS    CL31                                                     00991000
SAAUFTE  DS    CL1                                                      00992000
SAAUFT9  DS    0C                                                       00993000
         ORG   SAAUF+44                                                 00994000
SAAUFIM  DS    FL4                                                      00995000
SAAUFIL  DS    FL4                                                      00996000
SAAUFF   DS    BL4                                                      00997000
         ORG   SAAUFF                                                   00998000
SAAUFFA  DS    BL1                                                      00999000
@NM00148 EQU   SAAUFF+0                                                 01000000
         ORG   SAAUF+56                                                 01001000
@NM00149 DS    BL4                                                      01002000
SAAUF99  DS    0C                                                       01003000
         ORG   SAAU+128                                                 01004000
SAAUSF   DS    BL8                                                      01005000
         ORG   SAAUSF                                                   01006000
SAAUSF1  DS    BL1                                                      01007000
SAAUSF9  EQU   SAAUSF+0                                                 01008000
SAAUSFI  EQU   SAAUSF+0                                                 01009000
SAAUSFS  EQU   SAAUSF+0                                                 01010000
@NM00150 EQU   SAAUSF+0                                                 01011000
         ORG   SAAU+136                                                 01012000
SAAUGMT  DS    BL8                                                      01013000
SAAUPGV  DS    CL8                                                      01014000
SAAUSRC  DS    FL1                                                      01015000
@NM00151 DS    101BL1                                                   01016000
SAAUC    DS    CL2818                                                   01017000
         ORG   SAAUC                                                    01018000
SAAUCL   DS    FL2                                                      01019000
SAAUCT   DS    CL2816                                                   01020000
         ORG   SAAUCT                                                   01021000
SAAUCT1  DS    CL2816                                                   01022000
         ORG   SAAU+3072                                                01023000
SAAU999  DS    0C                                                       01024000
         ORG   SAAU+3072                                                01025000
MV99B    DS    CL60                                                     01026000
         ORG   MV99B                                                    01027000
MV99BL   DS    FL2                                                      01028000
@NM00153 DS    BL2                                                      01029000
MV99BT   DS    CL56                                                     01030000
         ORG   MV99BT                                                   01031000
MV99BTA  DS    CL9                                                      01032000
MV99BTB  DS    CL3                                                      01033000
MV99BTC  DS    CL8                                                      01034000
MV99BTD  DS    CL8                                                      01035000
MV99BTE  DS    CL1                                                      01036000
MV99BTF  DS    CL8                                                      01037000
MV99BTG  DS    CL19                                                     01038000
         ORG   MV99B+60                                                 01039000
ERLF     DS    BL1                                                      01040000
         ORG   ERLF                                                     01041000
ERLFB    DS    BL1                                                      01042000
ERLFD    EQU   ERLF+0                                                   01043000
ERLFN    EQU   ERLF+0                                                   01044000
ERLFS    EQU   ERLF+0                                                   01045000
@NM00155 EQU   ERLF+0                                                   01046000
         ORG   ERLF+1                                                   01047000
         DS    CL3                                                      01048000
BUF      DS    CL360                                                    01049000
PTRBIT   DS    BL4                                                      01050000
FVAL     DS    15A                                                      01051000
BLSVTCB  CSECT                                                          01052000
         DS    0F                                                       01053000
@SIZDATD DC    AL1(0)                                                   01054000
         DC    AL3(@ENDDATD-@DATD)                                      01055000
         DS    0D                                                       01056000
@CC00183 DC    C'                               '                       01057000
@CC01923 DC    C'RTM2WA'                                                01058000
@CC01909 DC    C'TCB '                                                  01059000
@CC01916 DC    C'TIOT'                                                  01060000
@CC01917 DC    C'SPQE'                                                  01061000
@CC01922 DC    C'JSCB'                                                  01062000
@CC01914 DC    C'DEB'                                                   01063000
@CC01918 DC    C'DCB'                                                   01064000
@CC01919 EQU   @CC01909                                                 01065000
@CC01920 DC    C'IQE'                                                   01066000
@CC01921 DC    C'CDE'                                                   01067000
@CC00083 DC    C'CV'                                                    01068000
@CC01912 DC    C'RB'                                                    01069000
         DS    CL1                                                      01070000
MV01     DS    CL46                                                     01071000
         ORG   MV01                                                     01072000
MV01L    DC    AL2(46)                                                  01073000
@NM00056 DC    X'0000'                                                  01074000
MV01T    DS    CL42                                                     01075000
         ORG   MV01T                                                    01076000
MV01TA   DC    CL9'BLS22051I'                                           01077000
MV01TB   DC    CL3' '                                                   01078000
MV01TC   DC    CL30'TCB NOT ON DOUBLEWORD BOUNDARY'                     01079000
         ORG   MV01+46                                                  01080000
MV02     DS    CL39                                                     01081000
         ORG   MV02                                                     01082000
MV02L    DC    AL2(39)                                                  01083000
@NM00057 DC    X'0000'                                                  01084000
MV02T    DS    CL35                                                     01085000
         ORG   MV02T                                                    01086000
MV02TA   DC    CL9'BLS22050I'                                           01087000
MV02TB   DC    CL3' '                                                   01088000
MV02TC   DC    CL23'TCB STORAGE NOT IN DUMP'                            01089000
         ORG   MV02+39                                                  01090000
         DS    CL1                                                      01091000
MV03     DS    CL48                                                     01092000
         ORG   MV03                                                     01093000
MV03L    DC    AL2(48)                                                  01094000
@NM00138 DC    X'0000'                                                  01095000
MV03T    DS    CL44                                                     01096000
         ORG   MV03T                                                    01097000
MV03TA   DC    CL9'BLS22052I'                                           01098000
MV03TB   DC    CL3' '                                                   01099000
MV03TC   DC    CL32'ADDRESS OF TCB IS LESS THAN 8192'                   01100000
         ORG   MV03+48                                                  01101000
MV04     DS    CL76                                                     01102000
         ORG   MV04                                                     01103000
MV04L    DC    AL2(76)                                                  01104000
@NM00139 DC    X'0000'                                                  01105000
MV04T    DS    CL72                                                     01106000
         ORG   MV04T                                                    01107000
MV04TA   DC    CL9'BLS22053I'                                           01108000
MV04TB   DC    CL3' '                                                   01109000
MV04TC   DC    CL60'ADDRESS OF TCB IS GREATER THAN OR EQUAL TO ADDRESS C01110000
               OF COMMON'                                               01111000
         ORG   MV04+76                                                  01112000
MV05     DS    CL42                                                     01113000
         ORG   MV05                                                     01114000
MV05L    DC    AL2(42)                                                  01115000
@NM00140 DC    X'0000'                                                  01116000
MV05T    DS    CL38                                                     01117000
         ORG   MV05T                                                    01118000
MV05TA   DC    CL9'BLS22054I'                                           01119000
MV05TB   DC    CL3' '                                                   01120000
MV05TC   DC    CL26'TCBTCBID NOT EQUAL C''TCB '''                       01121000
         ORG   MV05+42                                                  01122000
MV06     DS    CL41                                                     01123000
         ORG   MV06                                                     01124000
MV06L    DC    AL2(41)                                                  01125000
@NM00141 DC    X'0000'                                                  01126000
MV06T    DS    CL37                                                     01127000
         ORG   MV06T                                                    01128000
MV06TA   DC    CL9'BLS22055I'                                           01129000
MV06TB   DC    CL3' '                                                   01130000
MV06TC   DC    CL25'TCBZERO NOT EQUAL B''0000'''                        01131000
         ORG   MV06+41                                                  01132000
         DS    CL1                                                      01133000
MV99S    DS    CL60                                                     01134000
         ORG   MV99S                                                    01135000
MV99SL   DC    AL2(60)                                                  01136000
@NM00152 DC    X'0000'                                                  01137000
MV99ST   DS    CL56                                                     01138000
         ORG   MV99ST                                                   01139000
MV99STA  DC    CL9'BLS22056I'                                           01140000
MV99STB  DC    CL3' '                                                   01141000
MV99STC  DC    CL8'LOCATOR '                                            01142000
MV99STD  DC    CL8' '                                                   01143000
MV99STE  DC    CL1'='                                                   01144000
MV99STF  DC    CL8' '                                                   01145000
MV99STG  DC    CL19'. IT MAY BE DAMAGED'                                01146000
         ORG   MV99S+60                                                 01147000
FNAME    DC    CL8'TCBRBP'                                              01148000
         DC    CL8'TCBDEB'                                              01149000
         DC    CL8'TCBTIO'                                              01150000
         DC    CL8'TCBMSS'                                              01151000
         DC    CL8'TCBJLB'                                              01152000
         DC    CL8'TCBTCB'                                              01153000
         DC    CL8'TCBJSTCB'                                            01154000
         DC    CL8'TCBNTC'                                              01155000
         DC    CL8'TCBOTC'                                              01156000
         DC    CL8'TCBLTC'                                              01157000
         DC    CL8'TCBIQE'                                              01158000
         DC    CL8'TCBJPQ'                                              01159000
         DC    CL8'TCBJSCB'                                             01160000
         DC    CL8'TCBBACK'                                             01161000
         DC    CL8'TCBRTWA'                                             01162000
MSGPTR   DC    AL4(MV01)                                                01163000
         DC    AL4(MV02)                                                01164000
         DC    AL4(MV03)                                                01165000
         DC    AL4(MV04)                                                01166000
         DC    AL4(MV05)                                                01167000
         DC    AL4(MV06)                                                01168000
MSGLEVEL DC    AL1(12)                                                  01169000
         DC    AL1(4)                                                   01170000
         DC    AL1(12)                                                  01171000
         DC    AL1(12)                                                  01172000
         DC    AL1(12)                                                  01173000
         DC    AL1(4)                                                   01174000
@DATD    DSECT                                                          01175000
         SPACE 2                                                        01176000
*********************************************************************** 01177000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 01178000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 01179000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 01180000
*********************************************************************** 01181000
         SPACE                                                          01182000
BLSVTCB  CSECT                                                          01183000
         ORG                                                            01184000
         DS    0D                                                       01185000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSVTCB+19)/20+7)/8)CL8'BLSVTCB'       01186000
@DATD    DSECT                                                          01187000
         DS    0H                                                       01188000
@DATD    DSECT                                                          01189000
         SPACE 2                                                        01190000
*********************************************************************** 01191000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 01192000
*********************************************************************** 01193000
         SPACE                                                          01194000
         DS    0D                                                       01195000
@DATD    DSECT                                                          01196000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01197000
@ENDDATD EQU   *                                                        01198000
BLSVTCB  CSECT                                                          01199000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01200000
@01      EQU   01                                                       01201000
@02      EQU   02                                                       01202000
@03      EQU   03                                                       01203000
@04      EQU   04                                                       01204000
@05      EQU   05                                                       01205000
@06      EQU   06                                                       01206000
@07      EQU   07                                                       01207000
@08      EQU   08                                                       01208000
@09      EQU   09                                                       01209000
@10      EQU   10                                                       01210000
@11      EQU   11                                                       01211000
@12      EQU   12                                                       01212000
@13      EQU   13                                                       01213000
@14      EQU   14                                                       01214000
@15      EQU   15                                                       01215000
FNAMENDX EQU   @06                                                      01216000
ERRFNDX  EQU   @04                                                      01217000
TCBPTR   EQU   @04                                                      01218000
RETC     EQU   @05                                                      01219000
SABAPTR  EQU   @03                                                      01220000
R9       EQU   @09                                                      01221000
R0       EQU   @00                                                      01222000
R1       EQU   @01                                                      01223000
R2       EQU   @02                                                      01224000
R3       EQU   @03                                                      01225000
R4       EQU   @04                                                      01226000
R5       EQU   @05                                                      01227000
RB       EQU   @11                                                      01228000
RD       EQU   @13                                                      01229000
RE       EQU   @14                                                      01230000
RF       EQU   @15                                                      01231000
RA       EQU   @10                                                      01232000
RC       EQU   @12                                                      01233000
R6       EQU   @06                                                      01234000
R7       EQU   @07                                                      01235000
R8       EQU   @08                                                      01236000
SABA     EQU   0                                                        01237000
SABAAS   EQU   SABA+12                                                  01238000
SABAAST  EQU   SABAAS                                                   01239000
SABALAD  EQU   SABA+28                                                  01240000
SABADT   EQU   SABA+32                                                  01241000
SABAF    EQU   SABA+68                                                  01242000
SABAFT   EQU   SABAF+10                                                 01243000
SABAFF   EQU   SABAF+52                                                 01244000
SABASF   EQU   SABA+128                                                 01245000
SABASF1  EQU   SABASF                                                   01246000
SABASF9  EQU   SABASF                                                   01247000
SABASFI  EQU   SABASF                                                   01248000
SABASFS  EQU   SABASF                                                   01249000
SABAGMT  EQU   SABA+136                                                 01250000
SABASRC  EQU   SABA+152                                                 01251000
SABAC    EQU   SABA+254                                                 01252000
SABACL   EQU   SABAC                                                    01253000
SABACT   EQU   SABAC+2                                                  01254000
ESCO     EQU   0                                                        01255000
ESCOAS   EQU   ESCO+60                                                  01256000
ESCOD    EQU   ESCO+80                                                  01257000
ESCODT   EQU   ESCOD+10                                                 01258000
ESCODF   EQU   ESCOD+52                                                 01259000
ESCOF    EQU   ESCO+161                                                 01260000
ESCOFS   EQU   ESCOF                                                    01261000
ESCOFC   EQU   ESCOF+1                                                  01262000
ESCOR    EQU   ESCO+180                                                 01263000
ESCORT   EQU   ESCOR+2                                                  01264000
VRBA     EQU   0                                                        01265000
VRBAT    EQU   VRBA+4                                                   01266000
ZZ1      EQU   0                                                        01267000
ZZ1ATTN  EQU   ZZ1+360                                                  01268000
ZZ1EVE   EQU   ZZ1ATTN+4                                                01269000
ZZ1EVEP  EQU   ZZ1EVE                                                   01270000
ZZ1F     EQU   ZZ1+368                                                  01271000
ZZ1TRHEX EQU   ZZ1+568                                                  01272000
ZZ1N     EQU   ZZ1+1116                                                 01273000
ZZ2      EQU   0                                                        01274000
ZZ2AMD   EQU   ZZ2                                                      01275000
@NM00070 EQU   ZZ2AMD+7                                                 01276000
ZZ2PRT   EQU   ZZ2+138                                                  01277000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 01278000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                01279000
ZZ2A     EQU   ZZ2+272                                                  01280000
ZZ2ASE   EQU   ZZ2A+2                                                   01281000
ZZ2AF    EQU   ZZ2A+16                                                  01282000
ZZ2APID  EQU   ZZ2A+64                                                  01283000
ZZ2AD    EQU   ZZ2A+74                                                  01284000
ZZ2ADD   EQU   ZZ2AD                                                    01285000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 01286000
ZZ2ADM   EQU   ZZ2AD+46                                                 01287000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 01288000
ZZ2ADP   EQU   ZZ2AD+56                                                 01289000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 01290000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01291000
ZZ2AQAS  EQU   ZZ2A+144                                                 01292000
ZZ2AQD   EQU   ZZ2A+160                                                 01293000
ZZ2AQDT  EQU   ZZ2AQD+10                                                01294000
ZZ2AQDF  EQU   ZZ2AQD+52                                                01295000
ZZ2STG   EQU   ZZ2+960                                                  01296000
ZZ2TOD   EQU   ZZ2+968                                                  01297000
ZZ2ALLOP EQU   ZZ2+992                                                  01298000
ZZ2FREEP EQU   ZZ2+996                                                  01299000
ZZ2FF19P EQU   ZZ2+1000                                                 01300000
ZZ2FRE1P EQU   ZZ2+1004                                                 01301000
ZZ2FF18P EQU   ZZ2+1008                                                 01302000
ZZ2DYNAP EQU   ZZ2+1012                                                 01303000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 01304000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 01305000
ZZ2STAIP EQU   ZZ2+1024                                                 01306000
ZZ2FF02P EQU   ZZ2+1028                                                 01307000
ZZ2GETLP EQU   ZZ2+1032                                                 01308000
ZZ2PARSP EQU   ZZ2+1036                                                 01309000
ZZ2PTGTP EQU   ZZ2+1040                                                 01310000
ZZ2PUTLP EQU   ZZ2+1044                                                 01311000
ZZ2SCANP EQU   ZZ2+1048                                                 01312000
ZZ2STCKP EQU   ZZ2+1052                                                 01313000
ZZ2TRMOP EQU   ZZ2+1064                                                 01314000
ZZ2TRMVP EQU   ZZ2+1068                                                 01315000
ZZ2PUTNP EQU   ZZ2+1084                                                 01316000
ZZ2TRMNP EQU   ZZ2+1088                                                 01317000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 01318000
ZZ2BVTP  EQU   ZZ2+1280                                                 01319000
ZZ2RVTP  EQU   ZZ2+1284                                                 01320000
ZZ2CPPL  EQU   ZZ2+1292                                                 01321000
ZZ2CPPLC EQU   ZZ2CPPL                                                  01322000
ZZ2ESSYP EQU   ZZ2+1328                                                 01323000
ZZ2ITR   EQU   ZZ2+2840                                                 01324000
ZZ2ITRE  EQU   ZZ2ITR+16                                                01325000
ZZ2ITSE  EQU   ZZ2+2864                                                 01326000
ZZ2ES    EQU   ZZ2+2872                                                 01327000
ZZ2AMDX  EQU   ZZ2+7160                                                 01328000
ZZ2AXO   EQU   ZZ2+7934                                                 01329000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 01330000
CMD      EQU   0                                                        01331000
CMDT     EQU   CMD+4                                                    01332000
PSCB     EQU   0                                                        01333000
PSCBATR1 EQU   PSCB+16                                                  01334000
ECT      EQU   0                                                        01335000
ECTSWS   EQU   ECT+28                                                   01336000
ECTSWS2  EQU   ECT+40                                                   01337000
ECTSWS21 EQU   ECTSWS2                                                  01338000
UPT      EQU   0                                                        01339000
UPTSWS   EQU   UPT+12                                                   01340000
SA       EQU   0                                                        01341000
SA1      EQU   SA                                                       01342000
SAR      EQU   SA+12                                                    01343000
SAR1     EQU   SAR+12                                                   01344000
BLSUMPKN EQU   0                                                        01345000
BLSUPUTV EQU   0                                                        01346000
BVT      EQU   0                                                        01347000
BVTPUTLP EQU   BVT+4                                                    01348000
BVTPUTOP EQU   BVT+12                                                   01349000
BVTPUTTP EQU   BVT+16                                                   01350000
BVTPUTVP EQU   BVT+20                                                   01351000
BVTPUTAP EQU   BVT+24                                                   01352000
BVTPRTTP EQU   BVT+28                                                   01353000
BVTPRTAP EQU   BVT+32                                                   01354000
BVTPUTDP EQU   BVT+36                                                   01355000
BVTMONP  EQU   BVT+40                                                   01356000
BVTMON2P EQU   BVT+44                                                   01357000
BVTVSARP EQU   BVT+48                                                   01358000
BVTVSENP EQU   BVT+64                                                   01359000
BVTVSERP EQU   BVT+68                                                   01360000
BVTVSGEP EQU   BVT+72                                                   01361000
BVTVSGUP EQU   BVT+76                                                   01362000
BVTVSPOP EQU   BVT+80                                                   01363000
BVTVSPUP EQU   BVT+84                                                   01364000
BVTMPKNP EQU   BVT+104                                                  01365000
BVTMONLP EQU   BVT+108                                                  01366000
BVTPUTCP EQU   BVT+132                                                  01367000
BVTMPK1P EQU   BVT+136                                                  01368000
BVTZZ2RP EQU   BVT+140                                                  01369000
BVTPGMRP EQU   BVT+144                                                  01370000
BVTMONAP EQU   BVT+148                                                  01371000
BVTBLDDP EQU   BVT+152                                                  01372000
BVTBLDLP EQU   BVT+156                                                  01373000
BVTPGMCP EQU   BVT+160                                                  01374000
BVTPGMDP EQU   BVT+164                                                  01375000
BVTPGMLP EQU   BVT+168                                                  01376000
BVTMONCP EQU   BVT+180                                                  01377000
BVTMONDP EQU   BVT+184                                                  01378000
BVTMONTP EQU   BVT+188                                                  01379000
BVTPARIP EQU   BVT+192                                                  01380000
BVTPARUP EQU   BVT+196                                                  01381000
BVTPRTNP EQU   BVT+204                                                  01382000
BVTVSCRP EQU   BVT+208                                                  01383000
BVTVSMRP EQU   BVT+212                                                  01384000
BVTMONXP EQU   BVT+216                                                  01385000
BVTTRMAP EQU   BVT+228                                                  01386000
ZZ6      EQU   0                                                        01387000
ZZ6D     EQU   ZZ6+128                                                  01388000
ZZ6DD    EQU   ZZ6D+8                                                   01389000
ZZ6DDT   EQU   ZZ6DD+4                                                  01390000
ZZ6DQA   EQU   ZZ6D+68                                                  01391000
ZZ6DQ1   EQU   ZZ6D+84                                                  01392000
ZZ6DF    EQU   ZZ6D+92                                                  01393000
ZZ6DFAB  EQU   ZZ6DF                                                    01394000
ZZ6DPRP  EQU   ZZ6D+108                                                 01395000
ZZ6DCAP  EQU   ZZ6D+112                                                 01396000
ZZ6B     EQU   ZZ6+768                                                  01397000
BLSRACCQ EQU   0                                                        01398000
BLSRSAG  EQU   0                                                        01399000
BLSRSAPC EQU   0                                                        01400000
RVT      EQU   0                                                        01401000
RVTADDRP EQU   RVT                                                      01402000
RVTT01P  EQU   RVT+4                                                    01403000
RVTTAP   EQU   RVT+8                                                    01404000
RVTTBP   EQU   RVT+12                                                   01405000
RVTTCP   EQU   RVT+16                                                   01406000
RVTTFP   EQU   RVT+24                                                   01407000
RVTTYP   EQU   RVT+40                                                   01408000
RVTT02P  EQU   RVT+48                                                   01409000
RVTT03P  EQU   RVT+52                                                   01410000
RVTT04P  EQU   RVT+56                                                   01411000
RVTACCLP EQU   RVT+60                                                   01412000
RVTRACCP EQU   RVT+64                                                   01413000
RVTTLP   EQU   RVT+68                                                   01414000
RVTTMP   EQU   RVT+72                                                   01415000
RVTTUP   EQU   RVT+80                                                   01416000
RVTESGEP EQU   RVT+84                                                   01417000
RVTESGUP EQU   RVT+88                                                   01418000
RVTESARP EQU   RVT+92                                                   01419000
RVTRAARP EQU   RVT+96                                                   01420000
RVTRAGEP EQU   RVT+100                                                  01421000
RVTADDPP EQU   RVT+104                                                  01422000
RVTACCQP EQU   RVT+108                                                  01423000
RVTSAGUP EQU   RVT+124                                                  01424000
RVTSAGEP EQU   RVT+128                                                  01425000
RVTESCKP EQU   RVT+132                                                  01426000
RVTMSGAP EQU   RVT+136                                                  01427000
RVTMSGDP EQU   RVT+140                                                  01428000
RVTADDTP EQU   RVT+160                                                  01429000
RVTADDUP EQU   RVT+164                                                  01430000
RVTADD1P EQU   RVT+176                                                  01431000
RVTADD2P EQU   RVT+180                                                  01432000
RVTRSAGP EQU   RVT+184                                                  01433000
RVTMSGBP EQU   RVT+188                                                  01434000
RVTADDSP EQU   RVT+192                                                  01435000
RVTADD3P EQU   RVT+196                                                  01436000
RVTT05P  EQU   RVT+200                                                  01437000
RVTPADSP EQU   RVT+204                                                  01438000
RVTTRP   EQU   RVT+228                                                  01439000
RVTADD4P EQU   RVT+232                                                  01440000
RVTSAPCP EQU   RVT+236                                                  01441000
RVTSAARP EQU   RVT+240                                                  01442000
RVTSAGNP EQU   RVT+244                                                  01443000
RVTT06P  EQU   RVT+248                                                  01444000
RVTSAGCP EQU   RVT+252                                                  01445000
RVTSAGQP EQU   RVT+256                                                  01446000
RVTESGCP EQU   RVT+260                                                  01447000
RVTESGQP EQU   RVT+264                                                  01448000
RVTDUCKP EQU   RVT+276                                                  01449000
RVTDUCCP EQU   RVT+280                                                  01450000
TCBFIX   EQU   0                                                        01451000
TCBFRS   EQU   TCBFIX                                                   01452000
TCB      EQU   0                                                        01453000
TCBRBP   EQU   TCB                                                      01454000
TCBPIE   EQU   TCB+4                                                    01455000
TCBPMASK EQU   TCBPIE                                                   01456000
TCBDEB   EQU   TCB+8                                                    01457000
TCBTIO   EQU   TCB+12                                                   01458000
TCBCMP   EQU   TCB+16                                                   01459000
TCBCMPF  EQU   TCBCMP                                                   01460000
TCBCPP   EQU   TCBCMPF                                                  01461000
TCBSTCC  EQU   TCBCMPF                                                  01462000
TCBCDBL  EQU   TCBCMPF                                                  01463000
TCBCWTO  EQU   TCBCMPF                                                  01464000
TCBCIND  EQU   TCBCMPF                                                  01465000
TCBCMSG  EQU   TCBCMPF                                                  01466000
TCBTRN   EQU   TCB+20                                                   01467000
TCBABF   EQU   TCBTRN                                                   01468000
TCBMSS   EQU   TCB+24                                                   01469000
TCBPKF   EQU   TCB+28                                                   01470000
TCBZERO  EQU   TCBPKF                                                   01471000
TCBFLGS  EQU   TCB+29                                                   01472000
TCBFLGS1 EQU   TCBFLGS                                                  01473000
TCBFLGS2 EQU   TCBFLGS+1                                                01474000
TCBFLGS3 EQU   TCBFLGS+2                                                01475000
TCBFLGS4 EQU   TCBFLGS+3                                                01476000
TCBFLGS5 EQU   TCBFLGS+4                                                01477000
TCBABWF  EQU   TCBFLGS5                                                 01478000
TCBJLB   EQU   TCB+40                                                   01479000
TCBJPQ   EQU   TCB+44                                                   01480000
TCBPURGE EQU   TCBJPQ                                                   01481000
TCBGRS   EQU   TCB+48                                                   01482000
TCBFSA   EQU   TCB+112                                                  01483000
TCBTCB   EQU   TCB+116                                                  01484000
TCBTME   EQU   TCB+120                                                  01485000
TCBJSTCB EQU   TCB+124                                                  01486000
TCBNTC   EQU   TCB+128                                                  01487000
TCBOTC   EQU   TCB+132                                                  01488000
TCBLTC   EQU   TCB+136                                                  01489000
TCBIQE   EQU   TCB+140                                                  01490000
TCBTSFLG EQU   TCB+148                                                  01491000
TCBTSTSK EQU   TCBTSFLG                                                 01492000
TCBSTAB  EQU   TCB+160                                                  01493000
TCBNSTAE EQU   TCBSTAB                                                  01494000
TCBTCT   EQU   TCB+164                                                  01495000
TCBTCTGF EQU   TCBTCT                                                   01496000
TCBSCNDY EQU   TCB+172                                                  01497000
TCBNDSP  EQU   TCBSCNDY                                                 01498000
TCBNDSP1 EQU   TCBNDSP+1                                                01499000
TCBNDSP2 EQU   TCBNDSP+2                                                01500000
TCBNDSP3 EQU   TCBNDSP+3                                                01501000
TCBJSCB  EQU   TCB+180                                                  01502000
TCBRECDE EQU   TCBJSCB                                                  01503000
TCBEXT1  EQU   TCB+196                                                  01504000
TCBBITS  EQU   TCB+200                                                  01505000
TCBNDSP4 EQU   TCBBITS                                                  01506000
TCBNDSP5 EQU   TCBBITS+1                                                01507000
TCBFLGS6 EQU   TCBBITS+2                                                01508000
TCBFLGS7 EQU   TCBBITS+3                                                01509000
TCBDAR   EQU   TCB+204                                                  01510000
TCBDARC  EQU   TCBDAR                                                   01511000
TCBEXT2  EQU   TCB+208                                                  01512000
TCBBACK  EQU   TCB+220                                                  01513000
TCBRTWA  EQU   TCB+224                                                  01514000
TCBXSCT  EQU   TCB+240                                                  01515000
TCBXSCT1 EQU   TCBXSCT                                                  01516000
TCBFOE   EQU   TCB+244                                                  01517000
TCBSTAWA EQU   TCB+252                                                  01518000
TCBTCBID EQU   TCB+256                                                  01519000
TCBESTAE EQU   TCB+264                                                  01520000
TCBESTRM EQU   TCBESTAE+1                                               01521000
TCBFBYT1 EQU   TCB+276                                                  01522000
TCBFBYT2 EQU   TCB+277                                                  01523000
TCBRV124 EQU   TCB+278                                                  01524000
TCBRV133 EQU   TCB+279                                                  01525000
TCBXTNT2 EQU   0                                                        01526000
TCBGTF   EQU   TCBXTNT2                                                 01527000
TCBTFLG  EQU   TCBGTF                                                   01528000
TCBRV146 EQU   TCBXTNT2+28                                              01529000
TCBRV155 EQU   TCBXTNT2+29                                              01530000
TCBRV164 EQU   TCBXTNT2+30                                              01531000
TCBRV173 EQU   TCBXTNT2+31                                              01532000
BLSRACC  EQU   0                                                        01533000
BLSRACCL EQU   0                                                        01534000
BLSRADDP EQU   0                                                        01535000
BLSRADDR EQU   0                                                        01536000
BLSRADDS EQU   0                                                        01537000
BLSRADDT EQU   0                                                        01538000
BLSRADDU EQU   0                                                        01539000
BLSRADD1 EQU   0                                                        01540000
BLSRADD2 EQU   0                                                        01541000
BLSRADD3 EQU   0                                                        01542000
BLSRADD4 EQU   0                                                        01543000
BLSRDUCC EQU   0                                                        01544000
BLSRDUCK EQU   0                                                        01545000
BLSRESAR EQU   0                                                        01546000
BLSRESCK EQU   0                                                        01547000
BLSRESGC EQU   0                                                        01548000
BLSRESGE EQU   0                                                        01549000
BLSRESGQ EQU   0                                                        01550000
BLSRESGU EQU   0                                                        01551000
BLSRMSGA EQU   0                                                        01552000
BLSRMSGB EQU   0                                                        01553000
BLSRMSGD EQU   0                                                        01554000
BLSRPADS EQU   0                                                        01555000
BLSRRAAR EQU   0                                                        01556000
BLSRRAGE EQU   0                                                        01557000
BLSRSAAR EQU   0                                                        01558000
BLSRSAGC EQU   0                                                        01559000
BLSRSAGE EQU   0                                                        01560000
BLSRSAGN EQU   0                                                        01561000
BLSRSAGQ EQU   0                                                        01562000
BLSRSAGU EQU   0                                                        01563000
BLSTA    EQU   0                                                        01564000
BLSTB    EQU   0                                                        01565000
BLSTC    EQU   0                                                        01566000
BLSTF    EQU   0                                                        01567000
BLSTL    EQU   0                                                        01568000
BLSTM    EQU   0                                                        01569000
BLSTR    EQU   0                                                        01570000
BLSTU    EQU   0                                                        01571000
BLSTY    EQU   0                                                        01572000
BLST01   EQU   0                                                        01573000
BLST02   EQU   0                                                        01574000
BLST03   EQU   0                                                        01575000
BLST04   EQU   0                                                        01576000
BLST05   EQU   0                                                        01577000
BLST06   EQU   0                                                        01578000
BLSUALLO EQU   0                                                        01579000
BLSUBLDD EQU   0                                                        01580000
BLSUBLDL EQU   0                                                        01581000
BLSUDYNA EQU   0                                                        01582000
BLSUFREE EQU   0                                                        01583000
BLSUFRE1 EQU   0                                                        01584000
BLSUMON  EQU   0                                                        01585000
BLSUMONA EQU   0                                                        01586000
BLSUMONC EQU   0                                                        01587000
BLSUMOND EQU   0                                                        01588000
BLSUMONL EQU   0                                                        01589000
BLSUMONT EQU   0                                                        01590000
BLSUMONX EQU   0                                                        01591000
BLSUMON2 EQU   0                                                        01592000
BLSUMPK1 EQU   0                                                        01593000
BLSUPARI EQU   0                                                        01594000
BLSUPARU EQU   0                                                        01595000
BLSUPGMC EQU   0                                                        01596000
BLSUPGMD EQU   0                                                        01597000
BLSUPGML EQU   0                                                        01598000
BLSUPGMR EQU   0                                                        01599000
BLSUPRTA EQU   0                                                        01600000
BLSUPRTN EQU   0                                                        01601000
BLSUPRTT EQU   0                                                        01602000
BLSUPUTA EQU   0                                                        01603000
BLSUPUTC EQU   0                                                        01604000
BLSUPUTD EQU   0                                                        01605000
BLSUPUTL EQU   0                                                        01606000
BLSUPUTN EQU   0                                                        01607000
BLSUPUTO EQU   0                                                        01608000
BLSUPUTT EQU   0                                                        01609000
BLSUSTAI EQU   0                                                        01610000
BLSUTRMA EQU   0                                                        01611000
BLSUTRMN EQU   0                                                        01612000
BLSUTRMO EQU   0                                                        01613000
BLSUTRMV EQU   0                                                        01614000
BLSUVSAR EQU   0                                                        01615000
BLSUVSCR EQU   0                                                        01616000
BLSUVSEN EQU   0                                                        01617000
BLSUVSER EQU   0                                                        01618000
BLSUVSGE EQU   0                                                        01619000
BLSUVSGU EQU   0                                                        01620000
BLSUVSMR EQU   0                                                        01621000
BLSUVSPO EQU   0                                                        01622000
BLSUVSPU EQU   0                                                        01623000
BLSUZZ2C EQU   0                                                        01624000
BLSUZZ2D EQU   0                                                        01625000
BLSUZZ2R EQU   0                                                        01626000
IKJEFF02 EQU   0                                                        01627000
IKJEFF18 EQU   0                                                        01628000
IKJEFF19 EQU   0                                                        01629000
IKJGETL  EQU   0                                                        01630000
IKJPARS  EQU   0                                                        01631000
IKJPTGT  EQU   0                                                        01632000
IKJPUTL  EQU   0                                                        01633000
IKJSCAN  EQU   0                                                        01634000
IKJSTCK  EQU   0                                                        01635000
I001C    EQU   0                                                        01636000
I008P    EQU   0                                                        01637000
I015F    EQU   0                                                        01638000
I015P    EQU   0                                                        01639000
I031F    EQU   0                                                        01640000
I031P    EQU   0                                                        01641000
I256C    EQU   0                                                        01642000
PZ2      EQU   0                                                        01643000
SAPA     EQU   0                                                        01644000
SAPAAS   EQU   SAPA+12                                                  01645000
SAPADT   EQU   SAPA+32                                                  01646000
SAPAF    EQU   SAPA+68                                                  01647000
SAPAFT   EQU   SAPAF+10                                                 01648000
SAPAFF   EQU   SAPAF+52                                                 01649000
SAPASF   EQU   SAPA+128                                                 01650000
SAPAC    EQU   SAPA+254                                                 01651000
SAPACT   EQU   SAPAC+2                                                  01652000
SABK     EQU   0                                                        01653000
SABKAS   EQU   SABK+12                                                  01654000
SABKDT   EQU   SABK+32                                                  01655000
SABKF    EQU   SABK+68                                                  01656000
SABKFT   EQU   SABKF+10                                                 01657000
SABKFF   EQU   SABKF+52                                                 01658000
SABKSF   EQU   SABK+128                                                 01659000
SABKC    EQU   SABK+254                                                 01660000
SABKCT   EQU   SABKC+2                                                  01661000
CPPL     EQU   ZZ2CPPL                                                  01662000
CPPLUPT  EQU   CPPL+4                                                   01663000
CPPLPSCB EQU   CPPL+8                                                   01664000
CPPLECT  EQU   CPPL+12                                                  01665000
ERRF     EQU   SABACT                                                   01666000
ERRFB    EQU   ERRF                                                     01667000
ERRFD    EQU   ERRF                                                     01668000
ERRFS    EQU   ERRF                                                     01669000
PTRPTR   EQU   PTRBIT                                                   01670000
PCHK     EQU   SAAULAD                                                  01671000
PCHK24IG EQU   PCHK                                                     01672000
PCHK24   EQU   PCHK+1                                                   01673000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01674000
@NM00154 EQU   ERRF                                                     01675000
ERRFN    EQU   ERRF                                                     01676000
CPPLCBUF EQU   CPPL                                                     01677000
SABK999  EQU   SABK+3072                                                01678000
SABKCT1  EQU   SABKCT                                                   01679000
SABKCL   EQU   SABKC                                                    01680000
@NM00030 EQU   SABK+153                                                 01681000
SABKSRC  EQU   SABK+152                                                 01682000
SABKPGV  EQU   SABK+144                                                 01683000
SABKGMT  EQU   SABK+136                                                 01684000
@NM00029 EQU   SABKSF                                                   01685000
SABKSFS  EQU   SABKSF                                                   01686000
SABKSFI  EQU   SABKSF                                                   01687000
SABKSF9  EQU   SABKSF                                                   01688000
SABKSF1  EQU   SABKSF                                                   01689000
SABKF99  EQU   SABKF+60                                                 01690000
@NM00028 EQU   SABKF+56                                                 01691000
@NM00027 EQU   SABKFF                                                   01692000
SABKFFA  EQU   SABKFF                                                   01693000
SABKFIL  EQU   SABKF+48                                                 01694000
SABKFIM  EQU   SABKF+44                                                 01695000
SABKFT9  EQU   SABKFT+34                                                01696000
SABKFTE  EQU   SABKFT+33                                                01697000
SABKFTD  EQU   SABKFT+2                                                 01698000
@NM00026 EQU   SABKFT+1                                                 01699000
SABKFTY  EQU   SABKFT                                                   01700000
SABKFT0  EQU   SABKFT                                                   01701000
SABKFLB  EQU   SABKF+9                                                  01702000
SABKFOB  EQU   SABKF+8                                                  01703000
SABKFLE  EQU   SABKF+4                                                  01704000
SABKFOF  EQU   SABKF                                                    01705000
SABKF00  EQU   SABKF                                                    01706000
@NM00025 EQU   SABK+66                                                  01707000
SABKELK  EQU   SABK+66                                                  01708000
SABKDT9  EQU   SABKDT+34                                                01709000
SABKDTE  EQU   SABKDT+33                                                01710000
SABKDTD  EQU   SABKDT+2                                                 01711000
@NM00024 EQU   SABKDT+1                                                 01712000
SABKDTY  EQU   SABKDT                                                   01713000
SABKDT0  EQU   SABKDT                                                   01714000
SABKLAD  EQU   SABK+28                                                  01715000
SABKAS9  EQU   SABKAS+16                                                01716000
@NM00023 EQU   SABKAS+12                                                01717000
SABKAS2  EQU   SABKAS+8                                                 01718000
SABKAS1  EQU   SABKAS+4                                                 01719000
@NM00022 EQU   SABKAS+2                                                 01720000
SABKAST  EQU   SABKAS                                                   01721000
SABKAS0  EQU   SABKAS                                                   01722000
SABKRDX  EQU   SABK+8                                                   01723000
@NM00021 EQU   SABK+2                                                   01724000
SABKRID  EQU   SABK                                                     01725000
SAPA999  EQU   SAPA+3072                                                01726000
SAPACT1  EQU   SAPACT                                                   01727000
SAPACL   EQU   SAPAC                                                    01728000
@NM00010 EQU   SAPA+153                                                 01729000
SAPASRC  EQU   SAPA+152                                                 01730000
SAPAPGV  EQU   SAPA+144                                                 01731000
SAPAGMT  EQU   SAPA+136                                                 01732000
@NM00009 EQU   SAPASF                                                   01733000
SAPASFS  EQU   SAPASF                                                   01734000
SAPASFI  EQU   SAPASF                                                   01735000
SAPASF9  EQU   SAPASF                                                   01736000
SAPASF1  EQU   SAPASF                                                   01737000
SAPAF99  EQU   SAPAF+60                                                 01738000
@NM00008 EQU   SAPAF+56                                                 01739000
@NM00007 EQU   SAPAFF                                                   01740000
SAPAFFA  EQU   SAPAFF                                                   01741000
SAPAFIL  EQU   SAPAF+48                                                 01742000
SAPAFIM  EQU   SAPAF+44                                                 01743000
SAPAFT9  EQU   SAPAFT+34                                                01744000
SAPAFTE  EQU   SAPAFT+33                                                01745000
SAPAFTD  EQU   SAPAFT+2                                                 01746000
@NM00006 EQU   SAPAFT+1                                                 01747000
SAPAFTY  EQU   SAPAFT                                                   01748000
SAPAFT0  EQU   SAPAFT                                                   01749000
SAPAFLB  EQU   SAPAF+9                                                  01750000
SAPAFOB  EQU   SAPAF+8                                                  01751000
SAPAFLE  EQU   SAPAF+4                                                  01752000
SAPAFOF  EQU   SAPAF                                                    01753000
SAPAF00  EQU   SAPAF                                                    01754000
@NM00005 EQU   SAPA+66                                                  01755000
SAPAELK  EQU   SAPA+66                                                  01756000
SAPADT9  EQU   SAPADT+34                                                01757000
SAPADTE  EQU   SAPADT+33                                                01758000
SAPADTD  EQU   SAPADT+2                                                 01759000
@NM00004 EQU   SAPADT+1                                                 01760000
SAPADTY  EQU   SAPADT                                                   01761000
SAPADT0  EQU   SAPADT                                                   01762000
SAPALAD  EQU   SAPA+28                                                  01763000
SAPAAS9  EQU   SAPAAS+16                                                01764000
@NM00003 EQU   SAPAAS+12                                                01765000
SAPAAS2  EQU   SAPAAS+8                                                 01766000
SAPAAS1  EQU   SAPAAS+4                                                 01767000
@NM00002 EQU   SAPAAS+2                                                 01768000
SAPAAST  EQU   SAPAAS                                                   01769000
SAPAAS0  EQU   SAPAAS                                                   01770000
SAPARDX  EQU   SAPA+8                                                   01771000
@NM00001 EQU   SAPA+2                                                   01772000
SAPARID  EQU   SAPA                                                     01773000
@NM00137 EQU   TCBXTNT2+32                                              01774000
TCBRV181 EQU   TCBRV173                                                 01775000
TCBRV180 EQU   TCBRV173                                                 01776000
TCBRV179 EQU   TCBRV173                                                 01777000
TCBRV178 EQU   TCBRV173                                                 01778000
TCBRV177 EQU   TCBRV173                                                 01779000
TCBRV176 EQU   TCBRV173                                                 01780000
TCBRV175 EQU   TCBRV173                                                 01781000
TCBRV174 EQU   TCBRV173                                                 01782000
TCBRV172 EQU   TCBRV164                                                 01783000
TCBRV171 EQU   TCBRV164                                                 01784000
TCBRV170 EQU   TCBRV164                                                 01785000
TCBRV169 EQU   TCBRV164                                                 01786000
TCBRV168 EQU   TCBRV164                                                 01787000
TCBRV167 EQU   TCBRV164                                                 01788000
TCBRV166 EQU   TCBRV164                                                 01789000
TCBRV165 EQU   TCBRV164                                                 01790000
TCBRV163 EQU   TCBRV155                                                 01791000
TCBRV162 EQU   TCBRV155                                                 01792000
TCBRV161 EQU   TCBRV155                                                 01793000
TCBRV160 EQU   TCBRV155                                                 01794000
TCBRV159 EQU   TCBRV155                                                 01795000
TCBRV158 EQU   TCBRV155                                                 01796000
TCBRV157 EQU   TCBRV155                                                 01797000
TCBRV156 EQU   TCBRV155                                                 01798000
TCBRV154 EQU   TCBRV146                                                 01799000
TCBRV153 EQU   TCBRV146                                                 01800000
TCBRV152 EQU   TCBRV146                                                 01801000
TCBRV151 EQU   TCBRV146                                                 01802000
TCBRV150 EQU   TCBRV146                                                 01803000
TCBRV149 EQU   TCBRV146                                                 01804000
TCBRV148 EQU   TCBRV146                                                 01805000
TCBRV147 EQU   TCBRV146                                                 01806000
TCBRV145 EQU   TCBXTNT2+26                                              01807000
TCBRV144 EQU   TCBXTNT2+24                                              01808000
TCBRV143 EQU   TCBXTNT2+20                                              01809000
TCBRV142 EQU   TCBXTNT2+16                                              01810000
TCBRSV49 EQU   TCBXTNT2+12                                              01811000
TCBEVENT EQU   TCBXTNT2+8                                               01812000
TCBRCMP  EQU   TCBXTNT2+5                                               01813000
TCBRSVAB EQU   TCBXTNT2+4                                               01814000
TCBGTFA  EQU   TCBGTF+1                                                 01815000
TCBRSV47 EQU   TCBTFLG                                                  01816000
TCBRSV46 EQU   TCBTFLG                                                  01817000
TCBRSV45 EQU   TCBTFLG                                                  01818000
TCBRSV44 EQU   TCBTFLG                                                  01819000
TCBRSV43 EQU   TCBTFLG                                                  01820000
TCBDSPIT EQU   TCBTFLG                                                  01821000
TCBERRTN EQU   TCBTFLG                                                  01822000
TCBASYNC EQU   TCBTFLG                                                  01823000
@NM00136 EQU   TCB+296                                                  01824000
TCBSVCA2 EQU   TCB+292                                                  01825000
TCBSWASA EQU   TCB+288                                                  01826000
TCBDBTB  EQU   TCB+284                                                  01827000
TCBRPT   EQU   TCB+280                                                  01828000
TCBRV141 EQU   TCBRV133                                                 01829000
TCBRV140 EQU   TCBRV133                                                 01830000
TCBRV139 EQU   TCBRV133                                                 01831000
TCBRV138 EQU   TCBRV133                                                 01832000
TCBRV137 EQU   TCBRV133                                                 01833000
TCBRV136 EQU   TCBRV133                                                 01834000
TCBRV135 EQU   TCBRV133                                                 01835000
TCBRV134 EQU   TCBRV133                                                 01836000
TCBRV132 EQU   TCBRV124                                                 01837000
TCBRV131 EQU   TCBRV124                                                 01838000
TCBRV130 EQU   TCBRV124                                                 01839000
TCBRV129 EQU   TCBRV124                                                 01840000
TCBRV128 EQU   TCBRV124                                                 01841000
TCBRV127 EQU   TCBRV124                                                 01842000
TCBRV126 EQU   TCBRV124                                                 01843000
TCBRV125 EQU   TCBRV124                                                 01844000
TCBRV123 EQU   TCBFBYT2                                                 01845000
TCBRV122 EQU   TCBFBYT2                                                 01846000
TCBECBNV EQU   TCBFBYT2                                                 01847000
TCBSSSYN EQU   TCBFBYT2                                                 01848000
TCBFPRAP EQU   TCBFBYT2                                                 01849000
TCBFDW   EQU   TCBFBYT2                                                 01850000
TCBFMW   EQU   TCBFBYT2                                                 01851000
TCBCNCB  EQU   TCBFBYT2                                                 01852000
TCBLLH   EQU   TCBFBYT1                                                 01853000
TCBRV113 EQU   TCBFBYT1                                                 01854000
TCBEOT   EQU   TCBFBYT1                                                 01855000
TCBRTM2  EQU   TCBFBYT1                                                 01856000
TCBPGNLY EQU   TCBFBYT1                                                 01857000
TCBNDIOS EQU   TCBFBYT1                                                 01858000
TCBRV327 EQU   TCBFBYT1                                                 01859000
TCBEOTFM EQU   TCBFBYT1                                                 01860000
TCBAFFN  EQU   TCB+274                                                  01861000
TCBRV326 EQU   TCB+272                                                  01862000
TCBUKYSP EQU   TCB+268                                                  01863000
TCBMODE  EQU   TCBESTAE+3                                               01864000
TCBERTYP EQU   TCBESTAE+2                                               01865000
TCBRV314 EQU   TCBESTRM                                                 01866000
TCBRV313 EQU   TCBESTRM                                                 01867000
TCBRV312 EQU   TCBESTRM                                                 01868000
TCBRV311 EQU   TCBESTRM                                                 01869000
TCBRV310 EQU   TCBESTRM                                                 01870000
TCBRV309 EQU   TCBESTRM                                                 01871000
TCBRV308 EQU   TCBESTRM                                                 01872000
TCBETERM EQU   TCBESTRM                                                 01873000
TCBSCBKY EQU   TCBESTAE                                                 01874000
TCBRTM12 EQU   TCB+260                                                  01875000
TCBSTAFX EQU   TCBSTAWA                                                 01876000
TCBSWA   EQU   TCB+248                                                  01877000
TCBFOEA  EQU   TCBFOE+1                                                 01878000
TCBRSV42 EQU   TCBFOE                                                   01879000
TCBCCPVI EQU   TCBXSCT+2                                                01880000
TCBRV325 EQU   TCBXSCT+1                                                01881000
TCBRV324 EQU   TCBXSCT1                                                 01882000
TCBRV323 EQU   TCBXSCT1                                                 01883000
TCBRV322 EQU   TCBXSCT1                                                 01884000
TCBRV321 EQU   TCBXSCT1                                                 01885000
TCBRV320 EQU   TCBXSCT1                                                 01886000
TCBRV319 EQU   TCBXSCT1                                                 01887000
TCBS3A   EQU   TCBXSCT1                                                 01888000
TCBACTIV EQU   TCBXSCT1                                                 01889000
TCBRSV41 EQU   TCB+239                                                  01890000
TCBTID   EQU   TCB+238                                                  01891000
TCBRSVAA EQU   TCB+237                                                  01892000
TCBABCUR EQU   TCB+236                                                  01893000
TCBTMSAV EQU   TCB+232                                                  01894000
TCBIOTIM EQU   TCB+228                                                  01895000
TCBTIRB  EQU   TCB+216                                                  01896000
TCBAECB  EQU   TCB+212                                                  01897000
TCBEXT2A EQU   TCBEXT2+1                                                01898000
TCBRSV39 EQU   TCBEXT2                                                  01899000
TCBSTMCT EQU   TCB+207                                                  01900000
TCBSYSCT EQU   TCB+206                                                  01901000
TCBRSV37 EQU   TCB+205                                                  01902000
TCBEXSVC EQU   TCBDAR                                                   01903000
TCBDARMS EQU   TCBDAR                                                   01904000
TCBDARWT EQU   TCBDAR                                                   01905000
TCBDARO  EQU   TCBDAR                                                   01906000
TCBDARMC EQU   TCBDARC                                                  01907000
TCBDARD  EQU   TCBDAR                                                   01908000
TCBDARS  EQU   TCBDAR                                                   01909000
TCBDARP  EQU   TCBDAR                                                   01910000
TCBGTOFM EQU   TCBFLGS7                                                 01911000
TCBADMP  EQU   TCBFLGS7                                                 01912000
TCBRSTSK EQU   TCBFLGS7                                                 01913000
TCBSVCS  EQU   TCBFLGS7                                                 01914000
TCBSTACK EQU   TCBFLGS7                                                 01915000
TCBRSV34 EQU   TCBFLGS7                                                 01916000
TCBRSV33 EQU   TCBFLGS7                                                 01917000
TCBGPECB EQU   TCBFLGS7                                                 01918000
TCBNTJS  EQU   TCBFLGS6                                                 01919000
TCBAPG   EQU   TCBFLGS6                                                 01920000
TCBMIGR  EQU   TCBFLGS6                                                 01921000
TCBRV303 EQU   TCBFLGS6                                                 01922000
TCBSPVLK EQU   TCBFLGS6                                                 01923000
TCBCPU   EQU   TCBFLGS6                                                 01924000
TCBPIE17 EQU   TCBFLGS6                                                 01925000
TCBRV    EQU   TCBFLGS6                                                 01926000
TCBRSV79 EQU   TCBNDSP5                                                 01927000
TCBRSV78 EQU   TCBNDSP5                                                 01928000
TCBRSV77 EQU   TCBNDSP5                                                 01929000
TCBRSV76 EQU   TCBNDSP5                                                 01930000
TCBRSV75 EQU   TCBNDSP5                                                 01931000
TCBRSV74 EQU   TCBNDSP5                                                 01932000
TCBRSV95 EQU   TCBNDSP5                                                 01933000
TCBRSV94 EQU   TCBNDSP5                                                 01934000
TCBRSV93 EQU   TCBNDSP4                                                 01935000
TCBRSV92 EQU   TCBNDSP4                                                 01936000
TCBRSV91 EQU   TCBNDSP4                                                 01937000
TCBRSV90 EQU   TCBNDSP4                                                 01938000
TCBRSV89 EQU   TCBNDSP4                                                 01939000
TCBRSV88 EQU   TCBNDSP4                                                 01940000
TCBRSV87 EQU   TCBNDSP4                                                 01941000
TCBRSV86 EQU   TCBNDSP4                                                 01942000
TCBEXT1A EQU   TCBEXT1+1                                                01943000
TCBRSV32 EQU   TCBEXT1                                                  01944000
TCBEXCPD EQU   TCB+192                                                  01945000
TCBIOBRC EQU   TCB+188                                                  01946000
TCBDDWTC EQU   TCB+186                                                  01947000
TCBDDEXC EQU   TCB+184                                                  01948000
TCBJSCBB EQU   TCBJSCB+1                                                01949000
@NM00135 EQU   TCBRECDE                                                 01950000
TCBREC   EQU   TCBRECDE                                                 01951000
TCBMDIDS EQU   TCB+176                                                  01952000
TCBNDINT EQU   TCBNDSP3                                                 01953000
TCBRSV27 EQU   TCBNDSP3                                                 01954000
TCBRSV26 EQU   TCBNDSP3                                                 01955000
TCBRSV25 EQU   TCBNDSP3                                                 01956000
TCBRSV24 EQU   TCBNDSP3                                                 01957000
TCBSRBND EQU   TCBNDSP3                                                 01958000
TCBRV302 EQU   TCBNDSP3                                                 01959000
TCBLJSND EQU   TCBNDSP3                                                 01960000
TCBABE   EQU   TCBNDSP2                                                 01961000
TCBDSS   EQU   TCBNDSP2                                                 01962000
TCBOWAIT EQU   TCBNDSP2                                                 01963000
TCBIWAIT EQU   TCBNDSP2                                                 01964000
TCBNDTS  EQU   TCBNDSP2                                                 01965000
TCBNDSVC EQU   TCBNDSP2                                                 01966000
TCBSTPP  EQU   TCBNDSP2                                                 01967000
TCBABD   EQU   TCBNDSP2                                                 01968000
TCBRSV22 EQU   TCBNDSP1                                                 01969000
TCBPIEND EQU   TCBNDSP1                                                 01970000
TCBTPSP  EQU   TCBNDSP1                                                 01971000
TCBDDRND EQU   TCBNDSP1                                                 01972000
TCBRSPND EQU   TCBNDSP1                                                 01973000
TCBRSTND EQU   TCBNDSP1                                                 01974000
TCBDARPN EQU   TCBNDSP1                                                 01975000
TCBDARTN EQU   TCBNDSP1                                                 01976000
TCBNDSP0 EQU   TCBNDSP                                                  01977000
TCBUSER  EQU   TCB+168                                                  01978000
TCBTCTB  EQU   TCBTCT+1                                                 01979000
TCBRSV9C EQU   TCBTCTGF                                                 01980000
TCBRSV9B EQU   TCBTCTGF                                                 01981000
TCBRSV9A EQU   TCBTCTGF                                                 01982000
TCBRSV99 EQU   TCBTCTGF                                                 01983000
TCBRSV98 EQU   TCBTCTGF                                                 01984000
TCBRSV97 EQU   TCBTCTGF                                                 01985000
TCBRSV20 EQU   TCBTCTGF                                                 01986000
TCBSMFGF EQU   TCBTCTGF                                                 01987000
TCBSTABB EQU   TCBSTAB+1                                                01988000
TCBSTCUR EQU   TCBNSTAE                                                 01989000
TCBRV301 EQU   TCBNSTAE                                                 01990000
TCBSYNCH EQU   TCBNSTAE                                                 01991000
TCBHALT  EQU   TCBNSTAE                                                 01992000
TCBPPSUP EQU   TCBNSTAE                                                 01993000
TCB33E   EQU   TCBNSTAE                                                 01994000
TCBQUIES EQU   TCBNSTAE                                                 01995000
TCBSTABE EQU   TCBNSTAE                                                 01996000
TCBAQE   EQU   TCB+156                                                  01997000
TCBPQE   EQU   TCB+152                                                  01998000
TCBTSDP  EQU   TCB+151                                                  01999000
TCBTSLP  EQU   TCB+150                                                  02000000
TCBSTPCT EQU   TCB+149                                                  02001000
TCBCPUBN EQU   TCBTSFLG                                                 02002000
TCBDYDSP EQU   TCBTSFLG                                                 02003000
TCBRSV18 EQU   TCBTSFLG                                                 02004000
TCBRSV17 EQU   TCBTSFLG                                                 02005000
TCBTIOTG EQU   TCBTSFLG                                                 02006000
TCBATT   EQU   TCBTSFLG                                                 02007000
TCBSTPPR EQU   TCBTSFLG                                                 02008000
TCBRV300 EQU   TCBTSTSK                                                 02009000
TCBECB   EQU   TCB+144                                                  02010000
TCBJSTCA EQU   TCBJSTCB+1                                               02011000
TCBRSV16 EQU   TCBJSTCB                                                 02012000
TCBTQET  EQU   TCBTME                                                   02013000
TCBFSAB  EQU   TCBFSA+1                                                 02014000
TCBQEL   EQU   TCBFSA                                                   02015000
TCBGRS15 EQU   TCBGRS+60                                                02016000
TCBGRS14 EQU   TCBGRS+56                                                02017000
TCBGRS13 EQU   TCBGRS+52                                                02018000
TCBGRS12 EQU   TCBGRS+48                                                02019000
TCBGRS11 EQU   TCBGRS+44                                                02020000
TCBGRS10 EQU   TCBGRS+40                                                02021000
TCBGRS9  EQU   TCBGRS+36                                                02022000
TCBGRS8  EQU   TCBGRS+32                                                02023000
TCBGRS7  EQU   TCBGRS+28                                                02024000
TCBGRS6  EQU   TCBGRS+24                                                02025000
TCBGRS5  EQU   TCBGRS+20                                                02026000
TCBGRS4  EQU   TCBGRS+16                                                02027000
TCBGRS3  EQU   TCBGRS+12                                                02028000
TCBGRS2  EQU   TCBGRS+8                                                 02029000
TCBGRS1  EQU   TCBGRS+4                                                 02030000
TCBGRS0  EQU   TCBGRS                                                   02031000
TCBJPQB  EQU   TCBJPQ+1                                                 02032000
TCBRSV15 EQU   TCBPURGE                                                 02033000
TCBRSV14 EQU   TCBPURGE                                                 02034000
TCBRSV13 EQU   TCBPURGE                                                 02035000
TCBRSV12 EQU   TCBPURGE                                                 02036000
TCBRSV11 EQU   TCBPURGE                                                 02037000
TCBRSV10 EQU   TCBPURGE                                                 02038000
TCBRSV09 EQU   TCBPURGE                                                 02039000
TCBJPQF  EQU   TCBPURGE                                                 02040000
TCBLLS   EQU   TCB+36                                                   02041000
TCBDSP   EQU   TCB+35                                                   02042000
TCBLMP   EQU   TCB+34                                                   02043000
TCBPNDSP EQU   TCBFLGS5                                                 02044000
TCBFCD1  EQU   TCBFLGS5                                                 02045000
TCBSTP   EQU   TCBFLGS5                                                 02046000
TCBSYS   EQU   TCBFLGS5                                                 02047000
TCBANDSP EQU   TCBFLGS5                                                 02048000
TCBPAGE  EQU   TCBFLGS5                                                 02049000
TCBUXNDF EQU   TCBABWF                                                  02050000
TCBFC    EQU   TCBFLGS5                                                 02051000
TCBONDSP EQU   TCBFLGS4                                                 02052000
TCBMPCND EQU   TCBFLGS4                                                 02053000
TCBMPCVQ EQU   TCBFLGS4                                                 02054000
TCBUXNDV EQU   TCBFLGS4                                                 02055000
TCBHNDSP EQU   TCBFLGS4                                                 02056000
TCBRQENA EQU   TCBFLGS4                                                 02057000
TCBSER   EQU   TCBFLGS4                                                 02058000
TCBNDUMP EQU   TCBFLGS4                                                 02059000
TCBDWSTA EQU   TCBFLGS3                                                 02060000
TCBRSV08 EQU   TCBFLGS3                                                 02061000
TCBRSV07 EQU   TCBFLGS3                                                 02062000
TCBRSV06 EQU   TCBFLGS3                                                 02063000
TCBABGM  EQU   TCBFLGS3                                                 02064000
TCBABTRM EQU   TCBFLGS3                                                 02065000
TCBADINP EQU   TCBFLGS3                                                 02066000
TCBFSM   EQU   TCBFLGS3                                                 02067000
TCBFTS   EQU   TCBFLGS2                                                 02068000
TCBFETXR EQU   TCBFLGS2                                                 02069000
TCBFDSOP EQU   TCBFLGS2                                                 02070000
TCBFJMC  EQU   TCBFLGS2                                                 02071000
TCBFSMC  EQU   TCBFLGS2                                                 02072000
TCBFABOP EQU   TCBFLGS2                                                 02073000
TCBFSTI  EQU   TCBFLGS2                                                 02074000
TCBFOINP EQU   TCBFLGS2                                                 02075000
TCBFX    EQU   TCBFLGS1                                                 02076000
TCBFS    EQU   TCBFLGS1                                                 02077000
TCBFT    EQU   TCBFLGS1                                                 02078000
TCBPDUMP EQU   TCBFLGS1                                                 02079000
TCBNONPR EQU   TCBFLGS1                                                 02080000
TCBFERA  EQU   TCBFLGS1                                                 02081000
TCBFE    EQU   TCBFLGS1                                                 02082000
TCBFA    EQU   TCBFLGS1                                                 02083000
TCBFLAG  EQU   TCBPKF                                                   02084000
TCBMSSB  EQU   TCBMSS+1                                                 02085000
TCBRSV03 EQU   TCBMSS                                                   02086000
TCBTRNB  EQU   TCBTRN+1                                                 02087000
TCBRSV02 EQU   TCBABF                                                   02088000
TCBOLTEP EQU   TCBABF                                                   02089000
TCBTCP   EQU   TCBABF                                                   02090000
TCBTCPP  EQU   TCBABF                                                   02091000
TCBRSV01 EQU   TCBABF                                                   02092000
TCBGRPH  EQU   TCBABF                                                   02093000
TCBNOCHK EQU   TCBABF                                                   02094000
TCBMOD91 EQU   TCBABF                                                   02095000
TCBCMPC  EQU   TCBCMP+1                                                 02096000
TCBRV318 EQU   TCBCMSG                                                  02097000
TCBRV317 EQU   TCBCIND                                                  02098000
TCBRV316 EQU   TCBCWTO                                                  02099000
TCBCASID EQU   TCBCDBL                                                  02100000
TCBNOCC  EQU   TCBSTCC                                                  02101000
TCBDMPO  EQU   TCBCPP                                                   02102000
TCBCSTEP EQU   TCBCMPF                                                  02103000
TCBCREQ  EQU   TCBCMPF                                                  02104000
TCBPIEA  EQU   TCBPIE+1                                                 02105000
TCBPM    EQU   TCBPMASK                                                 02106000
@NM00134 EQU   TCBPMASK                                                 02107000
TCBFRS6  EQU   TCBFRS+24                                                02108000
TCBFRS4  EQU   TCBFRS+16                                                02109000
TCBFRS2  EQU   TCBFRS+8                                                 02110000
TCBFRS0  EQU   TCBFRS                                                   02111000
RVT99999 EQU   RVT+384                                                  02112000
RVT0096P EQU   RVT+380                                                  02113000
RVT0095P EQU   RVT+376                                                  02114000
RVT0094P EQU   RVT+372                                                  02115000
RVT0093P EQU   RVT+368                                                  02116000
RVT0092P EQU   RVT+364                                                  02117000
RVT0091P EQU   RVT+360                                                  02118000
RVT0090P EQU   RVT+356                                                  02119000
RVT0089P EQU   RVT+352                                                  02120000
RVT0088P EQU   RVT+348                                                  02121000
RVT0087P EQU   RVT+344                                                  02122000
RVT0086P EQU   RVT+340                                                  02123000
RVT0085P EQU   RVT+336                                                  02124000
RVT0084P EQU   RVT+332                                                  02125000
RVT0083P EQU   RVT+328                                                  02126000
RVT0082P EQU   RVT+324                                                  02127000
RVT0081P EQU   RVT+320                                                  02128000
RVT0080P EQU   RVT+316                                                  02129000
RVT0079P EQU   RVT+312                                                  02130000
RVT0078P EQU   RVT+308                                                  02131000
RVT0077P EQU   RVT+304                                                  02132000
RVT0076P EQU   RVT+300                                                  02133000
RVT0075P EQU   RVT+296                                                  02134000
RVT0074P EQU   RVT+292                                                  02135000
RVT0073P EQU   RVT+288                                                  02136000
RVT0072P EQU   RVT+284                                                  02137000
RVTDTUTP EQU   RVT+272                                                  02138000
RVTDTMTP EQU   RVT+268                                                  02139000
RVT0057P EQU   RVT+224                                                  02140000
RVT0056P EQU   RVT+220                                                  02141000
RVT0055P EQU   RVT+216                                                  02142000
RVT0054P EQU   RVT+212                                                  02143000
RVT0053P EQU   RVT+208                                                  02144000
RVT0044P EQU   RVT+172                                                  02145000
RVT0043P EQU   RVT+168                                                  02146000
RVT0040P EQU   RVT+156                                                  02147000
RVT0039P EQU   RVT+152                                                  02148000
RVT0038P EQU   RVT+148                                                  02149000
RVT0037P EQU   RVT+144                                                  02150000
RVT0031P EQU   RVT+120                                                  02151000
RVT0030P EQU   RVT+116                                                  02152000
RVT0029P EQU   RVT+112                                                  02153000
RVT0020P EQU   RVT+76                                                   02154000
RVT0012P EQU   RVT+44                                                   02155000
RVT0010P EQU   RVT+36                                                   02156000
RVT0009P EQU   RVT+32                                                   02157000
RVT0008P EQU   RVT+28                                                   02158000
RVT0006P EQU   RVT+20                                                   02159000
ZZ69999  EQU   ZZ6+1792                                                 02160000
ZZ6BRB   EQU   ZZ6B+12                                                  02161000
ZZ6BRC   EQU   ZZ6B+8                                                   02162000
@NM00133 EQU   ZZ6B+6                                                   02163000
ZZ6BFL   EQU   ZZ6B+4                                                   02164000
ZZ6BDA   EQU   ZZ6B                                                     02165000
@NM00132 EQU   ZZ6+540                                                  02166000
ZZ6BUFI  EQU   ZZ6+536                                                  02167000
ZZ6BUFP  EQU   ZZ6+532                                                  02168000
ZZ6FILE  EQU   ZZ6+524                                                  02169000
ZZ6BUFB  EQU   ZZ6+520                                                  02170000
ZZ6BUFL  EQU   ZZ6+518                                                  02171000
ZZ6BUFN  EQU   ZZ6+516                                                  02172000
ZZ6ZZ6P  EQU   ZZ6+512                                                  02173000
@NM00131 EQU   ZZ6+256                                                  02174000
ZZ6D999  EQU   ZZ6D+128                                                 02175000
@NM00130 EQU   ZZ6D+116                                                 02176000
ZZ6DDA2  EQU   ZZ6D+104                                                 02177000
ZZ6DDA1  EQU   ZZ6D+100                                                 02178000
@NM00129 EQU   ZZ6DF                                                    02179000
ZZ6DFSU  EQU   ZZ6DF                                                    02180000
ZZ6DFST  EQU   ZZ6DF                                                    02181000
ZZ6DFMP  EQU   ZZ6DF                                                    02182000
ZZ6DFDU  EQU   ZZ6DF                                                    02183000
ZZ6DFBS  EQU   ZZ6DF                                                    02184000
ZZ6DQ2   EQU   ZZ6D+88                                                  02185000
ZZ6DQA9  EQU   ZZ6DQA+16                                                02186000
@NM00128 EQU   ZZ6DQA+12                                                02187000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 02188000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 02189000
@NM00127 EQU   ZZ6DQA+2                                                 02190000
ZZ6DQAT  EQU   ZZ6DQA                                                   02191000
ZZ6DQA0  EQU   ZZ6DQA                                                   02192000
ZZ6DRDX  EQU   ZZ6D+64                                                  02193000
ZZ6DELK  EQU   ZZ6D+64                                                  02194000
ZZ6DMEM  EQU   ZZ6D+56                                                  02195000
ZZ6DDT1  EQU   ZZ6DDT                                                   02196000
ZZ6DDO   EQU   ZZ6DD+2                                                  02197000
ZZ6DDL   EQU   ZZ6DD                                                    02198000
@NM00126 EQU   ZZ6D+2                                                   02199000
ZZ6DRID  EQU   ZZ6D                                                     02200000
ZZ6RDCB  EQU   ZZ6                                                      02201000
ZZ60000  EQU   ZZ6                                                      02202000
BVT99999 EQU   BVT+256                                                  02203000
BVT0064P EQU   BVT+252                                                  02204000
BVT0063P EQU   BVT+248                                                  02205000
BVT0062P EQU   BVT+244                                                  02206000
BVT0061P EQU   BVT+240                                                  02207000
BVT0060P EQU   BVT+236                                                  02208000
BVT0059P EQU   BVT+232                                                  02209000
BVT0057P EQU   BVT+224                                                  02210000
BVT0056P EQU   BVT+220                                                  02211000
BVTSTBLP EQU   BVT+200                                                  02212000
BVT0045P EQU   BVT+176                                                  02213000
BVT0044P EQU   BVT+172                                                  02214000
BVT0033P EQU   BVT+128                                                  02215000
BVT0032P EQU   BVT+124                                                  02216000
BVT0031P EQU   BVT+120                                                  02217000
BVT0030P EQU   BVT+116                                                  02218000
BVT0029P EQU   BVT+112                                                  02219000
BVT0026P EQU   BVT+100                                                  02220000
BVT0025P EQU   BVT+96                                                   02221000
BVT0024P EQU   BVT+92                                                   02222000
BVT0023P EQU   BVT+88                                                   02223000
BVT0016P EQU   BVT+60                                                   02224000
BVT0015P EQU   BVT+56                                                   02225000
BVT0014P EQU   BVT+52                                                   02226000
BVT0003P EQU   BVT+8                                                    02227000
BVT0001P EQU   BVT                                                      02228000
SA99     EQU   SA+72                                                    02229000
SARC     EQU   SAR+56                                                   02230000
SARB     EQU   SAR+52                                                   02231000
SARA     EQU   SAR+48                                                   02232000
SAR9     EQU   SAR+44                                                   02233000
SAR8     EQU   SAR+40                                                   02234000
SAR7     EQU   SAR+36                                                   02235000
SAR6     EQU   SAR+32                                                   02236000
SAR5     EQU   SAR+28                                                   02237000
SAR4     EQU   SAR+24                                                   02238000
SAR3     EQU   SAR+20                                                   02239000
SAR2     EQU   SAR+16                                                   02240000
SAR0     EQU   SAR+8                                                    02241000
SARF     EQU   SAR+4                                                    02242000
SARE     EQU   SAR                                                      02243000
SAFWD    EQU   SA+8                                                     02244000
SABAK    EQU   SA+4                                                     02245000
SA1L     EQU   SA1+1                                                    02246000
SA1P     EQU   SA1                                                      02247000
UPTPREFL EQU   UPT+23                                                   02248000
UPTPREFX EQU   UPT+16                                                   02249000
@NM00125 EQU   UPT+15                                                   02250000
UPTLDEL  EQU   UPT+14                                                   02251000
UPTCDEL  EQU   UPT+13                                                   02252000
UPTWTP   EQU   UPTSWS                                                   02253000
UPTMODE  EQU   UPTSWS                                                   02254000
UPTALD   EQU   UPTSWS                                                   02255000
UPTPAUS  EQU   UPTSWS                                                   02256000
UPTNCOM  EQU   UPTSWS                                                   02257000
UPTMID   EQU   UPTSWS                                                   02258000
UPTNPRM  EQU   UPTSWS                                                   02259000
UPTRCVR  EQU   UPTSWS                                                   02260000
UPTUSER  EQU   UPT+2                                                    02261000
@NM00124 EQU   UPT                                                      02262000
@NM00123 EQU   ECT+52                                                   02263000
@NM00122 EQU   ECT+48                                                   02264000
@NM00121 EQU   ECT+44                                                   02265000
@NM00120 EQU   ECTSWS2+1                                                02266000
@NM00119 EQU   ECTSWS21                                                 02267000
ECTTABND EQU   ECTSWS21                                                 02268000
ECTDEFCS EQU   ECTSWS21                                                 02269000
ECTBKPB  EQU   ECT+36                                                   02270000
ECTUSER  EQU   ECT+32                                                   02271000
ECTDDNUM EQU   ECT+29                                                   02272000
ECTATTN  EQU   ECTSWS                                                   02273000
ECTBKGRD EQU   ECTSWS                                                   02274000
ECTNNOT  EQU   ECTSWS                                                   02275000
ECTNMAL  EQU   ECTSWS                                                   02276000
ECTLOGF  EQU   ECTSWS                                                   02277000
ECTATRM  EQU   ECTSWS                                                   02278000
@NM00118 EQU   ECTSWS                                                   02279000
ECTNOPD  EQU   ECTSWS                                                   02280000
ECTSCMD  EQU   ECT+20                                                   02281000
ECTPCMD  EQU   ECT+12                                                   02282000
ECTSMSG  EQU   ECT+9                                                    02283000
ECTMSGF  EQU   ECT+8                                                    02284000
ECTIOWA  EQU   ECT+4                                                    02285000
ECTRTCD  EQU   ECT+1                                                    02286000
ECTRCDF  EQU   ECT                                                      02287000
PSCBU    EQU   PSCB+64                                                  02288000
PSCBRSZ  EQU   PSCB+60                                                  02289000
PSCBLINE EQU   PSCB+59                                                  02290000
PSCBCHAR EQU   PSCB+58                                                  02291000
PSCBUPTL EQU   PSCB+56                                                  02292000
PSCBUPT  EQU   PSCB+52                                                  02293000
PSCBRLGB EQU   PSCB+48                                                  02294000
PSCBDEST EQU   PSCB+40                                                  02295000
@NM00117 EQU   PSCB+36                                                  02296000
@NM00116 EQU   PSCB+32                                                  02297000
@NM00115 EQU   PSCB+28                                                  02298000
PSCBLTI2 EQU   PSCB+24                                                  02299000
PSCBLTIM EQU   PSCB+20                                                  02300000
PSCBATR2 EQU   PSCB+18                                                  02301000
@NM00114 EQU   PSCBATR1                                                 02302000
@NM00113 EQU   PSCBATR1                                                 02303000
@NM00112 EQU   PSCBATR1                                                 02304000
PSCBATTN EQU   PSCBATR1                                                 02305000
PSCBVMNT EQU   PSCBATR1                                                 02306000
PSCBJCL  EQU   PSCBATR1                                                 02307000
PSCBACCT EQU   PSCBATR1                                                 02308000
PSCBCTRL EQU   PSCBATR1                                                 02309000
PSCBGPNM EQU   PSCB+8                                                   02310000
PSCBUSRL EQU   PSCB+7                                                   02311000
PSCBUSER EQU   PSCB                                                     02312000
CMDT1    EQU   CMDT                                                     02313000
CMDO     EQU   CMD+2                                                    02314000
CMDL     EQU   CMD                                                      02315000
ZZ299999 EQU   ZZ2+8192                                                 02316000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  02317000
ZZ2AXOL  EQU   ZZ2AXO                                                   02318000
@NM00111 EQU   ZZ2+7288                                                 02319000
@NM00110 EQU   ZZ2AMDX+4                                                02320000
ZZ2AMDXC EQU   ZZ2AMDX                                                  02321000
ZZ2HSD   EQU   ZZ2+3056                                                 02322000
@NM00109 EQU   ZZ2ES                                                    02323000
@NM00108 EQU   ZZ2+2868                                                 02324000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                02325000
@NM00107 EQU   ZZ2ITSE                                                  02326000
ZZ2ITSEP EQU   ZZ2ITSE                                                  02327000
ZZ2ITSEW EQU   ZZ2ITSE                                                  02328000
@NM00106 EQU   ZZ2ITR+20                                                02329000
ZZ2ITREC EQU   ZZ2ITRE+1                                                02330000
@NM00105 EQU   ZZ2ITRE                                                  02331000
ZZ2ITREP EQU   ZZ2ITRE                                                  02332000
ZZ2ITREW EQU   ZZ2ITRE                                                  02333000
@NM00104 EQU   ZZ2ITR+9                                                 02334000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 02335000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 02336000
ZZ2ITRPP EQU   ZZ2ITR                                                   02337000
@NM00103 EQU   ZZ2+1544                                                 02338000
ZZ2PGM   EQU   ZZ2+1536                                                 02339000
@NM00102 EQU   ZZ2+1526                                                 02340000
ZZ2CW    EQU   ZZ2+1524                                                 02341000
@NM00101 EQU   ZZ2+1504                                                 02342000
@NM00100 EQU   ZZ2+1352                                                 02343000
ZZ2FFSYP EQU   ZZ2+1348                                                 02344000
ZZ2SASYP EQU   ZZ2+1344                                                 02345000
ZZ2RDSYP EQU   ZZ2+1340                                                 02346000
ZZ2RASYP EQU   ZZ2+1336                                                 02347000
ZZ2PHSYP EQU   ZZ2+1332                                                 02348000
ZZ200SYP EQU   ZZ2+1324                                                 02349000
ZZ2SCWP  EQU   ZZ2+1320                                                 02350000
ZZ2TTLP  EQU   ZZ2+1316                                                 02351000
ZZ2LOADP EQU   ZZ2+1312                                                 02352000
ZZ2VRESP EQU   ZZ2+1308                                                 02353000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               02354000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                02355000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                02356000
ZZ2VRSAP EQU   ZZ2+1288                                                 02357000
ZZ2DVTP  EQU   ZZ2+1276                                                 02358000
@NM00099 EQU   ZZ2+1272                                                 02359000
@NM00098 EQU   ZZ2+1268                                                 02360000
ZZ2RPLP  EQU   ZZ2+1260                                                 02361000
ZZ2TCBP  EQU   ZZ2+1256                                                 02362000
@NM00097 EQU   ZZ2+1252                                                 02363000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 02364000
@NM00096 EQU   ZZ2+1112                                                 02365000
ZZ2FPDRP EQU   ZZ2+1108                                                 02366000
ZZ2FDSDP EQU   ZZ2+1104                                                 02367000
ZZ2APDRP EQU   ZZ2+1100                                                 02368000
ZZ2ADSDP EQU   ZZ2+1096                                                 02369000
ZZ2ENQ0P EQU   ZZ2+1092                                                 02370000
@NM00095 EQU   ZZ2+1080                                                 02371000
ZZ2MSG0P EQU   ZZ2+1076                                                 02372000
ZZ2FT25P EQU   ZZ2+1072                                                 02373000
ZZ2MSGSP EQU   ZZ2+1060                                                 02374000
ZZ2ALOCP EQU   ZZ2+1056                                                 02375000
@NM00094 EQU   ZZ2+976                                                  02376000
ZZ2STGN  EQU   ZZ2STG+4                                                 02377000
ZZ2STGP  EQU   ZZ2STG                                                   02378000
@NM00093 EQU   ZZ2+952                                                  02379000
ZZ2SCMDE EQU   ZZ2+944                                                  02380000
ZZ2SCMDN EQU   ZZ2+936                                                  02381000
ZZ2IDENT EQU   ZZ2+928                                                  02382000
ZZ2A9999 EQU   ZZ2A+656                                                 02383000
@NM00092 EQU   ZZ2A+224                                                 02384000
@NM00091 EQU   ZZ2A+220                                                 02385000
ZZ2AQD99 EQU   ZZ2AQD+60                                                02386000
@NM00090 EQU   ZZ2AQD+56                                                02387000
@NM00089 EQU   ZZ2AQDF                                                  02388000
ZZ2AQDFA EQU   ZZ2AQDF                                                  02389000
ZZ2AQDIL EQU   ZZ2AQD+48                                                02390000
ZZ2AQDIM EQU   ZZ2AQD+44                                                02391000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               02392000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               02393000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                02394000
@NM00088 EQU   ZZ2AQDT+1                                                02395000
ZZ2AQDTY EQU   ZZ2AQDT                                                  02396000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  02397000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 02398000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 02399000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 02400000
ZZ2AQDOF EQU   ZZ2AQD                                                   02401000
ZZ2AQD00 EQU   ZZ2AQD                                                   02402000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               02403000
@NM00087 EQU   ZZ2AQAS+12                                               02404000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                02405000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                02406000
@NM00086 EQU   ZZ2AQAS+2                                                02407000
ZZ2AQAST EQU   ZZ2AQAS                                                  02408000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  02409000
ZZ2ADPTA EQU   ZZ2ADPT                                                  02410000
ZZ2ADPL  EQU   ZZ2ADP                                                   02411000
ZZ2ADMTA EQU   ZZ2ADMT                                                  02412000
ZZ2ADML  EQU   ZZ2ADM                                                   02413000
ZZ2ADDTA EQU   ZZ2ADDT                                                  02414000
ZZ2ADDL  EQU   ZZ2ADD                                                   02415000
@NM00085 EQU   ZZ2A+72                                                  02416000
ZZ2APIDB EQU   ZZ2APID+3                                                02417000
ZZ2APIDA EQU   ZZ2APID                                                  02418000
@NM00084 EQU   ZZ2A+24                                                  02419000
@NM00083 EQU   ZZ2AF+5                                                  02420000
ZZ2AFX   EQU   ZZ2AF+5                                                  02421000
@NM00082 EQU   ZZ2AF+3                                                  02422000
ZZ2AFS   EQU   ZZ2AF+2                                                  02423000
ZZ2AFD   EQU   ZZ2AF+2                                                  02424000
ZZ2AFQ   EQU   ZZ2AF+2                                                  02425000
ZZ2AF$   EQU   ZZ2AF+2                                                  02426000
@NM00081 EQU   ZZ2AF+2                                                  02427000
ZZ2AFM   EQU   ZZ2AF+2                                                  02428000
@NM00080 EQU   ZZ2AF+2                                                  02429000
@NM00079 EQU   ZZ2AF+1                                                  02430000
ZZ2AFV   EQU   ZZ2AF+1                                                  02431000
@NM00078 EQU   ZZ2AF+1                                                  02432000
ZZ2AFC   EQU   ZZ2AF+1                                                  02433000
@NM00077 EQU   ZZ2AF                                                    02434000
ZZ2AFFS  EQU   ZZ2AF                                                    02435000
ZZ2AFT   EQU   ZZ2AF                                                    02436000
ZZ2AFP   EQU   ZZ2AF                                                    02437000
@NM00076 EQU   ZZ2A+8                                                   02438000
ZZ2ALINE EQU   ZZ2A+4                                                   02439000
@NM00075 EQU   ZZ2A+3                                                   02440000
ZZ2ACH   EQU   ZZ2A                                                     02441000
@NM00074 EQU   ZZ2+264                                                  02442000
@NM00073 EQU   ZZ2+263                                                  02443000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  02444000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 02445000
ZZ2PRTL  EQU   ZZ2PRT                                                   02446000
@NM00072 EQU   ZZ2AMD+56                                                02447000
ZZ2AMDXP EQU   ZZ2AMD+52                                                02448000
ZZ2AMDD  EQU   ZZ2AMD+48                                                02449000
ZZ2AMDL  EQU   ZZ2AMD+44                                                02450000
ZZ2AMDU  EQU   ZZ2AMD+28                                                02451000
ZZ2AMDF  EQU   ZZ2AMD+24                                                02452000
ZZ2AMDS  EQU   ZZ2AMD+20                                                02453000
ZZ2AMDC  EQU   ZZ2AMD+16                                                02454000
ZZ2AMDP  EQU   ZZ2AMD+12                                                02455000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 02456000
@NM00071 EQU   @NM00070                                                 02457000
ZZ2AMD2  EQU   @NM00070                                                 02458000
ZZ2AMD1  EQU   @NM00070                                                 02459000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 02460000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 02461000
ZZ2AMDT  EQU   ZZ2AMD                                                   02462000
ZZ199999 EQU   ZZ1+3072                                                 02463000
@NM00069 EQU   ZZ1+2160                                                 02464000
ZZ1TRTAS EQU   ZZ1+1904                                                 02465000
ZZ1TRUPC EQU   ZZ1+1648                                                 02466000
ZZ1TRCTX EQU   ZZ1+1392                                                 02467000
ZZ1NASID EQU   ZZ1N+274                                                 02468000
ZZ1NSTRL EQU   ZZ1N+272                                                 02469000
ZZ1NOFF  EQU   ZZ1N+268                                                 02470000
ZZ1NBDY  EQU   ZZ1N+264                                                 02471000
ZZ1NADE  EQU   ZZ1N+260                                                 02472000
ZZ1NADB  EQU   ZZ1N+256                                                 02473000
ZZ1NSTR  EQU   ZZ1N                                                     02474000
@NM00068 EQU   ZZ1+1080                                                 02475000
ZZ1TREBC EQU   ZZ1+824                                                  02476000
@NM00067 EQU   ZZ1+377                                                  02477000
ZZ1USTAE EQU   ZZ1+376                                                  02478000
@NM00066 EQU   ZZ1F+1                                                   02479000
@NM00065 EQU   ZZ1F                                                     02480000
ZZ1FM    EQU   ZZ1F                                                     02481000
ZZ1FX    EQU   ZZ1F                                                     02482000
ZZ1FU    EQU   ZZ1F                                                     02483000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 02484000
@NM00064 EQU   ZZ1EVE                                                   02485000
ZZ1EVEW  EQU   ZZ1EVE                                                   02486000
ZZ1ACMP  EQU   ZZ1ATTN                                                  02487000
@NM00063 EQU   ZZ1+144                                                  02488000
ZZ1FPP   EQU   ZZ1+140                                                  02489000
ZZ1ZZ6P  EQU   ZZ1+136                                                  02490000
@NM00062 EQU   ZZ1+84                                                   02491000
ZZ1PLINE EQU   ZZ1+80                                                   02492000
ZZ1PGSZ  EQU   ZZ1+76                                                   02493000
ZZ1PCNT  EQU   ZZ1+72                                                   02494000
@NM00061 EQU   ZZ1+68                                                   02495000
ZZ1TPAGE EQU   ZZ1+64                                                   02496000
ZZ1TLINE EQU   ZZ1+60                                                   02497000
@NM00060 EQU   ZZ1+52                                                   02498000
ZZ1DMCBP EQU   ZZ1+48                                                   02499000
ZZ1DSDP  EQU   ZZ1+44                                                   02500000
ZZ1PDRP  EQU   ZZ1+40                                                   02501000
ZZ1ZZ2P  EQU   ZZ1+36                                                   02502000
ZZ1327WP EQU   ZZ1+32                                                   02503000
ZZ1ACBP  EQU   ZZ1+28                                                   02504000
@NM00059 EQU   ZZ1+24                                                   02505000
ZZ1PDCBP EQU   ZZ1+20                                                   02506000
ZZ1BLRBL EQU   ZZ1+16                                                   02507000
@NM00058 EQU   ZZ1+12                                                   02508000
ZZ1PNULL EQU   ZZ1+8                                                    02509000
ZZ1NULL  EQU   ZZ1+4                                                    02510000
ZZ1IDE   EQU   ZZ1                                                      02511000
VRBAT1   EQU   VRBAT                                                    02512000
@NM00055 EQU   VRBA+2                                                   02513000
VRBAL    EQU   VRBA                                                     02514000
ESCO999  EQU   ESCO+182                                                 02515000
ESCORT1  EQU   ESCORT                                                   02516000
ESCORL   EQU   ESCOR                                                    02517000
@NM00054 EQU   ESCO+168                                                 02518000
ESCOABS  EQU   ESCO+164                                                 02519000
@NM00053 EQU   ESCOF+2                                                  02520000
@NM00052 EQU   ESCOFC                                                   02521000
ESCOFCD  EQU   ESCOFC                                                   02522000
ESCOFSS  EQU   ESCOFS                                                   02523000
ESCOFSX  EQU   ESCOFS                                                   02524000
ESCOFSR  EQU   ESCOFS                                                   02525000
ESCOFSP  EQU   ESCOFS                                                   02526000
ESCOFSA  EQU   ESCOFS                                                   02527000
ESCOFSM  EQU   ESCOFS                                                   02528000
ESCOFS2  EQU   ESCOFS                                                   02529000
ESCOFSC  EQU   ESCOFS                                                   02530000
ESCOKEY  EQU   ESCO+160                                                 02531000
@NM00051 EQU   ESCO+144                                                 02532000
ESCOMAD  EQU   ESCO+140                                                 02533000
ESCOD99  EQU   ESCOD+60                                                 02534000
@NM00050 EQU   ESCOD+56                                                 02535000
@NM00049 EQU   ESCODF                                                   02536000
ESCODFA  EQU   ESCODF                                                   02537000
ESCODIL  EQU   ESCOD+48                                                 02538000
ESCODIM  EQU   ESCOD+44                                                 02539000
ESCODT9  EQU   ESCODT+34                                                02540000
ESCODTE  EQU   ESCODT+33                                                02541000
ESCODTD  EQU   ESCODT+2                                                 02542000
@NM00048 EQU   ESCODT+1                                                 02543000
ESCODTY  EQU   ESCODT                                                   02544000
ESCODT0  EQU   ESCODT                                                   02545000
ESCODLB  EQU   ESCOD+9                                                  02546000
ESCODOB  EQU   ESCOD+8                                                  02547000
ESCODLE  EQU   ESCOD+4                                                  02548000
ESCODOF  EQU   ESCOD                                                    02549000
ESCOD00  EQU   ESCOD                                                    02550000
ESCOLAD  EQU   ESCO+76                                                  02551000
ESCOAS9  EQU   ESCOAS+16                                                02552000
@NM00047 EQU   ESCOAS+12                                                02553000
ESCOAS2  EQU   ESCOAS+8                                                 02554000
ESCOAS1  EQU   ESCOAS+4                                                 02555000
@NM00046 EQU   ESCOAS+2                                                 02556000
ESCOAST  EQU   ESCOAS                                                   02557000
ESCOAS0  EQU   ESCOAS                                                   02558000
ESCORV1  EQU   ESCO+59                                                  02559000
ESCOELK  EQU   ESCO+59                                                  02560000
ESCOSYM  EQU   ESCO+28                                                  02561000
ESCORDX  EQU   ESCO+24                                                  02562000
@NM00045 EQU   ESCO+16                                                  02563000
@NM00044 EQU   ESCO+8                                                   02564000
@NM00043 EQU   ESCO+2                                                   02565000
ESCORID  EQU   ESCO                                                     02566000
SABA999  EQU   SABA+3072                                                02567000
SABACT1  EQU   SABACT                                                   02568000
@NM00020 EQU   SABA+153                                                 02569000
SABAPGV  EQU   SABA+144                                                 02570000
@NM00019 EQU   SABASF                                                   02571000
SABAF99  EQU   SABAF+60                                                 02572000
@NM00018 EQU   SABAF+56                                                 02573000
@NM00017 EQU   SABAFF                                                   02574000
SABAFFA  EQU   SABAFF                                                   02575000
SABAFIL  EQU   SABAF+48                                                 02576000
SABAFIM  EQU   SABAF+44                                                 02577000
SABAFT9  EQU   SABAFT+34                                                02578000
SABAFTE  EQU   SABAFT+33                                                02579000
SABAFTD  EQU   SABAFT+2                                                 02580000
@NM00016 EQU   SABAFT+1                                                 02581000
SABAFTY  EQU   SABAFT                                                   02582000
SABAFT0  EQU   SABAFT                                                   02583000
SABAFLB  EQU   SABAF+9                                                  02584000
SABAFOB  EQU   SABAF+8                                                  02585000
SABAFLE  EQU   SABAF+4                                                  02586000
SABAFOF  EQU   SABAF                                                    02587000
SABAF00  EQU   SABAF                                                    02588000
@NM00015 EQU   SABA+66                                                  02589000
SABAELK  EQU   SABA+66                                                  02590000
SABADT9  EQU   SABADT+34                                                02591000
SABADTE  EQU   SABADT+33                                                02592000
SABADTD  EQU   SABADT+2                                                 02593000
@NM00014 EQU   SABADT+1                                                 02594000
SABADTY  EQU   SABADT                                                   02595000
SABADT0  EQU   SABADT                                                   02596000
SABAAS9  EQU   SABAAS+16                                                02597000
@NM00013 EQU   SABAAS+12                                                02598000
SABAAS2  EQU   SABAAS+8                                                 02599000
SABAAS1  EQU   SABAAS+4                                                 02600000
@NM00012 EQU   SABAAS+2                                                 02601000
SABAAS0  EQU   SABAAS                                                   02602000
SABARDX  EQU   SABA+8                                                   02603000
@NM00011 EQU   SABA+2                                                   02604000
SABARID  EQU   SABA                                                     02605000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02606000
@RT00174 EQU   LBLSCAN2                                                 02607000
@RF00174 EQU   LBLSCAN8                                                 02608000
@RT00256 EQU   LBLSCAN8                                                 02609000
@RT00259 EQU   LBLSCAN7                                                 02610000
@RT00289 EQU   LBLSCAN8                                                 02611000
@RT00328 EQU   EXIT                                                     02612000
@RT00358 EQU   PCHKEXIT                                                 02613000
@RF00361 EQU   @EC00371                                                 02614000
@RT00373 EQU   PCHKEXIT                                                 02615000
@ENDDATA EQU   *                                                        02616000
         END   BLSVTCB,(C'PLS0820',0701,78070)                          02617000
./  ADD  SSI=80690147,NAME=BLSVUCB
XUCB     TITLE 'BLSVUCB --SCAN UNIT CONTROL BLOCK (UCB)                *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPLK                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSVUCB  CSECT ,                                                   0002 00006000
@MAINENT DS    0H                                                  0002 00007000
         USING *,@15                                               0002 00008000
         B     @PROLOG                                             0002 00009000
         DC    AL1(16)                                             0002 00010000
         DC    C'BLSVUCB   78.069'                                 0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00013000
         BALR  @12,0                                               0002 00014000
@PSTART  DS    0H                                                  0002 00015000
         USING @PSTART,@12                                         0002 00016000
         L     @00,@SIZDATD                                        0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                             0002 00019000
         LA    @10,4095(,@11)                                      0002 00020000
         USING @DATD,@11                                           0002 00021000
         USING @DATD+4095,@10                                      0002 00022000
         ST    @13,@SA00001+4                                      0002 00023000
         LM    @00,@01,20(@13)                                     0002 00024000
         ST    @11,8(,@13)                                         0002 00025000
         LR    @13,@11                                             0002 00026000
         MVC   @PC00001(12),0(@01)                                 0002 00027000
*/********************************************************************/ 00028000
*/*                                                                  */ 00029000
*/* BLSVUCB --SCAN UNIT CONTROL BLOCK (UCB)                          */ 00030000
*/*                                                                  */ 00031000
*/********************************************************************/ 00032000
*                                                                  0173 00033000
*   /*****************************************************************/ 00034000
*   /*                                                               */ 00035000
*   /* BLSV12--SCAN EXIT SETUP AND IMAGE RETRIEVAL                   */ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                                  0173 00039000
*   DO;                             /* BLSV12                        */ 00040000
*                                                                  0173 00041000
*     /***************************************************************/ 00042000
*     /*                                                             */ 00043000
*     /* BLSV1--SCAN EXIT SETUP                                      */ 00044000
*     /*                                                             */ 00045000
*     /***************************************************************/ 00046000
*                                                                  0174 00047000
*     DO;                           /* BLSV1                         */ 00048000
*       RESPECIFY                                                  0175 00049000
*        (RF) RESTRICTED;           /* RETURN CODES                  */ 00050000
*       RETC=ZZZFLAGI;              /* RETURN CODE                   */ 00051000
         SLR   RETC,RETC                                           0176 00052000
*       SABAPTR=ADDR(SAPA);         /* ->SABA (ALIAS FOR SAPA        */ 00053000
         L     SABAPTR,@PC00001+4                                  0177 00054000
*       IF SABASF1=ZZZ1 THEN        /* SCAN STARTED                  */ 00055000
         TM    SABASF1(SABAPTR),B'10000000'                        0178 00056000
         BNO   @RF00178                                            0178 00057000
*         IF                        /* IMAGE RETRIEVAL REQUIRED      */ 00058000
*             SABASF9=ZZZ0|         /* SCAN NOT COMPLETE             */ 00059000
*             (SABASFS=ZZZ1&ZZ2ASE<=SABASRC) THEN/* IMAGE USED FOR 0179 00060000
*                                      MESSAGES                      */ 00061000
         TM    SABASF9(SABAPTR),B'01000000'                        0179 00062000
         BZ    @RT00179                                            0179 00063000
         TM    SABASFS(SABAPTR),B'00010000'                        0179 00064000
         BNO   @RF00179                                            0179 00065000
         CLC   ZZ2ASE(1,R9),SABASRC(SABAPTR)                       0179 00066000
         BNH   @RT00179                                            0179 00067000
*           GO TO LBLSCAN2;         /* IMAGE RETRIEVAL               */ 00068000
*         ELSE                      /* NO IMAGE RETRIEVAL            */ 00069000
*           GO TO LBLSCAN8;         /* TRANSMIT SCAN MESSAGE(S)      */ 00070000
         B     LBLSCAN8                                            0181 00071000
*       SABAGMT=ZZ2TOD;             /* REQUEST DATA BASE UPDATE      */ 00072000
@RF00178 MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0182 00073000
*       SABACL=(LENGTH(ERRF)/8)*DIM(ERRF);/* LENGTH OF SABACT        */ 00074000
*                                                                  0183 00075000
         MVC   SABACL(2,SABAPTR),@CH00048                          0183 00076000
*       /*************************************************************/ 00077000
*       /*                                                           */ 00078000
*       /* CLEAR ALL ERROR FLAGS                                     */ 00079000
*       /*                                                           */ 00080000
*       /*************************************************************/ 00081000
*                                                                  0184 00082000
*       DO ERRFNDX=1 TO DIM(ERRF);  /* CLEAR ALL ERROR FLAGS         */ 00083000
         LA    ERRFNDX,1                                           0184 00084000
@DL00184 DS    0H                                                  0185 00085000
*         ERRF(ERRFNDX)='00'X;      /* ONE BYTE AT A TIME            */ 00086000
         LR    @14,SABAPTR                                         0185 00087000
         ALR   @14,ERRFNDX                                         0185 00088000
         MVI   ERRF-1(@14),X'00'                                   0185 00089000
*       END;                        /* CLEAR ALL ERROR FLAGS         */ 00090000
         AL    ERRFNDX,@CF00051                                    0186 00091000
         C     ERRFNDX,@CF00048                                    0186 00092000
         BNH   @DL00184                                            0186 00093000
*       IF SABALAD//8¬=0 THEN       /* UNALIGNED                     */ 00094000
*                                                                  0187 00095000
         L     @14,SABALAD(,SABAPTR)                               0187 00096000
         N     @14,@CF00442                                        0187 00097000
         LTR   @14,@14                                             0187 00098000
         BZ    @RF00187                                            0187 00099000
*         /***********************************************************/ 00100000
*         /*                                                         */ 00101000
*         /* UNALIGNED                                               */ 00102000
*         /*                                                         */ 00103000
*         /***********************************************************/ 00104000
*                                                                  0188 00105000
*         DO;                       /* UNALIGNED                     */ 00106000
*           ERRFB(TST011)=ZZZ1;     /* UNALIGNED STORAGE ERROR       */ 00107000
         OI    ERRFB(SABAPTR),B'10000000'                          0189 00108000
*           SABASRC=ZZZFLAGS;       /* SCAN RETURN CODE              */ 00109000
         MVI   SABASRC(SABAPTR),X'0C'                              0190 00110000
*           SABASF1=ZZZ1;           /* SCAN STARTED                  */ 00111000
*           SABASF9=ZZZ1;           /* SCAN COMPLETED                */ 00112000
*           SABASFI=ZZZ1;           /* INITIAL ANALYSIS ERROR        */ 00113000
         OI    SABASF1(SABAPTR),B'11100000'                        0193 00114000
*           GO TO LBLSCAN8;         /* TRANSMIT SCAN MESSAGE(S)      */ 00115000
         B     LBLSCAN8                                            0194 00116000
*         END;                      /* UNALIGNED                     */ 00117000
*     END;                          /* BLSV1                         */ 00118000
*                                                                  0196 00119000
@RF00187 DS    0H                                                  0197 00120000
*     /***************************************************************/ 00121000
*     /*                                                             */ 00122000
*     /* BLSV2--RETRIEVE IMAGE OF BLOCK TO BE SCANNED                */ 00123000
*     /*                                                             */ 00124000
*     /***************************************************************/ 00125000
*                                                                  0197 00126000
*LBLSCAN2:                                                         0197 00127000
*     DO;                           /* BLSV2                         */ 00128000
LBLSCAN2 DS    0H                                                  0198 00129000
*       ESAU(1:LENGTH(ESCO))=ESCO;  /* INITIALIZE ES RECORD          */ 00130000
         L     @14,ZZ2ESSYP(,R9)                                   0198 00131000
         MVC   ESAU(182),ESCO(@14)                                 0198 00132000
*       ESAUAS=SABAAS;              /* ADDRESS SPACE                 */ 00133000
         MVC   ESAUAS(16),SABAAS(SABAPTR)                          0199 00134000
*       ESAULAD=SABALAD;            /* LOGICAL ADDRESS               */ 00135000
         L     @14,SABALAD(,SABAPTR)                               0200 00136000
         ST    @14,ESAULAD                                         0200 00137000
*       ESAUDT=SABADT;              /* DATA TYPE                     */ 00138000
         MVC   ESAUDT(34),SABADT(SABAPTR)                          0201 00139000
*       ESAUDOF=-8;                 /* DATA OFFSET                   */ 00140000
         MVC   ESAUDOF(4),@CF01868                                 0202 00141000
*       ESAUDLE=LENGTH(UCBOB)+8;    /* LENGTH                        */ 00142000
         MVC   ESAUDLE(4),@CF00070                                 0203 00143000
*       CALL BLSRACCQ(ZZ2,ESAU,BUF);/* RETRIEVE STORAGE              */ 00144000
         ST    R9,@AL00001                                         0204 00145000
         LA    @14,ESAU                                            0204 00146000
         ST    @14,@AL00001+4                                      0204 00147000
         LA    @14,BUF                                             0204 00148000
         ST    @14,@AL00001+8                                      0204 00149000
         L     @08,ZZ2RVTP(,R9)                                    0204 00150000
         L     @15,RVTACCQP(,@08)                                  0204 00151000
         LA    @01,@AL00001                                        0204 00152000
         BALR  @14,@15                                             0204 00153000
*       IF ESAUFSM=ZZZ1 THEN        /* STORAGE NOT AVAILABLE         */ 00154000
*                                                                  0205 00155000
         TM    ESAUFSM,B'00100000'                                 0205 00156000
         BNO   @RF00205                                            0205 00157000
*         /***********************************************************/ 00158000
*         /*                                                         */ 00159000
*         /* STORAGE NOT AVAILABLE                                   */ 00160000
*         /*                                                         */ 00161000
*         /***********************************************************/ 00162000
*                                                                  0206 00163000
*         DO;                       /* STORAGE NOT AVAILABLE         */ 00164000
*           IF ZZ1EVEP=ZZZ1 THEN    /* EARLY TERMINATION REQUESTED   */ 00165000
*                                                                  0207 00166000
         L     @14,ZZ2ZZ1P(,R9)                                    0207 00167000
         TM    ZZ1EVEP(@14),B'01000000'                            0207 00168000
         BNO   @RF00207                                            0207 00169000
*             /*******************************************************/ 00170000
*             /*                                                     */ 00171000
*             /* EARLY TERMINATION REQUESTED                         */ 00172000
*             /*                                                     */ 00173000
*             /*******************************************************/ 00174000
*                                                                  0208 00175000
*             DO;                   /* EARLY TERMINATION REQUESTED   */ 00176000
*               RETC=ZZZFLAGS;      /* RETURN CODE                   */ 00177000
         LA    RETC,12                                             0209 00178000
*               GO TO EXIT;         /* COMMON EXIT PATH              */ 00179000
         B     EXIT                                                0210 00180000
*             END;                  /* EARLY TERMINATION REQUESTED   */ 00181000
*           ERRFB(TST010)=ZZZ1;     /* STORAGE NOT AVAILABLE         */ 00182000
@RF00207 OI    ERRFB+1(SABAPTR),B'10000000'                        0212 00183000
*           SABASRC=MAX(SABASRC,ZZZFLAGW);/* SCAN RETURN CODE        */ 00184000
         SLR   @14,@14                                             0213 00185000
         IC    @14,SABASRC(,SABAPTR)                               0213 00186000
         LA    @08,4                                               0213 00187000
         CR    @14,@08                                             0213 00188000
         BNL   *+6                                                      00189000
         LR    @14,@08                                             0213 00190000
         STC   @14,SABASRC(,SABAPTR)                               0213 00191000
*           SABASF1=ZZZ1;           /* SCAN STARTED                  */ 00192000
*           SABASF9=ZZZ1;           /* SCAN COMPLETE                 */ 00193000
*           SABASFI=ZZZ1;           /* INITIAL ANALYSIS ERROR        */ 00194000
         OI    SABASF1(SABAPTR),B'11100000'                        0216 00195000
*           SABAGMT=ZZ2TOD;         /* REQUEST DATA BASE UPDATE      */ 00196000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0217 00197000
*           GO TO LBLSCAN8;         /* TRANSMIT SCAN MESSAGE(S)      */ 00198000
         B     LBLSCAN8                                            0218 00199000
*         END;                      /* STORAGE NOT AVAILABLE         */ 00200000
*       UCBPTR=ADDR(BUF)-ESAUDOF;   /* ->IMAGE                       */ 00201000
@RF00205 LA    UCBPTR,BUF                                          0220 00202000
         SL    UCBPTR,ESAUDOF                                      0220 00203000
*       FVAL(1)=UCBEXTPT;           /* POINTER 1                     */ 00204000
         L     @14,UCBEXTPT(,UCBPTR)                               0221 00205000
         ST    @14,FVAL                                            0221 00206000
*       IF SABASF9=ZZZ1 THEN        /* SCAN COMPLETED                */ 00207000
         TM    SABASF9(SABAPTR),B'01000000'                        0222 00208000
         BO    @RT00222                                            0222 00209000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00210000
*       SABASF9=ZZZ1;               /* SCAN COMPLETED                */ 00211000
         OI    SABASF9(SABAPTR),B'01000000'                        0224 00212000
*       IF SABASF1=ZZZ1 THEN        /* SCAN STARTED                  */ 00213000
         TM    SABASF1(SABAPTR),B'10000000'                        0225 00214000
         BO    @RT00225                                            0225 00215000
*         GO TO LBLSCAN7;           /* ANALYZE LOCATOR DATA          */ 00216000
*     END;                          /* BLSV2                         */ 00217000
*   END;                            /* BLSV12                        */ 00218000
*   SABAF=ESAUD;                    /* STORAGE ATTRIBUTES            */ 00219000
         MVC   SABAF(60,SABAPTR),ESAUD                             0229 00220000
*   DO;                             /* BLSVM0 MF(EXECUTE,TST012)     */ 00221000
*     IF UCBID¬='FF'X THEN                                         0231 00222000
         CLI   UCBID(UCBPTR),X'FF'                                 0231 00223000
         BE    @RF00231                                            0231 00224000
*       DO;                         /* INITIAL ANALYSIS ERROR        */ 00225000
*         ERRFB(TST012)=ZZZ1;                                      0233 00226000
         OI    ERRFB+2(SABAPTR),B'10000000'                        0233 00227000
*         SABASRC=MAX(SABASRC,MSGLEVEL(TST012));                   0234 00228000
         SLR   @14,@14                                             0234 00229000
         IC    @14,SABASRC(,SABAPTR)                               0234 00230000
         SLR   @08,@08                                             0234 00231000
         IC    @08,MSGLEVEL+2                                      0234 00232000
         CR    @14,@08                                             0234 00233000
         BNL   *+6                                                      00234000
         LR    @14,@08                                             0234 00235000
         STC   @14,SABASRC(,SABAPTR)                               0234 00236000
*         SABASF1=ZZZ1;             /* ANALYSIS STARTED              */ 00237000
*         SABASF9=ZZZ1;             /* ANALYSIS COMPLETE             */ 00238000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00239000
         OI    SABASF1(SABAPTR),B'11100000'                        0237 00240000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00241000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0238 00242000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00243000
         B     LBLSCAN8                                            0239 00244000
*       END;                        /* INITIAL ANALYSIS ERROR        */ 00245000
*   END;                            /* BLSVM0 MF(EXECUTE,TST012)     */ 00246000
@RF00231 DS    0H                                                  0242 00247000
*   J1=LENGTH(UCBOB)-SABAFOF;       /* BASE UCB LENGTH               */ 00248000
         LA    J1,24                                               0242 00249000
         SL    J1,SABAFOF(,SABAPTR)                                0242 00250000
*   IF UCB3COMM='1'B THEN                                          0243 00251000
*                                                                  0243 00252000
         TM    UCB3COMM(UCBPTR),B'01000000'                        0243 00253000
         BNO   @RF00243                                            0243 00254000
*     /***************************************************************/ 00255000
*     /*                                                             */ 00256000
*     /* TELECOMMUNICATIONS OR CHANNEL-TO-CHANNEL UCB                */ 00257000
*     /*                                                             */ 00258000
*     /***************************************************************/ 00259000
*                                                                  0244 00260000
*     DO;                           /* TP OR CTC UCB                 */ 00261000
*       IF UCBDVCLS='41'X THEN                                     0245 00262000
*                                                                  0245 00263000
         CLI   UCBDVCLS(UCBPTR),X'41'                              0245 00264000
         BNE   @RF00245                                            0245 00265000
*         /***********************************************************/ 00266000
*         /*                                                         */ 00267000
*         /* CHANNEL-TO-CHANNEL ADAPTER                              */ 00268000
*         /*                                                         */ 00269000
*         /***********************************************************/ 00270000
*                                                                  0246 00271000
*         DO;                       /* CHANNEL-TO-CHANNEL ADAPTER    */ 00272000
*           SABAFLE=J1+LENGTH(UCBOBS08);/* CTC UCB                   */ 00273000
         LA    @14,8                                               0247 00274000
         ALR   @14,J1                                              0247 00275000
         ST    @14,SABAFLE(,SABAPTR)                               0247 00276000
*           SABAFT=DTCTC;           /* DATA TYPE                     */ 00277000
         MVC   SABAFT(34,SABAPTR),DTCTC                            0248 00278000
*         END;                                                     0249 00279000
*       ELSE                                                       0250 00280000
*                                                                  0250 00281000
*         /***********************************************************/ 00282000
*         /*                                                         */ 00283000
*         /* TELECOMMUNICATIONS LINE                                 */ 00284000
*         /*                                                         */ 00285000
*         /***********************************************************/ 00286000
*                                                                  0250 00287000
*         DO;                       /* TELECOMMUNICATIONS LINE       */ 00288000
         B     @RC00245                                            0250 00289000
@RF00245 DS    0H                                                  0251 00290000
*           SABAFLE=J1+LENGTH(UCBOBS07);/* TP UCB                    */ 00291000
         LA    @14,8                                               0251 00292000
         ALR   @14,J1                                              0251 00293000
         ST    @14,SABAFLE(,SABAPTR)                               0251 00294000
*           SABAFT=DTTP;            /* DATA TYPE                     */ 00295000
         MVC   SABAFT(34,SABAPTR),DTTP                             0252 00296000
*         END;                                                     0253 00297000
*     END;                                                         0254 00298000
*   ELSE                                                           0255 00299000
*     IF UCB3TAPE='1'B THEN                                        0255 00300000
*                                                                  0255 00301000
         B     @RC00243                                            0255 00302000
@RF00243 TM    UCB3TAPE(UCBPTR),B'10000000'                        0255 00303000
         BNO   @RF00255                                            0255 00304000
*       /*************************************************************/ 00305000
*       /*                                                           */ 00306000
*       /* MAGNETIC TAPE                                             */ 00307000
*       /*                                                           */ 00308000
*       /*************************************************************/ 00309000
*                                                                  0256 00310000
*       DO;                         /* MAGNETIC TAPE                 */ 00311000
*         SABAFLE=J1+LENGTH(UCBOBS02);/* TAPE UCB                    */ 00312000
         LA    @14,24                                              0257 00313000
         ALR   @14,J1                                              0257 00314000
         ST    @14,SABAFLE(,SABAPTR)                               0257 00315000
*         SABAFT=DTTAPE;            /* DATA TYPE                     */ 00316000
         MVC   SABAFT(34,SABAPTR),DTTAPE                           0258 00317000
*       END;                                                       0259 00318000
*     ELSE                                                         0260 00319000
*       IF UCB3DISP='1'B THEN                                      0260 00320000
*                                                                  0260 00321000
         B     @RC00255                                            0260 00322000
@RF00255 TM    UCB3DISP(UCBPTR),B'00010000'                        0260 00323000
         BNO   @RF00260                                            0260 00324000
*         /***********************************************************/ 00325000
*         /*                                                         */ 00326000
*         /* GRAPHICS UCB                                            */ 00327000
*         /*                                                         */ 00328000
*         /***********************************************************/ 00329000
*                                                                  0261 00330000
*         DO;                       /* GRAPHICS UCB                  */ 00331000
*           IF UCBUNTYP>'08'X&UCBUNTYP<'0D'X THEN                  0262 00332000
*                                                                  0262 00333000
         CLI   UCBUNTYP(UCBPTR),X'08'                              0262 00334000
         BNH   @RF00262                                            0262 00335000
         CLI   UCBUNTYP(UCBPTR),X'0D'                              0262 00336000
         BNL   @RF00262                                            0262 00337000
*             /*******************************************************/ 00338000
*             /*                                                     */ 00339000
*             /* 3270 INFORMATION DISPLAY                            */ 00340000
*             /*                                                     */ 00341000
*             /*******************************************************/ 00342000
*                                                                  0263 00343000
*             DO;                   /* 3270 INFORMATION DISPLAY      */ 00344000
*               SABAFLE=J1+LENGTH(UCBOBS06);/* 3270 UCB              */ 00345000
         LA    @14,16                                              0264 00346000
         ALR   @14,J1                                              0264 00347000
         ST    @14,SABAFLE(,SABAPTR)                               0264 00348000
*               SABAFT=DT3270;      /* DATA TYPE                     */ 00349000
         MVC   SABAFT(34,SABAPTR),DT3270                           0265 00350000
*             END;                                                 0266 00351000
*           ELSE                                                   0267 00352000
*                                                                  0267 00353000
*             /*******************************************************/ 00354000
*             /*                                                     */ 00355000
*             /* GRAPHIC DEVICE                                      */ 00356000
*             /*                                                     */ 00357000
*             /*******************************************************/ 00358000
*                                                                  0267 00359000
*             DO;                   /* GRAPHIC DEVICE                */ 00360000
         B     @RC00262                                            0267 00361000
@RF00262 DS    0H                                                  0268 00362000
*               SABAFLE=J1+LENGTH(UCBOBS04);/* GRAPHICS UCB          */ 00363000
         LA    @14,16                                              0268 00364000
         ALR   @14,J1                                              0268 00365000
         ST    @14,SABAFLE(,SABAPTR)                               0268 00366000
*               SABAFT=DTGFX;       /* DATA TYPE                     */ 00367000
         MVC   SABAFT(34,SABAPTR),DTGFX                            0269 00368000
*             END;                                                 0270 00369000
*         END;                                                     0271 00370000
*       ELSE                                                       0272 00371000
*         IF UCB3UREC='1'B THEN                                    0272 00372000
*                                                                  0272 00373000
         B     @RC00260                                            0272 00374000
@RF00260 TM    UCB3UREC(UCBPTR),B'00001000'                        0272 00375000
         BNO   @RF00272                                            0272 00376000
*           /*********************************************************/ 00377000
*           /*                                                       */ 00378000
*           /* UNIT RECORD DEVICE                                    */ 00379000
*           /*                                                       */ 00380000
*           /*********************************************************/ 00381000
*                                                                  0273 00382000
*           DO;                     /* UNIT RECORD                   */ 00383000
*             SABAFLE=J1+LENGTH(UCBOBS03);/* UNIT RECORD UCB         */ 00384000
         LA    @14,4                                               0274 00385000
         ALR   @14,J1                                              0274 00386000
         ST    @14,SABAFLE(,SABAPTR)                               0274 00387000
*             SABAFT=DTUR;          /* DATA TYPE                     */ 00388000
         MVC   SABAFT(34,SABAPTR),DTUR                             0275 00389000
*           END;                                                   0276 00390000
*         ELSE                                                     0277 00391000
*                                                                  0277 00392000
*           /*********************************************************/ 00393000
*           /*                                                       */ 00394000
*           /* USE THE LENGTH OF A DIRECT ACCESS UCB BOTH FOR DIRECT */ 00395000
*           /* ACCESS UCBS AND FOR ALL UCBS WHOSE TYPE IS NOT        */ 00396000
*           /* RECOGNIZED BY THIS VERSION OF BLSSUCB                 */ 00397000
*           /*                                                       */ 00398000
*           /*********************************************************/ 00399000
*                                                                  0277 00400000
*           DO;                     /* DEFAULT TYPE                  */ 00401000
         B     @RC00272                                            0277 00402000
@RF00272 DS    0H                                                  0278 00403000
*             SABAFLE=J1+LENGTH(UCBOBS01);/* DIRECT ACCESS UCB       */ 00404000
         LA    @14,24                                              0278 00405000
         ALR   @14,J1                                              0278 00406000
         ST    @14,SABAFLE(,SABAPTR)                               0278 00407000
*             IF UCB3DACC='1'B THEN                                0279 00408000
*                                                                  0279 00409000
         TM    UCB3DACC(UCBPTR),B'00100000'                        0279 00410000
         BNO   @RF00279                                            0279 00411000
*               /*****************************************************/ 00412000
*               /*                                                   */ 00413000
*               /* DIRECT ACCESS UCB                                 */ 00414000
*               /*                                                   */ 00415000
*               /*****************************************************/ 00416000
*                                                                  0280 00417000
*               DO;                 /* DIRECT ACCESS UCB             */ 00418000
*                 SABAFT=DTDA;      /* DATA TYPE                     */ 00419000
         MVC   SABAFT(34,SABAPTR),DTDA                             0281 00420000
*                 IF UCBMTPXP='1'B THEN                            0282 00421000
*                                                                  0282 00422000
         TM    UCBMTPXP(UCBPTR),B'00001000'                        0282 00423000
         BNO   @RF00282                                            0282 00424000
*                   /*************************************************/ 00425000
*                   /*                                               */ 00426000
*                   /* MULTIPLE EXPOSURE DEVICE                      */ 00427000
*                   /*                                               */ 00428000
*                   /*************************************************/ 00429000
*                                                                  0283 00430000
*                   DO;             /* MULTIPLE EXPOSURE DEVICE      */ 00431000
*                     SABAFFA='1'B; /* ARRAY                         */ 00432000
         OI    SABAFFA(SABAPTR),B'10000000'                        0284 00433000
*                     SABAFIM=8;    /* DIMENSION                     */ 00434000
         MVC   SABAFIM(4,SABAPTR),@CF00059                         0285 00435000
*                   END;                                           0286 00436000
*               END;                                               0287 00437000
@RF00282 DS    0H                                                  0288 00438000
*           END;                                                   0288 00439000
*                                                                  0288 00440000
@RF00279 DS    0H                                                  0289 00441000
*   /*****************************************************************/ 00442000
*   /*                                                               */ 00443000
*   /* BLSV79--SCAN EXIT LOCATOR ANALYSIS, MESSAGE TRANSMISSION, AND */ 00444000
*   /* EPILOG                                                        */ 00445000
*   /*                                                               */ 00446000
*   /*****************************************************************/ 00447000
*                                                                  0289 00448000
*LBLSCAN7:                                                         0289 00449000
*   DO;                             /* BLSV79                        */ 00450000
*                                                                  0289 00451000
@RC00272 DS    0H                                                  0289 00452000
@RC00260 DS    0H                                                  0289 00453000
@RC00255 DS    0H                                                  0289 00454000
@RC00243 DS    0H                                                  0289 00455000
LBLSCAN7 DS    0H                                                  0290 00456000
*     /***************************************************************/ 00457000
*     /*                                                             */ 00458000
*     /* BLSV7--ANALYZE LOCATOR DATA                                 */ 00459000
*     /*                                                             */ 00460000
*     /***************************************************************/ 00461000
*                                                                  0290 00462000
*     DO;                           /* BLSV7                         */ 00463000
*       ERRFNDX=DIM(MSGPTR)+1;      /* ERROR INDEX                   */ 00464000
         LA    ERRFNDX,4                                           0291 00465000
*       SAAUAS=SABAAS;              /* ADDRESS SPACE                 */ 00466000
         MVC   SAAUAS(16),SABAAS(SABAPTR)                          0292 00467000
*       SAAUDTY=ZZZDTYM;            /* DATA TYPE CODE                */ 00468000
         MVI   SAAUDTY,C'M'                                        0293 00469000
*       SAAUDTD=ZZZSYM40;           /* RESET DATA NAME               */ 00470000
         MVC   SAAUDTD(31),@CC00183                                0294 00471000
*       SAAUDTD(1:LENGTH('UCBEXT'))='UCBEXT';/* DATA NAME            */ 00472000
         MVC   SAAUDTD(6),@CC01877                                 0295 00473000
*       CALL BLSRPCK1;              /* POINTER TEST 1                */ 00474000
         BAL   @14,BLSRPCK1                                        0296 00475000
*     END;                          /* BLSV7                         */ 00476000
*                                                                  0297 00477000
*     /***************************************************************/ 00478000
*     /*                                                             */ 00479000
*     /* BLSV8--TRANSMIT SCAN MESSAGE(S)                             */ 00480000
*     /*                                                             */ 00481000
*     /***************************************************************/ 00482000
*                                                                  0298 00483000
*LBLSCAN8:                                                         0298 00484000
*     DO;                           /* BLSV8                         */ 00485000
LBLSCAN8 DS    0H                                                  0299 00486000
*       SABASF1=ZZZ1;               /* SCAN STARTED                  */ 00487000
         OI    SABASF1(SABAPTR),B'10000000'                        0299 00488000
*       IF SABASRC=ZZZFLAGI|SABASRC<ZZ2ASE|ZZ1EVEP=ZZZ1 THEN       0300 00489000
         CLI   SABASRC(SABAPTR),0                                  0300 00490000
         BE    @RT00300                                            0300 00491000
         CLC   SABASRC(1,SABAPTR),ZZ2ASE(R9)                       0300 00492000
         BL    @RT00300                                            0300 00493000
         L     @14,ZZ2ZZ1P(,R9)                                    0300 00494000
         TM    ZZ1EVEP(@14),B'01000000'                            0300 00495000
         BO    @RT00300                                            0300 00496000
*         GO TO EXIT;               /* COMMON EXIT PATH              */ 00497000
*       CALL BLSRSAPC(ZZ2,SABA,SABK);/* IDENTIFY DAMAGED AREA        */ 00498000
*                                                                  0302 00499000
         ST    R9,@AL00001                                         0302 00500000
         ST    SABAPTR,@AL00001+4                                  0302 00501000
         L     @14,@PC00001+8                                      0302 00502000
         ST    @14,@AL00001+8                                      0302 00503000
         L     @08,ZZ2RVTP(,R9)                                    0302 00504000
         L     @15,RVTSAPCP(,@08)                                  0302 00505000
         LA    @01,@AL00001                                        0302 00506000
         BALR  @14,@15                                             0302 00507000
*       /*************************************************************/ 00508000
*       /*                                                           */ 00509000
*       /* PROCESS UNIQUE MESSAGES                                   */ 00510000
*       /*                                                           */ 00511000
*       /*************************************************************/ 00512000
*                                                                  0303 00513000
*       DO ERRFNDX=1 TO DIM(MSGPTR);/* PROCESS UNIQUE MESSAGES       */ 00514000
         LA    ERRFNDX,1                                           0303 00515000
@DL00303 DS    0H                                                  0304 00516000
*         IF ERRFB(ERRFNDX)=ZZZ1&MSGLEVEL(ERRFNDX)>=ZZ2ASE THEN    0304 00517000
         LR    @14,SABAPTR                                         0304 00518000
         ALR   @14,ERRFNDX                                         0304 00519000
         TM    ERRFB-1(@14),B'10000000'                            0304 00520000
         BNO   @RF00304                                            0304 00521000
         SLR   @14,@14                                             0304 00522000
         IC    @14,MSGLEVEL-1(ERRFNDX)                             0304 00523000
         SLR   @08,@08                                             0304 00524000
         IC    @08,ZZ2ASE(,R9)                                     0304 00525000
         CR    @14,@08                                             0304 00526000
         BL    @RF00304                                            0304 00527000
*           CALL BLSUPUTV(ZZ2,MSGPTR(ERRFNDX)->VRBA);              0305 00528000
         ST    R9,@AL00001                                         0305 00529000
         LR    @14,ERRFNDX                                         0305 00530000
         SLA   @14,2                                               0305 00531000
         L     @14,MSGPTR-4(@14)                                   0305 00532000
         ST    @14,@AL00001+4                                      0305 00533000
         L     @08,ZZ2BVTP(,R9)                                    0305 00534000
         L     @15,BVTPUTVP(,@08)                                  0305 00535000
         LA    @01,@AL00001                                        0305 00536000
         BALR  @14,@15                                             0305 00537000
*       END;                        /* PROCESS UNIQUE MESSAGES       */ 00538000
@RF00304 AL    ERRFNDX,@CF00051                                    0306 00539000
         C     ERRFNDX,@CF00161                                    0306 00540000
         BNH   @DL00303                                            0306 00541000
*       IF ZZ2ASE<=8&SABASFS=ZZZ1 THEN                             0307 00542000
*                                                                  0307 00543000
         CLI   ZZ2ASE(R9),8                                        0307 00544000
         BH    @RF00307                                            0307 00545000
         TM    SABASFS(SABAPTR),B'00010000'                        0307 00546000
         BNO   @RF00307                                            0307 00547000
*         /***********************************************************/ 00548000
*         /*                                                         */ 00549000
*         /* DIAGNOSE DAMAGED POINTER(S)                             */ 00550000
*         /*                                                         */ 00551000
*         /***********************************************************/ 00552000
*                                                                  0308 00553000
*         DO ERRFNDX=DIM(MSGPTR)+1 TO DIM(MSGPTR)+DIM(FVAL);       0308 00554000
         LA    ERRFNDX,4                                           0308 00555000
@DL00308 DS    0H                                                  0309 00556000
*           IF ERRFB(ERRFNDX)=ZZZ1 THEN/* DAMAGED POINTER            */ 00557000
*                                                                  0309 00558000
         LR    @14,SABAPTR                                         0309 00559000
         ALR   @14,ERRFNDX                                         0309 00560000
         TM    ERRFB-1(@14),B'10000000'                            0309 00561000
         BNO   @RF00309                                            0309 00562000
*             /*******************************************************/ 00563000
*             /*                                                     */ 00564000
*             /* DAMAGED POINTER                                     */ 00565000
*             /*                                                     */ 00566000
*             /*******************************************************/ 00567000
*                                                                  0310 00568000
*             DO;                   /* DAMAGED POINTER               */ 00569000
*               FNAMENDX=ERRFNDX-DIM(MSGPTR);/* FNAME/FVAL INDEX     */ 00570000
         LR    FNAMENDX,ERRFNDX                                    0311 00571000
         SL    FNAMENDX,@CF00161                                   0311 00572000
*               MV99B=MV99S;        /* MESSAGE MV99 LITERAL TEXT     */ 00573000
         MVC   MV99B(60),MV99S                                     0312 00574000
*               MV99BTD=FNAME(FNAMENDX);/* NAME OF DAMAGED POINTER   */ 00575000
         LR    @14,FNAMENDX                                        0313 00576000
         SLA   @14,3                                               0313 00577000
         LA    @08,FNAME-8(@14)                                    0313 00578000
         MVC   MV99BTD(8),0(@08)                                   0313 00579000
*               DO;                 /* BLRCNVPC(FVAL(FNAMENDX)) FROM(   00580000
*                                      POINTER)TO(CHARACTER)SET(MV99B   00581000
*                                      TF)REMARK(CONTENTS OF DAMAGED    00582000
*                                      POINTER)TR(ZZ1TRHEX)          */ 00583000
*                                                                  0314 00584000
*                 /***************************************************/ 00585000
*                 /*                                                 */ 00586000
*                 /* CONTENTS OF DAMAGED POINTER                     */ 00587000
*                 /*                                                 */ 00588000
*                 /***************************************************/ 00589000
*                                                                  0315 00590000
*                 PTRPTR=FVAL(FNAMENDX);/* SOURCE TO BIT/POINTER   0315 00591000
*                                      INTERMEDIATE                  */ 00592000
         LR    @14,FNAMENDX                                        0315 00593000
         SLA   @14,2                                               0315 00594000
         L     @14,FVAL-4(@14)                                     0315 00595000
         ST    @14,PTRPTR                                          0315 00596000
*                 UNPK(MV99BTF(1:LENGTH(MV99BTF)-1),PTRBIT);/*     0316 00597000
*                                      BIT=>ZONED HEXADECIMAL        */ 00598000
         UNPK  MV99BTF(7),PTRBIT(4)                                0316 00599000
*                 MV99BTF(LENGTH(MV99BTF):LENGTH(MV99BTF))=PTRBIT(25:32 00600000
*                     );            /* FINAL ZONED HEXADECIMAL DIGIT */ 00601000
         MVC   MV99BTF+7(1),PTRBIT+3                               0317 00602000
*                 TR(MV99BTF,ZZ1TRHEX);/* ZONED HEXADECIMAL=>EBCDIC  */ 00603000
         L     @14,ZZ2ZZ1P(,R9)                                    0318 00604000
         TR    MV99BTF(8),ZZ1TRHEX(@14)                            0318 00605000
*               END;                /* BLRCNVPC(FVAL(FNAMENDX)) FROM(   00606000
*                                      POINTER)TO(CHARACTER)SET(MV99B   00607000
*                                      TF)REMARK(CONTENTS OF DAMAGED    00608000
*                                      POINTER)TR(ZZ1TRHEX)          */ 00609000
*               CALL BLSUMPKN(ZZ2,MV99B,LENGTH(MV99BTA)+LENGTH(MV99BTB) 00610000
*                   );              /* COMPRESS MESSAGE MV99         */ 00611000
         ST    R9,@AL00001                                         0320 00612000
         LA    @14,MV99B                                           0320 00613000
         ST    @14,@AL00001+4                                      0320 00614000
         LA    @14,@CF00037                                        0320 00615000
         ST    @14,@AL00001+8                                      0320 00616000
         L     @08,ZZ2BVTP(,R9)                                    0320 00617000
         L     @15,BVTMPKNP(,@08)                                  0320 00618000
         LA    @01,@AL00001                                        0320 00619000
         BALR  @14,@15                                             0320 00620000
*               CALL BLSUPUTV(ZZ2,MV99B);/* DISPLAY MESSAGE MV99     */ 00621000
         ST    R9,@AL00001                                         0321 00622000
         LA    @14,MV99B                                           0321 00623000
         ST    @14,@AL00001+4                                      0321 00624000
         L     @08,ZZ2BVTP(,R9)                                    0321 00625000
         L     @15,BVTPUTVP(,@08)                                  0321 00626000
         LA    @01,@AL00001                                        0321 00627000
         BALR  @14,@15                                             0321 00628000
*             END;                  /* DAMAGED POINTER               */ 00629000
*         END;                      /* DIAGNOSE DAMAGED POINTERS     */ 00630000
@RF00309 AL    ERRFNDX,@CF00051                                    0323 00631000
         C     ERRFNDX,@CF00048                                    0323 00632000
         BNH   @DL00308                                            0323 00633000
*     END;                          /* BLSV8                         */ 00634000
*                                                                  0324 00635000
@RF00307 DS    0H                                                  0325 00636000
*     /***************************************************************/ 00637000
*     /*                                                             */ 00638000
*     /* BLSV9--SCAN EPILOG                                          */ 00639000
*     /*                                                             */ 00640000
*     /***************************************************************/ 00641000
*                                                                  0325 00642000
*EXIT:                                                             0325 00643000
*     RETURN CODE(RETC);                                           0325 00644000
EXIT     L     @13,4(,@13)                                         0325 00645000
         L     @00,@SIZDATD                                        0325 00646000
         LR    @01,@11                                             0325 00647000
         BLSUFRES R,LV=(0),A=(1)                                        00648000
         LR    @15,@06                                             0325 00649000
         L     @14,12(,@13)                                        0325 00650000
         LM    @00,@12,20(@13)                                     0325 00651000
         BR    @14                                                 0325 00652000
*   END;                            /* BLSV79                        */ 00653000
         EJECT                                                          00654000
*                                                                  0327 00655000
*/*------------------------------------------------------------------*/ 00656000
*/* BLSRPCK1--EVALUATE A REQUIRED LOCATOR                            */ 00657000
*/*------------------------------------------------------------------*/ 00658000
*                                                                  0327 00659000
*BLSRPCK1:                          /* EVALUATE A REQUIRED LOCATOR   */ 00660000
*   PROCEDURE;                                                     0327 00661000
BLSRPCK1 STM   @14,@12,@SA00002                                    0327 00662000
*   DECLARE                                                        0328 00663000
*     1 PCHK POINTER DEFINED(SAAULAD),/* LOCATOR VALIDATION DATA     */ 00664000
*      2 PCHK24IG BIT(8),           /* IGNORED IN 24-BIT ADDRESS     */ 00665000
*      2 PCHK24 POINTER(24);        /* 24-BIT INTERPRETATION         */ 00666000
*   ERLF=ERRF(ERRFNDX);             /* ERROR FLAGS                   */ 00667000
         LR    @14,SABAPTR                                         0329 00668000
         ALR   @14,ERRFNDX                                         0329 00669000
         MVC   ERLF(1),ERRF-1(@14)                                 0329 00670000
*   IF ERLFD=ZZZ1 THEN              /* LOCATOR TEST COMPLETE         */ 00671000
         TM    ERLFD,B'01000000'                                   0330 00672000
         BO    @RT00330                                            0330 00673000
*     GO TO PCHKEXIT;               /* COMMON EXIT PATH              */ 00674000
*   SAAULAD=FVAL(ERRFNDX-DIM(MSGPTR));/* INSERT VALUE                */ 00675000
         LR    @14,ERRFNDX                                         0332 00676000
         SLA   @14,2                                               0332 00677000
         L     @14,FVAL-16(@14)                                    0332 00678000
         ST    @14,SAAULAD                                         0332 00679000
*   IF PCHK24=0 THEN                /* NULL LOCATOR                  */ 00680000
*                                                                  0333 00681000
         L     @14,PCHK24-1                                        0333 00682000
         LA    @14,0(,@14)                                         0333 00683000
         LTR   @14,@14                                             0333 00684000
         BNZ   @RF00333                                            0333 00685000
*     /***************************************************************/ 00686000
*     /*                                                             */ 00687000
*     /* NULL LOCATOR                                                */ 00688000
*     /*                                                             */ 00689000
*     /***************************************************************/ 00690000
*                                                                  0334 00691000
*     DO;                           /* NULL LOCATOR                  */ 00692000
*       SABASRC=ZZZFLAGE;           /* SCAN RETURN CODE              */ 00693000
         MVI   SABASRC(SABAPTR),X'08'                              0335 00694000
*       SABASFS=ZZZ1;               /* STORAGE REQUIRED FOR        0336 00695000
*                                      MESSAGE(S)                    */ 00696000
         OI    SABASFS(SABAPTR),B'00010000'                        0336 00697000
*       ERLFB=ZZZ1;                 /* ERROR FLAG                    */ 00698000
*       ERLFN=ZZZ1;                 /* NULL LOCATOR                  */ 00699000
*       ERLFD=ZZZ1;                 /* LOCATOR TEST COMPLETE         */ 00700000
         OI    ERLFB,B'11100000'                                   0339 00701000
*       SABAGMT=ZZ2TOD;             /* REQUEST DATA BASE UPDATE      */ 00702000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0340 00703000
*       GO TO PCHKEXIT;             /* COMMON EXIT PATH              */ 00704000
         B     PCHKEXIT                                            0341 00705000
*     END;                          /* NULL LOCATOR                  */ 00706000
*   IF PCHK24=0 THEN                /* NULL LOCATOR                  */ 00707000
@RF00333 L     @14,PCHK24-1                                        0343 00708000
         LA    @14,0(,@14)                                         0343 00709000
         LTR   @14,@14                                             0343 00710000
         BNZ   @RF00343                                            0343 00711000
*     ERLFN=ZZZ1;                   /* NULL LOCATOR                  */ 00712000
         OI    ERLFN,B'00100000'                                   0344 00713000
*   ELSE                            /* LOCATOR NOT NULL              */ 00714000
*                                                                  0345 00715000
*     /***************************************************************/ 00716000
*     /*                                                             */ 00717000
*     /* LOCATOR NOT NULL                                            */ 00718000
*     /*                                                             */ 00719000
*     /***************************************************************/ 00720000
*                                                                  0345 00721000
*     DO;                           /* LOCATOR NOT NULL              */ 00722000
         B     @RC00343                                            0345 00723000
@RF00343 DS    0H                                                  0346 00724000
*       PCHK24IG='00'X;             /* ELIMINATE EXTRANEOUS BITS     */ 00725000
         MVI   PCHK24IG,X'00'                                      0346 00726000
*       CALL BLSRSAG(ZZ2,SAAU,SABA);/* PROCESS THE SA RECORD         */ 00727000
         ST    R9,@AL00001                                         0347 00728000
         LA    @14,SAAU                                            0347 00729000
         ST    @14,@AL00001+4                                      0347 00730000
         ST    SABAPTR,@AL00001+8                                  0347 00731000
         L     @08,ZZ2RVTP(,R9)                                    0347 00732000
         L     @15,RVTRSAGP(,@08)                                  0347 00733000
         LA    @01,@AL00001                                        0347 00734000
         BALR  @14,@15                                             0347 00735000
*       IF SAAUSF1=ZZZ0 THEN        /* SCAN STARTED                  */ 00736000
*                                                                  0348 00737000
         TM    SAAUSF1,B'10000000'                                 0348 00738000
         BNZ   @RF00348                                            0348 00739000
*         /***********************************************************/ 00740000
*         /*                                                         */ 00741000
*         /* LOCATOR TEST INCOMPLETE                                 */ 00742000
*         /*                                                         */ 00743000
*         /***********************************************************/ 00744000
*                                                                  0349 00745000
*         DO;                       /* LOCATOR TEST INCOMPLETE       */ 00746000
*           SABASF9=ZZZ0;           /* SCAN NOT COMPLETE             */ 00747000
         NI    SABASF9(SABAPTR),B'10111111'                        0350 00748000
*           GO TO PCHKEXIT;         /* COMMON EXIT PATH              */ 00749000
         B     PCHKEXIT                                            0351 00750000
*         END;                      /* LOCATOR TEST INCOMPLETE       */ 00751000
*       IF SAAUSRC>ZZZFLAGE THEN    /* LOCATOR ERROR                 */ 00752000
*                                                                  0353 00753000
@RF00348 CLI   SAAUSRC,8                                           0353 00754000
         BNH   @RF00353                                            0353 00755000
*         /***********************************************************/ 00756000
*         /*                                                         */ 00757000
*         /* LOCATOR ERROR                                           */ 00758000
*         /*                                                         */ 00759000
*         /***********************************************************/ 00760000
*                                                                  0354 00761000
*         DO;                       /* LOCATOR ERROR                 */ 00762000
*           SABASRC=ZZZFLAGE;       /* SCAN RETURN CODE              */ 00763000
         MVI   SABASRC(SABAPTR),X'08'                              0355 00764000
*           SABASFS=ZZZ1;           /* STORAGE REQUIRED FOR        0356 00765000
*                                      MESSAGE(S)                    */ 00766000
         OI    SABASFS(SABAPTR),B'00010000'                        0356 00767000
*           ERLFB=ZZZ1;             /* LOCATOR ERROR                 */ 00768000
         OI    ERLFB,B'10000000'                                   0357 00769000
*         END;                      /* LOCATOR ERROR                 */ 00770000
*     END;                          /* LOCATOR NOT NULL              */ 00771000
@RF00353 DS    0H                                                  0360 00772000
*   ERLFD=ZZZ1;                     /* LOCATOR TEST COMPLETE         */ 00773000
@RC00343 OI    ERLFD,B'01000000'                                   0360 00774000
*   SABAGMT=ZZ2TOD;                 /* REQUEST DATA BASE UPDATE      */ 00775000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0361 00776000
*PCHKEXIT:                          /* COMMON EXIT PATH              */ 00777000
*   ERRF(ERRFNDX)=ERLF;             /* ERROR FLAGS                   */ 00778000
PCHKEXIT LR    @14,SABAPTR                                         0362 00779000
         ALR   @14,ERRFNDX                                         0362 00780000
         MVC   ERRF-1(1,@14),ERLF                                  0362 00781000
*   ERRFNDX=ERRFNDX+1;              /* ERROR INDEX                   */ 00782000
         AL    ERRFNDX,@CF00051                                    0363 00783000
*   RETURN;                                                        0364 00784000
@EL00002 DS    0H                                                  0364 00785000
@EF00002 DS    0H                                                  0364 00786000
@ER00002 LM    @14,@12,@SA00002                                    0364 00787000
         BR    @14                                                 0364 00788000
*   END BLSRPCK1;                                                  0365 00789000
*                                                                  0365 00790000
*/*BLSVPEND--SCAN EXIT                                               */ 00791000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00792000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00793000
*                                                                  0366 00794000
*   DECLARE                         /* DATA FOR AHB MACROS           */ 00795000
*     PTRBIT BIT(32) BOUNDARY(WORD),/* DATA CONVERSION WORK AREA FOR    00796000
*                                      POINTER DATA                  */ 00797000
*     PTRPTR POINTER DEFINED(PTRBIT);/* DATA CONVERSION WORK AREA FOR   00798000
*                                      POINTER DATA                  */ 00799000
*   DECLARE                         /* COMMON VARIABLES              */ 00800000
*     I256C CHAR(256) BASED,                                       0367 00801000
*     I031F FIXED(31) BASED,                                       0367 00802000
*     I031P PTR(31) BASED,                                         0367 00803000
*     I015F FIXED(15) BASED,                                       0367 00804000
*     I015P PTR(15) BASED,                                         0367 00805000
*     I008P PTR(8) BASED,                                          0367 00806000
*     I001C CHAR(1) BASED;                                         0367 00807000
*   GENERATE NODEFS NOREFS DATA;                                   0368 00808000
*   END BLSVUCB                     /* BLRPEND(BLSVUCB)              */ 00809000
*                                                                  0369 00810000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00811000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00812000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00813000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00814000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00815000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00816000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00817000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00818000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00819000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00820000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00821000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00822000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00823000
*                                                                  0369 00824000
*       ;                                                          0369 00825000
@EL00001 L     @13,4(,@13)                                         0369 00826000
@EF00001 L     @00,@SIZDATD                                        0369 00827000
         LR    @01,@11                                             0369 00828000
         BLSUFRES R,LV=(0),A=(1)                                        00829000
@ER00001 LM    @14,@12,12(@13)                                     0369 00830000
         BR    @14                                                 0369 00831000
@DATA    DS    0H                                                       00832000
@DATD    DSECT                                                          00833000
         DS    0F                                                       00834000
@SA00001 DS    18F                                                      00835000
@PC00001 DS    3F                                                       00836000
@SA00002 DS    15F                                                      00837000
@AL00001 DS    3A                                                       00838000
BLSVUCB  CSECT                                                          00839000
         DS    0F                                                       00840000
@CF00051 DC    F'1'                                                     00841000
@CF00161 DC    F'3'                                                     00842000
@CF00048 DC    F'4'                                                     00843000
@CH00048 EQU   @CF00048+2                                               00844000
@CF00442 DC    F'7'                                                     00845000
@CF00059 DC    F'8'                                                     00846000
@CF00037 DC    F'12'                                                    00847000
@CF00070 DC    F'32'                                                    00848000
@CF01868 DC    F'-8'                                                    00849000
@DATD    DSECT                                                          00850000
         DS    0D                                                       00851000
ESAU     DS    CL694                                                    00852000
         ORG   ESAU                                                     00853000
ESAURID  DS    CL2                                                      00854000
@NM00031 DS    BL6                                                      00855000
@NM00032 DS    CL8                                                      00856000
@NM00033 DS    BL8                                                      00857000
ESAURDX  DS    FL4                                                      00858000
ESAUSYM  DS    CL31                                                     00859000
ESAUELK  DS    0C                                                       00860000
ESAURV1  DS    CL1                                                      00861000
ESAUAS   DS    CL16                                                     00862000
         ORG   ESAUAS                                                   00863000
ESAUAS0  DS    0C                                                       00864000
ESAUAST  DS    CL2                                                      00865000
@NM00034 DS    BL2                                                      00866000
ESAUAS1  DS    FL4                                                      00867000
ESAUAS2  DS    FL4                                                      00868000
@NM00035 DS    BL4                                                      00869000
ESAUAS9  DS    0C                                                       00870000
         ORG   ESAU+76                                                  00871000
ESAULAD  DS    AL4                                                      00872000
ESAUD    DS    CL60                                                     00873000
         ORG   ESAUD                                                    00874000
ESAUD00  DS    0C                                                       00875000
ESAUDOF  DS    FL4                                                      00876000
ESAUDLE  DS    FL4                                                      00877000
ESAUDOB  DS    FL1                                                      00878000
ESAUDLB  DS    FL1                                                      00879000
ESAUDT   DS    CL34                                                     00880000
         ORG   ESAUDT                                                   00881000
ESAUDT0  DS    0C                                                       00882000
ESAUDTY  DS    CL1                                                      00883000
@NM00036 DS    BL1                                                      00884000
ESAUDTD  DS    CL31                                                     00885000
ESAUDTE  DS    CL1                                                      00886000
ESAUDT9  DS    0C                                                       00887000
         ORG   ESAUD+44                                                 00888000
ESAUDIM  DS    FL4                                                      00889000
ESAUDIL  DS    FL4                                                      00890000
ESAUDF   DS    BL4                                                      00891000
         ORG   ESAUDF                                                   00892000
ESAUDFA  DS    BL1                                                      00893000
@NM00037 EQU   ESAUDF+0                                                 00894000
         ORG   ESAUD+56                                                 00895000
@NM00038 DS    BL4                                                      00896000
ESAUD99  DS    0C                                                       00897000
         ORG   ESAU+140                                                 00898000
ESAUMAD  DS    AL4                                                      00899000
@NM00039 DS    BL16                                                     00900000
ESAUKEY  DS    BL1                                                      00901000
ESAUF    DS    BL3                                                      00902000
         ORG   ESAUF                                                    00903000
ESAUFS   DS    BL1                                                      00904000
         ORG   ESAUFS                                                   00905000
ESAUFSC  DS    BL1                                                      00906000
ESAUFS2  EQU   ESAUFS+0                                                 00907000
ESAUFSM  EQU   ESAUFS+0                                                 00908000
ESAUFSA  EQU   ESAUFS+0                                                 00909000
ESAUFSP  EQU   ESAUFS+0                                                 00910000
ESAUFSR  EQU   ESAUFS+0                                                 00911000
ESAUFSX  EQU   ESAUFS+0                                                 00912000
ESAUFSS  EQU   ESAUFS+0                                                 00913000
         ORG   ESAUF+1                                                  00914000
ESAUFC   DS    BL1                                                      00915000
         ORG   ESAUFC                                                   00916000
ESAUFCD  DS    BL1                                                      00917000
@NM00040 EQU   ESAUFC+0                                                 00918000
         ORG   ESAUF+2                                                  00919000
@NM00041 DS    BL1                                                      00920000
         ORG   ESAU+164                                                 00921000
ESAUABS  DS    FL4                                                      00922000
@NM00042 DS    BL12                                                     00923000
ESAUR    DS    CL514                                                    00924000
         ORG   ESAUR                                                    00925000
ESAURL   DS    FL2                                                      00926000
ESAURT   DS    CL512                                                    00927000
         ORG   ESAURT                                                   00928000
ESAURT1  DS    CL512                                                    00929000
         ORG   ESAU+694                                                 00930000
ESAU999  DS    0C                                                       00931000
         ORG   ESAU+694                                                 00932000
         DS    CL2                                                      00933000
SAAU     DS    CL3072                                                   00934000
         ORG   SAAU                                                     00935000
SAAURID  DS    CL2                                                      00936000
@NM00146 DS    BL6                                                      00937000
SAAURDX  DS    FL4                                                      00938000
SAAUAS   DS    CL16                                                     00939000
         ORG   SAAUAS                                                   00940000
SAAUAS0  DS    0C                                                       00941000
SAAUAST  DS    CL2                                                      00942000
@NM00147 DS    BL2                                                      00943000
SAAUAS1  DS    FL4                                                      00944000
SAAUAS2  DS    FL4                                                      00945000
@NM00148 DS    BL4                                                      00946000
SAAUAS9  DS    0C                                                       00947000
         ORG   SAAU+28                                                  00948000
SAAULAD  DS    AL4                                                      00949000
SAAUDT   DS    CL34                                                     00950000
         ORG   SAAUDT                                                   00951000
SAAUDT0  DS    0C                                                       00952000
SAAUDTY  DS    CL1                                                      00953000
@NM00149 DS    BL1                                                      00954000
SAAUDTD  DS    CL31                                                     00955000
SAAUDTE  DS    CL1                                                      00956000
SAAUDT9  DS    0C                                                       00957000
         ORG   SAAU+66                                                  00958000
SAAUELK  DS    0C                                                       00959000
@NM00150 DS    BL2                                                      00960000
SAAUF    DS    CL60                                                     00961000
         ORG   SAAUF                                                    00962000
SAAUF00  DS    0C                                                       00963000
SAAUFOF  DS    FL4                                                      00964000
SAAUFLE  DS    FL4                                                      00965000
SAAUFOB  DS    FL1                                                      00966000
SAAUFLB  DS    FL1                                                      00967000
SAAUFT   DS    CL34                                                     00968000
         ORG   SAAUFT                                                   00969000
SAAUFT0  DS    0C                                                       00970000
SAAUFTY  DS    CL1                                                      00971000
@NM00151 DS    BL1                                                      00972000
SAAUFTD  DS    CL31                                                     00973000
SAAUFTE  DS    CL1                                                      00974000
SAAUFT9  DS    0C                                                       00975000
         ORG   SAAUF+44                                                 00976000
SAAUFIM  DS    FL4                                                      00977000
SAAUFIL  DS    FL4                                                      00978000
SAAUFF   DS    BL4                                                      00979000
         ORG   SAAUFF                                                   00980000
SAAUFFA  DS    BL1                                                      00981000
@NM00152 EQU   SAAUFF+0                                                 00982000
         ORG   SAAUF+56                                                 00983000
@NM00153 DS    BL4                                                      00984000
SAAUF99  DS    0C                                                       00985000
         ORG   SAAU+128                                                 00986000
SAAUSF   DS    BL8                                                      00987000
         ORG   SAAUSF                                                   00988000
SAAUSF1  DS    BL1                                                      00989000
SAAUSF9  EQU   SAAUSF+0                                                 00990000
SAAUSFI  EQU   SAAUSF+0                                                 00991000
SAAUSFS  EQU   SAAUSF+0                                                 00992000
@NM00154 EQU   SAAUSF+0                                                 00993000
         ORG   SAAU+136                                                 00994000
SAAUGMT  DS    BL8                                                      00995000
SAAUPGV  DS    CL8                                                      00996000
SAAUSRC  DS    FL1                                                      00997000
@NM00155 DS    101BL1                                                   00998000
SAAUC    DS    CL2818                                                   00999000
         ORG   SAAUC                                                    01000000
SAAUCL   DS    FL2                                                      01001000
SAAUCT   DS    CL2816                                                   01002000
         ORG   SAAUCT                                                   01003000
SAAUCT1  DS    CL2816                                                   01004000
         ORG   SAAU+3072                                                01005000
SAAU999  DS    0C                                                       01006000
         ORG   SAAU+3072                                                01007000
MV99B    DS    CL60                                                     01008000
         ORG   MV99B                                                    01009000
MV99BL   DS    FL2                                                      01010000
@NM00157 DS    BL2                                                      01011000
MV99BT   DS    CL56                                                     01012000
         ORG   MV99BT                                                   01013000
MV99BTA  DS    CL9                                                      01014000
MV99BTB  DS    CL3                                                      01015000
MV99BTC  DS    CL8                                                      01016000
MV99BTD  DS    CL8                                                      01017000
MV99BTE  DS    CL1                                                      01018000
MV99BTF  DS    CL8                                                      01019000
MV99BTG  DS    CL19                                                     01020000
         ORG   MV99B+60                                                 01021000
ERLF     DS    BL1                                                      01022000
         ORG   ERLF                                                     01023000
ERLFB    DS    BL1                                                      01024000
ERLFD    EQU   ERLF+0                                                   01025000
ERLFN    EQU   ERLF+0                                                   01026000
ERLFS    EQU   ERLF+0                                                   01027000
@NM00159 EQU   ERLF+0                                                   01028000
         ORG   ERLF+1                                                   01029000
         DS    CL3                                                      01030000
BUF      DS    CL256                                                    01031000
PTRBIT   DS    BL4                                                      01032000
FVAL     DS    1A                                                       01033000
BLSVUCB  CSECT                                                          01034000
         DS    0F                                                       01035000
@SIZDATD DC    AL1(0)                                                   01036000
         DC    AL3(@ENDDATD-@DATD)                                      01037000
         DS    0D                                                       01038000
@CC00183 DC    C'                               '                       01039000
@CC01877 DC    C'UCBEXT'                                                01040000
         DS    CL1                                                      01041000
MV01     DS    CL46                                                     01042000
         ORG   MV01                                                     01043000
MV01L    DC    AL2(46)                                                  01044000
@NM00056 DC    X'0000'                                                  01045000
MV01T    DS    CL42                                                     01046000
         ORG   MV01T                                                    01047000
MV01TA   DC    CL9'BLS22011I'                                           01048000
MV01TB   DC    CL3' '                                                   01049000
MV01TC   DC    CL30'UCB NOT ON DOUBLEWORD BOUNDARY'                     01050000
         ORG   MV01+46                                                  01051000
MV02     DS    CL39                                                     01052000
         ORG   MV02                                                     01053000
MV02L    DC    AL2(39)                                                  01054000
@NM00057 DC    X'0000'                                                  01055000
MV02T    DS    CL35                                                     01056000
         ORG   MV02T                                                    01057000
MV02TA   DC    CL9'BLS22010I'                                           01058000
MV02TB   DC    CL3' '                                                   01059000
MV02TC   DC    CL23'UCB STORAGE NOT IN DUMP'                            01060000
         ORG   MV02+39                                                  01061000
         DS    CL1                                                      01062000
DTCTC    DS    CL34                                                     01063000
         ORG   DTCTC                                                    01064000
DTCTC0   DS    0C                                                       01065000
DTCTCY   DC    CL1'M'                                                   01066000
@NM00138 DC    X'00'                                                    01067000
DTCTCD   DC    CL31'UCBCTC'                                             01068000
DTCTCE   DC    CL1' '                                                   01069000
DTCTC9   DS    0C                                                       01070000
         ORG   DTCTC+34                                                 01071000
DTTP     DS    CL34                                                     01072000
         ORG   DTTP                                                     01073000
DTTP0    DS    0C                                                       01074000
DTTPY    DC    CL1'M'                                                   01075000
@NM00139 DC    X'00'                                                    01076000
DTTPD    DC    CL31'UCBTP'                                              01077000
DTTPE    DC    CL1' '                                                   01078000
DTTP9    DS    0C                                                       01079000
         ORG   DTTP+34                                                  01080000
DTTAPE   DS    CL34                                                     01081000
         ORG   DTTAPE                                                   01082000
DTTAPE0  DS    0C                                                       01083000
DTTAPEY  DC    CL1'M'                                                   01084000
@NM00140 DC    X'00'                                                    01085000
DTTAPED  DC    CL31'UCBTAPE'                                            01086000
DTTAPEE  DC    CL1' '                                                   01087000
DTTAPE9  DS    0C                                                       01088000
         ORG   DTTAPE+34                                                01089000
DTGFX    DS    CL34                                                     01090000
         ORG   DTGFX                                                    01091000
DTGFX0   DS    0C                                                       01092000
DTGFXY   DC    CL1'M'                                                   01093000
@NM00141 DC    X'00'                                                    01094000
DTGFXD   DC    CL31'UCBGFX'                                             01095000
DTGFXE   DC    CL1' '                                                   01096000
DTGFX9   DS    0C                                                       01097000
         ORG   DTGFX+34                                                 01098000
DT3270   DS    CL34                                                     01099000
         ORG   DT3270                                                   01100000
DT32700  DS    0C                                                       01101000
DT3270Y  DC    CL1'M'                                                   01102000
@NM00142 DC    X'00'                                                    01103000
DT3270D  DC    CL31'UCB3270'                                            01104000
DT3270E  DC    CL1' '                                                   01105000
DT32709  DS    0C                                                       01106000
         ORG   DT3270+34                                                01107000
DTUR     DS    CL34                                                     01108000
         ORG   DTUR                                                     01109000
DTUR0    DS    0C                                                       01110000
DTURY    DC    CL1'M'                                                   01111000
@NM00143 DC    X'00'                                                    01112000
DTURD    DC    CL31'UCBUR'                                              01113000
DTURE    DC    CL1' '                                                   01114000
DTUR9    DS    0C                                                       01115000
         ORG   DTUR+34                                                  01116000
DTDA     DS    CL34                                                     01117000
         ORG   DTDA                                                     01118000
DTDA0    DS    0C                                                       01119000
DTDAY    DC    CL1'M'                                                   01120000
@NM00144 DC    X'00'                                                    01121000
DTDAD    DC    CL31'UCBDA'                                              01122000
DTDAE    DC    CL1' '                                                   01123000
DTDA9    DS    0C                                                       01124000
         ORG   DTDA+34                                                  01125000
MV03     DS    CL37                                                     01126000
         ORG   MV03                                                     01127000
MV03L    DC    AL2(37)                                                  01128000
@NM00145 DC    X'0000'                                                  01129000
MV03T    DS    CL33                                                     01130000
         ORG   MV03T                                                    01131000
MV03TA   DC    CL9'BLS22012I'                                           01132000
MV03TB   DC    CL3' '                                                   01133000
MV03TC   DC    CL21'UCBID NOT EQUAL X''FF'''                            01134000
         ORG   MV03+37                                                  01135000
         DS    CL1                                                      01136000
MV99S    DS    CL60                                                     01137000
         ORG   MV99S                                                    01138000
MV99SL   DC    AL2(60)                                                  01139000
@NM00156 DC    X'0000'                                                  01140000
MV99ST   DS    CL56                                                     01141000
         ORG   MV99ST                                                   01142000
MV99STA  DC    CL9'BLS22013I'                                           01143000
MV99STB  DC    CL3' '                                                   01144000
MV99STC  DC    CL8'LOCATOR '                                            01145000
MV99STD  DC    CL8' '                                                   01146000
MV99STE  DC    CL1'='                                                   01147000
MV99STF  DC    CL8' '                                                   01148000
MV99STG  DC    CL19'. IT MAY BE DAMAGED'                                01149000
         ORG   MV99S+60                                                 01150000
FNAME    DC    CL8'UCBEXTPT'                                            01151000
MSGPTR   DC    AL4(MV01)                                                01152000
         DC    AL4(MV02)                                                01153000
         DC    AL4(MV03)                                                01154000
MSGLEVEL DC    AL1(12)                                                  01155000
         DC    AL1(4)                                                   01156000
         DC    AL1(12)                                                  01157000
@DATD    DSECT                                                          01158000
         SPACE 2                                                        01159000
*********************************************************************** 01160000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 01161000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 01162000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 01163000
*********************************************************************** 01164000
         SPACE                                                          01165000
BLSVUCB  CSECT                                                          01166000
         ORG                                                            01167000
         DS    0D                                                       01168000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSVUCB+19)/20+7)/8)CL8'BLSVUCB'       01169000
@DATD    DSECT                                                          01170000
         DS    0H                                                       01171000
@DATD    DSECT                                                          01172000
         SPACE 2                                                        01173000
*********************************************************************** 01174000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 01175000
*********************************************************************** 01176000
         SPACE                                                          01177000
         DS    0D                                                       01178000
@DATD    DSECT                                                          01179000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                01180000
@ENDDATD EQU   *                                                        01181000
BLSVUCB  CSECT                                                          01182000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       01183000
@01      EQU   01                                                       01184000
@02      EQU   02                                                       01185000
@03      EQU   03                                                       01186000
@04      EQU   04                                                       01187000
@05      EQU   05                                                       01188000
@06      EQU   06                                                       01189000
@07      EQU   07                                                       01190000
@08      EQU   08                                                       01191000
@09      EQU   09                                                       01192000
@10      EQU   10                                                       01193000
@11      EQU   11                                                       01194000
@12      EQU   12                                                       01195000
@13      EQU   13                                                       01196000
@14      EQU   14                                                       01197000
@15      EQU   15                                                       01198000
J1       EQU   @05                                                      01199000
FNAMENDX EQU   @05                                                      01200000
ERRFNDX  EQU   @04                                                      01201000
UCBPTR   EQU   @04                                                      01202000
RETC     EQU   @06                                                      01203000
SABAPTR  EQU   @03                                                      01204000
R9       EQU   @09                                                      01205000
R0       EQU   @00                                                      01206000
R1       EQU   @01                                                      01207000
R2       EQU   @02                                                      01208000
R3       EQU   @03                                                      01209000
R4       EQU   @04                                                      01210000
R5       EQU   @05                                                      01211000
RB       EQU   @11                                                      01212000
RD       EQU   @13                                                      01213000
RE       EQU   @14                                                      01214000
RF       EQU   @15                                                      01215000
RA       EQU   @10                                                      01216000
RC       EQU   @12                                                      01217000
R6       EQU   @06                                                      01218000
R7       EQU   @07                                                      01219000
R8       EQU   @08                                                      01220000
SABA     EQU   0                                                        01221000
SABAAS   EQU   SABA+12                                                  01222000
SABALAD  EQU   SABA+28                                                  01223000
SABADT   EQU   SABA+32                                                  01224000
SABAF    EQU   SABA+68                                                  01225000
SABAFOF  EQU   SABAF                                                    01226000
SABAFLE  EQU   SABAF+4                                                  01227000
SABAFT   EQU   SABAF+10                                                 01228000
SABAFIM  EQU   SABAF+44                                                 01229000
SABAFF   EQU   SABAF+52                                                 01230000
SABAFFA  EQU   SABAFF                                                   01231000
SABASF   EQU   SABA+128                                                 01232000
SABASF1  EQU   SABASF                                                   01233000
SABASF9  EQU   SABASF                                                   01234000
SABASFI  EQU   SABASF                                                   01235000
SABASFS  EQU   SABASF                                                   01236000
SABAGMT  EQU   SABA+136                                                 01237000
SABASRC  EQU   SABA+152                                                 01238000
SABAC    EQU   SABA+254                                                 01239000
SABACL   EQU   SABAC                                                    01240000
SABACT   EQU   SABAC+2                                                  01241000
ESCO     EQU   0                                                        01242000
ESCOAS   EQU   ESCO+60                                                  01243000
ESCOD    EQU   ESCO+80                                                  01244000
ESCODT   EQU   ESCOD+10                                                 01245000
ESCODF   EQU   ESCOD+52                                                 01246000
ESCOF    EQU   ESCO+161                                                 01247000
ESCOFS   EQU   ESCOF                                                    01248000
ESCOFC   EQU   ESCOF+1                                                  01249000
ESCOR    EQU   ESCO+180                                                 01250000
ESCORT   EQU   ESCOR+2                                                  01251000
VRBA     EQU   0                                                        01252000
VRBAT    EQU   VRBA+4                                                   01253000
ZZ1      EQU   0                                                        01254000
ZZ1ATTN  EQU   ZZ1+360                                                  01255000
ZZ1EVE   EQU   ZZ1ATTN+4                                                01256000
ZZ1EVEP  EQU   ZZ1EVE                                                   01257000
ZZ1F     EQU   ZZ1+368                                                  01258000
ZZ1TRHEX EQU   ZZ1+568                                                  01259000
ZZ1N     EQU   ZZ1+1116                                                 01260000
ZZ2      EQU   0                                                        01261000
ZZ2AMD   EQU   ZZ2                                                      01262000
@NM00070 EQU   ZZ2AMD+7                                                 01263000
ZZ2PRT   EQU   ZZ2+138                                                  01264000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 01265000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                01266000
ZZ2A     EQU   ZZ2+272                                                  01267000
ZZ2ASE   EQU   ZZ2A+2                                                   01268000
ZZ2AF    EQU   ZZ2A+16                                                  01269000
ZZ2APID  EQU   ZZ2A+64                                                  01270000
ZZ2AD    EQU   ZZ2A+74                                                  01271000
ZZ2ADD   EQU   ZZ2AD                                                    01272000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 01273000
ZZ2ADM   EQU   ZZ2AD+46                                                 01274000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 01275000
ZZ2ADP   EQU   ZZ2AD+56                                                 01276000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 01277000
ZZ2AZZ6P EQU   ZZ2A+140                                                 01278000
ZZ2AQAS  EQU   ZZ2A+144                                                 01279000
ZZ2AQD   EQU   ZZ2A+160                                                 01280000
ZZ2AQDT  EQU   ZZ2AQD+10                                                01281000
ZZ2AQDF  EQU   ZZ2AQD+52                                                01282000
ZZ2STG   EQU   ZZ2+960                                                  01283000
ZZ2TOD   EQU   ZZ2+968                                                  01284000
ZZ2ALLOP EQU   ZZ2+992                                                  01285000
ZZ2FREEP EQU   ZZ2+996                                                  01286000
ZZ2FF19P EQU   ZZ2+1000                                                 01287000
ZZ2FRE1P EQU   ZZ2+1004                                                 01288000
ZZ2FF18P EQU   ZZ2+1008                                                 01289000
ZZ2DYNAP EQU   ZZ2+1012                                                 01290000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 01291000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 01292000
ZZ2STAIP EQU   ZZ2+1024                                                 01293000
ZZ2FF02P EQU   ZZ2+1028                                                 01294000
ZZ2GETLP EQU   ZZ2+1032                                                 01295000
ZZ2PARSP EQU   ZZ2+1036                                                 01296000
ZZ2PTGTP EQU   ZZ2+1040                                                 01297000
ZZ2PUTLP EQU   ZZ2+1044                                                 01298000
ZZ2SCANP EQU   ZZ2+1048                                                 01299000
ZZ2STCKP EQU   ZZ2+1052                                                 01300000
ZZ2TRMOP EQU   ZZ2+1064                                                 01301000
ZZ2TRMVP EQU   ZZ2+1068                                                 01302000
ZZ2PUTNP EQU   ZZ2+1084                                                 01303000
ZZ2TRMNP EQU   ZZ2+1088                                                 01304000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 01305000
ZZ2BVTP  EQU   ZZ2+1280                                                 01306000
ZZ2RVTP  EQU   ZZ2+1284                                                 01307000
ZZ2CPPL  EQU   ZZ2+1292                                                 01308000
ZZ2CPPLC EQU   ZZ2CPPL                                                  01309000
ZZ2ESSYP EQU   ZZ2+1328                                                 01310000
ZZ2ITR   EQU   ZZ2+2840                                                 01311000
ZZ2ITRE  EQU   ZZ2ITR+16                                                01312000
ZZ2ITSE  EQU   ZZ2+2864                                                 01313000
ZZ2ES    EQU   ZZ2+2872                                                 01314000
ZZ2AMDX  EQU   ZZ2+7160                                                 01315000
ZZ2AXO   EQU   ZZ2+7934                                                 01316000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 01317000
CMD      EQU   0                                                        01318000
CMDT     EQU   CMD+4                                                    01319000
PSCB     EQU   0                                                        01320000
PSCBATR1 EQU   PSCB+16                                                  01321000
ECT      EQU   0                                                        01322000
ECTSWS   EQU   ECT+28                                                   01323000
ECTSWS2  EQU   ECT+40                                                   01324000
ECTSWS21 EQU   ECTSWS2                                                  01325000
UPT      EQU   0                                                        01326000
UPTSWS   EQU   UPT+12                                                   01327000
SA       EQU   0                                                        01328000
SA1      EQU   SA                                                       01329000
SAR      EQU   SA+12                                                    01330000
SAR1     EQU   SAR+12                                                   01331000
BLSUMPKN EQU   0                                                        01332000
BLSUPUTV EQU   0                                                        01333000
BVT      EQU   0                                                        01334000
BVTPUTLP EQU   BVT+4                                                    01335000
BVTPUTOP EQU   BVT+12                                                   01336000
BVTPUTTP EQU   BVT+16                                                   01337000
BVTPUTVP EQU   BVT+20                                                   01338000
BVTPUTAP EQU   BVT+24                                                   01339000
BVTPRTTP EQU   BVT+28                                                   01340000
BVTPRTAP EQU   BVT+32                                                   01341000
BVTPUTDP EQU   BVT+36                                                   01342000
BVTMONP  EQU   BVT+40                                                   01343000
BVTMON2P EQU   BVT+44                                                   01344000
BVTVSARP EQU   BVT+48                                                   01345000
BVTVSENP EQU   BVT+64                                                   01346000
BVTVSERP EQU   BVT+68                                                   01347000
BVTVSGEP EQU   BVT+72                                                   01348000
BVTVSGUP EQU   BVT+76                                                   01349000
BVTVSPOP EQU   BVT+80                                                   01350000
BVTVSPUP EQU   BVT+84                                                   01351000
BVTMPKNP EQU   BVT+104                                                  01352000
BVTMONLP EQU   BVT+108                                                  01353000
BVTPUTCP EQU   BVT+132                                                  01354000
BVTMPK1P EQU   BVT+136                                                  01355000
BVTZZ2RP EQU   BVT+140                                                  01356000
BVTPGMRP EQU   BVT+144                                                  01357000
BVTMONAP EQU   BVT+148                                                  01358000
BVTBLDDP EQU   BVT+152                                                  01359000
BVTBLDLP EQU   BVT+156                                                  01360000
BVTPGMCP EQU   BVT+160                                                  01361000
BVTPGMDP EQU   BVT+164                                                  01362000
BVTPGMLP EQU   BVT+168                                                  01363000
BVTMONCP EQU   BVT+180                                                  01364000
BVTMONDP EQU   BVT+184                                                  01365000
BVTMONTP EQU   BVT+188                                                  01366000
BVTPARIP EQU   BVT+192                                                  01367000
BVTPARUP EQU   BVT+196                                                  01368000
BVTPRTNP EQU   BVT+204                                                  01369000
BVTVSCRP EQU   BVT+208                                                  01370000
BVTVSMRP EQU   BVT+212                                                  01371000
BVTMONXP EQU   BVT+216                                                  01372000
BVTTRMAP EQU   BVT+228                                                  01373000
ZZ6      EQU   0                                                        01374000
ZZ6D     EQU   ZZ6+128                                                  01375000
ZZ6DD    EQU   ZZ6D+8                                                   01376000
ZZ6DDT   EQU   ZZ6DD+4                                                  01377000
ZZ6DQA   EQU   ZZ6D+68                                                  01378000
ZZ6DF    EQU   ZZ6D+92                                                  01379000
ZZ6B     EQU   ZZ6+768                                                  01380000
BLSRACCQ EQU   0                                                        01381000
BLSRSAG  EQU   0                                                        01382000
BLSRSAPC EQU   0                                                        01383000
RVT      EQU   0                                                        01384000
RVTADDRP EQU   RVT                                                      01385000
RVTT01P  EQU   RVT+4                                                    01386000
RVTTAP   EQU   RVT+8                                                    01387000
RVTTBP   EQU   RVT+12                                                   01388000
RVTTCP   EQU   RVT+16                                                   01389000
RVTTFP   EQU   RVT+24                                                   01390000
RVTTYP   EQU   RVT+40                                                   01391000
RVTT02P  EQU   RVT+48                                                   01392000
RVTT03P  EQU   RVT+52                                                   01393000
RVTT04P  EQU   RVT+56                                                   01394000
RVTACCLP EQU   RVT+60                                                   01395000
RVTRACCP EQU   RVT+64                                                   01396000
RVTTLP   EQU   RVT+68                                                   01397000
RVTTMP   EQU   RVT+72                                                   01398000
RVTTUP   EQU   RVT+80                                                   01399000
RVTESGEP EQU   RVT+84                                                   01400000
RVTESGUP EQU   RVT+88                                                   01401000
RVTESARP EQU   RVT+92                                                   01402000
RVTRAARP EQU   RVT+96                                                   01403000
RVTRAGEP EQU   RVT+100                                                  01404000
RVTADDPP EQU   RVT+104                                                  01405000
RVTACCQP EQU   RVT+108                                                  01406000
RVTSAGUP EQU   RVT+124                                                  01407000
RVTSAGEP EQU   RVT+128                                                  01408000
RVTESCKP EQU   RVT+132                                                  01409000
RVTMSGAP EQU   RVT+136                                                  01410000
RVTMSGDP EQU   RVT+140                                                  01411000
RVTADDTP EQU   RVT+160                                                  01412000
RVTADDUP EQU   RVT+164                                                  01413000
RVTADD1P EQU   RVT+176                                                  01414000
RVTADD2P EQU   RVT+180                                                  01415000
RVTRSAGP EQU   RVT+184                                                  01416000
RVTMSGBP EQU   RVT+188                                                  01417000
RVTADDSP EQU   RVT+192                                                  01418000
RVTADD3P EQU   RVT+196                                                  01419000
RVTT05P  EQU   RVT+200                                                  01420000
RVTPADSP EQU   RVT+204                                                  01421000
RVTTRP   EQU   RVT+228                                                  01422000
RVTADD4P EQU   RVT+232                                                  01423000
RVTSAPCP EQU   RVT+236                                                  01424000
RVTSAARP EQU   RVT+240                                                  01425000
RVTSAGNP EQU   RVT+244                                                  01426000
RVTT06P  EQU   RVT+248                                                  01427000
RVTSAGCP EQU   RVT+252                                                  01428000
RVTSAGQP EQU   RVT+256                                                  01429000
RVTESGCP EQU   RVT+260                                                  01430000
RVTESGQP EQU   RVT+264                                                  01431000
RVTDUCKP EQU   RVT+276                                                  01432000
RVTDUCCP EQU   RVT+280                                                  01433000
UCB      EQU   0                                                        01434000
UCBOB    EQU   0                                                        01435000
UCBJBNR  EQU   UCBOB                                                    01436000
UCBFL5   EQU   UCBOB+1                                                  01437000
UCBAF    EQU   UCBFL5                                                   01438000
UCBID    EQU   UCBOB+2                                                  01439000
UCBSTAT  EQU   UCBOB+3                                                  01440000
UCBCHAN  EQU   UCBOB+4                                                  01441000
UCBSFLS  EQU   UCBOB+6                                                  01442000
UCBFLA   EQU   UCBSFLS                                                  01443000
UCBFL1   EQU   UCBFLA                                                   01444000
UCBBSY   EQU   UCBFL1                                                   01445000
UCBNRY   EQU   UCBFL1                                                   01446000
UCBPST   EQU   UCBFL1                                                   01447000
UCBCUB   EQU   UCBFL1                                                   01448000
UCBFLB   EQU   UCBSFLS+1                                                01449000
UCBCHM   EQU   UCBOB+8                                                  01450000
UCBCHM1  EQU   UCBCHM                                                   01451000
UCBPTH0  EQU   UCBCHM1                                                  01452000
UCBPTH1  EQU   UCBCHM1                                                  01453000
UCBWGT   EQU   UCBOB+12                                                 01454000
UCBMTPXP EQU   UCBWGT                                                   01455000
UCBTYP   EQU   UCBOB+16                                                 01456000
UCBTBYT1 EQU   UCBTYP                                                   01457000
UCB1FEA5 EQU   UCBTBYT1                                                 01458000
UCB1FEA6 EQU   UCBTBYT1                                                 01459000
UCBTBYT2 EQU   UCBTYP+1                                                 01460000
UCB2OPT2 EQU   UCBTBYT2                                                 01461000
UCBDUDN1 EQU   UCB2OPT2                                                 01462000
UCB2OPT3 EQU   UCBTBYT2                                                 01463000
UCBDUDN2 EQU   UCB2OPT3                                                 01464000
UCB2OPT4 EQU   UCBTBYT2                                                 01465000
UCBRWTAU EQU   UCB2OPT4                                                 01466000
UCB2OPT6 EQU   UCBTBYT2                                                 01467000
UCB2OPT7 EQU   UCBTBYT2                                                 01468000
UCBTBYT3 EQU   UCBTYP+2                                                 01469000
UCBDVCLS EQU   UCBTBYT3                                                 01470000
UCB3TAPE EQU   UCBDVCLS                                                 01471000
UCB3COMM EQU   UCBDVCLS                                                 01472000
UCB3DACC EQU   UCBDVCLS                                                 01473000
UCB3DISP EQU   UCBDVCLS                                                 01474000
UCB3UREC EQU   UCBDVCLS                                                 01475000
UCBTBYT4 EQU   UCBTYP+3                                                 01476000
UCBUNTYP EQU   UCBTBYT4                                                 01477000
UCBEXTPT EQU   UCBOB+20                                                 01478000
UCBFLC   EQU   UCBEXTPT                                                 01479000
UCBDEV   EQU   UCBOB+24                                                 01480000
UCBCMEXT EQU   0                                                        01481000
UCBATI   EQU   UCBCMEXT+3                                               01482000
@NM00137 EQU   UCBATI                                                   01483000
UCBFLP1  EQU   UCBCMEXT+5                                               01484000
UCBMT    EQU   0                                                        01485000
UCBOCR   EQU   0                                                        01486000
UCB3540X EQU   0                                                        01487000
UCBDKBYT EQU   UCB3540X+6                                               01488000
UCB3800X EQU   0                                                        01489000
UCBOPTNS EQU   UCB3800X                                                 01490000
UCBACTIV EQU   UCB3800X+3                                               01491000
UCBMDRBF EQU   UCB3800X+36                                              01492000
UCBUCS   EQU   0                                                        01493000
UCBUCSOP EQU   UCBUCS+4                                                 01494000
UCBFCBOP EQU   UCBUCS+5                                                 01495000
BLSRACC  EQU   0                                                        01496000
BLSRACCL EQU   0                                                        01497000
BLSRADDP EQU   0                                                        01498000
BLSRADDR EQU   0                                                        01499000
BLSRADDS EQU   0                                                        01500000
BLSRADDT EQU   0                                                        01501000
BLSRADDU EQU   0                                                        01502000
BLSRADD1 EQU   0                                                        01503000
BLSRADD2 EQU   0                                                        01504000
BLSRADD3 EQU   0                                                        01505000
BLSRADD4 EQU   0                                                        01506000
BLSRDUCC EQU   0                                                        01507000
BLSRDUCK EQU   0                                                        01508000
BLSRESAR EQU   0                                                        01509000
BLSRESCK EQU   0                                                        01510000
BLSRESGC EQU   0                                                        01511000
BLSRESGE EQU   0                                                        01512000
BLSRESGQ EQU   0                                                        01513000
BLSRESGU EQU   0                                                        01514000
BLSRMSGA EQU   0                                                        01515000
BLSRMSGB EQU   0                                                        01516000
BLSRMSGD EQU   0                                                        01517000
BLSRPADS EQU   0                                                        01518000
BLSRRAAR EQU   0                                                        01519000
BLSRRAGE EQU   0                                                        01520000
BLSRSAAR EQU   0                                                        01521000
BLSRSAGC EQU   0                                                        01522000
BLSRSAGE EQU   0                                                        01523000
BLSRSAGN EQU   0                                                        01524000
BLSRSAGQ EQU   0                                                        01525000
BLSRSAGU EQU   0                                                        01526000
BLSTA    EQU   0                                                        01527000
BLSTB    EQU   0                                                        01528000
BLSTC    EQU   0                                                        01529000
BLSTF    EQU   0                                                        01530000
BLSTL    EQU   0                                                        01531000
BLSTM    EQU   0                                                        01532000
BLSTR    EQU   0                                                        01533000
BLSTU    EQU   0                                                        01534000
BLSTY    EQU   0                                                        01535000
BLST01   EQU   0                                                        01536000
BLST02   EQU   0                                                        01537000
BLST03   EQU   0                                                        01538000
BLST04   EQU   0                                                        01539000
BLST05   EQU   0                                                        01540000
BLST06   EQU   0                                                        01541000
BLSUALLO EQU   0                                                        01542000
BLSUBLDD EQU   0                                                        01543000
BLSUBLDL EQU   0                                                        01544000
BLSUDYNA EQU   0                                                        01545000
BLSUFREE EQU   0                                                        01546000
BLSUFRE1 EQU   0                                                        01547000
BLSUMON  EQU   0                                                        01548000
BLSUMONA EQU   0                                                        01549000
BLSUMONC EQU   0                                                        01550000
BLSUMOND EQU   0                                                        01551000
BLSUMONL EQU   0                                                        01552000
BLSUMONT EQU   0                                                        01553000
BLSUMONX EQU   0                                                        01554000
BLSUMON2 EQU   0                                                        01555000
BLSUMPK1 EQU   0                                                        01556000
BLSUPARI EQU   0                                                        01557000
BLSUPARU EQU   0                                                        01558000
BLSUPGMC EQU   0                                                        01559000
BLSUPGMD EQU   0                                                        01560000
BLSUPGML EQU   0                                                        01561000
BLSUPGMR EQU   0                                                        01562000
BLSUPRTA EQU   0                                                        01563000
BLSUPRTN EQU   0                                                        01564000
BLSUPRTT EQU   0                                                        01565000
BLSUPUTA EQU   0                                                        01566000
BLSUPUTC EQU   0                                                        01567000
BLSUPUTD EQU   0                                                        01568000
BLSUPUTL EQU   0                                                        01569000
BLSUPUTN EQU   0                                                        01570000
BLSUPUTO EQU   0                                                        01571000
BLSUPUTT EQU   0                                                        01572000
BLSUSTAI EQU   0                                                        01573000
BLSUTRMA EQU   0                                                        01574000
BLSUTRMN EQU   0                                                        01575000
BLSUTRMO EQU   0                                                        01576000
BLSUTRMV EQU   0                                                        01577000
BLSUVSAR EQU   0                                                        01578000
BLSUVSCR EQU   0                                                        01579000
BLSUVSEN EQU   0                                                        01580000
BLSUVSER EQU   0                                                        01581000
BLSUVSGE EQU   0                                                        01582000
BLSUVSGU EQU   0                                                        01583000
BLSUVSMR EQU   0                                                        01584000
BLSUVSPO EQU   0                                                        01585000
BLSUVSPU EQU   0                                                        01586000
BLSUZZ2C EQU   0                                                        01587000
BLSUZZ2D EQU   0                                                        01588000
BLSUZZ2R EQU   0                                                        01589000
IKJEFF02 EQU   0                                                        01590000
IKJEFF18 EQU   0                                                        01591000
IKJEFF19 EQU   0                                                        01592000
IKJGETL  EQU   0                                                        01593000
IKJPARS  EQU   0                                                        01594000
IKJPTGT  EQU   0                                                        01595000
IKJPUTL  EQU   0                                                        01596000
IKJSCAN  EQU   0                                                        01597000
IKJSTCK  EQU   0                                                        01598000
I001C    EQU   0                                                        01599000
I008P    EQU   0                                                        01600000
I015F    EQU   0                                                        01601000
I015P    EQU   0                                                        01602000
I031F    EQU   0                                                        01603000
I031P    EQU   0                                                        01604000
I256C    EQU   0                                                        01605000
UCBBGN   EQU   0                                                        01606000
PZ2      EQU   0                                                        01607000
SAPA     EQU   0                                                        01608000
SAPAAS   EQU   SAPA+12                                                  01609000
SAPADT   EQU   SAPA+32                                                  01610000
SAPAF    EQU   SAPA+68                                                  01611000
SAPAFT   EQU   SAPAF+10                                                 01612000
SAPAFF   EQU   SAPAF+52                                                 01613000
SAPASF   EQU   SAPA+128                                                 01614000
SAPAC    EQU   SAPA+254                                                 01615000
SAPACT   EQU   SAPAC+2                                                  01616000
SABK     EQU   0                                                        01617000
SABKAS   EQU   SABK+12                                                  01618000
SABKDT   EQU   SABK+32                                                  01619000
SABKF    EQU   SABK+68                                                  01620000
SABKFT   EQU   SABKF+10                                                 01621000
SABKFF   EQU   SABKF+52                                                 01622000
SABKSF   EQU   SABK+128                                                 01623000
SABKC    EQU   SABK+254                                                 01624000
SABKCT   EQU   SABKC+2                                                  01625000
CPPL     EQU   ZZ2CPPL                                                  01626000
CPPLUPT  EQU   CPPL+4                                                   01627000
CPPLPSCB EQU   CPPL+8                                                   01628000
CPPLECT  EQU   CPPL+12                                                  01629000
UCBOBS01 EQU   UCBDEV                                                   01630000
UCBSTAB  EQU   UCBOBS01+10                                              01631000
UCBBSVL  EQU   UCBSTAB                                                  01632000
UCBPRSRS EQU   UCBSTAB                                                  01633000
UCBDMCT  EQU   UCBOBS01+11                                              01634000
UCBFL4   EQU   UCBOBS01+13                                              01635000
UCBOBS02 EQU   UCBDEV                                                   01636000
UCBTFL1  EQU   UCBOBS02+19                                              01637000
UCBXTN   EQU   UCBOBS02+20                                              01638000
UCBVOPT  EQU   UCBXTN                                                   01639000
UCBOBS03 EQU   UCBDEV                                                   01640000
UCBXTADR EQU   UCBOBS03                                                 01641000
UCBOBS04 EQU   UCBDEV                                                   01642000
UCBBTA   EQU   UCBOBS04+12                                              01643000
UCBOBS06 EQU   UCBDEV                                                   01644000
UCBAOF   EQU   UCBOBS06                                                 01645000
UCBAOF1  EQU   UCBAOF                                                   01646000
UCBAOF2  EQU   UCBAOF+1                                                 01647000
@NM00136 EQU   UCBOBS06+3                                               01648000
UCBIRB   EQU   UCBOBS06+4                                               01649000
UCBGRAF  EQU   UCBIRB                                                   01650000
UCBLDNCA EQU   UCBOBS06+8                                               01651000
UCBRDYQ  EQU   UCBLDNCA                                                 01652000
UCBIRLN  EQU   UCBRDYQ                                                  01653000
UCBLDNCB EQU   UCBRDYQ+1                                                01654000
UCBCTLNK EQU   UCBOBS06+12                                              01655000
UCBOBS07 EQU   UCBDEV                                                   01656000
UCBOBS08 EQU   UCBDEV                                                   01657000
UCBCTCAD EQU   UCBOBS08                                                 01658000
UCBCTCF1 EQU   UCBOBS08+4                                               01659000
UCBOBS09 EQU   UCBDEV                                                   01660000
ERRF     EQU   SABACT                                                   01661000
ERRFB    EQU   ERRF                                                     01662000
PTRPTR   EQU   PTRBIT                                                   01663000
PCHK     EQU   SAAULAD                                                  01664000
PCHK24IG EQU   PCHK                                                     01665000
PCHK24   EQU   PCHK+1                                                   01666000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01667000
@NM00158 EQU   ERRF                                                     01668000
ERRFS    EQU   ERRF                                                     01669000
ERRFN    EQU   ERRF                                                     01670000
ERRFD    EQU   ERRF                                                     01671000
UCBRV066 EQU   UCBOBS09+4                                               01672000
UCBIOSBA EQU   UCBOBS09                                                 01673000
UCBRV042 EQU   UCBOBS08+5                                               01674000
UCBRV082 EQU   UCBCTCF1                                                 01675000
UCBRV081 EQU   UCBCTCF1                                                 01676000
UCBRV080 EQU   UCBCTCF1                                                 01677000
UCBRV079 EQU   UCBCTCF1                                                 01678000
UCBRV078 EQU   UCBCTCF1                                                 01679000
UCBRV077 EQU   UCBCTCF1                                                 01680000
UCBRV076 EQU   UCBCTCF1                                                 01681000
UCBCTC80 EQU   UCBCTCF1                                                 01682000
UCBCTCAL EQU   UCBCTCAD                                                 01683000
UCBICNCB EQU   UCBOBS07+4                                               01684000
UCBRV040 EQU   UCBOBS07                                                 01685000
UCBCTLNA EQU   UCBCTLNK+1                                               01686000
UCBRLN   EQU   UCBCTLNK                                                 01687000
UCBRDYQA EQU   UCBLDNCB                                                 01688000
UCBINRLN EQU   UCBIRLN                                                  01689000
UCBIRBA  EQU   UCBIRB+1                                                 01690000
UCBRV039 EQU   UCBGRAF                                                  01691000
UCBDWNR  EQU   UCBGRAF                                                  01692000
UCBRPND  EQU   UCBGRAF                                                  01693000
UCBUPM   EQU   UCBGRAF                                                  01694000
UCBBTAM  EQU   UCBGRAF                                                  01695000
UCBDRNO  EQU   UCBGRAF                                                  01696000
UCBDRO   EQU   UCBGRAF                                                  01697000
UCBOIP   EQU   UCBGRAF                                                  01698000
UCBATRCD EQU   @NM00136                                                 01699000
UCBSKPFG EQU   @NM00136                                                 01700000
UCBRIPND EQU   @NM00136                                                 01701000
UCBRTIAC EQU   @NM00136                                                 01702000
UCBRSV79 EQU   @NM00136                                                 01703000
UCBRSV78 EQU   @NM00136                                                 01704000
UCBRSV77 EQU   @NM00136                                                 01705000
UCBOLTEP EQU   @NM00136                                                 01706000
UCBATNCT EQU   UCBOBS06+2                                               01707000
UCBRSV76 EQU   UCBAOF2                                                  01708000
UCBRSV75 EQU   UCBAOF2                                                  01709000
UCBRSV74 EQU   UCBAOF2                                                  01710000
UCBRSV73 EQU   UCBAOF2                                                  01711000
UCBRSV72 EQU   UCBAOF2                                                  01712000
UCBRSV71 EQU   UCBAOF2                                                  01713000
UCBRSV70 EQU   UCBAOF2                                                  01714000
UCBRSV69 EQU   UCBAOF2                                                  01715000
UCBRSV68 EQU   UCBAOF1                                                  01716000
UCBRSV67 EQU   UCBAOF1                                                  01717000
UCBRSV66 EQU   UCBAOF1                                                  01718000
UCBRSV65 EQU   UCBAOF1                                                  01719000
UCBRSV64 EQU   UCBAOF1                                                  01720000
UCBOFNL  EQU   UCBAOF1                                                  01721000
UCBOFSP  EQU   UCBAOF1                                                  01722000
UCBOFMCR EQU   UCBAOF1                                                  01723000
UCBBTB   EQU   UCBBTA+1                                                 01724000
UCBDI    EQU   UCBBTA                                                   01725000
UCBSNS   EQU   UCBOBS04+8                                               01726000
UCBTEB   EQU   UCBOBS04+4                                               01727000
UCBGCB   EQU   UCBOBS04+3                                               01728000
UCBOPEN  EQU   UCBOBS04+2                                               01729000
UCBSTART EQU   UCBOBS04                                                 01730000
UCBXTNB  EQU   UCBXTN+1                                                 01731000
UCBRSV22 EQU   UCBVOPT                                                  01732000
UCBRSV21 EQU   UCBVOPT                                                  01733000
UCBRSV20 EQU   UCBVOPT                                                  01734000
UCBESVE  EQU   UCBVOPT                                                  01735000
UCBERPC  EQU   UCBVOPT                                                  01736000
UCBESVC  EQU   UCBVOPT                                                  01737000
UCBEVA   EQU   UCBVOPT                                                  01738000
UCBESV   EQU   UCBVOPT                                                  01739000
UCBRV009 EQU   UCBTFL1                                                  01740000
UCBRV008 EQU   UCBTFL1                                                  01741000
UCBRV007 EQU   UCBTFL1                                                  01742000
UCBRV006 EQU   UCBTFL1                                                  01743000
UCBRV005 EQU   UCBTFL1                                                  01744000
UCBDQDSP EQU   UCBTFL1                                                  01745000
UCBNSLTP EQU   UCBTFL1                                                  01746000
UCBNLTP  EQU   UCBTFL1                                                  01747000
UCBRES1B EQU   UCBOBS02+18                                              01748000
UCBFSER  EQU   UCBOBS02+12                                              01749000
@NM00135 EQU   UCBOBS02+4                                               01750000
UCBFSEQ  EQU   UCBOBS02+2                                               01751000
UCBFSCT  EQU   UCBOBS02                                                 01752000
UCBNEXP  EQU   UCBOBS01+20                                              01753000
UCBBASE  EQU   UCBOBS01+16                                              01754000
UCBRES1A EQU   UCBOBS01+15                                              01755000
UCBUSER  EQU   UCBOBS01+14                                              01756000
UCBFL47  EQU   UCBFL4                                                   01757000
UCBFL46  EQU   UCBFL4                                                   01758000
UCBFL45  EQU   UCBFL4                                                   01759000
UCBRV065 EQU   UCBFL4                                                   01760000
UCBDSS   EQU   UCBFL4                                                   01761000
UCBRESVP EQU   UCBFL4                                                   01762000
UCBWDAV  EQU   UCBFL4                                                   01763000
UCBDAVV  EQU   UCBFL4                                                   01764000
UCBSQC   EQU   UCBOBS01+12                                              01765000
UCBDATP  EQU   UCBOBS01+12                                              01766000
UCBDMC   EQU   UCBDMCT                                                  01767000
UCBMOUNT EQU   UCBDMCT                                                  01768000
UCBBNUL  EQU   UCBSTAB                                                  01769000
UCBSHAR  EQU   UCBSTAB                                                  01770000
UCBBSTR  EQU   UCBSTAB                                                  01771000
UCBBPUB  EQU   UCBSTAB                                                  01772000
UCBBPRV  EQU   UCBSTAB                                                  01773000
UCBBALB  EQU   UCBPRSRS                                                 01774000
UCBPGFL  EQU   UCBSTAB                                                  01775000
UCBDVSHR EQU   UCBBSVL                                                  01776000
UCBVOLI  EQU   UCBOBS01+4                                               01777000
UCBVTOC  EQU   UCBOBS01                                                 01778000
CPPLCBUF EQU   CPPL                                                     01779000
SABK999  EQU   SABK+3072                                                01780000
SABKCT1  EQU   SABKCT                                                   01781000
SABKCL   EQU   SABKC                                                    01782000
@NM00030 EQU   SABK+153                                                 01783000
SABKSRC  EQU   SABK+152                                                 01784000
SABKPGV  EQU   SABK+144                                                 01785000
SABKGMT  EQU   SABK+136                                                 01786000
@NM00029 EQU   SABKSF                                                   01787000
SABKSFS  EQU   SABKSF                                                   01788000
SABKSFI  EQU   SABKSF                                                   01789000
SABKSF9  EQU   SABKSF                                                   01790000
SABKSF1  EQU   SABKSF                                                   01791000
SABKF99  EQU   SABKF+60                                                 01792000
@NM00028 EQU   SABKF+56                                                 01793000
@NM00027 EQU   SABKFF                                                   01794000
SABKFFA  EQU   SABKFF                                                   01795000
SABKFIL  EQU   SABKF+48                                                 01796000
SABKFIM  EQU   SABKF+44                                                 01797000
SABKFT9  EQU   SABKFT+34                                                01798000
SABKFTE  EQU   SABKFT+33                                                01799000
SABKFTD  EQU   SABKFT+2                                                 01800000
@NM00026 EQU   SABKFT+1                                                 01801000
SABKFTY  EQU   SABKFT                                                   01802000
SABKFT0  EQU   SABKFT                                                   01803000
SABKFLB  EQU   SABKF+9                                                  01804000
SABKFOB  EQU   SABKF+8                                                  01805000
SABKFLE  EQU   SABKF+4                                                  01806000
SABKFOF  EQU   SABKF                                                    01807000
SABKF00  EQU   SABKF                                                    01808000
@NM00025 EQU   SABK+66                                                  01809000
SABKELK  EQU   SABK+66                                                  01810000
SABKDT9  EQU   SABKDT+34                                                01811000
SABKDTE  EQU   SABKDT+33                                                01812000
SABKDTD  EQU   SABKDT+2                                                 01813000
@NM00024 EQU   SABKDT+1                                                 01814000
SABKDTY  EQU   SABKDT                                                   01815000
SABKDT0  EQU   SABKDT                                                   01816000
SABKLAD  EQU   SABK+28                                                  01817000
SABKAS9  EQU   SABKAS+16                                                01818000
@NM00023 EQU   SABKAS+12                                                01819000
SABKAS2  EQU   SABKAS+8                                                 01820000
SABKAS1  EQU   SABKAS+4                                                 01821000
@NM00022 EQU   SABKAS+2                                                 01822000
SABKAST  EQU   SABKAS                                                   01823000
SABKAS0  EQU   SABKAS                                                   01824000
SABKRDX  EQU   SABK+8                                                   01825000
@NM00021 EQU   SABK+2                                                   01826000
SABKRID  EQU   SABK                                                     01827000
SAPA999  EQU   SAPA+3072                                                01828000
SAPACT1  EQU   SAPACT                                                   01829000
SAPACL   EQU   SAPAC                                                    01830000
@NM00010 EQU   SAPA+153                                                 01831000
SAPASRC  EQU   SAPA+152                                                 01832000
SAPAPGV  EQU   SAPA+144                                                 01833000
SAPAGMT  EQU   SAPA+136                                                 01834000
@NM00009 EQU   SAPASF                                                   01835000
SAPASFS  EQU   SAPASF                                                   01836000
SAPASFI  EQU   SAPASF                                                   01837000
SAPASF9  EQU   SAPASF                                                   01838000
SAPASF1  EQU   SAPASF                                                   01839000
SAPAF99  EQU   SAPAF+60                                                 01840000
@NM00008 EQU   SAPAF+56                                                 01841000
@NM00007 EQU   SAPAFF                                                   01842000
SAPAFFA  EQU   SAPAFF                                                   01843000
SAPAFIL  EQU   SAPAF+48                                                 01844000
SAPAFIM  EQU   SAPAF+44                                                 01845000
SAPAFT9  EQU   SAPAFT+34                                                01846000
SAPAFTE  EQU   SAPAFT+33                                                01847000
SAPAFTD  EQU   SAPAFT+2                                                 01848000
@NM00006 EQU   SAPAFT+1                                                 01849000
SAPAFTY  EQU   SAPAFT                                                   01850000
SAPAFT0  EQU   SAPAFT                                                   01851000
SAPAFLB  EQU   SAPAF+9                                                  01852000
SAPAFOB  EQU   SAPAF+8                                                  01853000
SAPAFLE  EQU   SAPAF+4                                                  01854000
SAPAFOF  EQU   SAPAF                                                    01855000
SAPAF00  EQU   SAPAF                                                    01856000
@NM00005 EQU   SAPA+66                                                  01857000
SAPAELK  EQU   SAPA+66                                                  01858000
SAPADT9  EQU   SAPADT+34                                                01859000
SAPADTE  EQU   SAPADT+33                                                01860000
SAPADTD  EQU   SAPADT+2                                                 01861000
@NM00004 EQU   SAPADT+1                                                 01862000
SAPADTY  EQU   SAPADT                                                   01863000
SAPADT0  EQU   SAPADT                                                   01864000
SAPALAD  EQU   SAPA+28                                                  01865000
SAPAAS9  EQU   SAPAAS+16                                                01866000
@NM00003 EQU   SAPAAS+12                                                01867000
SAPAAS2  EQU   SAPAAS+8                                                 01868000
SAPAAS1  EQU   SAPAAS+4                                                 01869000
@NM00002 EQU   SAPAAS+2                                                 01870000
SAPAAST  EQU   SAPAAS                                                   01871000
SAPAAS0  EQU   SAPAAS                                                   01872000
SAPARDX  EQU   SAPA+8                                                   01873000
@NM00001 EQU   SAPA+2                                                   01874000
SAPARID  EQU   SAPA                                                     01875000
UCBERADR EQU   UCBUCS+12                                                01876000
UCBFCBID EQU   UCBUCS+8                                                 01877000
UCBERCNT EQU   UCBUCS+7                                                 01878000
UCBRSV51 EQU   UCBUCS+6                                                 01879000
UCBFCBPE EQU   UCBFCBOP                                                 01880000
UCBRSV49 EQU   UCBFCBOP                                                 01881000
UCBRSV48 EQU   UCBFCBOP                                                 01882000
UCBRSV47 EQU   UCBFCBOP                                                 01883000
UCBRSV46 EQU   UCBFCBOP                                                 01884000
UCBRSV45 EQU   UCBFCBOP                                                 01885000
UCBRSV44 EQU   UCBFCBOP                                                 01886000
UCBFCBO1 EQU   UCBFCBOP                                                 01887000
UCBUCSPE EQU   UCBUCSOP                                                 01888000
UCBRSV43 EQU   UCBUCSOP                                                 01889000
UCBRSV42 EQU   UCBUCSOP                                                 01890000
UCBRSV41 EQU   UCBUCSOP                                                 01891000
UCBRSV40 EQU   UCBUCSOP                                                 01892000
UCBRSV39 EQU   UCBUCSOP                                                 01893000
UCBUCSO2 EQU   UCBUCSOP                                                 01894000
UCBUCSO1 EQU   UCBUCSOP                                                 01895000
UCBUCSID EQU   UCBUCS                                                   01896000
UCBMDRBA EQU   UCBMDRBF+1                                               01897000
UCBRV075 EQU   UCBMDRBF                                                 01898000
UCBRV074 EQU   UCB3800X+32                                              01899000
UCBIMAGE EQU   UCB3800X+28                                              01900000
UCBFCBNM EQU   UCB3800X+24                                              01901000
UCBCHAR4 EQU   UCB3800X+20                                              01902000
UCBCHAR3 EQU   UCB3800X+16                                              01903000
UCBCHAR2 EQU   UCB3800X+12                                              01904000
UCBCHAR1 EQU   UCB3800X+8                                               01905000
UCBCGMID EQU   UCB3800X+4                                               01906000
UCBBRSTA EQU   UCBACTIV                                                 01907000
UCBRV063 EQU   UCBACTIV                                                 01908000
UCBRV062 EQU   UCBACTIV                                                 01909000
UCBRV061 EQU   UCBACTIV                                                 01910000
UCBRV060 EQU   UCBACTIV                                                 01911000
UCBRV059 EQU   UCBACTIV                                                 01912000
UCBRV058 EQU   UCBACTIV                                                 01913000
UCBRV057 EQU   UCBACTIV                                                 01914000
UCBRV050 EQU   UCB3800X+2                                               01915000
UCBCGMNO EQU   UCB3800X+1                                               01916000
UCBRV083 EQU   UCBOPTNS                                                 01917000
UCBBRSTR EQU   UCBOPTNS                                                 01918000
UCBRV056 EQU   UCBOPTNS                                                 01919000
UCBRV055 EQU   UCBOPTNS                                                 01920000
UCBRV054 EQU   UCBOPTNS                                                 01921000
UCBRV053 EQU   UCBOPTNS                                                 01922000
UCBRV052 EQU   UCBOPTNS                                                 01923000
UCBRV051 EQU   UCBOPTNS                                                 01924000
UCBRV073 EQU   UCB3540X+7                                               01925000
UCBRV072 EQU   UCBDKBYT                                                 01926000
UCBRV071 EQU   UCBDKBYT                                                 01927000
UCBRV070 EQU   UCBDKBYT                                                 01928000
UCBRV069 EQU   UCBDKBYT                                                 01929000
UCBRV068 EQU   UCBDKBYT                                                 01930000
UCBRV067 EQU   UCBDKBYT                                                 01931000
UCBVLVER EQU   UCBDKBYT                                                 01932000
UCBDKAMX EQU   UCBDKBYT                                                 01933000
UCBVLSER EQU   UCB3540X                                                 01934000
UCBRDATA EQU   UCBOCR+4                                                 01935000
UCBFRID  EQU   UCBOCR                                                   01936000
UCBCLN   EQU   UCBMT+14                                                 01937000
UCBERG   EQU   UCBMT+12                                                 01938000
UCBMS    EQU   UCBMT+11                                                 01939000
UCBNB    EQU   UCBMT+10                                                 01940000
UCBPW    EQU   UCBMT+9                                                  01941000
UCBPR    EQU   UCBMT+8                                                  01942000
UCBSIO   EQU   UCBMT+6                                                  01943000
UCBTW    EQU   UCBMT+5                                                  01944000
UCBTR    EQU   UCBMT+4                                                  01945000
UCBTWT   EQU   UCBMT+3                                                  01946000
UCBTRT   EQU   UCBMT+2                                                  01947000
UCBCTD   EQU   UCBMT                                                    01948000
UCBWTOID EQU   UCBCMEXT+17                                              01949000
UCBRV043 EQU   UCBCMEXT+16                                              01950000
UCBASID  EQU   UCBCMEXT+14                                              01951000
UCBMFCNT EQU   UCBCMEXT+12                                              01952000
UCBPMSK  EQU   UCBCMEXT+10                                              01953000
UCBCCWOF EQU   UCBCMEXT+8                                               01954000
UCBRV041 EQU   UCBCMEXT+6                                               01955000
UCBRV036 EQU   UCBFLP1                                                  01956000
UCBRV035 EQU   UCBFLP1                                                  01957000
UCBERLOG EQU   UCBFLP1                                                  01958000
UCBRV033 EQU   UCBFLP1                                                  01959000
UCBINHIO EQU   UCBFLP1                                                  01960000
UCBNSWAP EQU   UCBFLP1                                                  01961000
UCBSHRUP EQU   UCBFLP1                                                  01962000
UCBNSRCH EQU   UCBFLP1                                                  01963000
UCBSNSCT EQU   UCBCMEXT+4                                               01964000
UCBHPDV  EQU   @NM00137                                                 01965000
UCBHALI  EQU   @NM00137                                                 01966000
UCBRSV09 EQU   @NM00137                                                 01967000
UCBRSV08 EQU   @NM00137                                                 01968000
UCBRSV07 EQU   @NM00137                                                 01969000
UCBRSV06 EQU   @NM00137                                                 01970000
UCBRSV05 EQU   @NM00137                                                 01971000
UCBRSV04 EQU   @NM00137                                                 01972000
UCBDTI   EQU   UCBCMEXT+2                                               01973000
UCBSTI   EQU   UCBCMEXT+1                                               01974000
UCBETI   EQU   UCBCMEXT                                                 01975000
UCBEXTP  EQU   UCBEXTPT+1                                               01976000
UCBDDRSW EQU   UCBFLC                                                   01977000
UCBTICBT EQU   UCBFLC                                                   01978000
UCBIVRR  EQU   UCBFLC                                                   01979000
UCBIVRS  EQU   UCBFLC                                                   01980000
UCBITF   EQU   UCBFLC                                                   01981000
UCBUDE   EQU   UCBFLC                                                   01982000
UCBWAA   EQU   UCBFLC                                                   01983000
UCBATTP  EQU   UCBFLC                                                   01984000
UCBRSV11 EQU   UCBDVCLS                                                 01985000
UCBRSV10 EQU   UCBDVCLS                                                 01986000
UCB3CHAR EQU   UCBDVCLS                                                 01987000
UCBDVPWR EQU   UCB2OPT7                                                 01988000
UCBVLPWR EQU   UCB2OPT6                                                 01989000
UCB2OPT5 EQU   UCBTBYT2                                                 01990000
UCBRVDEV EQU   UCBRWTAU                                                 01991000
UCBRPS   EQU   UCBDUDN2                                                 01992000
UCBRR    EQU   UCBDUDN1                                                 01993000
UCB2OPT1 EQU   UCBTBYT2                                                 01994000
UCB2OPT0 EQU   UCBTBYT2                                                 01995000
UCB1FEA7 EQU   UCBTBYT1                                                 01996000
UCBD6250 EQU   UCB1FEA6                                                 01997000
UCBD1600 EQU   UCB1FEA5                                                 01998000
UCB1FEA4 EQU   UCBTBYT1                                                 01999000
UCB1FEA3 EQU   UCBTBYT1                                                 02000000
UCB1FEA2 EQU   UCBTBYT1                                                 02001000
UCB1FEA1 EQU   UCBTBYT1                                                 02002000
UCB1FEA0 EQU   UCBTBYT1                                                 02003000
UCBNAME  EQU   UCBOB+13                                                 02004000
UCBRV029 EQU   UCBWGT                                                   02005000
UCBVHRSN EQU   UCBWGT                                                   02006000
UCBVORSN EQU   UCBWGT                                                   02007000
UCBREW   EQU   UCBWGT                                                   02008000
UCBPUB   EQU   UCBWGT                                                   02009000
UCBOUT   EQU   UCBWGT                                                   02010000
UCBIN    EQU   UCBWGT                                                   02011000
UCBCPU   EQU   UCBOB+11                                                 02012000
UCBLCI   EQU   UCBOB+10                                                 02013000
UCBCNT   EQU   UCBOB+9                                                  02014000
UCBRV017 EQU   UCBCHM1                                                  02015000
UCBRV016 EQU   UCBCHM1                                                  02016000
UCBRV015 EQU   UCBCHM1                                                  02017000
UCBRV014 EQU   UCBCHM1                                                  02018000
UCBSPB   EQU   UCBPTH1                                                  02019000
UCBPPB   EQU   UCBPTH1                                                  02020000
UCBSPA   EQU   UCBPTH0                                                  02021000
UCBPPA   EQU   UCBPTH0                                                  02022000
UCBSIGP  EQU   UCBFLB                                                   02023000
UCBVALPH EQU   UCBFLB                                                   02024000
UCBCRHSN EQU   UCBFLB                                                   02025000
UCBCRHRV EQU   UCBFLB                                                   02026000
UCBRESVH EQU   UCBFLB                                                   02027000
UCBSPST  EQU   UCBFLB                                                   02028000
UCBASNS  EQU   UCBFLB                                                   02029000
UCBIORST EQU   UCBFLB                                                   02030000
UCBQISCE EQU   UCBFL1                                                   02031000
UCBACTV  EQU   UCBFL1                                                   02032000
UCBSAP   EQU   UCBFL1                                                   02033000
UCBNOTRC EQU   UCBCUB                                                   02034000
UCBPSNS  EQU   UCBFL1                                                   02035000
UCBUSING EQU   UCBPST                                                   02036000
UCBNOTRD EQU   UCBNRY                                                   02037000
UCBBUSYD EQU   UCBBSY                                                   02038000
UCBUA    EQU   UCBCHAN+1                                                02039000
UCBCHA   EQU   UCBCHAN                                                  02040000
UCBDADI  EQU   UCBSTAT                                                  02041000
UCBSYSR  EQU   UCBSTAT                                                  02042000
UCBPRES  EQU   UCBSTAT                                                  02043000
UCBALOC  EQU   UCBSTAT                                                  02044000
UCBUNLD  EQU   UCBSTAT                                                  02045000
UCBRESV  EQU   UCBSTAT                                                  02046000
UCBCHGS  EQU   UCBSTAT                                                  02047000
UCBONLI  EQU   UCBSTAT                                                  02048000
UCBALTPH EQU   UCBFL5                                                   02049000
UCBALTCU EQU   UCBFL5                                                   02050000
UCBNALOC EQU   UCBFL5                                                   02051000
UCBENVRD EQU   UCBFL5                                                   02052000
UCBVSDR  EQU   UCBFL5                                                   02053000
UCBSASK  EQU   UCBFL5                                                   02054000
UCBAMV   EQU   UCBAF                                                    02055000
UCBDCC   EQU   UCBFL5                                                   02056000
UCBMONT  EQU   UCBJBNR                                                  02057000
UCBRV011 EQU   UCBJBNR                                                  02058000
UCBMMSGP EQU   UCBJBNR                                                  02059000
UCBOLDSM EQU   UCBJBNR                                                  02060000
UCBRV003 EQU   UCBJBNR                                                  02061000
UCBDUC   EQU   UCBJBNR                                                  02062000
UCBJES3  EQU   UCBJBNR                                                  02063000
UCBVRDEV EQU   UCBJBNR                                                  02064000
UCBCMSEG EQU   UCBOB                                                    02065000
UCBPFXND EQU   UCB+512                                                  02066000
UCBIOQ   EQU   UCB+508                                                  02067000
UCBLOCK  EQU   UCB+504                                                  02068000
UCBPXST  EQU   UCB+504                                                  02069000
@NM00134 EQU   UCB                                                      02070000
RVT99999 EQU   RVT+384                                                  02071000
RVT0096P EQU   RVT+380                                                  02072000
RVT0095P EQU   RVT+376                                                  02073000
RVT0094P EQU   RVT+372                                                  02074000
RVT0093P EQU   RVT+368                                                  02075000
RVT0092P EQU   RVT+364                                                  02076000
RVT0091P EQU   RVT+360                                                  02077000
RVT0090P EQU   RVT+356                                                  02078000
RVT0089P EQU   RVT+352                                                  02079000
RVT0088P EQU   RVT+348                                                  02080000
RVT0087P EQU   RVT+344                                                  02081000
RVT0086P EQU   RVT+340                                                  02082000
RVT0085P EQU   RVT+336                                                  02083000
RVT0084P EQU   RVT+332                                                  02084000
RVT0083P EQU   RVT+328                                                  02085000
RVT0082P EQU   RVT+324                                                  02086000
RVT0081P EQU   RVT+320                                                  02087000
RVT0080P EQU   RVT+316                                                  02088000
RVT0079P EQU   RVT+312                                                  02089000
RVT0078P EQU   RVT+308                                                  02090000
RVT0077P EQU   RVT+304                                                  02091000
RVT0076P EQU   RVT+300                                                  02092000
RVT0075P EQU   RVT+296                                                  02093000
RVT0074P EQU   RVT+292                                                  02094000
RVT0073P EQU   RVT+288                                                  02095000
RVT0072P EQU   RVT+284                                                  02096000
RVTDTUTP EQU   RVT+272                                                  02097000
RVTDTMTP EQU   RVT+268                                                  02098000
RVT0057P EQU   RVT+224                                                  02099000
RVT0056P EQU   RVT+220                                                  02100000
RVT0055P EQU   RVT+216                                                  02101000
RVT0054P EQU   RVT+212                                                  02102000
RVT0053P EQU   RVT+208                                                  02103000
RVT0044P EQU   RVT+172                                                  02104000
RVT0043P EQU   RVT+168                                                  02105000
RVT0040P EQU   RVT+156                                                  02106000
RVT0039P EQU   RVT+152                                                  02107000
RVT0038P EQU   RVT+148                                                  02108000
RVT0037P EQU   RVT+144                                                  02109000
RVT0031P EQU   RVT+120                                                  02110000
RVT0030P EQU   RVT+116                                                  02111000
RVT0029P EQU   RVT+112                                                  02112000
RVT0020P EQU   RVT+76                                                   02113000
RVT0012P EQU   RVT+44                                                   02114000
RVT0010P EQU   RVT+36                                                   02115000
RVT0009P EQU   RVT+32                                                   02116000
RVT0008P EQU   RVT+28                                                   02117000
RVT0006P EQU   RVT+20                                                   02118000
ZZ69999  EQU   ZZ6+1792                                                 02119000
ZZ6BRB   EQU   ZZ6B+12                                                  02120000
ZZ6BRC   EQU   ZZ6B+8                                                   02121000
@NM00133 EQU   ZZ6B+6                                                   02122000
ZZ6BFL   EQU   ZZ6B+4                                                   02123000
ZZ6BDA   EQU   ZZ6B                                                     02124000
@NM00132 EQU   ZZ6+540                                                  02125000
ZZ6BUFI  EQU   ZZ6+536                                                  02126000
ZZ6BUFP  EQU   ZZ6+532                                                  02127000
ZZ6FILE  EQU   ZZ6+524                                                  02128000
ZZ6BUFB  EQU   ZZ6+520                                                  02129000
ZZ6BUFL  EQU   ZZ6+518                                                  02130000
ZZ6BUFN  EQU   ZZ6+516                                                  02131000
ZZ6ZZ6P  EQU   ZZ6+512                                                  02132000
@NM00131 EQU   ZZ6+256                                                  02133000
ZZ6D999  EQU   ZZ6D+128                                                 02134000
@NM00130 EQU   ZZ6D+116                                                 02135000
ZZ6DCAP  EQU   ZZ6D+112                                                 02136000
ZZ6DPRP  EQU   ZZ6D+108                                                 02137000
ZZ6DDA2  EQU   ZZ6D+104                                                 02138000
ZZ6DDA1  EQU   ZZ6D+100                                                 02139000
@NM00129 EQU   ZZ6DF                                                    02140000
ZZ6DFSU  EQU   ZZ6DF                                                    02141000
ZZ6DFST  EQU   ZZ6DF                                                    02142000
ZZ6DFAB  EQU   ZZ6DF                                                    02143000
ZZ6DFMP  EQU   ZZ6DF                                                    02144000
ZZ6DFDU  EQU   ZZ6DF                                                    02145000
ZZ6DFBS  EQU   ZZ6DF                                                    02146000
ZZ6DQ2   EQU   ZZ6D+88                                                  02147000
ZZ6DQ1   EQU   ZZ6D+84                                                  02148000
ZZ6DQA9  EQU   ZZ6DQA+16                                                02149000
@NM00128 EQU   ZZ6DQA+12                                                02150000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 02151000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 02152000
@NM00127 EQU   ZZ6DQA+2                                                 02153000
ZZ6DQAT  EQU   ZZ6DQA                                                   02154000
ZZ6DQA0  EQU   ZZ6DQA                                                   02155000
ZZ6DRDX  EQU   ZZ6D+64                                                  02156000
ZZ6DELK  EQU   ZZ6D+64                                                  02157000
ZZ6DMEM  EQU   ZZ6D+56                                                  02158000
ZZ6DDT1  EQU   ZZ6DDT                                                   02159000
ZZ6DDO   EQU   ZZ6DD+2                                                  02160000
ZZ6DDL   EQU   ZZ6DD                                                    02161000
@NM00126 EQU   ZZ6D+2                                                   02162000
ZZ6DRID  EQU   ZZ6D                                                     02163000
ZZ6RDCB  EQU   ZZ6                                                      02164000
ZZ60000  EQU   ZZ6                                                      02165000
BVT99999 EQU   BVT+256                                                  02166000
BVT0064P EQU   BVT+252                                                  02167000
BVT0063P EQU   BVT+248                                                  02168000
BVT0062P EQU   BVT+244                                                  02169000
BVT0061P EQU   BVT+240                                                  02170000
BVT0060P EQU   BVT+236                                                  02171000
BVT0059P EQU   BVT+232                                                  02172000
BVT0057P EQU   BVT+224                                                  02173000
BVT0056P EQU   BVT+220                                                  02174000
BVTSTBLP EQU   BVT+200                                                  02175000
BVT0045P EQU   BVT+176                                                  02176000
BVT0044P EQU   BVT+172                                                  02177000
BVT0033P EQU   BVT+128                                                  02178000
BVT0032P EQU   BVT+124                                                  02179000
BVT0031P EQU   BVT+120                                                  02180000
BVT0030P EQU   BVT+116                                                  02181000
BVT0029P EQU   BVT+112                                                  02182000
BVT0026P EQU   BVT+100                                                  02183000
BVT0025P EQU   BVT+96                                                   02184000
BVT0024P EQU   BVT+92                                                   02185000
BVT0023P EQU   BVT+88                                                   02186000
BVT0016P EQU   BVT+60                                                   02187000
BVT0015P EQU   BVT+56                                                   02188000
BVT0014P EQU   BVT+52                                                   02189000
BVT0003P EQU   BVT+8                                                    02190000
BVT0001P EQU   BVT                                                      02191000
SA99     EQU   SA+72                                                    02192000
SARC     EQU   SAR+56                                                   02193000
SARB     EQU   SAR+52                                                   02194000
SARA     EQU   SAR+48                                                   02195000
SAR9     EQU   SAR+44                                                   02196000
SAR8     EQU   SAR+40                                                   02197000
SAR7     EQU   SAR+36                                                   02198000
SAR6     EQU   SAR+32                                                   02199000
SAR5     EQU   SAR+28                                                   02200000
SAR4     EQU   SAR+24                                                   02201000
SAR3     EQU   SAR+20                                                   02202000
SAR2     EQU   SAR+16                                                   02203000
SAR0     EQU   SAR+8                                                    02204000
SARF     EQU   SAR+4                                                    02205000
SARE     EQU   SAR                                                      02206000
SAFWD    EQU   SA+8                                                     02207000
SABAK    EQU   SA+4                                                     02208000
SA1L     EQU   SA1+1                                                    02209000
SA1P     EQU   SA1                                                      02210000
UPTPREFL EQU   UPT+23                                                   02211000
UPTPREFX EQU   UPT+16                                                   02212000
@NM00125 EQU   UPT+15                                                   02213000
UPTLDEL  EQU   UPT+14                                                   02214000
UPTCDEL  EQU   UPT+13                                                   02215000
UPTWTP   EQU   UPTSWS                                                   02216000
UPTMODE  EQU   UPTSWS                                                   02217000
UPTALD   EQU   UPTSWS                                                   02218000
UPTPAUS  EQU   UPTSWS                                                   02219000
UPTNCOM  EQU   UPTSWS                                                   02220000
UPTMID   EQU   UPTSWS                                                   02221000
UPTNPRM  EQU   UPTSWS                                                   02222000
UPTRCVR  EQU   UPTSWS                                                   02223000
UPTUSER  EQU   UPT+2                                                    02224000
@NM00124 EQU   UPT                                                      02225000
@NM00123 EQU   ECT+52                                                   02226000
@NM00122 EQU   ECT+48                                                   02227000
@NM00121 EQU   ECT+44                                                   02228000
@NM00120 EQU   ECTSWS2+1                                                02229000
@NM00119 EQU   ECTSWS21                                                 02230000
ECTTABND EQU   ECTSWS21                                                 02231000
ECTDEFCS EQU   ECTSWS21                                                 02232000
ECTBKPB  EQU   ECT+36                                                   02233000
ECTUSER  EQU   ECT+32                                                   02234000
ECTDDNUM EQU   ECT+29                                                   02235000
ECTATTN  EQU   ECTSWS                                                   02236000
ECTBKGRD EQU   ECTSWS                                                   02237000
ECTNNOT  EQU   ECTSWS                                                   02238000
ECTNMAL  EQU   ECTSWS                                                   02239000
ECTLOGF  EQU   ECTSWS                                                   02240000
ECTATRM  EQU   ECTSWS                                                   02241000
@NM00118 EQU   ECTSWS                                                   02242000
ECTNOPD  EQU   ECTSWS                                                   02243000
ECTSCMD  EQU   ECT+20                                                   02244000
ECTPCMD  EQU   ECT+12                                                   02245000
ECTSMSG  EQU   ECT+9                                                    02246000
ECTMSGF  EQU   ECT+8                                                    02247000
ECTIOWA  EQU   ECT+4                                                    02248000
ECTRTCD  EQU   ECT+1                                                    02249000
ECTRCDF  EQU   ECT                                                      02250000
PSCBU    EQU   PSCB+64                                                  02251000
PSCBRSZ  EQU   PSCB+60                                                  02252000
PSCBLINE EQU   PSCB+59                                                  02253000
PSCBCHAR EQU   PSCB+58                                                  02254000
PSCBUPTL EQU   PSCB+56                                                  02255000
PSCBUPT  EQU   PSCB+52                                                  02256000
PSCBRLGB EQU   PSCB+48                                                  02257000
PSCBDEST EQU   PSCB+40                                                  02258000
@NM00117 EQU   PSCB+36                                                  02259000
@NM00116 EQU   PSCB+32                                                  02260000
@NM00115 EQU   PSCB+28                                                  02261000
PSCBLTI2 EQU   PSCB+24                                                  02262000
PSCBLTIM EQU   PSCB+20                                                  02263000
PSCBATR2 EQU   PSCB+18                                                  02264000
@NM00114 EQU   PSCBATR1                                                 02265000
@NM00113 EQU   PSCBATR1                                                 02266000
@NM00112 EQU   PSCBATR1                                                 02267000
PSCBATTN EQU   PSCBATR1                                                 02268000
PSCBVMNT EQU   PSCBATR1                                                 02269000
PSCBJCL  EQU   PSCBATR1                                                 02270000
PSCBACCT EQU   PSCBATR1                                                 02271000
PSCBCTRL EQU   PSCBATR1                                                 02272000
PSCBGPNM EQU   PSCB+8                                                   02273000
PSCBUSRL EQU   PSCB+7                                                   02274000
PSCBUSER EQU   PSCB                                                     02275000
CMDT1    EQU   CMDT                                                     02276000
CMDO     EQU   CMD+2                                                    02277000
CMDL     EQU   CMD                                                      02278000
ZZ299999 EQU   ZZ2+8192                                                 02279000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  02280000
ZZ2AXOL  EQU   ZZ2AXO                                                   02281000
@NM00111 EQU   ZZ2+7288                                                 02282000
@NM00110 EQU   ZZ2AMDX+4                                                02283000
ZZ2AMDXC EQU   ZZ2AMDX                                                  02284000
ZZ2HSD   EQU   ZZ2+3056                                                 02285000
@NM00109 EQU   ZZ2ES                                                    02286000
@NM00108 EQU   ZZ2+2868                                                 02287000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                02288000
@NM00107 EQU   ZZ2ITSE                                                  02289000
ZZ2ITSEP EQU   ZZ2ITSE                                                  02290000
ZZ2ITSEW EQU   ZZ2ITSE                                                  02291000
@NM00106 EQU   ZZ2ITR+20                                                02292000
ZZ2ITREC EQU   ZZ2ITRE+1                                                02293000
@NM00105 EQU   ZZ2ITRE                                                  02294000
ZZ2ITREP EQU   ZZ2ITRE                                                  02295000
ZZ2ITREW EQU   ZZ2ITRE                                                  02296000
@NM00104 EQU   ZZ2ITR+9                                                 02297000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 02298000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 02299000
ZZ2ITRPP EQU   ZZ2ITR                                                   02300000
@NM00103 EQU   ZZ2+1544                                                 02301000
ZZ2PGM   EQU   ZZ2+1536                                                 02302000
@NM00102 EQU   ZZ2+1526                                                 02303000
ZZ2CW    EQU   ZZ2+1524                                                 02304000
@NM00101 EQU   ZZ2+1504                                                 02305000
@NM00100 EQU   ZZ2+1352                                                 02306000
ZZ2FFSYP EQU   ZZ2+1348                                                 02307000
ZZ2SASYP EQU   ZZ2+1344                                                 02308000
ZZ2RDSYP EQU   ZZ2+1340                                                 02309000
ZZ2RASYP EQU   ZZ2+1336                                                 02310000
ZZ2PHSYP EQU   ZZ2+1332                                                 02311000
ZZ200SYP EQU   ZZ2+1324                                                 02312000
ZZ2SCWP  EQU   ZZ2+1320                                                 02313000
ZZ2TTLP  EQU   ZZ2+1316                                                 02314000
ZZ2LOADP EQU   ZZ2+1312                                                 02315000
ZZ2VRESP EQU   ZZ2+1308                                                 02316000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               02317000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                02318000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                02319000
ZZ2VRSAP EQU   ZZ2+1288                                                 02320000
ZZ2DVTP  EQU   ZZ2+1276                                                 02321000
@NM00099 EQU   ZZ2+1272                                                 02322000
@NM00098 EQU   ZZ2+1268                                                 02323000
ZZ2RPLP  EQU   ZZ2+1260                                                 02324000
ZZ2TCBP  EQU   ZZ2+1256                                                 02325000
@NM00097 EQU   ZZ2+1252                                                 02326000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 02327000
@NM00096 EQU   ZZ2+1112                                                 02328000
ZZ2FPDRP EQU   ZZ2+1108                                                 02329000
ZZ2FDSDP EQU   ZZ2+1104                                                 02330000
ZZ2APDRP EQU   ZZ2+1100                                                 02331000
ZZ2ADSDP EQU   ZZ2+1096                                                 02332000
ZZ2ENQ0P EQU   ZZ2+1092                                                 02333000
@NM00095 EQU   ZZ2+1080                                                 02334000
ZZ2MSG0P EQU   ZZ2+1076                                                 02335000
ZZ2FT25P EQU   ZZ2+1072                                                 02336000
ZZ2MSGSP EQU   ZZ2+1060                                                 02337000
ZZ2ALOCP EQU   ZZ2+1056                                                 02338000
@NM00094 EQU   ZZ2+976                                                  02339000
ZZ2STGN  EQU   ZZ2STG+4                                                 02340000
ZZ2STGP  EQU   ZZ2STG                                                   02341000
@NM00093 EQU   ZZ2+952                                                  02342000
ZZ2SCMDE EQU   ZZ2+944                                                  02343000
ZZ2SCMDN EQU   ZZ2+936                                                  02344000
ZZ2IDENT EQU   ZZ2+928                                                  02345000
ZZ2A9999 EQU   ZZ2A+656                                                 02346000
@NM00092 EQU   ZZ2A+224                                                 02347000
@NM00091 EQU   ZZ2A+220                                                 02348000
ZZ2AQD99 EQU   ZZ2AQD+60                                                02349000
@NM00090 EQU   ZZ2AQD+56                                                02350000
@NM00089 EQU   ZZ2AQDF                                                  02351000
ZZ2AQDFA EQU   ZZ2AQDF                                                  02352000
ZZ2AQDIL EQU   ZZ2AQD+48                                                02353000
ZZ2AQDIM EQU   ZZ2AQD+44                                                02354000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               02355000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               02356000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                02357000
@NM00088 EQU   ZZ2AQDT+1                                                02358000
ZZ2AQDTY EQU   ZZ2AQDT                                                  02359000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  02360000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 02361000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 02362000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 02363000
ZZ2AQDOF EQU   ZZ2AQD                                                   02364000
ZZ2AQD00 EQU   ZZ2AQD                                                   02365000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               02366000
@NM00087 EQU   ZZ2AQAS+12                                               02367000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                02368000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                02369000
@NM00086 EQU   ZZ2AQAS+2                                                02370000
ZZ2AQAST EQU   ZZ2AQAS                                                  02371000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  02372000
ZZ2ADPTA EQU   ZZ2ADPT                                                  02373000
ZZ2ADPL  EQU   ZZ2ADP                                                   02374000
ZZ2ADMTA EQU   ZZ2ADMT                                                  02375000
ZZ2ADML  EQU   ZZ2ADM                                                   02376000
ZZ2ADDTA EQU   ZZ2ADDT                                                  02377000
ZZ2ADDL  EQU   ZZ2ADD                                                   02378000
@NM00085 EQU   ZZ2A+72                                                  02379000
ZZ2APIDB EQU   ZZ2APID+3                                                02380000
ZZ2APIDA EQU   ZZ2APID                                                  02381000
@NM00084 EQU   ZZ2A+24                                                  02382000
@NM00083 EQU   ZZ2AF+5                                                  02383000
ZZ2AFX   EQU   ZZ2AF+5                                                  02384000
@NM00082 EQU   ZZ2AF+3                                                  02385000
ZZ2AFS   EQU   ZZ2AF+2                                                  02386000
ZZ2AFD   EQU   ZZ2AF+2                                                  02387000
ZZ2AFQ   EQU   ZZ2AF+2                                                  02388000
ZZ2AF$   EQU   ZZ2AF+2                                                  02389000
@NM00081 EQU   ZZ2AF+2                                                  02390000
ZZ2AFM   EQU   ZZ2AF+2                                                  02391000
@NM00080 EQU   ZZ2AF+2                                                  02392000
@NM00079 EQU   ZZ2AF+1                                                  02393000
ZZ2AFV   EQU   ZZ2AF+1                                                  02394000
@NM00078 EQU   ZZ2AF+1                                                  02395000
ZZ2AFC   EQU   ZZ2AF+1                                                  02396000
@NM00077 EQU   ZZ2AF                                                    02397000
ZZ2AFFS  EQU   ZZ2AF                                                    02398000
ZZ2AFT   EQU   ZZ2AF                                                    02399000
ZZ2AFP   EQU   ZZ2AF                                                    02400000
@NM00076 EQU   ZZ2A+8                                                   02401000
ZZ2ALINE EQU   ZZ2A+4                                                   02402000
@NM00075 EQU   ZZ2A+3                                                   02403000
ZZ2ACH   EQU   ZZ2A                                                     02404000
@NM00074 EQU   ZZ2+264                                                  02405000
@NM00073 EQU   ZZ2+263                                                  02406000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  02407000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 02408000
ZZ2PRTL  EQU   ZZ2PRT                                                   02409000
@NM00072 EQU   ZZ2AMD+56                                                02410000
ZZ2AMDXP EQU   ZZ2AMD+52                                                02411000
ZZ2AMDD  EQU   ZZ2AMD+48                                                02412000
ZZ2AMDL  EQU   ZZ2AMD+44                                                02413000
ZZ2AMDU  EQU   ZZ2AMD+28                                                02414000
ZZ2AMDF  EQU   ZZ2AMD+24                                                02415000
ZZ2AMDS  EQU   ZZ2AMD+20                                                02416000
ZZ2AMDC  EQU   ZZ2AMD+16                                                02417000
ZZ2AMDP  EQU   ZZ2AMD+12                                                02418000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 02419000
@NM00071 EQU   @NM00070                                                 02420000
ZZ2AMD2  EQU   @NM00070                                                 02421000
ZZ2AMD1  EQU   @NM00070                                                 02422000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 02423000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 02424000
ZZ2AMDT  EQU   ZZ2AMD                                                   02425000
ZZ199999 EQU   ZZ1+3072                                                 02426000
@NM00069 EQU   ZZ1+2160                                                 02427000
ZZ1TRTAS EQU   ZZ1+1904                                                 02428000
ZZ1TRUPC EQU   ZZ1+1648                                                 02429000
ZZ1TRCTX EQU   ZZ1+1392                                                 02430000
ZZ1NASID EQU   ZZ1N+274                                                 02431000
ZZ1NSTRL EQU   ZZ1N+272                                                 02432000
ZZ1NOFF  EQU   ZZ1N+268                                                 02433000
ZZ1NBDY  EQU   ZZ1N+264                                                 02434000
ZZ1NADE  EQU   ZZ1N+260                                                 02435000
ZZ1NADB  EQU   ZZ1N+256                                                 02436000
ZZ1NSTR  EQU   ZZ1N                                                     02437000
@NM00068 EQU   ZZ1+1080                                                 02438000
ZZ1TREBC EQU   ZZ1+824                                                  02439000
@NM00067 EQU   ZZ1+377                                                  02440000
ZZ1USTAE EQU   ZZ1+376                                                  02441000
@NM00066 EQU   ZZ1F+1                                                   02442000
@NM00065 EQU   ZZ1F                                                     02443000
ZZ1FM    EQU   ZZ1F                                                     02444000
ZZ1FX    EQU   ZZ1F                                                     02445000
ZZ1FU    EQU   ZZ1F                                                     02446000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 02447000
@NM00064 EQU   ZZ1EVE                                                   02448000
ZZ1EVEW  EQU   ZZ1EVE                                                   02449000
ZZ1ACMP  EQU   ZZ1ATTN                                                  02450000
@NM00063 EQU   ZZ1+144                                                  02451000
ZZ1FPP   EQU   ZZ1+140                                                  02452000
ZZ1ZZ6P  EQU   ZZ1+136                                                  02453000
@NM00062 EQU   ZZ1+84                                                   02454000
ZZ1PLINE EQU   ZZ1+80                                                   02455000
ZZ1PGSZ  EQU   ZZ1+76                                                   02456000
ZZ1PCNT  EQU   ZZ1+72                                                   02457000
@NM00061 EQU   ZZ1+68                                                   02458000
ZZ1TPAGE EQU   ZZ1+64                                                   02459000
ZZ1TLINE EQU   ZZ1+60                                                   02460000
@NM00060 EQU   ZZ1+52                                                   02461000
ZZ1DMCBP EQU   ZZ1+48                                                   02462000
ZZ1DSDP  EQU   ZZ1+44                                                   02463000
ZZ1PDRP  EQU   ZZ1+40                                                   02464000
ZZ1ZZ2P  EQU   ZZ1+36                                                   02465000
ZZ1327WP EQU   ZZ1+32                                                   02466000
ZZ1ACBP  EQU   ZZ1+28                                                   02467000
@NM00059 EQU   ZZ1+24                                                   02468000
ZZ1PDCBP EQU   ZZ1+20                                                   02469000
ZZ1BLRBL EQU   ZZ1+16                                                   02470000
@NM00058 EQU   ZZ1+12                                                   02471000
ZZ1PNULL EQU   ZZ1+8                                                    02472000
ZZ1NULL  EQU   ZZ1+4                                                    02473000
ZZ1IDE   EQU   ZZ1                                                      02474000
VRBAT1   EQU   VRBAT                                                    02475000
@NM00055 EQU   VRBA+2                                                   02476000
VRBAL    EQU   VRBA                                                     02477000
ESCO999  EQU   ESCO+182                                                 02478000
ESCORT1  EQU   ESCORT                                                   02479000
ESCORL   EQU   ESCOR                                                    02480000
@NM00054 EQU   ESCO+168                                                 02481000
ESCOABS  EQU   ESCO+164                                                 02482000
@NM00053 EQU   ESCOF+2                                                  02483000
@NM00052 EQU   ESCOFC                                                   02484000
ESCOFCD  EQU   ESCOFC                                                   02485000
ESCOFSS  EQU   ESCOFS                                                   02486000
ESCOFSX  EQU   ESCOFS                                                   02487000
ESCOFSR  EQU   ESCOFS                                                   02488000
ESCOFSP  EQU   ESCOFS                                                   02489000
ESCOFSA  EQU   ESCOFS                                                   02490000
ESCOFSM  EQU   ESCOFS                                                   02491000
ESCOFS2  EQU   ESCOFS                                                   02492000
ESCOFSC  EQU   ESCOFS                                                   02493000
ESCOKEY  EQU   ESCO+160                                                 02494000
@NM00051 EQU   ESCO+144                                                 02495000
ESCOMAD  EQU   ESCO+140                                                 02496000
ESCOD99  EQU   ESCOD+60                                                 02497000
@NM00050 EQU   ESCOD+56                                                 02498000
@NM00049 EQU   ESCODF                                                   02499000
ESCODFA  EQU   ESCODF                                                   02500000
ESCODIL  EQU   ESCOD+48                                                 02501000
ESCODIM  EQU   ESCOD+44                                                 02502000
ESCODT9  EQU   ESCODT+34                                                02503000
ESCODTE  EQU   ESCODT+33                                                02504000
ESCODTD  EQU   ESCODT+2                                                 02505000
@NM00048 EQU   ESCODT+1                                                 02506000
ESCODTY  EQU   ESCODT                                                   02507000
ESCODT0  EQU   ESCODT                                                   02508000
ESCODLB  EQU   ESCOD+9                                                  02509000
ESCODOB  EQU   ESCOD+8                                                  02510000
ESCODLE  EQU   ESCOD+4                                                  02511000
ESCODOF  EQU   ESCOD                                                    02512000
ESCOD00  EQU   ESCOD                                                    02513000
ESCOLAD  EQU   ESCO+76                                                  02514000
ESCOAS9  EQU   ESCOAS+16                                                02515000
@NM00047 EQU   ESCOAS+12                                                02516000
ESCOAS2  EQU   ESCOAS+8                                                 02517000
ESCOAS1  EQU   ESCOAS+4                                                 02518000
@NM00046 EQU   ESCOAS+2                                                 02519000
ESCOAST  EQU   ESCOAS                                                   02520000
ESCOAS0  EQU   ESCOAS                                                   02521000
ESCORV1  EQU   ESCO+59                                                  02522000
ESCOELK  EQU   ESCO+59                                                  02523000
ESCOSYM  EQU   ESCO+28                                                  02524000
ESCORDX  EQU   ESCO+24                                                  02525000
@NM00045 EQU   ESCO+16                                                  02526000
@NM00044 EQU   ESCO+8                                                   02527000
@NM00043 EQU   ESCO+2                                                   02528000
ESCORID  EQU   ESCO                                                     02529000
SABA999  EQU   SABA+3072                                                02530000
SABACT1  EQU   SABACT                                                   02531000
@NM00020 EQU   SABA+153                                                 02532000
SABAPGV  EQU   SABA+144                                                 02533000
@NM00019 EQU   SABASF                                                   02534000
SABAF99  EQU   SABAF+60                                                 02535000
@NM00018 EQU   SABAF+56                                                 02536000
@NM00017 EQU   SABAFF                                                   02537000
SABAFIL  EQU   SABAF+48                                                 02538000
SABAFT9  EQU   SABAFT+34                                                02539000
SABAFTE  EQU   SABAFT+33                                                02540000
SABAFTD  EQU   SABAFT+2                                                 02541000
@NM00016 EQU   SABAFT+1                                                 02542000
SABAFTY  EQU   SABAFT                                                   02543000
SABAFT0  EQU   SABAFT                                                   02544000
SABAFLB  EQU   SABAF+9                                                  02545000
SABAFOB  EQU   SABAF+8                                                  02546000
SABAF00  EQU   SABAF                                                    02547000
@NM00015 EQU   SABA+66                                                  02548000
SABAELK  EQU   SABA+66                                                  02549000
SABADT9  EQU   SABADT+34                                                02550000
SABADTE  EQU   SABADT+33                                                02551000
SABADTD  EQU   SABADT+2                                                 02552000
@NM00014 EQU   SABADT+1                                                 02553000
SABADTY  EQU   SABADT                                                   02554000
SABADT0  EQU   SABADT                                                   02555000
SABAAS9  EQU   SABAAS+16                                                02556000
@NM00013 EQU   SABAAS+12                                                02557000
SABAAS2  EQU   SABAAS+8                                                 02558000
SABAAS1  EQU   SABAAS+4                                                 02559000
@NM00012 EQU   SABAAS+2                                                 02560000
SABAAST  EQU   SABAAS                                                   02561000
SABAAS0  EQU   SABAAS                                                   02562000
SABARDX  EQU   SABA+8                                                   02563000
@NM00011 EQU   SABA+2                                                   02564000
SABARID  EQU   SABA                                                     02565000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      02566000
@RT00179 EQU   LBLSCAN2                                                 02567000
@RF00179 EQU   LBLSCAN8                                                 02568000
@RT00222 EQU   LBLSCAN8                                                 02569000
@RT00225 EQU   LBLSCAN7                                                 02570000
@RC00245 EQU   @RC00243                                                 02571000
@RC00262 EQU   @RC00260                                                 02572000
@RT00300 EQU   EXIT                                                     02573000
@RT00330 EQU   PCHKEXIT                                                 02574000
@ENDDATA EQU   *                                                        02575000
         END   BLSVUCB,(C'PLS2104',0701,78069)                          02576000
./  ADD  SSI=80690148,NAME=BLSVXTLS
XXTL     TITLE 'BLSVXTLS--SCAN EXTENT LIST (XTLST)                     *00001000
                        '                                               00002000
*/* CHANGE ACTIVITY -------------------------------------------------*/ 00003000
*/*   THIS MODULE WAS WRITTEN FOR @G57LPLK                           */ 00004000
*/*------------------------------------------------------------------*/ 00005000
BLSVXTLS CSECT ,                                                   0002 00006000
@MAINENT DS    0H                                                  0002 00007000
         USING *,@15                                               0002 00008000
         B     @PROLOG                                             0002 00009000
         DC    AL1(16)                                             0002 00010000
         DC    C'BLSVXTLS  78.069'                                 0002 00011000
         DROP  @15                                                      00012000
@PROLOG  STM   @14,@12,12(@13)                                     0002 00013000
         BALR  @12,0                                               0002 00014000
@PSTART  DS    0H                                                  0002 00015000
         USING @PSTART,@12                                         0002 00016000
         L     @00,@SIZDATD                                        0002 00017000
         BLSUALLS R,LV=(0)                                              00018000
         LR    @11,@01                                             0002 00019000
         LA    @10,4095(,@11)                                      0002 00020000
         USING @DATD,@11                                           0002 00021000
         USING @DATD+4095,@10                                      0002 00022000
         ST    @13,@SA00001+4                                      0002 00023000
         LM    @00,@01,20(@13)                                     0002 00024000
         ST    @11,8(,@13)                                         0002 00025000
         LR    @13,@11                                             0002 00026000
         MVC   @PC00001(12),0(@01)                                 0002 00027000
*/********************************************************************/ 00028000
*/*                                                                  */ 00029000
*/* BLSVXTLS--SCAN EXTENT LIST (XTLST)                               */ 00030000
*/*                                                                  */ 00031000
*/********************************************************************/ 00032000
*                                                                  0150 00033000
*   /*****************************************************************/ 00034000
*   /*                                                               */ 00035000
*   /* BLSV1--SCAN EXIT SETUP                                        */ 00036000
*   /*                                                               */ 00037000
*   /*****************************************************************/ 00038000
*                                                                  0150 00039000
*   DO;                             /* BLSV1                         */ 00040000
*     RESPECIFY                                                    0151 00041000
*      (RF) RESTRICTED;             /* RETURN CODES                  */ 00042000
*     RETC=ZZZFLAGI;                /* RETURN CODE                   */ 00043000
         SLR   RETC,RETC                                           0152 00044000
*     SABAPTR=ADDR(SAPA);           /* ->SABA (ALIAS FOR SAPA        */ 00045000
         L     SABAPTR,@PC00001+4                                  0153 00046000
*     IF SABASF1=ZZZ1 THEN          /* SCAN STARTED                  */ 00047000
         TM    SABASF1(SABAPTR),B'10000000'                        0154 00048000
         BNO   @RF00154                                            0154 00049000
*       IF                          /* IMAGE RETRIEVAL REQUIRED      */ 00050000
*           SABASF9=ZZZ0|           /* SCAN NOT COMPLETE             */ 00051000
*           (SABASFS=ZZZ1&ZZ2ASE<=SABASRC) THEN/* IMAGE USED FOR   0155 00052000
*                                      MESSAGES                      */ 00053000
         TM    SABASF9(SABAPTR),B'01000000'                        0155 00054000
         BZ    @RT00155                                            0155 00055000
         TM    SABASFS(SABAPTR),B'00010000'                        0155 00056000
         BNO   @RF00155                                            0155 00057000
         CLC   ZZ2ASE(1,R9),SABASRC(SABAPTR)                       0155 00058000
         BNH   @RT00155                                            0155 00059000
*         GO TO LBLSCAN2;           /* IMAGE RETRIEVAL               */ 00060000
*       ELSE                        /* NO IMAGE RETRIEVAL            */ 00061000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00062000
         B     LBLSCAN8                                            0157 00063000
*     SABAGMT=ZZ2TOD;               /* REQUEST DATA BASE UPDATE      */ 00064000
@RF00154 MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0158 00065000
*     SABACL=(LENGTH(ERRF)/8)*DIM(ERRF);/* LENGTH OF SABACT          */ 00066000
*                                                                  0159 00067000
         MVC   SABACL(2,SABAPTR),@CH00442                          0159 00068000
*     /***************************************************************/ 00069000
*     /*                                                             */ 00070000
*     /* CLEAR ALL ERROR FLAGS                                       */ 00071000
*     /*                                                             */ 00072000
*     /***************************************************************/ 00073000
*                                                                  0160 00074000
*     DO ERRFNDX=1 TO DIM(ERRF);    /* CLEAR ALL ERROR FLAGS         */ 00075000
         LA    ERRFNDX,1                                           0160 00076000
@DL00160 DS    0H                                                  0161 00077000
*       ERRF(ERRFNDX)='00'X;        /* ONE BYTE AT A TIME            */ 00078000
         LR    @14,SABAPTR                                         0161 00079000
         ALR   @14,ERRFNDX                                         0161 00080000
         MVI   ERRF-1(@14),X'00'                                   0161 00081000
*     END;                          /* CLEAR ALL ERROR FLAGS         */ 00082000
         AL    ERRFNDX,@CF00051                                    0162 00083000
         C     ERRFNDX,@CF00442                                    0162 00084000
         BNH   @DL00160                                            0162 00085000
*     IF SABALAD//8¬=0 THEN         /* UNALIGNED                     */ 00086000
*                                                                  0163 00087000
         L     @14,SABALAD(,SABAPTR)                               0163 00088000
         N     @14,@CF00442                                        0163 00089000
         LTR   @14,@14                                             0163 00090000
         BZ    @RF00163                                            0163 00091000
*       /*************************************************************/ 00092000
*       /*                                                           */ 00093000
*       /* UNALIGNED                                                 */ 00094000
*       /*                                                           */ 00095000
*       /*************************************************************/ 00096000
*                                                                  0164 00097000
*       DO;                         /* UNALIGNED                     */ 00098000
*         ERRFB(TST109)=ZZZ1;       /* UNALIGNED STORAGE ERROR       */ 00099000
         OI    ERRFB(SABAPTR),B'10000000'                          0165 00100000
*         SABASRC=ZZZFLAGS;         /* SCAN RETURN CODE              */ 00101000
         MVI   SABASRC(SABAPTR),X'0C'                              0166 00102000
*         SABASF1=ZZZ1;             /* SCAN STARTED                  */ 00103000
*         SABASF9=ZZZ1;             /* SCAN COMPLETED                */ 00104000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00105000
         OI    SABASF1(SABAPTR),B'11100000'                        0169 00106000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00107000
         B     LBLSCAN8                                            0170 00108000
*       END;                        /* UNALIGNED                     */ 00109000
*   END;                            /* BLSV1                         */ 00110000
@RF00163 DS    0H                                                  0173 00111000
*   IF SABAAST=ZZZASTCV THEN        /* VIRTUAL STORAGE               */ 00112000
         CLC   SABAAST(2,SABAPTR),@CC00083                         0173 00113000
         BNE   @RF00173                                            0173 00114000
*     DO;                           /* BLSVM0 MF(EXECUTE,TST110)     */ 00115000
*       IF SABALAD<ZZ6DPRP THEN                                    0175 00116000
         L     @14,ZZ2AZZ6P(,R9)                                   0175 00117000
         CLC   SABALAD(4,SABAPTR),ZZ6DPRP(@14)                     0175 00118000
         BNL   @RF00175                                            0175 00119000
*         DO;                       /* INITIAL ANALYSIS ERROR        */ 00120000
*           ERRFB(TST110)=ZZZ1;                                    0177 00121000
         OI    ERRFB+2(SABAPTR),B'10000000'                        0177 00122000
*           SABASRC=MAX(SABASRC,MSGLEVEL(TST110));                 0178 00123000
         SLR   @14,@14                                             0178 00124000
         IC    @14,SABASRC(,SABAPTR)                               0178 00125000
         SLR   @08,@08                                             0178 00126000
         IC    @08,MSGLEVEL+2                                      0178 00127000
         CR    @14,@08                                             0178 00128000
         BNL   *+6                                                      00129000
         LR    @14,@08                                             0178 00130000
         STC   @14,SABASRC(,SABAPTR)                               0178 00131000
*           SABASF1=ZZZ1;           /* ANALYSIS STARTED              */ 00132000
*           SABASF9=ZZZ1;           /* ANALYSIS COMPLETE             */ 00133000
*           SABASFI=ZZZ1;           /* INITIAL ANALYSIS ERROR        */ 00134000
         OI    SABASF1(SABAPTR),B'11100000'                        0181 00135000
*           SABAGMT=ZZ2TOD;         /* REQUEST DATA BASE UPDATE      */ 00136000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0182 00137000
*           GO TO LBLSCAN8;         /* TRANSMIT SCAN MESSAGE(S)      */ 00138000
         B     LBLSCAN8                                            0183 00139000
*         END;                      /* INITIAL ANALYSIS ERROR        */ 00140000
*     END;                          /* BLSVM0 MF(EXECUTE,TST110)     */ 00141000
*                                                                  0185 00142000
@RF00175 DS    0H                                                  0186 00143000
*   /*****************************************************************/ 00144000
*   /*                                                               */ 00145000
*   /* BLSV2--RETRIEVE IMAGE OF BLOCK TO BE SCANNED                  */ 00146000
*   /*                                                               */ 00147000
*   /*****************************************************************/ 00148000
*                                                                  0186 00149000
*LBLSCAN2:                                                         0186 00150000
*   DO;                             /* BLSV2                         */ 00151000
@RF00173 DS    0H                                                  0186 00152000
LBLSCAN2 DS    0H                                                  0187 00153000
*     ESAU(1:LENGTH(ESCO))=ESCO;    /* INITIALIZE ES RECORD          */ 00154000
         L     @14,ZZ2ESSYP(,R9)                                   0187 00155000
         MVC   ESAU(182),ESCO(@14)                                 0187 00156000
*     ESAUAS=SABAAS;                /* ADDRESS SPACE                 */ 00157000
         MVC   ESAUAS(16),SABAAS(SABAPTR)                          0188 00158000
*     ESAULAD=SABALAD;              /* LOGICAL ADDRESS               */ 00159000
         L     @14,SABALAD(,SABAPTR)                               0189 00160000
         ST    @14,ESAULAD                                         0189 00161000
*     ESAUDT=SABADT;                /* DATA TYPE                     */ 00162000
         MVC   ESAUDT(34),SABADT(SABAPTR)                          0190 00163000
*     ESAUDLE=LENGTH(BUF);          /* LENGTH                        */ 00164000
         MVC   ESAUDLE(4),@CF00062                                 0191 00165000
*     CALL BLSRACCQ(ZZ2,ESAU,BUF);  /* RETRIEVE STORAGE              */ 00166000
         ST    R9,@AL00001                                         0192 00167000
         LA    @14,ESAU                                            0192 00168000
         ST    @14,@AL00001+4                                      0192 00169000
         LA    @14,BUF                                             0192 00170000
         ST    @14,@AL00001+8                                      0192 00171000
         L     @08,ZZ2RVTP(,R9)                                    0192 00172000
         L     @15,RVTACCQP(,@08)                                  0192 00173000
         LA    @01,@AL00001                                        0192 00174000
         BALR  @14,@15                                             0192 00175000
*     IF ESAUFSM=ZZZ1 THEN          /* STORAGE NOT AVAILABLE         */ 00176000
*                                                                  0193 00177000
         TM    ESAUFSM,B'00100000'                                 0193 00178000
         BNO   @RF00193                                            0193 00179000
*       /*************************************************************/ 00180000
*       /*                                                           */ 00181000
*       /* STORAGE NOT AVAILABLE                                     */ 00182000
*       /*                                                           */ 00183000
*       /*************************************************************/ 00184000
*                                                                  0194 00185000
*       DO;                         /* STORAGE NOT AVAILABLE         */ 00186000
*         IF ZZ1EVEP=ZZZ1 THEN      /* EARLY TERMINATION REQUESTED   */ 00187000
*                                                                  0195 00188000
         L     @14,ZZ2ZZ1P(,R9)                                    0195 00189000
         TM    ZZ1EVEP(@14),B'01000000'                            0195 00190000
         BNO   @RF00195                                            0195 00191000
*           /*********************************************************/ 00192000
*           /*                                                       */ 00193000
*           /* EARLY TERMINATION REQUESTED                           */ 00194000
*           /*                                                       */ 00195000
*           /*********************************************************/ 00196000
*                                                                  0196 00197000
*           DO;                     /* EARLY TERMINATION REQUESTED   */ 00198000
*             RETC=ZZZFLAGS;        /* RETURN CODE                   */ 00199000
         LA    RETC,12                                             0197 00200000
*             GO TO EXIT;           /* COMMON EXIT PATH              */ 00201000
         B     EXIT                                                0198 00202000
*           END;                    /* EARLY TERMINATION REQUESTED   */ 00203000
*         ERRFB(TST108)=ZZZ1;       /* STORAGE NOT AVAILABLE         */ 00204000
@RF00195 OI    ERRFB+1(SABAPTR),B'10000000'                        0200 00205000
*         SABASRC=MAX(SABASRC,ZZZFLAGW);/* SCAN RETURN CODE          */ 00206000
         SLR   @14,@14                                             0201 00207000
         IC    @14,SABASRC(,SABAPTR)                               0201 00208000
         LA    @08,4                                               0201 00209000
         CR    @14,@08                                             0201 00210000
         BNL   *+6                                                      00211000
         LR    @14,@08                                             0201 00212000
         STC   @14,SABASRC(,SABAPTR)                               0201 00213000
*         SABASF1=ZZZ1;             /* SCAN STARTED                  */ 00214000
*         SABASF9=ZZZ1;             /* SCAN COMPLETE                 */ 00215000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00216000
         OI    SABASF1(SABAPTR),B'11100000'                        0204 00217000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00218000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0205 00219000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00220000
         B     LBLSCAN8                                            0206 00221000
*       END;                        /* STORAGE NOT AVAILABLE         */ 00222000
*     XTLSTPTR=ADDR(BUF);           /* ->IMAGE                       */ 00223000
@RF00193 LA    XTLSTPTR,BUF                                        0208 00224000
*     IF SABASF9=ZZZ1 THEN          /* SCAN COMPLETED                */ 00225000
         TM    SABASF9(SABAPTR),B'01000000'                        0209 00226000
         BO    @RT00209                                            0209 00227000
*       GO TO LBLSCAN8;             /* TRANSMIT SCAN MESSAGE(S)      */ 00228000
*     SABASF9=ZZZ1;                 /* SCAN COMPLETED                */ 00229000
         OI    SABASF9(SABAPTR),B'01000000'                        0211 00230000
*   END;                            /* BLSV2                         */ 00231000
*   SABAF=ESAUD;                    /* STORAGE ATTRIBUTES            */ 00232000
         MVC   SABAF(60,SABAPTR),ESAUD                             0213 00233000
*   SABAFLE=XTLLNTH;                /* LENGTH                        */ 00234000
         L     @14,XTLLNTH(,XTLSTPTR)                              0214 00235000
         ST    @14,SABAFLE(,SABAPTR)                               0214 00236000
*   DO;                             /* BLSVM0 MF(EXECUTE,TST111)     */ 00237000
*     IF XTLNRFAC¬=1 THEN                                          0216 00238000
         CLC   XTLNRFAC(4,XTLSTPTR),@CF00051                       0216 00239000
         BE    @RF00216                                            0216 00240000
*       DO;                         /* INITIAL ANALYSIS ERROR        */ 00241000
*         ERRFB(TST111)=ZZZ1;                                      0218 00242000
         OI    ERRFB+3(SABAPTR),B'10000000'                        0218 00243000
*         SABASRC=MAX(SABASRC,MSGLEVEL(TST111));                   0219 00244000
         SLR   @14,@14                                             0219 00245000
         IC    @14,SABASRC(,SABAPTR)                               0219 00246000
         SLR   @08,@08                                             0219 00247000
         IC    @08,MSGLEVEL+3                                      0219 00248000
         CR    @14,@08                                             0219 00249000
         BNL   *+6                                                      00250000
         LR    @14,@08                                             0219 00251000
         STC   @14,SABASRC(,SABAPTR)                               0219 00252000
*         SABASF1=ZZZ1;             /* ANALYSIS STARTED              */ 00253000
*         SABASF9=ZZZ1;             /* ANALYSIS COMPLETE             */ 00254000
*         SABASFI=ZZZ1;             /* INITIAL ANALYSIS ERROR        */ 00255000
         OI    SABASF1(SABAPTR),B'11100000'                        0222 00256000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00257000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0223 00258000
*         GO TO LBLSCAN8;           /* TRANSMIT SCAN MESSAGE(S)      */ 00259000
         B     LBLSCAN8                                            0224 00260000
*       END;                        /* INITIAL ANALYSIS ERROR        */ 00261000
*   END;                            /* BLSVM0 MF(EXECUTE,TST111)     */ 00262000
@RF00216 DS    0H                                                  0227 00263000
*   IF SABALAD<ZZ6DPRP|SABALAD>=ZZ6DCAP THEN/* COMMON AREA XTLST     */ 00264000
         L     @14,SABALAD(,SABAPTR)                               0227 00265000
         L     @08,ZZ2AZZ6P(,R9)                                   0227 00266000
         CL    @14,ZZ6DPRP(,@08)                                   0227 00267000
         BL    @RT00227                                            0227 00268000
         CL    @14,ZZ6DCAP(,@08)                                   0227 00269000
         BL    @RF00227                                            0227 00270000
@RT00227 DS    0H                                                  0228 00271000
*     DO;                           /* BLSVM0 MF(EXECUTE,TST112)     */ 00272000
*       IF XTLMSBAD>=ZZ6DPRP&XTLMSBAD<ZZ6DCAP THEN                 0229 00273000
         L     @14,XTLMSBAD-1(,XTLSTPTR)                           0229 00274000
         LA    @14,0(,@14)                                         0229 00275000
         L     @08,ZZ2AZZ6P(,R9)                                   0229 00276000
         C     @14,ZZ6DPRP(,@08)                                   0229 00277000
         BL    @RF00229                                            0229 00278000
         C     @14,ZZ6DCAP(,@08)                                   0229 00279000
         BNL   @RF00229                                            0229 00280000
*         DO;                       /* INITIAL ANALYSIS ERROR        */ 00281000
*           ERRFB(TST112)=ZZZ1;                                    0231 00282000
         OI    ERRFB+4(SABAPTR),B'10000000'                        0231 00283000
*           SABASRC=MAX(SABASRC,MSGLEVEL(TST112));                 0232 00284000
         SLR   @14,@14                                             0232 00285000
         IC    @14,SABASRC(,SABAPTR)                               0232 00286000
         SLR   @08,@08                                             0232 00287000
         IC    @08,MSGLEVEL+4                                      0232 00288000
         CR    @14,@08                                             0232 00289000
         BNL   *+6                                                      00290000
         LR    @14,@08                                             0232 00291000
         STC   @14,SABASRC(,SABAPTR)                               0232 00292000
*           SABASF1=ZZZ1;           /* ANALYSIS STARTED              */ 00293000
*           SABASF9=ZZZ1;           /* ANALYSIS COMPLETE             */ 00294000
*           SABASFI=ZZZ1;           /* INITIAL ANALYSIS ERROR        */ 00295000
         OI    SABASF1(SABAPTR),B'11100000'                        0235 00296000
*           SABAGMT=ZZ2TOD;         /* REQUEST DATA BASE UPDATE      */ 00297000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0236 00298000
*           GO TO LBLSCAN8;         /* TRANSMIT SCAN MESSAGE(S)      */ 00299000
         B     LBLSCAN8                                            0237 00300000
*         END;                      /* INITIAL ANALYSIS ERROR        */ 00301000
*     END;                          /* BLSVM0 MF(EXECUTE,TST112)     */ 00302000
*   ELSE                            /* COMMON AREA XTLST             */ 00303000
*     DO;                           /* BLSVM0 MF(EXECUTE,TST113)     */ 00304000
         B     @RC00227                                            0240 00305000
@RF00227 DS    0H                                                  0241 00306000
*       IF XTLMSBAD<ZZ6DPRP|XTLMSBAD>=ZZ6DCAP THEN                 0241 00307000
         L     @14,XTLMSBAD-1(,XTLSTPTR)                           0241 00308000
         LA    @14,0(,@14)                                         0241 00309000
         L     @08,ZZ2AZZ6P(,R9)                                   0241 00310000
         C     @14,ZZ6DPRP(,@08)                                   0241 00311000
         BL    @RT00241                                            0241 00312000
         C     @14,ZZ6DCAP(,@08)                                   0241 00313000
         BL    @RF00241                                            0241 00314000
@RT00241 DS    0H                                                  0242 00315000
*         DO;                       /* INITIAL ANALYSIS ERROR        */ 00316000
*           ERRFB(TST113)=ZZZ1;                                    0243 00317000
         OI    ERRFB+5(SABAPTR),B'10000000'                        0243 00318000
*           SABASRC=MAX(SABASRC,MSGLEVEL(TST113));                 0244 00319000
         SLR   @14,@14                                             0244 00320000
         IC    @14,SABASRC(,SABAPTR)                               0244 00321000
         SLR   @08,@08                                             0244 00322000
         IC    @08,MSGLEVEL+5                                      0244 00323000
         CR    @14,@08                                             0244 00324000
         BNL   *+6                                                      00325000
         LR    @14,@08                                             0244 00326000
         STC   @14,SABASRC(,SABAPTR)                               0244 00327000
*           SABASF1=ZZZ1;           /* ANALYSIS STARTED              */ 00328000
*           SABASF9=ZZZ1;           /* ANALYSIS COMPLETE             */ 00329000
*           SABASFI=ZZZ1;           /* INITIAL ANALYSIS ERROR        */ 00330000
         OI    SABASF1(SABAPTR),B'11100000'                        0247 00331000
*           SABAGMT=ZZ2TOD;         /* REQUEST DATA BASE UPDATE      */ 00332000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0248 00333000
*           GO TO LBLSCAN8;         /* TRANSMIT SCAN MESSAGE(S)      */ 00334000
         B     LBLSCAN8                                            0249 00335000
*         END;                      /* INITIAL ANALYSIS ERROR        */ 00336000
*     END;                          /* BLSVM0 MF(EXECUTE,TST113)     */ 00337000
@RF00241 DS    0H                                                  0252 00338000
*   DO;                             /* BLSVM1 MF(EXECUTE,TST114)     */ 00339000
@RC00227 DS    0H                                                  0253 00340000
*     IF XTLMSBLN>'13FFFF'X THEN                                   0253 00341000
         CLC   XTLMSBLN(3,XTLSTPTR),@CF01379+1                     0253 00342000
         BNH   @RF00253                                            0253 00343000
*       DO;                         /* MAIN ANALYSIS ERROR           */ 00344000
*         ERRFB(TST114)=ZZZ1;                                      0255 00345000
         OI    ERRFB+6(SABAPTR),B'10000000'                        0255 00346000
*         SABASRC=MAX(SABASRC,MSGLEVEL(TST114));                   0256 00347000
         SLR   @14,@14                                             0256 00348000
         IC    @14,SABASRC(,SABAPTR)                               0256 00349000
         SLR   @08,@08                                             0256 00350000
         IC    @08,MSGLEVEL+6                                      0256 00351000
         CR    @14,@08                                             0256 00352000
         BNL   *+6                                                      00353000
         LR    @14,@08                                             0256 00354000
         STC   @14,SABASRC(,SABAPTR)                               0256 00355000
*         SABAGMT=ZZ2TOD;           /* REQUEST DATA BASE UPDATE      */ 00356000
         MVC   SABAGMT(8,SABAPTR),ZZ2TOD(R9)                       0257 00357000
*       END;                        /* MAIN ANALYSIS ERROR           */ 00358000
*   END;                            /* BLSVM1 MF(EXECUTE,TST114)     */ 00359000
*                                                                  0259 00360000
@RF00253 DS    0H                                                  0260 00361000
*   /*****************************************************************/ 00362000
*   /*                                                               */ 00363000
*   /* BLSV89--SCAN EXIT MESSAGE TRANSMISSION AND EPILOG             */ 00364000
*   /*                                                               */ 00365000
*   /*****************************************************************/ 00366000
*                                                                  0260 00367000
*LBLSCAN8:                                                         0260 00368000
*   DO;                             /* BLSV89                        */ 00369000
*                                                                  0260 00370000
LBLSCAN8 DS    0H                                                  0261 00371000
*     /***************************************************************/ 00372000
*     /*                                                             */ 00373000
*     /* BLSV8--TRANSMIT SCAN MESSAGE(S)                             */ 00374000
*     /*                                                             */ 00375000
*     /***************************************************************/ 00376000
*                                                                  0261 00377000
*     DO;                           /* BLSV8                         */ 00378000
*       SABASF1=ZZZ1;               /* SCAN STARTED                  */ 00379000
         OI    SABASF1(SABAPTR),B'10000000'                        0262 00380000
*       IF SABASRC=ZZZFLAGI|SABASRC<ZZ2ASE|ZZ1EVEP=ZZZ1 THEN       0263 00381000
         CLI   SABASRC(SABAPTR),0                                  0263 00382000
         BE    @RT00263                                            0263 00383000
         CLC   SABASRC(1,SABAPTR),ZZ2ASE(R9)                       0263 00384000
         BL    @RT00263                                            0263 00385000
         L     @14,ZZ2ZZ1P(,R9)                                    0263 00386000
         TM    ZZ1EVEP(@14),B'01000000'                            0263 00387000
         BO    @RT00263                                            0263 00388000
*         GO TO EXIT;               /* COMMON EXIT PATH              */ 00389000
*       CALL BLSRSAPC(ZZ2,SABA,SABK);/* IDENTIFY DAMAGED AREA        */ 00390000
*                                                                  0265 00391000
         ST    R9,@AL00001                                         0265 00392000
         ST    SABAPTR,@AL00001+4                                  0265 00393000
         L     @14,@PC00001+8                                      0265 00394000
         ST    @14,@AL00001+8                                      0265 00395000
         L     @08,ZZ2RVTP(,R9)                                    0265 00396000
         L     @15,RVTSAPCP(,@08)                                  0265 00397000
         LA    @01,@AL00001                                        0265 00398000
         BALR  @14,@15                                             0265 00399000
*       /*************************************************************/ 00400000
*       /*                                                           */ 00401000
*       /* PROCESS UNIQUE MESSAGES                                   */ 00402000
*       /*                                                           */ 00403000
*       /*************************************************************/ 00404000
*                                                                  0266 00405000
*       DO ERRFNDX=1 TO DIM(MSGPTR);/* PROCESS UNIQUE MESSAGES       */ 00406000
         LA    ERRFNDX,1                                           0266 00407000
@DL00266 DS    0H                                                  0267 00408000
*         IF ERRFB(ERRFNDX)=ZZZ1&MSGLEVEL(ERRFNDX)>=ZZ2ASE THEN    0267 00409000
         LR    @14,SABAPTR                                         0267 00410000
         ALR   @14,ERRFNDX                                         0267 00411000
         TM    ERRFB-1(@14),B'10000000'                            0267 00412000
         BNO   @RF00267                                            0267 00413000
         SLR   @14,@14                                             0267 00414000
         IC    @14,MSGLEVEL-1(ERRFNDX)                             0267 00415000
         SLR   @08,@08                                             0267 00416000
         IC    @08,ZZ2ASE(,R9)                                     0267 00417000
         CR    @14,@08                                             0267 00418000
         BL    @RF00267                                            0267 00419000
*           CALL BLSUPUTV(ZZ2,MSGPTR(ERRFNDX)->VRBA);              0268 00420000
         ST    R9,@AL00001                                         0268 00421000
         LR    @14,ERRFNDX                                         0268 00422000
         SLA   @14,2                                               0268 00423000
         L     @14,MSGPTR-4(@14)                                   0268 00424000
         ST    @14,@AL00001+4                                      0268 00425000
         L     @08,ZZ2BVTP(,R9)                                    0268 00426000
         L     @15,BVTPUTVP(,@08)                                  0268 00427000
         LA    @01,@AL00001                                        0268 00428000
         BALR  @14,@15                                             0268 00429000
*       END;                        /* PROCESS UNIQUE MESSAGES       */ 00430000
@RF00267 AL    ERRFNDX,@CF00051                                    0269 00431000
         C     ERRFNDX,@CF00442                                    0269 00432000
         BNH   @DL00266                                            0269 00433000
*     END;                          /* BLSV8                         */ 00434000
*                                                                  0270 00435000
*     /***************************************************************/ 00436000
*     /*                                                             */ 00437000
*     /* BLSV9--SCAN EPILOG                                          */ 00438000
*     /*                                                             */ 00439000
*     /***************************************************************/ 00440000
*                                                                  0271 00441000
*EXIT:                                                             0271 00442000
*     RETURN CODE(RETC);                                           0271 00443000
EXIT     L     @13,4(,@13)                                         0271 00444000
         L     @00,@SIZDATD                                        0271 00445000
         LR    @01,@11                                             0271 00446000
         BLSUFRES R,LV=(0),A=(1)                                        00447000
         LR    @15,@05                                             0271 00448000
         L     @14,12(,@13)                                        0271 00449000
         LM    @00,@12,20(@13)                                     0271 00450000
         BR    @14                                                 0271 00451000
*   END;                            /* BLSV89                        */ 00452000
*/*BLSVPEND--SCAN EXIT                                               */ 00453000
*/*BLSRPEND--DEBUGGING MODULE                                        */ 00454000
*/*BLSUPEND--MVS IPCS MODULE                                         */ 00455000
*                                                                  0273 00456000
*   DECLARE                         /* COMMON VARIABLES              */ 00457000
*     I256C CHAR(256) BASED,                                       0273 00458000
*     I031F FIXED(31) BASED,                                       0273 00459000
*     I031P PTR(31) BASED,                                         0273 00460000
*     I015F FIXED(15) BASED,                                       0273 00461000
*     I015P PTR(15) BASED,                                         0273 00462000
*     I008P PTR(8) BASED,                                          0273 00463000
*     I001C CHAR(1) BASED;                                         0273 00464000
*   GENERATE NODEFS NOREFS DATA;                                   0274 00465000
*   END BLSVXTLS                    /* BLRPEND(BLSVXTLS)             */ 00466000
*                                                                  0275 00467000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00468000
*/*%INCLUDE SYSLIB  (BLSRZZZ )                                       */ 00469000
*/*%INCLUDE SYSLIB  (BLSUZZZ )                                       */ 00470000
*/*%INCLUDE SYSLIB  (BLRFULL )                                       */ 00471000
*/*%INCLUDE SYSLIB  (IKJCPPL )                                       */ 00472000
*/*%INCLUDE SYSLIB  (IKJPSCB )                                       */ 00473000
*/*%INCLUDE SYSLIB  (IKJECT  )                                       */ 00474000
*/*%INCLUDE SYSLIB  (IKJUPT  )                                       */ 00475000
*/*%INCLUDE SYSLIB  (BLSUSERV)                                       */ 00476000
*/*%INCLUDE SYSLIB  (BLRSERV )                                       */ 00477000
*/*%INCLUDE SYSLIB  (BLRSERVD)                                       */ 00478000
*/*%INCLUDE SYSLIB  (BLSRSERV)                                       */ 00479000
*/*%INCLUDE SYSLIB  (IHAXTLST)                                       */ 00480000
*                                                                  0275 00481000
*       ;                                                          0275 00482000
@EL00001 L     @13,4(,@13)                                         0275 00483000
@EF00001 L     @00,@SIZDATD                                        0275 00484000
         LR    @01,@11                                             0275 00485000
         BLSUFRES R,LV=(0),A=(1)                                        00486000
@ER00001 LM    @14,@12,12(@13)                                     0275 00487000
         BR    @14                                                 0275 00488000
@DATA    DS    0H                                                       00489000
@DATD    DSECT                                                          00490000
         DS    0F                                                       00491000
@SA00001 DS    18F                                                      00492000
@PC00001 DS    3F                                                       00493000
@AL00001 DS    3A                                                       00494000
BLSVXTLS CSECT                                                          00495000
         DS    0F                                                       00496000
@CF00051 DC    F'1'                                                     00497000
@CF00442 DC    F'7'                                                     00498000
@CH00442 EQU   @CF00442+2                                               00499000
@CF00062 DC    F'16'                                                    00500000
@CF01379 DC    XL4'13FFFF'                                              00501000
@DATD    DSECT                                                          00502000
         DS    0D                                                       00503000
ESAU     DS    CL694                                                    00504000
         ORG   ESAU                                                     00505000
ESAURID  DS    CL2                                                      00506000
@NM00031 DS    BL6                                                      00507000
@NM00032 DS    CL8                                                      00508000
@NM00033 DS    BL8                                                      00509000
ESAURDX  DS    FL4                                                      00510000
ESAUSYM  DS    CL31                                                     00511000
ESAUELK  DS    0C                                                       00512000
ESAURV1  DS    CL1                                                      00513000
ESAUAS   DS    CL16                                                     00514000
         ORG   ESAUAS                                                   00515000
ESAUAS0  DS    0C                                                       00516000
ESAUAST  DS    CL2                                                      00517000
@NM00034 DS    BL2                                                      00518000
ESAUAS1  DS    FL4                                                      00519000
ESAUAS2  DS    FL4                                                      00520000
@NM00035 DS    BL4                                                      00521000
ESAUAS9  DS    0C                                                       00522000
         ORG   ESAU+76                                                  00523000
ESAULAD  DS    AL4                                                      00524000
ESAUD    DS    CL60                                                     00525000
         ORG   ESAUD                                                    00526000
ESAUD00  DS    0C                                                       00527000
ESAUDOF  DS    FL4                                                      00528000
ESAUDLE  DS    FL4                                                      00529000
ESAUDOB  DS    FL1                                                      00530000
ESAUDLB  DS    FL1                                                      00531000
ESAUDT   DS    CL34                                                     00532000
         ORG   ESAUDT                                                   00533000
ESAUDT0  DS    0C                                                       00534000
ESAUDTY  DS    CL1                                                      00535000
@NM00036 DS    BL1                                                      00536000
ESAUDTD  DS    CL31                                                     00537000
ESAUDTE  DS    CL1                                                      00538000
ESAUDT9  DS    0C                                                       00539000
         ORG   ESAUD+44                                                 00540000
ESAUDIM  DS    FL4                                                      00541000
ESAUDIL  DS    FL4                                                      00542000
ESAUDF   DS    BL4                                                      00543000
         ORG   ESAUDF                                                   00544000
ESAUDFA  DS    BL1                                                      00545000
@NM00037 EQU   ESAUDF+0                                                 00546000
         ORG   ESAUD+56                                                 00547000
@NM00038 DS    BL4                                                      00548000
ESAUD99  DS    0C                                                       00549000
         ORG   ESAU+140                                                 00550000
ESAUMAD  DS    AL4                                                      00551000
@NM00039 DS    BL16                                                     00552000
ESAUKEY  DS    BL1                                                      00553000
ESAUF    DS    BL3                                                      00554000
         ORG   ESAUF                                                    00555000
ESAUFS   DS    BL1                                                      00556000
         ORG   ESAUFS                                                   00557000
ESAUFSC  DS    BL1                                                      00558000
ESAUFS2  EQU   ESAUFS+0                                                 00559000
ESAUFSM  EQU   ESAUFS+0                                                 00560000
ESAUFSA  EQU   ESAUFS+0                                                 00561000
ESAUFSP  EQU   ESAUFS+0                                                 00562000
ESAUFSR  EQU   ESAUFS+0                                                 00563000
ESAUFSX  EQU   ESAUFS+0                                                 00564000
ESAUFSS  EQU   ESAUFS+0                                                 00565000
         ORG   ESAUF+1                                                  00566000
ESAUFC   DS    BL1                                                      00567000
         ORG   ESAUFC                                                   00568000
ESAUFCD  DS    BL1                                                      00569000
@NM00040 EQU   ESAUFC+0                                                 00570000
         ORG   ESAUF+2                                                  00571000
@NM00041 DS    BL1                                                      00572000
         ORG   ESAU+164                                                 00573000
ESAUABS  DS    FL4                                                      00574000
@NM00042 DS    BL12                                                     00575000
ESAUR    DS    CL514                                                    00576000
         ORG   ESAUR                                                    00577000
ESAURL   DS    FL2                                                      00578000
ESAURT   DS    CL512                                                    00579000
         ORG   ESAURT                                                   00580000
ESAURT1  DS    CL512                                                    00581000
         ORG   ESAU+694                                                 00582000
ESAU999  DS    0C                                                       00583000
         ORG   ESAU+694                                                 00584000
         DS    CL2                                                      00585000
BUF      DS    CL16                                                     00586000
BLSVXTLS CSECT                                                          00587000
         DS    0F                                                       00588000
@SIZDATD DC    AL1(0)                                                   00589000
         DC    AL3(@ENDDATD-@DATD)                                      00590000
         DS    0D                                                       00591000
@CC00083 DC    C'CV'                                                    00592000
MV01     DS    CL48                                                     00593000
         ORG   MV01                                                     00594000
MV01L    DC    AL2(48)                                                  00595000
@NM00056 DC    X'0000'                                                  00596000
MV01T    DS    CL44                                                     00597000
         ORG   MV01T                                                    00598000
MV01TA   DC    CL9'BLS22109I'                                           00599000
MV01TB   DC    CL3' '                                                   00600000
MV01TC   DC    CL32'XTLST NOT ON DOUBLEWORD BOUNDARY'                   00601000
         ORG   MV01+48                                                  00602000
MV02     DS    CL41                                                     00603000
         ORG   MV02                                                     00604000
MV02L    DC    AL2(41)                                                  00605000
@NM00057 DC    X'0000'                                                  00606000
MV02T    DS    CL37                                                     00607000
         ORG   MV02T                                                    00608000
MV02TA   DC    CL9'BLS22108I'                                           00609000
MV02TB   DC    CL3' '                                                   00610000
MV02TC   DC    CL25'XTLST STORAGE NOT IN DUMP'                          00611000
         ORG   MV02+41                                                  00612000
         DS    CL1                                                      00613000
MV03     DS    CL64                                                     00614000
         ORG   MV03                                                     00615000
MV03L    DC    AL2(64)                                                  00616000
@NM00136 DC    X'0000'                                                  00617000
MV03T    DS    CL60                                                     00618000
         ORG   MV03T                                                    00619000
MV03TA   DC    CL9'BLS22110I'                                           00620000
MV03TB   DC    CL3' '                                                   00621000
MV03TC   DC    CL48'ADDRESS OF XTLST IS LESS THAN ADDRESS OF PRIVATE'   00622000
         ORG   MV03+64                                                  00623000
MV04     DS    CL36                                                     00624000
         ORG   MV04                                                     00625000
MV04L    DC    AL2(36)                                                  00626000
@NM00137 DC    X'0000'                                                  00627000
MV04T    DS    CL32                                                     00628000
         ORG   MV04T                                                    00629000
MV04TA   DC    CL9'BLS22111I'                                           00630000
MV04TB   DC    CL3' '                                                   00631000
MV04TC   DC    CL20'XTLNRFAC NOT EQUAL 1'                               00632000
         ORG   MV04+36                                                  00633000
MV05     DS    CL63                                                     00634000
         ORG   MV05                                                     00635000
MV05L    DC    AL2(63)                                                  00636000
@NM00138 DC    X'0000'                                                  00637000
MV05T    DS    CL59                                                     00638000
         ORG   MV05T                                                    00639000
MV05TA   DC    CL9'BLS22112I'                                           00640000
MV05TB   DC    CL3' '                                                   00641000
MV05TC   DC    CL47'COMMON AREA XTLST DESCRIBES PRIVATE AREA MODULE'    00642000
         ORG   MV05+63                                                  00643000
         DS    CL1                                                      00644000
MV06     DS    CL63                                                     00645000
         ORG   MV06                                                     00646000
MV06L    DC    AL2(63)                                                  00647000
@NM00139 DC    X'0000'                                                  00648000
MV06T    DS    CL59                                                     00649000
         ORG   MV06T                                                    00650000
MV06TA   DC    CL9'BLS22113I'                                           00651000
MV06TB   DC    CL3' '                                                   00652000
MV06TC   DC    CL47'PRIVATE AREA XTLST DESCRIBES COMMON AREA MODULE'    00653000
         ORG   MV06+63                                                  00654000
         DS    CL1                                                      00655000
MV07     DS    CL47                                                     00656000
         ORG   MV07                                                     00657000
MV07L    DC    AL2(47)                                                  00658000
@NM00140 DC    X'0000'                                                  00659000
MV07T    DS    CL43                                                     00660000
         ORG   MV07T                                                    00661000
MV07TA   DC    CL9'BLS22114I'                                           00662000
MV07TB   DC    CL3' '                                                   00663000
MV07TC   DC    CL31'XTLMSBLN GREATER THAN X''13FFFF'''                  00664000
         ORG   MV07+47                                                  00665000
         DS    CL1                                                      00666000
MSGPTR   DC    AL4(MV01)                                                00667000
         DC    AL4(MV02)                                                00668000
         DC    AL4(MV03)                                                00669000
         DC    AL4(MV04)                                                00670000
         DC    AL4(MV05)                                                00671000
         DC    AL4(MV06)                                                00672000
         DC    AL4(MV07)                                                00673000
MSGLEVEL DC    AL1(12)                                                  00674000
         DC    AL1(4)                                                   00675000
         DC    AL1(12)                                                  00676000
         DC    AL1(12)                                                  00677000
         DC    AL1(12)                                                  00678000
         DC    AL1(12)                                                  00679000
         DC    AL1(4)                                                   00680000
@DATD    DSECT                                                          00681000
         SPACE 2                                                        00682000
*********************************************************************** 00683000
* THE FOLLOWING AREA, BLRPATCH, IS RESERVED FOR PATCH APPLICATION     * 00684000
* TO OBTAIN PATCH ROOM IN THE @DATD AUTOMATIC STORAGE AREA, MODIFY    * 00685000
* CONSTANT @SIZDATD TO REFLECT THE DESIRED @DATD SIZE                 * 00686000
*********************************************************************** 00687000
         SPACE                                                          00688000
BLSVXTLS CSECT                                                          00689000
         ORG                                                            00690000
         DS    0D                                                       00691000
BLRPATCH DC    CL8'ZAPAREA',(((*-BLSVXTLS+19)/20+7)/8)CL8'BLSVXTLS'     00692000
@DATD    DSECT                                                          00693000
         DS    0H                                                       00694000
@DATD    DSECT                                                          00695000
         SPACE 2                                                        00696000
*********************************************************************** 00697000
* ALIGN END OF DATA ON A DOUBLEWORD BOUNDARY                          * 00698000
*********************************************************************** 00699000
         SPACE                                                          00700000
         DS    0D                                                       00701000
@DATD    DSECT                                                          00702000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                00703000
@ENDDATD EQU   *                                                        00704000
BLSVXTLS CSECT                                                          00705000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00706000
@01      EQU   01                                                       00707000
@02      EQU   02                                                       00708000
@03      EQU   03                                                       00709000
@04      EQU   04                                                       00710000
@05      EQU   05                                                       00711000
@06      EQU   06                                                       00712000
@07      EQU   07                                                       00713000
@08      EQU   08                                                       00714000
@09      EQU   09                                                       00715000
@10      EQU   10                                                       00716000
@11      EQU   11                                                       00717000
@12      EQU   12                                                       00718000
@13      EQU   13                                                       00719000
@14      EQU   14                                                       00720000
@15      EQU   15                                                       00721000
ERRFNDX  EQU   @04                                                      00722000
XTLSTPTR EQU   @04                                                      00723000
RETC     EQU   @05                                                      00724000
SABAPTR  EQU   @03                                                      00725000
R9       EQU   @09                                                      00726000
R0       EQU   @00                                                      00727000
R1       EQU   @01                                                      00728000
R2       EQU   @02                                                      00729000
R3       EQU   @03                                                      00730000
R4       EQU   @04                                                      00731000
R5       EQU   @05                                                      00732000
RB       EQU   @11                                                      00733000
RD       EQU   @13                                                      00734000
RE       EQU   @14                                                      00735000
RF       EQU   @15                                                      00736000
RA       EQU   @10                                                      00737000
RC       EQU   @12                                                      00738000
R6       EQU   @06                                                      00739000
R7       EQU   @07                                                      00740000
R8       EQU   @08                                                      00741000
SABA     EQU   0                                                        00742000
SABAAS   EQU   SABA+12                                                  00743000
SABAAST  EQU   SABAAS                                                   00744000
SABALAD  EQU   SABA+28                                                  00745000
SABADT   EQU   SABA+32                                                  00746000
SABAF    EQU   SABA+68                                                  00747000
SABAFLE  EQU   SABAF+4                                                  00748000
SABAFT   EQU   SABAF+10                                                 00749000
SABAFF   EQU   SABAF+52                                                 00750000
SABASF   EQU   SABA+128                                                 00751000
SABASF1  EQU   SABASF                                                   00752000
SABASF9  EQU   SABASF                                                   00753000
SABASFI  EQU   SABASF                                                   00754000
SABASFS  EQU   SABASF                                                   00755000
SABAGMT  EQU   SABA+136                                                 00756000
SABASRC  EQU   SABA+152                                                 00757000
SABAC    EQU   SABA+254                                                 00758000
SABACL   EQU   SABAC                                                    00759000
SABACT   EQU   SABAC+2                                                  00760000
ESCO     EQU   0                                                        00761000
ESCOAS   EQU   ESCO+60                                                  00762000
ESCOD    EQU   ESCO+80                                                  00763000
ESCODT   EQU   ESCOD+10                                                 00764000
ESCODF   EQU   ESCOD+52                                                 00765000
ESCOF    EQU   ESCO+161                                                 00766000
ESCOFS   EQU   ESCOF                                                    00767000
ESCOFC   EQU   ESCOF+1                                                  00768000
ESCOR    EQU   ESCO+180                                                 00769000
ESCORT   EQU   ESCOR+2                                                  00770000
VRBA     EQU   0                                                        00771000
VRBAT    EQU   VRBA+4                                                   00772000
ZZ1      EQU   0                                                        00773000
ZZ1ATTN  EQU   ZZ1+360                                                  00774000
ZZ1EVE   EQU   ZZ1ATTN+4                                                00775000
ZZ1EVEP  EQU   ZZ1EVE                                                   00776000
ZZ1F     EQU   ZZ1+368                                                  00777000
ZZ1N     EQU   ZZ1+1116                                                 00778000
ZZ2      EQU   0                                                        00779000
ZZ2AMD   EQU   ZZ2                                                      00780000
@NM00070 EQU   ZZ2AMD+7                                                 00781000
ZZ2PRT   EQU   ZZ2+138                                                  00782000
ZZ2PRTT  EQU   ZZ2PRT+4                                                 00783000
ZZ2PRTT1 EQU   ZZ2PRTT+1                                                00784000
ZZ2A     EQU   ZZ2+272                                                  00785000
ZZ2ASE   EQU   ZZ2A+2                                                   00786000
ZZ2AF    EQU   ZZ2A+16                                                  00787000
ZZ2APID  EQU   ZZ2A+64                                                  00788000
ZZ2AD    EQU   ZZ2A+74                                                  00789000
ZZ2ADD   EQU   ZZ2AD                                                    00790000
ZZ2ADDT  EQU   ZZ2ADD+2                                                 00791000
ZZ2ADM   EQU   ZZ2AD+46                                                 00792000
ZZ2ADMT  EQU   ZZ2ADM+2                                                 00793000
ZZ2ADP   EQU   ZZ2AD+56                                                 00794000
ZZ2ADPT  EQU   ZZ2ADP+2                                                 00795000
ZZ2AZZ6P EQU   ZZ2A+140                                                 00796000
ZZ2AQAS  EQU   ZZ2A+144                                                 00797000
ZZ2AQD   EQU   ZZ2A+160                                                 00798000
ZZ2AQDT  EQU   ZZ2AQD+10                                                00799000
ZZ2AQDF  EQU   ZZ2AQD+52                                                00800000
ZZ2STG   EQU   ZZ2+960                                                  00801000
ZZ2TOD   EQU   ZZ2+968                                                  00802000
ZZ2ALLOP EQU   ZZ2+992                                                  00803000
ZZ2FREEP EQU   ZZ2+996                                                  00804000
ZZ2FF19P EQU   ZZ2+1000                                                 00805000
ZZ2FRE1P EQU   ZZ2+1004                                                 00806000
ZZ2FF18P EQU   ZZ2+1008                                                 00807000
ZZ2DYNAP EQU   ZZ2+1012                                                 00808000
ZZ2ZZ2CP EQU   ZZ2+1016                                                 00809000
ZZ2ZZ2DP EQU   ZZ2+1020                                                 00810000
ZZ2STAIP EQU   ZZ2+1024                                                 00811000
ZZ2FF02P EQU   ZZ2+1028                                                 00812000
ZZ2GETLP EQU   ZZ2+1032                                                 00813000
ZZ2PARSP EQU   ZZ2+1036                                                 00814000
ZZ2PTGTP EQU   ZZ2+1040                                                 00815000
ZZ2PUTLP EQU   ZZ2+1044                                                 00816000
ZZ2SCANP EQU   ZZ2+1048                                                 00817000
ZZ2STCKP EQU   ZZ2+1052                                                 00818000
ZZ2TRMOP EQU   ZZ2+1064                                                 00819000
ZZ2TRMVP EQU   ZZ2+1068                                                 00820000
ZZ2PUTNP EQU   ZZ2+1084                                                 00821000
ZZ2TRMNP EQU   ZZ2+1088                                                 00822000
ZZ2ZZ1P  EQU   ZZ2+1264                                                 00823000
ZZ2BVTP  EQU   ZZ2+1280                                                 00824000
ZZ2RVTP  EQU   ZZ2+1284                                                 00825000
ZZ2CPPL  EQU   ZZ2+1292                                                 00826000
ZZ2CPPLC EQU   ZZ2CPPL                                                  00827000
ZZ2ESSYP EQU   ZZ2+1328                                                 00828000
ZZ2ITR   EQU   ZZ2+2840                                                 00829000
ZZ2ITRE  EQU   ZZ2ITR+16                                                00830000
ZZ2ITSE  EQU   ZZ2+2864                                                 00831000
ZZ2ES    EQU   ZZ2+2872                                                 00832000
ZZ2AMDX  EQU   ZZ2+7160                                                 00833000
ZZ2AXO   EQU   ZZ2+7934                                                 00834000
ZZ2AXOT  EQU   ZZ2AXO+2                                                 00835000
CMD      EQU   0                                                        00836000
CMDT     EQU   CMD+4                                                    00837000
PSCB     EQU   0                                                        00838000
PSCBATR1 EQU   PSCB+16                                                  00839000
ECT      EQU   0                                                        00840000
ECTSWS   EQU   ECT+28                                                   00841000
ECTSWS2  EQU   ECT+40                                                   00842000
ECTSWS21 EQU   ECTSWS2                                                  00843000
UPT      EQU   0                                                        00844000
UPTSWS   EQU   UPT+12                                                   00845000
SA       EQU   0                                                        00846000
SA1      EQU   SA                                                       00847000
SAR      EQU   SA+12                                                    00848000
SAR1     EQU   SAR+12                                                   00849000
BLSUPUTV EQU   0                                                        00850000
BVT      EQU   0                                                        00851000
BVTPUTLP EQU   BVT+4                                                    00852000
BVTPUTOP EQU   BVT+12                                                   00853000
BVTPUTTP EQU   BVT+16                                                   00854000
BVTPUTVP EQU   BVT+20                                                   00855000
BVTPUTAP EQU   BVT+24                                                   00856000
BVTPRTTP EQU   BVT+28                                                   00857000
BVTPRTAP EQU   BVT+32                                                   00858000
BVTPUTDP EQU   BVT+36                                                   00859000
BVTMONP  EQU   BVT+40                                                   00860000
BVTMON2P EQU   BVT+44                                                   00861000
BVTVSARP EQU   BVT+48                                                   00862000
BVTVSENP EQU   BVT+64                                                   00863000
BVTVSERP EQU   BVT+68                                                   00864000
BVTVSGEP EQU   BVT+72                                                   00865000
BVTVSGUP EQU   BVT+76                                                   00866000
BVTVSPOP EQU   BVT+80                                                   00867000
BVTVSPUP EQU   BVT+84                                                   00868000
BVTMPKNP EQU   BVT+104                                                  00869000
BVTMONLP EQU   BVT+108                                                  00870000
BVTPUTCP EQU   BVT+132                                                  00871000
BVTMPK1P EQU   BVT+136                                                  00872000
BVTZZ2RP EQU   BVT+140                                                  00873000
BVTPGMRP EQU   BVT+144                                                  00874000
BVTMONAP EQU   BVT+148                                                  00875000
BVTBLDDP EQU   BVT+152                                                  00876000
BVTBLDLP EQU   BVT+156                                                  00877000
BVTPGMCP EQU   BVT+160                                                  00878000
BVTPGMDP EQU   BVT+164                                                  00879000
BVTPGMLP EQU   BVT+168                                                  00880000
BVTMONCP EQU   BVT+180                                                  00881000
BVTMONDP EQU   BVT+184                                                  00882000
BVTMONTP EQU   BVT+188                                                  00883000
BVTPARIP EQU   BVT+192                                                  00884000
BVTPARUP EQU   BVT+196                                                  00885000
BVTPRTNP EQU   BVT+204                                                  00886000
BVTVSCRP EQU   BVT+208                                                  00887000
BVTVSMRP EQU   BVT+212                                                  00888000
BVTMONXP EQU   BVT+216                                                  00889000
BVTTRMAP EQU   BVT+228                                                  00890000
ZZ6      EQU   0                                                        00891000
ZZ6D     EQU   ZZ6+128                                                  00892000
ZZ6DD    EQU   ZZ6D+8                                                   00893000
ZZ6DDT   EQU   ZZ6DD+4                                                  00894000
ZZ6DQA   EQU   ZZ6D+68                                                  00895000
ZZ6DF    EQU   ZZ6D+92                                                  00896000
ZZ6DPRP  EQU   ZZ6D+108                                                 00897000
ZZ6DCAP  EQU   ZZ6D+112                                                 00898000
ZZ6B     EQU   ZZ6+768                                                  00899000
BLSRACCQ EQU   0                                                        00900000
BLSRSAPC EQU   0                                                        00901000
RVT      EQU   0                                                        00902000
RVTADDRP EQU   RVT                                                      00903000
RVTT01P  EQU   RVT+4                                                    00904000
RVTTAP   EQU   RVT+8                                                    00905000
RVTTBP   EQU   RVT+12                                                   00906000
RVTTCP   EQU   RVT+16                                                   00907000
RVTTFP   EQU   RVT+24                                                   00908000
RVTTYP   EQU   RVT+40                                                   00909000
RVTT02P  EQU   RVT+48                                                   00910000
RVTT03P  EQU   RVT+52                                                   00911000
RVTT04P  EQU   RVT+56                                                   00912000
RVTACCLP EQU   RVT+60                                                   00913000
RVTRACCP EQU   RVT+64                                                   00914000
RVTTLP   EQU   RVT+68                                                   00915000
RVTTMP   EQU   RVT+72                                                   00916000
RVTTUP   EQU   RVT+80                                                   00917000
RVTESGEP EQU   RVT+84                                                   00918000
RVTESGUP EQU   RVT+88                                                   00919000
RVTESARP EQU   RVT+92                                                   00920000
RVTRAARP EQU   RVT+96                                                   00921000
RVTRAGEP EQU   RVT+100                                                  00922000
RVTADDPP EQU   RVT+104                                                  00923000
RVTACCQP EQU   RVT+108                                                  00924000
RVTSAGUP EQU   RVT+124                                                  00925000
RVTSAGEP EQU   RVT+128                                                  00926000
RVTESCKP EQU   RVT+132                                                  00927000
RVTMSGAP EQU   RVT+136                                                  00928000
RVTMSGDP EQU   RVT+140                                                  00929000
RVTADDTP EQU   RVT+160                                                  00930000
RVTADDUP EQU   RVT+164                                                  00931000
RVTADD1P EQU   RVT+176                                                  00932000
RVTADD2P EQU   RVT+180                                                  00933000
RVTRSAGP EQU   RVT+184                                                  00934000
RVTMSGBP EQU   RVT+188                                                  00935000
RVTADDSP EQU   RVT+192                                                  00936000
RVTADD3P EQU   RVT+196                                                  00937000
RVTT05P  EQU   RVT+200                                                  00938000
RVTPADSP EQU   RVT+204                                                  00939000
RVTTRP   EQU   RVT+228                                                  00940000
RVTADD4P EQU   RVT+232                                                  00941000
RVTSAPCP EQU   RVT+236                                                  00942000
RVTSAARP EQU   RVT+240                                                  00943000
RVTSAGNP EQU   RVT+244                                                  00944000
RVTT06P  EQU   RVT+248                                                  00945000
RVTSAGCP EQU   RVT+252                                                  00946000
RVTSAGQP EQU   RVT+256                                                  00947000
RVTESGCP EQU   RVT+260                                                  00948000
RVTESGQP EQU   RVT+264                                                  00949000
RVTDUCKP EQU   RVT+276                                                  00950000
RVTDUCCP EQU   RVT+280                                                  00951000
XTLST    EQU   0                                                        00952000
XTLLNTH  EQU   XTLST                                                    00953000
XTLNRFAC EQU   XTLST+4                                                  00954000
XTLMSBLA EQU   XTLST+8                                                  00955000
XTLMSBLN EQU   XTLMSBLA+1                                               00956000
XTLMSBAA EQU   XTLST+12                                                 00957000
XTLMSBAD EQU   XTLMSBAA+1                                               00958000
BLSRACC  EQU   0                                                        00959000
BLSRACCL EQU   0                                                        00960000
BLSRADDP EQU   0                                                        00961000
BLSRADDR EQU   0                                                        00962000
BLSRADDS EQU   0                                                        00963000
BLSRADDT EQU   0                                                        00964000
BLSRADDU EQU   0                                                        00965000
BLSRADD1 EQU   0                                                        00966000
BLSRADD2 EQU   0                                                        00967000
BLSRADD3 EQU   0                                                        00968000
BLSRADD4 EQU   0                                                        00969000
BLSRDUCC EQU   0                                                        00970000
BLSRDUCK EQU   0                                                        00971000
BLSRESAR EQU   0                                                        00972000
BLSRESCK EQU   0                                                        00973000
BLSRESGC EQU   0                                                        00974000
BLSRESGE EQU   0                                                        00975000
BLSRESGQ EQU   0                                                        00976000
BLSRESGU EQU   0                                                        00977000
BLSRMSGA EQU   0                                                        00978000
BLSRMSGB EQU   0                                                        00979000
BLSRMSGD EQU   0                                                        00980000
BLSRPADS EQU   0                                                        00981000
BLSRRAAR EQU   0                                                        00982000
BLSRRAGE EQU   0                                                        00983000
BLSRSAAR EQU   0                                                        00984000
BLSRSAG  EQU   0                                                        00985000
BLSRSAGC EQU   0                                                        00986000
BLSRSAGE EQU   0                                                        00987000
BLSRSAGN EQU   0                                                        00988000
BLSRSAGQ EQU   0                                                        00989000
BLSRSAGU EQU   0                                                        00990000
BLSTA    EQU   0                                                        00991000
BLSTB    EQU   0                                                        00992000
BLSTC    EQU   0                                                        00993000
BLSTF    EQU   0                                                        00994000
BLSTL    EQU   0                                                        00995000
BLSTM    EQU   0                                                        00996000
BLSTR    EQU   0                                                        00997000
BLSTU    EQU   0                                                        00998000
BLSTY    EQU   0                                                        00999000
BLST01   EQU   0                                                        01000000
BLST02   EQU   0                                                        01001000
BLST03   EQU   0                                                        01002000
BLST04   EQU   0                                                        01003000
BLST05   EQU   0                                                        01004000
BLST06   EQU   0                                                        01005000
BLSUALLO EQU   0                                                        01006000
BLSUBLDD EQU   0                                                        01007000
BLSUBLDL EQU   0                                                        01008000
BLSUDYNA EQU   0                                                        01009000
BLSUFREE EQU   0                                                        01010000
BLSUFRE1 EQU   0                                                        01011000
BLSUMON  EQU   0                                                        01012000
BLSUMONA EQU   0                                                        01013000
BLSUMONC EQU   0                                                        01014000
BLSUMOND EQU   0                                                        01015000
BLSUMONL EQU   0                                                        01016000
BLSUMONT EQU   0                                                        01017000
BLSUMONX EQU   0                                                        01018000
BLSUMON2 EQU   0                                                        01019000
BLSUMPKN EQU   0                                                        01020000
BLSUMPK1 EQU   0                                                        01021000
BLSUPARI EQU   0                                                        01022000
BLSUPARU EQU   0                                                        01023000
BLSUPGMC EQU   0                                                        01024000
BLSUPGMD EQU   0                                                        01025000
BLSUPGML EQU   0                                                        01026000
BLSUPGMR EQU   0                                                        01027000
BLSUPRTA EQU   0                                                        01028000
BLSUPRTN EQU   0                                                        01029000
BLSUPRTT EQU   0                                                        01030000
BLSUPUTA EQU   0                                                        01031000
BLSUPUTC EQU   0                                                        01032000
BLSUPUTD EQU   0                                                        01033000
BLSUPUTL EQU   0                                                        01034000
BLSUPUTN EQU   0                                                        01035000
BLSUPUTO EQU   0                                                        01036000
BLSUPUTT EQU   0                                                        01037000
BLSUSTAI EQU   0                                                        01038000
BLSUTRMA EQU   0                                                        01039000
BLSUTRMN EQU   0                                                        01040000
BLSUTRMO EQU   0                                                        01041000
BLSUTRMV EQU   0                                                        01042000
BLSUVSAR EQU   0                                                        01043000
BLSUVSCR EQU   0                                                        01044000
BLSUVSEN EQU   0                                                        01045000
BLSUVSER EQU   0                                                        01046000
BLSUVSGE EQU   0                                                        01047000
BLSUVSGU EQU   0                                                        01048000
BLSUVSMR EQU   0                                                        01049000
BLSUVSPO EQU   0                                                        01050000
BLSUVSPU EQU   0                                                        01051000
BLSUZZ2C EQU   0                                                        01052000
BLSUZZ2D EQU   0                                                        01053000
BLSUZZ2R EQU   0                                                        01054000
IKJEFF02 EQU   0                                                        01055000
IKJEFF18 EQU   0                                                        01056000
IKJEFF19 EQU   0                                                        01057000
IKJGETL  EQU   0                                                        01058000
IKJPARS  EQU   0                                                        01059000
IKJPTGT  EQU   0                                                        01060000
IKJPUTL  EQU   0                                                        01061000
IKJSCAN  EQU   0                                                        01062000
IKJSTCK  EQU   0                                                        01063000
I001C    EQU   0                                                        01064000
I008P    EQU   0                                                        01065000
I015F    EQU   0                                                        01066000
I015P    EQU   0                                                        01067000
I031F    EQU   0                                                        01068000
I031P    EQU   0                                                        01069000
I256C    EQU   0                                                        01070000
PZ2      EQU   0                                                        01071000
SAPA     EQU   0                                                        01072000
SAPAAS   EQU   SAPA+12                                                  01073000
SAPADT   EQU   SAPA+32                                                  01074000
SAPAF    EQU   SAPA+68                                                  01075000
SAPAFT   EQU   SAPAF+10                                                 01076000
SAPAFF   EQU   SAPAF+52                                                 01077000
SAPASF   EQU   SAPA+128                                                 01078000
SAPAC    EQU   SAPA+254                                                 01079000
SAPACT   EQU   SAPAC+2                                                  01080000
SABK     EQU   0                                                        01081000
SABKAS   EQU   SABK+12                                                  01082000
SABKDT   EQU   SABK+32                                                  01083000
SABKF    EQU   SABK+68                                                  01084000
SABKFT   EQU   SABKF+10                                                 01085000
SABKFF   EQU   SABKF+52                                                 01086000
SABKSF   EQU   SABK+128                                                 01087000
SABKC    EQU   SABK+254                                                 01088000
SABKCT   EQU   SABKC+2                                                  01089000
CPPL     EQU   ZZ2CPPL                                                  01090000
CPPLUPT  EQU   CPPL+4                                                   01091000
CPPLPSCB EQU   CPPL+8                                                   01092000
CPPLECT  EQU   CPPL+12                                                  01093000
ERRF     EQU   SABACT                                                   01094000
ERRFB    EQU   ERRF                                                     01095000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01096000
@NM00141 EQU   ERRF                                                     01097000
ERRFS    EQU   ERRF                                                     01098000
ERRFN    EQU   ERRF                                                     01099000
ERRFD    EQU   ERRF                                                     01100000
CPPLCBUF EQU   CPPL                                                     01101000
SABK999  EQU   SABK+3072                                                01102000
SABKCT1  EQU   SABKCT                                                   01103000
SABKCL   EQU   SABKC                                                    01104000
@NM00030 EQU   SABK+153                                                 01105000
SABKSRC  EQU   SABK+152                                                 01106000
SABKPGV  EQU   SABK+144                                                 01107000
SABKGMT  EQU   SABK+136                                                 01108000
@NM00029 EQU   SABKSF                                                   01109000
SABKSFS  EQU   SABKSF                                                   01110000
SABKSFI  EQU   SABKSF                                                   01111000
SABKSF9  EQU   SABKSF                                                   01112000
SABKSF1  EQU   SABKSF                                                   01113000
SABKF99  EQU   SABKF+60                                                 01114000
@NM00028 EQU   SABKF+56                                                 01115000
@NM00027 EQU   SABKFF                                                   01116000
SABKFFA  EQU   SABKFF                                                   01117000
SABKFIL  EQU   SABKF+48                                                 01118000
SABKFIM  EQU   SABKF+44                                                 01119000
SABKFT9  EQU   SABKFT+34                                                01120000
SABKFTE  EQU   SABKFT+33                                                01121000
SABKFTD  EQU   SABKFT+2                                                 01122000
@NM00026 EQU   SABKFT+1                                                 01123000
SABKFTY  EQU   SABKFT                                                   01124000
SABKFT0  EQU   SABKFT                                                   01125000
SABKFLB  EQU   SABKF+9                                                  01126000
SABKFOB  EQU   SABKF+8                                                  01127000
SABKFLE  EQU   SABKF+4                                                  01128000
SABKFOF  EQU   SABKF                                                    01129000
SABKF00  EQU   SABKF                                                    01130000
@NM00025 EQU   SABK+66                                                  01131000
SABKELK  EQU   SABK+66                                                  01132000
SABKDT9  EQU   SABKDT+34                                                01133000
SABKDTE  EQU   SABKDT+33                                                01134000
SABKDTD  EQU   SABKDT+2                                                 01135000
@NM00024 EQU   SABKDT+1                                                 01136000
SABKDTY  EQU   SABKDT                                                   01137000
SABKDT0  EQU   SABKDT                                                   01138000
SABKLAD  EQU   SABK+28                                                  01139000
SABKAS9  EQU   SABKAS+16                                                01140000
@NM00023 EQU   SABKAS+12                                                01141000
SABKAS2  EQU   SABKAS+8                                                 01142000
SABKAS1  EQU   SABKAS+4                                                 01143000
@NM00022 EQU   SABKAS+2                                                 01144000
SABKAST  EQU   SABKAS                                                   01145000
SABKAS0  EQU   SABKAS                                                   01146000
SABKRDX  EQU   SABK+8                                                   01147000
@NM00021 EQU   SABK+2                                                   01148000
SABKRID  EQU   SABK                                                     01149000
SAPA999  EQU   SAPA+3072                                                01150000
SAPACT1  EQU   SAPACT                                                   01151000
SAPACL   EQU   SAPAC                                                    01152000
@NM00010 EQU   SAPA+153                                                 01153000
SAPASRC  EQU   SAPA+152                                                 01154000
SAPAPGV  EQU   SAPA+144                                                 01155000
SAPAGMT  EQU   SAPA+136                                                 01156000
@NM00009 EQU   SAPASF                                                   01157000
SAPASFS  EQU   SAPASF                                                   01158000
SAPASFI  EQU   SAPASF                                                   01159000
SAPASF9  EQU   SAPASF                                                   01160000
SAPASF1  EQU   SAPASF                                                   01161000
SAPAF99  EQU   SAPAF+60                                                 01162000
@NM00008 EQU   SAPAF+56                                                 01163000
@NM00007 EQU   SAPAFF                                                   01164000
SAPAFFA  EQU   SAPAFF                                                   01165000
SAPAFIL  EQU   SAPAF+48                                                 01166000
SAPAFIM  EQU   SAPAF+44                                                 01167000
SAPAFT9  EQU   SAPAFT+34                                                01168000
SAPAFTE  EQU   SAPAFT+33                                                01169000
SAPAFTD  EQU   SAPAFT+2                                                 01170000
@NM00006 EQU   SAPAFT+1                                                 01171000
SAPAFTY  EQU   SAPAFT                                                   01172000
SAPAFT0  EQU   SAPAFT                                                   01173000
SAPAFLB  EQU   SAPAF+9                                                  01174000
SAPAFOB  EQU   SAPAF+8                                                  01175000
SAPAFLE  EQU   SAPAF+4                                                  01176000
SAPAFOF  EQU   SAPAF                                                    01177000
SAPAF00  EQU   SAPAF                                                    01178000
@NM00005 EQU   SAPA+66                                                  01179000
SAPAELK  EQU   SAPA+66                                                  01180000
SAPADT9  EQU   SAPADT+34                                                01181000
SAPADTE  EQU   SAPADT+33                                                01182000
SAPADTD  EQU   SAPADT+2                                                 01183000
@NM00004 EQU   SAPADT+1                                                 01184000
SAPADTY  EQU   SAPADT                                                   01185000
SAPADT0  EQU   SAPADT                                                   01186000
SAPALAD  EQU   SAPA+28                                                  01187000
SAPAAS9  EQU   SAPAAS+16                                                01188000
@NM00003 EQU   SAPAAS+12                                                01189000
SAPAAS2  EQU   SAPAAS+8                                                 01190000
SAPAAS1  EQU   SAPAAS+4                                                 01191000
@NM00002 EQU   SAPAAS+2                                                 01192000
SAPAAST  EQU   SAPAAS                                                   01193000
SAPAAS0  EQU   SAPAAS                                                   01194000
SAPARDX  EQU   SAPA+8                                                   01195000
@NM00001 EQU   SAPA+2                                                   01196000
SAPARID  EQU   SAPA                                                     01197000
@NM00135 EQU   XTLMSBAA                                                 01198000
@NM00134 EQU   XTLMSBLA                                                 01199000
RVT99999 EQU   RVT+384                                                  01200000
RVT0096P EQU   RVT+380                                                  01201000
RVT0095P EQU   RVT+376                                                  01202000
RVT0094P EQU   RVT+372                                                  01203000
RVT0093P EQU   RVT+368                                                  01204000
RVT0092P EQU   RVT+364                                                  01205000
RVT0091P EQU   RVT+360                                                  01206000
RVT0090P EQU   RVT+356                                                  01207000
RVT0089P EQU   RVT+352                                                  01208000
RVT0088P EQU   RVT+348                                                  01209000
RVT0087P EQU   RVT+344                                                  01210000
RVT0086P EQU   RVT+340                                                  01211000
RVT0085P EQU   RVT+336                                                  01212000
RVT0084P EQU   RVT+332                                                  01213000
RVT0083P EQU   RVT+328                                                  01214000
RVT0082P EQU   RVT+324                                                  01215000
RVT0081P EQU   RVT+320                                                  01216000
RVT0080P EQU   RVT+316                                                  01217000
RVT0079P EQU   RVT+312                                                  01218000
RVT0078P EQU   RVT+308                                                  01219000
RVT0077P EQU   RVT+304                                                  01220000
RVT0076P EQU   RVT+300                                                  01221000
RVT0075P EQU   RVT+296                                                  01222000
RVT0074P EQU   RVT+292                                                  01223000
RVT0073P EQU   RVT+288                                                  01224000
RVT0072P EQU   RVT+284                                                  01225000
RVTDTUTP EQU   RVT+272                                                  01226000
RVTDTMTP EQU   RVT+268                                                  01227000
RVT0057P EQU   RVT+224                                                  01228000
RVT0056P EQU   RVT+220                                                  01229000
RVT0055P EQU   RVT+216                                                  01230000
RVT0054P EQU   RVT+212                                                  01231000
RVT0053P EQU   RVT+208                                                  01232000
RVT0044P EQU   RVT+172                                                  01233000
RVT0043P EQU   RVT+168                                                  01234000
RVT0040P EQU   RVT+156                                                  01235000
RVT0039P EQU   RVT+152                                                  01236000
RVT0038P EQU   RVT+148                                                  01237000
RVT0037P EQU   RVT+144                                                  01238000
RVT0031P EQU   RVT+120                                                  01239000
RVT0030P EQU   RVT+116                                                  01240000
RVT0029P EQU   RVT+112                                                  01241000
RVT0020P EQU   RVT+76                                                   01242000
RVT0012P EQU   RVT+44                                                   01243000
RVT0010P EQU   RVT+36                                                   01244000
RVT0009P EQU   RVT+32                                                   01245000
RVT0008P EQU   RVT+28                                                   01246000
RVT0006P EQU   RVT+20                                                   01247000
ZZ69999  EQU   ZZ6+1792                                                 01248000
ZZ6BRB   EQU   ZZ6B+12                                                  01249000
ZZ6BRC   EQU   ZZ6B+8                                                   01250000
@NM00133 EQU   ZZ6B+6                                                   01251000
ZZ6BFL   EQU   ZZ6B+4                                                   01252000
ZZ6BDA   EQU   ZZ6B                                                     01253000
@NM00132 EQU   ZZ6+540                                                  01254000
ZZ6BUFI  EQU   ZZ6+536                                                  01255000
ZZ6BUFP  EQU   ZZ6+532                                                  01256000
ZZ6FILE  EQU   ZZ6+524                                                  01257000
ZZ6BUFB  EQU   ZZ6+520                                                  01258000
ZZ6BUFL  EQU   ZZ6+518                                                  01259000
ZZ6BUFN  EQU   ZZ6+516                                                  01260000
ZZ6ZZ6P  EQU   ZZ6+512                                                  01261000
@NM00131 EQU   ZZ6+256                                                  01262000
ZZ6D999  EQU   ZZ6D+128                                                 01263000
@NM00130 EQU   ZZ6D+116                                                 01264000
ZZ6DDA2  EQU   ZZ6D+104                                                 01265000
ZZ6DDA1  EQU   ZZ6D+100                                                 01266000
@NM00129 EQU   ZZ6DF                                                    01267000
ZZ6DFSU  EQU   ZZ6DF                                                    01268000
ZZ6DFST  EQU   ZZ6DF                                                    01269000
ZZ6DFAB  EQU   ZZ6DF                                                    01270000
ZZ6DFMP  EQU   ZZ6DF                                                    01271000
ZZ6DFDU  EQU   ZZ6DF                                                    01272000
ZZ6DFBS  EQU   ZZ6DF                                                    01273000
ZZ6DQ2   EQU   ZZ6D+88                                                  01274000
ZZ6DQ1   EQU   ZZ6D+84                                                  01275000
ZZ6DQA9  EQU   ZZ6DQA+16                                                01276000
@NM00128 EQU   ZZ6DQA+12                                                01277000
ZZ6DQA2  EQU   ZZ6DQA+8                                                 01278000
ZZ6DQA1  EQU   ZZ6DQA+4                                                 01279000
@NM00127 EQU   ZZ6DQA+2                                                 01280000
ZZ6DQAT  EQU   ZZ6DQA                                                   01281000
ZZ6DQA0  EQU   ZZ6DQA                                                   01282000
ZZ6DRDX  EQU   ZZ6D+64                                                  01283000
ZZ6DELK  EQU   ZZ6D+64                                                  01284000
ZZ6DMEM  EQU   ZZ6D+56                                                  01285000
ZZ6DDT1  EQU   ZZ6DDT                                                   01286000
ZZ6DDO   EQU   ZZ6DD+2                                                  01287000
ZZ6DDL   EQU   ZZ6DD                                                    01288000
@NM00126 EQU   ZZ6D+2                                                   01289000
ZZ6DRID  EQU   ZZ6D                                                     01290000
ZZ6RDCB  EQU   ZZ6                                                      01291000
ZZ60000  EQU   ZZ6                                                      01292000
BVT99999 EQU   BVT+256                                                  01293000
BVT0064P EQU   BVT+252                                                  01294000
BVT0063P EQU   BVT+248                                                  01295000
BVT0062P EQU   BVT+244                                                  01296000
BVT0061P EQU   BVT+240                                                  01297000
BVT0060P EQU   BVT+236                                                  01298000
BVT0059P EQU   BVT+232                                                  01299000
BVT0057P EQU   BVT+224                                                  01300000
BVT0056P EQU   BVT+220                                                  01301000
BVTSTBLP EQU   BVT+200                                                  01302000
BVT0045P EQU   BVT+176                                                  01303000
BVT0044P EQU   BVT+172                                                  01304000
BVT0033P EQU   BVT+128                                                  01305000
BVT0032P EQU   BVT+124                                                  01306000
BVT0031P EQU   BVT+120                                                  01307000
BVT0030P EQU   BVT+116                                                  01308000
BVT0029P EQU   BVT+112                                                  01309000
BVT0026P EQU   BVT+100                                                  01310000
BVT0025P EQU   BVT+96                                                   01311000
BVT0024P EQU   BVT+92                                                   01312000
BVT0023P EQU   BVT+88                                                   01313000
BVT0016P EQU   BVT+60                                                   01314000
BVT0015P EQU   BVT+56                                                   01315000
BVT0014P EQU   BVT+52                                                   01316000
BVT0003P EQU   BVT+8                                                    01317000
BVT0001P EQU   BVT                                                      01318000
SA99     EQU   SA+72                                                    01319000
SARC     EQU   SAR+56                                                   01320000
SARB     EQU   SAR+52                                                   01321000
SARA     EQU   SAR+48                                                   01322000
SAR9     EQU   SAR+44                                                   01323000
SAR8     EQU   SAR+40                                                   01324000
SAR7     EQU   SAR+36                                                   01325000
SAR6     EQU   SAR+32                                                   01326000
SAR5     EQU   SAR+28                                                   01327000
SAR4     EQU   SAR+24                                                   01328000
SAR3     EQU   SAR+20                                                   01329000
SAR2     EQU   SAR+16                                                   01330000
SAR0     EQU   SAR+8                                                    01331000
SARF     EQU   SAR+4                                                    01332000
SARE     EQU   SAR                                                      01333000
SAFWD    EQU   SA+8                                                     01334000
SABAK    EQU   SA+4                                                     01335000
SA1L     EQU   SA1+1                                                    01336000
SA1P     EQU   SA1                                                      01337000
UPTPREFL EQU   UPT+23                                                   01338000
UPTPREFX EQU   UPT+16                                                   01339000
@NM00125 EQU   UPT+15                                                   01340000
UPTLDEL  EQU   UPT+14                                                   01341000
UPTCDEL  EQU   UPT+13                                                   01342000
UPTWTP   EQU   UPTSWS                                                   01343000
UPTMODE  EQU   UPTSWS                                                   01344000
UPTALD   EQU   UPTSWS                                                   01345000
UPTPAUS  EQU   UPTSWS                                                   01346000
UPTNCOM  EQU   UPTSWS                                                   01347000
UPTMID   EQU   UPTSWS                                                   01348000
UPTNPRM  EQU   UPTSWS                                                   01349000
UPTRCVR  EQU   UPTSWS                                                   01350000
UPTUSER  EQU   UPT+2                                                    01351000
@NM00124 EQU   UPT                                                      01352000
@NM00123 EQU   ECT+52                                                   01353000
@NM00122 EQU   ECT+48                                                   01354000
@NM00121 EQU   ECT+44                                                   01355000
@NM00120 EQU   ECTSWS2+1                                                01356000
@NM00119 EQU   ECTSWS21                                                 01357000
ECTTABND EQU   ECTSWS21                                                 01358000
ECTDEFCS EQU   ECTSWS21                                                 01359000
ECTBKPB  EQU   ECT+36                                                   01360000
ECTUSER  EQU   ECT+32                                                   01361000
ECTDDNUM EQU   ECT+29                                                   01362000
ECTATTN  EQU   ECTSWS                                                   01363000
ECTBKGRD EQU   ECTSWS                                                   01364000
ECTNNOT  EQU   ECTSWS                                                   01365000
ECTNMAL  EQU   ECTSWS                                                   01366000
ECTLOGF  EQU   ECTSWS                                                   01367000
ECTATRM  EQU   ECTSWS                                                   01368000
@NM00118 EQU   ECTSWS                                                   01369000
ECTNOPD  EQU   ECTSWS                                                   01370000
ECTSCMD  EQU   ECT+20                                                   01371000
ECTPCMD  EQU   ECT+12                                                   01372000
ECTSMSG  EQU   ECT+9                                                    01373000
ECTMSGF  EQU   ECT+8                                                    01374000
ECTIOWA  EQU   ECT+4                                                    01375000
ECTRTCD  EQU   ECT+1                                                    01376000
ECTRCDF  EQU   ECT                                                      01377000
PSCBU    EQU   PSCB+64                                                  01378000
PSCBRSZ  EQU   PSCB+60                                                  01379000
PSCBLINE EQU   PSCB+59                                                  01380000
PSCBCHAR EQU   PSCB+58                                                  01381000
PSCBUPTL EQU   PSCB+56                                                  01382000
PSCBUPT  EQU   PSCB+52                                                  01383000
PSCBRLGB EQU   PSCB+48                                                  01384000
PSCBDEST EQU   PSCB+40                                                  01385000
@NM00117 EQU   PSCB+36                                                  01386000
@NM00116 EQU   PSCB+32                                                  01387000
@NM00115 EQU   PSCB+28                                                  01388000
PSCBLTI2 EQU   PSCB+24                                                  01389000
PSCBLTIM EQU   PSCB+20                                                  01390000
PSCBATR2 EQU   PSCB+18                                                  01391000
@NM00114 EQU   PSCBATR1                                                 01392000
@NM00113 EQU   PSCBATR1                                                 01393000
@NM00112 EQU   PSCBATR1                                                 01394000
PSCBATTN EQU   PSCBATR1                                                 01395000
PSCBVMNT EQU   PSCBATR1                                                 01396000
PSCBJCL  EQU   PSCBATR1                                                 01397000
PSCBACCT EQU   PSCBATR1                                                 01398000
PSCBCTRL EQU   PSCBATR1                                                 01399000
PSCBGPNM EQU   PSCB+8                                                   01400000
PSCBUSRL EQU   PSCB+7                                                   01401000
PSCBUSER EQU   PSCB                                                     01402000
CMDT1    EQU   CMDT                                                     01403000
CMDO     EQU   CMD+2                                                    01404000
CMDL     EQU   CMD                                                      01405000
ZZ299999 EQU   ZZ2+8192                                                 01406000
ZZ2AXOT1 EQU   ZZ2AXOT                                                  01407000
ZZ2AXOL  EQU   ZZ2AXO                                                   01408000
@NM00111 EQU   ZZ2+7288                                                 01409000
@NM00110 EQU   ZZ2AMDX+4                                                01410000
ZZ2AMDXC EQU   ZZ2AMDX                                                  01411000
ZZ2HSD   EQU   ZZ2+3056                                                 01412000
@NM00109 EQU   ZZ2ES                                                    01413000
@NM00108 EQU   ZZ2+2868                                                 01414000
ZZ2ITSEC EQU   ZZ2ITSE+1                                                01415000
@NM00107 EQU   ZZ2ITSE                                                  01416000
ZZ2ITSEP EQU   ZZ2ITSE                                                  01417000
ZZ2ITSEW EQU   ZZ2ITSE                                                  01418000
@NM00106 EQU   ZZ2ITR+20                                                01419000
ZZ2ITREC EQU   ZZ2ITRE+1                                                01420000
@NM00105 EQU   ZZ2ITRE                                                  01421000
ZZ2ITREP EQU   ZZ2ITRE                                                  01422000
ZZ2ITREW EQU   ZZ2ITRE                                                  01423000
@NM00104 EQU   ZZ2ITR+9                                                 01424000
ZZ2ITRRC EQU   ZZ2ITR+8                                                 01425000
ZZ2ITR2P EQU   ZZ2ITR+4                                                 01426000
ZZ2ITRPP EQU   ZZ2ITR                                                   01427000
@NM00103 EQU   ZZ2+1544                                                 01428000
ZZ2PGM   EQU   ZZ2+1536                                                 01429000
@NM00102 EQU   ZZ2+1526                                                 01430000
ZZ2CW    EQU   ZZ2+1524                                                 01431000
@NM00101 EQU   ZZ2+1504                                                 01432000
@NM00100 EQU   ZZ2+1352                                                 01433000
ZZ2FFSYP EQU   ZZ2+1348                                                 01434000
ZZ2SASYP EQU   ZZ2+1344                                                 01435000
ZZ2RDSYP EQU   ZZ2+1340                                                 01436000
ZZ2RASYP EQU   ZZ2+1336                                                 01437000
ZZ2PHSYP EQU   ZZ2+1332                                                 01438000
ZZ200SYP EQU   ZZ2+1324                                                 01439000
ZZ2SCWP  EQU   ZZ2+1320                                                 01440000
ZZ2TTLP  EQU   ZZ2+1316                                                 01441000
ZZ2LOADP EQU   ZZ2+1312                                                 01442000
ZZ2VRESP EQU   ZZ2+1308                                                 01443000
ZZ2CPPLE EQU   ZZ2CPPL+12                                               01444000
ZZ2CPPLP EQU   ZZ2CPPL+8                                                01445000
ZZ2CPPLU EQU   ZZ2CPPL+4                                                01446000
ZZ2VRSAP EQU   ZZ2+1288                                                 01447000
ZZ2DVTP  EQU   ZZ2+1276                                                 01448000
@NM00099 EQU   ZZ2+1272                                                 01449000
@NM00098 EQU   ZZ2+1268                                                 01450000
ZZ2RPLP  EQU   ZZ2+1260                                                 01451000
ZZ2TCBP  EQU   ZZ2+1256                                                 01452000
@NM00097 EQU   ZZ2+1252                                                 01453000
ZZ2ZZ2P  EQU   ZZ2+1248                                                 01454000
@NM00096 EQU   ZZ2+1112                                                 01455000
ZZ2FPDRP EQU   ZZ2+1108                                                 01456000
ZZ2FDSDP EQU   ZZ2+1104                                                 01457000
ZZ2APDRP EQU   ZZ2+1100                                                 01458000
ZZ2ADSDP EQU   ZZ2+1096                                                 01459000
ZZ2ENQ0P EQU   ZZ2+1092                                                 01460000
@NM00095 EQU   ZZ2+1080                                                 01461000
ZZ2MSG0P EQU   ZZ2+1076                                                 01462000
ZZ2FT25P EQU   ZZ2+1072                                                 01463000
ZZ2MSGSP EQU   ZZ2+1060                                                 01464000
ZZ2ALOCP EQU   ZZ2+1056                                                 01465000
@NM00094 EQU   ZZ2+976                                                  01466000
ZZ2STGN  EQU   ZZ2STG+4                                                 01467000
ZZ2STGP  EQU   ZZ2STG                                                   01468000
@NM00093 EQU   ZZ2+952                                                  01469000
ZZ2SCMDE EQU   ZZ2+944                                                  01470000
ZZ2SCMDN EQU   ZZ2+936                                                  01471000
ZZ2IDENT EQU   ZZ2+928                                                  01472000
ZZ2A9999 EQU   ZZ2A+656                                                 01473000
@NM00092 EQU   ZZ2A+224                                                 01474000
@NM00091 EQU   ZZ2A+220                                                 01475000
ZZ2AQD99 EQU   ZZ2AQD+60                                                01476000
@NM00090 EQU   ZZ2AQD+56                                                01477000
@NM00089 EQU   ZZ2AQDF                                                  01478000
ZZ2AQDFA EQU   ZZ2AQDF                                                  01479000
ZZ2AQDIL EQU   ZZ2AQD+48                                                01480000
ZZ2AQDIM EQU   ZZ2AQD+44                                                01481000
ZZ2AQDT9 EQU   ZZ2AQDT+34                                               01482000
ZZ2AQDTE EQU   ZZ2AQDT+33                                               01483000
ZZ2AQDTD EQU   ZZ2AQDT+2                                                01484000
@NM00088 EQU   ZZ2AQDT+1                                                01485000
ZZ2AQDTY EQU   ZZ2AQDT                                                  01486000
ZZ2AQDT0 EQU   ZZ2AQDT                                                  01487000
ZZ2AQDLB EQU   ZZ2AQD+9                                                 01488000
ZZ2AQDOB EQU   ZZ2AQD+8                                                 01489000
ZZ2AQDLE EQU   ZZ2AQD+4                                                 01490000
ZZ2AQDOF EQU   ZZ2AQD                                                   01491000
ZZ2AQD00 EQU   ZZ2AQD                                                   01492000
ZZ2AQAS9 EQU   ZZ2AQAS+16                                               01493000
@NM00087 EQU   ZZ2AQAS+12                                               01494000
ZZ2AQAS2 EQU   ZZ2AQAS+8                                                01495000
ZZ2AQAS1 EQU   ZZ2AQAS+4                                                01496000
@NM00086 EQU   ZZ2AQAS+2                                                01497000
ZZ2AQAST EQU   ZZ2AQAS                                                  01498000
ZZ2AQAS0 EQU   ZZ2AQAS                                                  01499000
ZZ2ADPTA EQU   ZZ2ADPT                                                  01500000
ZZ2ADPL  EQU   ZZ2ADP                                                   01501000
ZZ2ADMTA EQU   ZZ2ADMT                                                  01502000
ZZ2ADML  EQU   ZZ2ADM                                                   01503000
ZZ2ADDTA EQU   ZZ2ADDT                                                  01504000
ZZ2ADDL  EQU   ZZ2ADD                                                   01505000
@NM00085 EQU   ZZ2A+72                                                  01506000
ZZ2APIDB EQU   ZZ2APID+3                                                01507000
ZZ2APIDA EQU   ZZ2APID                                                  01508000
@NM00084 EQU   ZZ2A+24                                                  01509000
@NM00083 EQU   ZZ2AF+5                                                  01510000
ZZ2AFX   EQU   ZZ2AF+5                                                  01511000
@NM00082 EQU   ZZ2AF+3                                                  01512000
ZZ2AFS   EQU   ZZ2AF+2                                                  01513000
ZZ2AFD   EQU   ZZ2AF+2                                                  01514000
ZZ2AFQ   EQU   ZZ2AF+2                                                  01515000
ZZ2AF$   EQU   ZZ2AF+2                                                  01516000
@NM00081 EQU   ZZ2AF+2                                                  01517000
ZZ2AFM   EQU   ZZ2AF+2                                                  01518000
@NM00080 EQU   ZZ2AF+2                                                  01519000
@NM00079 EQU   ZZ2AF+1                                                  01520000
ZZ2AFV   EQU   ZZ2AF+1                                                  01521000
@NM00078 EQU   ZZ2AF+1                                                  01522000
ZZ2AFC   EQU   ZZ2AF+1                                                  01523000
@NM00077 EQU   ZZ2AF                                                    01524000
ZZ2AFFS  EQU   ZZ2AF                                                    01525000
ZZ2AFT   EQU   ZZ2AF                                                    01526000
ZZ2AFP   EQU   ZZ2AF                                                    01527000
@NM00076 EQU   ZZ2A+8                                                   01528000
ZZ2ALINE EQU   ZZ2A+4                                                   01529000
@NM00075 EQU   ZZ2A+3                                                   01530000
ZZ2ACH   EQU   ZZ2A                                                     01531000
@NM00074 EQU   ZZ2+264                                                  01532000
@NM00073 EQU   ZZ2+263                                                  01533000
ZZ2PRTT0 EQU   ZZ2PRTT                                                  01534000
ZZ2PRTO  EQU   ZZ2PRT+2                                                 01535000
ZZ2PRTL  EQU   ZZ2PRT                                                   01536000
@NM00072 EQU   ZZ2AMD+56                                                01537000
ZZ2AMDXP EQU   ZZ2AMD+52                                                01538000
ZZ2AMDD  EQU   ZZ2AMD+48                                                01539000
ZZ2AMDL  EQU   ZZ2AMD+44                                                01540000
ZZ2AMDU  EQU   ZZ2AMD+28                                                01541000
ZZ2AMDF  EQU   ZZ2AMD+24                                                01542000
ZZ2AMDS  EQU   ZZ2AMD+20                                                01543000
ZZ2AMDC  EQU   ZZ2AMD+16                                                01544000
ZZ2AMDP  EQU   ZZ2AMD+12                                                01545000
ZZ2AMDB  EQU   ZZ2AMD+8                                                 01546000
@NM00071 EQU   @NM00070                                                 01547000
ZZ2AMD2  EQU   @NM00070                                                 01548000
ZZ2AMD1  EQU   @NM00070                                                 01549000
ZZ2AMD0  EQU   ZZ2AMD+6                                                 01550000
ZZ2AMDA  EQU   ZZ2AMD+4                                                 01551000
ZZ2AMDT  EQU   ZZ2AMD                                                   01552000
ZZ199999 EQU   ZZ1+3072                                                 01553000
@NM00069 EQU   ZZ1+2160                                                 01554000
ZZ1TRTAS EQU   ZZ1+1904                                                 01555000
ZZ1TRUPC EQU   ZZ1+1648                                                 01556000
ZZ1TRCTX EQU   ZZ1+1392                                                 01557000
ZZ1NASID EQU   ZZ1N+274                                                 01558000
ZZ1NSTRL EQU   ZZ1N+272                                                 01559000
ZZ1NOFF  EQU   ZZ1N+268                                                 01560000
ZZ1NBDY  EQU   ZZ1N+264                                                 01561000
ZZ1NADE  EQU   ZZ1N+260                                                 01562000
ZZ1NADB  EQU   ZZ1N+256                                                 01563000
ZZ1NSTR  EQU   ZZ1N                                                     01564000
@NM00068 EQU   ZZ1+1080                                                 01565000
ZZ1TREBC EQU   ZZ1+824                                                  01566000
ZZ1TRHEX EQU   ZZ1+568                                                  01567000
@NM00067 EQU   ZZ1+377                                                  01568000
ZZ1USTAE EQU   ZZ1+376                                                  01569000
@NM00066 EQU   ZZ1F+1                                                   01570000
@NM00065 EQU   ZZ1F                                                     01571000
ZZ1FM    EQU   ZZ1F                                                     01572000
ZZ1FX    EQU   ZZ1F                                                     01573000
ZZ1FU    EQU   ZZ1F                                                     01574000
ZZ1EVEC  EQU   ZZ1EVE+1                                                 01575000
@NM00064 EQU   ZZ1EVE                                                   01576000
ZZ1EVEW  EQU   ZZ1EVE                                                   01577000
ZZ1ACMP  EQU   ZZ1ATTN                                                  01578000
@NM00063 EQU   ZZ1+144                                                  01579000
ZZ1FPP   EQU   ZZ1+140                                                  01580000
ZZ1ZZ6P  EQU   ZZ1+136                                                  01581000
@NM00062 EQU   ZZ1+84                                                   01582000
ZZ1PLINE EQU   ZZ1+80                                                   01583000
ZZ1PGSZ  EQU   ZZ1+76                                                   01584000
ZZ1PCNT  EQU   ZZ1+72                                                   01585000
@NM00061 EQU   ZZ1+68                                                   01586000
ZZ1TPAGE EQU   ZZ1+64                                                   01587000
ZZ1TLINE EQU   ZZ1+60                                                   01588000
@NM00060 EQU   ZZ1+52                                                   01589000
ZZ1DMCBP EQU   ZZ1+48                                                   01590000
ZZ1DSDP  EQU   ZZ1+44                                                   01591000
ZZ1PDRP  EQU   ZZ1+40                                                   01592000
ZZ1ZZ2P  EQU   ZZ1+36                                                   01593000
ZZ1327WP EQU   ZZ1+32                                                   01594000
ZZ1ACBP  EQU   ZZ1+28                                                   01595000
@NM00059 EQU   ZZ1+24                                                   01596000
ZZ1PDCBP EQU   ZZ1+20                                                   01597000
ZZ1BLRBL EQU   ZZ1+16                                                   01598000
@NM00058 EQU   ZZ1+12                                                   01599000
ZZ1PNULL EQU   ZZ1+8                                                    01600000
ZZ1NULL  EQU   ZZ1+4                                                    01601000
ZZ1IDE   EQU   ZZ1                                                      01602000
VRBAT1   EQU   VRBAT                                                    01603000
@NM00055 EQU   VRBA+2                                                   01604000
VRBAL    EQU   VRBA                                                     01605000
ESCO999  EQU   ESCO+182                                                 01606000
ESCORT1  EQU   ESCORT                                                   01607000
ESCORL   EQU   ESCOR                                                    01608000
@NM00054 EQU   ESCO+168                                                 01609000
ESCOABS  EQU   ESCO+164                                                 01610000
@NM00053 EQU   ESCOF+2                                                  01611000
@NM00052 EQU   ESCOFC                                                   01612000
ESCOFCD  EQU   ESCOFC                                                   01613000
ESCOFSS  EQU   ESCOFS                                                   01614000
ESCOFSX  EQU   ESCOFS                                                   01615000
ESCOFSR  EQU   ESCOFS                                                   01616000
ESCOFSP  EQU   ESCOFS                                                   01617000
ESCOFSA  EQU   ESCOFS                                                   01618000
ESCOFSM  EQU   ESCOFS                                                   01619000
ESCOFS2  EQU   ESCOFS                                                   01620000
ESCOFSC  EQU   ESCOFS                                                   01621000
ESCOKEY  EQU   ESCO+160                                                 01622000
@NM00051 EQU   ESCO+144                                                 01623000
ESCOMAD  EQU   ESCO+140                                                 01624000
ESCOD99  EQU   ESCOD+60                                                 01625000
@NM00050 EQU   ESCOD+56                                                 01626000
@NM00049 EQU   ESCODF                                                   01627000
ESCODFA  EQU   ESCODF                                                   01628000
ESCODIL  EQU   ESCOD+48                                                 01629000
ESCODIM  EQU   ESCOD+44                                                 01630000
ESCODT9  EQU   ESCODT+34                                                01631000
ESCODTE  EQU   ESCODT+33                                                01632000
ESCODTD  EQU   ESCODT+2                                                 01633000
@NM00048 EQU   ESCODT+1                                                 01634000
ESCODTY  EQU   ESCODT                                                   01635000
ESCODT0  EQU   ESCODT                                                   01636000
ESCODLB  EQU   ESCOD+9                                                  01637000
ESCODOB  EQU   ESCOD+8                                                  01638000
ESCODLE  EQU   ESCOD+4                                                  01639000
ESCODOF  EQU   ESCOD                                                    01640000
ESCOD00  EQU   ESCOD                                                    01641000
ESCOLAD  EQU   ESCO+76                                                  01642000
ESCOAS9  EQU   ESCOAS+16                                                01643000
@NM00047 EQU   ESCOAS+12                                                01644000
ESCOAS2  EQU   ESCOAS+8                                                 01645000
ESCOAS1  EQU   ESCOAS+4                                                 01646000
@NM00046 EQU   ESCOAS+2                                                 01647000
ESCOAST  EQU   ESCOAS                                                   01648000
ESCOAS0  EQU   ESCOAS                                                   01649000
ESCORV1  EQU   ESCO+59                                                  01650000
ESCOELK  EQU   ESCO+59                                                  01651000
ESCOSYM  EQU   ESCO+28                                                  01652000
ESCORDX  EQU   ESCO+24                                                  01653000
@NM00045 EQU   ESCO+16                                                  01654000
@NM00044 EQU   ESCO+8                                                   01655000
@NM00043 EQU   ESCO+2                                                   01656000
ESCORID  EQU   ESCO                                                     01657000
SABA999  EQU   SABA+3072                                                01658000
SABACT1  EQU   SABACT                                                   01659000
@NM00020 EQU   SABA+153                                                 01660000
SABAPGV  EQU   SABA+144                                                 01661000
@NM00019 EQU   SABASF                                                   01662000
SABAF99  EQU   SABAF+60                                                 01663000
@NM00018 EQU   SABAF+56                                                 01664000
@NM00017 EQU   SABAFF                                                   01665000
SABAFFA  EQU   SABAFF                                                   01666000
SABAFIL  EQU   SABAF+48                                                 01667000
SABAFIM  EQU   SABAF+44                                                 01668000
SABAFT9  EQU   SABAFT+34                                                01669000
SABAFTE  EQU   SABAFT+33                                                01670000
SABAFTD  EQU   SABAFT+2                                                 01671000
@NM00016 EQU   SABAFT+1                                                 01672000
SABAFTY  EQU   SABAFT                                                   01673000
SABAFT0  EQU   SABAFT                                                   01674000
SABAFLB  EQU   SABAF+9                                                  01675000
SABAFOB  EQU   SABAF+8                                                  01676000
SABAFOF  EQU   SABAF                                                    01677000
SABAF00  EQU   SABAF                                                    01678000
@NM00015 EQU   SABA+66                                                  01679000
SABAELK  EQU   SABA+66                                                  01680000
SABADT9  EQU   SABADT+34                                                01681000
SABADTE  EQU   SABADT+33                                                01682000
SABADTD  EQU   SABADT+2                                                 01683000
@NM00014 EQU   SABADT+1                                                 01684000
SABADTY  EQU   SABADT                                                   01685000
SABADT0  EQU   SABADT                                                   01686000
SABAAS9  EQU   SABAAS+16                                                01687000
@NM00013 EQU   SABAAS+12                                                01688000
SABAAS2  EQU   SABAAS+8                                                 01689000
SABAAS1  EQU   SABAAS+4                                                 01690000
@NM00012 EQU   SABAAS+2                                                 01691000
SABAAS0  EQU   SABAAS                                                   01692000
SABARDX  EQU   SABA+8                                                   01693000
@NM00011 EQU   SABA+2                                                   01694000
SABARID  EQU   SABA                                                     01695000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01696000
@RT00155 EQU   LBLSCAN2                                                 01697000
@RF00155 EQU   LBLSCAN8                                                 01698000
@RT00209 EQU   LBLSCAN8                                                 01699000
@RF00229 EQU   @RC00227                                                 01700000
@RT00263 EQU   EXIT                                                     01701000
@ENDDATA EQU   *                                                        01702000
         END   BLSVXTLS,(C'PLS2104',0701,78069)                         01703000
