./  ADD  SSI=82090138,NAME=IGE0001G
         TITLE 'IGE0001G, SENECA ERROR RECOVERY PROCEDURE              *00001000
                        '                                               00002000
ER3890   CSECT ,                                                   0001 00003000
@PROLOG  BALR  @06,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@06                                         0001 00006000
*                                                                  0106 00007000
*   /*****************************************************************/ 00008000
*   /*                                                               */ 00009000
*   /* INITIALIZE IOB FLAGS                                          */ 00010000
*   /*                                                               */ 00011000
*   /*****************************************************************/ 00012000
*                                                                  0107 00013000
*   UCBPTR=IOSUCB;                  /* INIT PTR YM2316               */ 00014000
         L     UCBPTR,IOSUCB(,IOSBPTR)                             0107 00015000
*   EWAPTR=IOSERP;                  /* PTR FOR WORK AREA Y02990      */ 00016000
         L     EWAPTR,IOSERP(,IOSBPTR)                             0108 00017000
*   IOSERR='1'B;                    /* IOSB ERROR FLAG ON Y02990     */ 00018000
*   IOSEX='1'B;                     /* SET IOSB EXCEPTION Y02990     */ 00019000
         OI    IOSERR(IOSBPTR),B'00100100'                         0110 00020000
*   CVTREG=CVTPTR;                  /* INITIALIZE CVT REGISTER       */ 00021000
         L     CVTREG,CVTPTR                                       0111 00022000
*   IF IOSACHN='11'B                /* TEST FOR MIX CHAIN Y02990     */ 00023000
*     THEN                          /* YES, RECOVERY NOT POSSIBLE    */ 00024000
         TM    IOSACHN(IOSBPTR),B'11000000'                        0112 00025000
         BO    @RT00112                                            0112 00026000
*     GO TO EXIT22;                 /* PERMANENT ERROR- NO LOGOUT    */ 00027000
*   ELSE                            /* NO - CONTINUE                 */ 00028000
*     CCWREG=IOSCSWCA-EIGHT;        /* BACKUP ONE CCW Y02990         */ 00029000
         L     CCWREG,IOSCSWCA-1(,IOSBPTR)                         0114 00030000
         LA    CCWREG,0(,CCWREG)                                   0114 00031000
         SL    CCWREG,@CF00183                                     0114 00032000
*   IF IOSCCHN='0'B                 /* TEST OF CMND CHAIN Y02990     */ 00033000
*     THEN                          /* NO - MUST BE DATA OR NONE     */ 00034000
         TM    IOSCCHN(IOSBPTR),B'01000000'                        0115 00035000
         BZ    @RT00115                                            0115 00036000
*     GO TO STATUS;                 /* CHECK STATUS BYTE             */ 00037000
*   RFY                                                            0117 00038000
*     WKREG RSTD;                   /* Y02990                        */ 00039000
*   WKREG=CCWREG;                   /* Y02990                        */ 00040000
         LR    WKREG,CCWREG                                        0118 00041000
*   GEN(LRA WKREG,0(WKREG));        /* POINT TO REAL ADDR Y02990     */ 00042000
         LRA WKREG,0(WKREG)                                             00043000
*   IF IOSENT='0'B                  /* PREVIOUS ENTRY? Y02990        */ 00044000
*     THEN                          /* NO -FIRST TIME THROUGH        */ 00045000
         TM    IOSENT(EWAPTR),B'00000100'                          0120 00046000
         BNZ   @RF00120                                            0120 00047000
*     DO;                                                          0121 00048000
*       IOSENT='1'B;                /* SET ENTRY BIT Y02990          */ 00049000
         OI    IOSENT(EWAPTR),B'00000100'                          0122 00050000
*       GO TO RSTART;               /* SET RESTART ADDRESS           */ 00051000
         B     RSTART                                              0123 00052000
*     END;                                                         0124 00053000
*   IF WKREG=IOSRST                 /* ERROR ON RESTART? Y02990      */ 00054000
*     THEN                          /* YES - FLAGS ALREADY SET       */ 00055000
@RF00120 C     WKREG,IOSRST(,IOSBPTR)                              0125 00056000
         BE    @RT00125                                            0125 00057000
*     GO TO STATUS;                 /* CHECK STATUS BYTE             */ 00058000
*   ELSE                            /* NO - RESET ERROR COUNTS       */ 00059000
*     DO;                                                          0127 00060000
*       IOSFL3='00'B;               /* RESET ERROR COUNTERY02990     */ 00061000
         MVI   IOSFL3(EWAPTR),B'00000000'                          0128 00062000
*       IOSFL4='00'B;               /* RESET ERROR COUNTERY02990     */ 00063000
         MVI   IOSFL4(EWAPTR),B'00000000'                          0129 00064000
*     END;                                                         0130 00065000
*RSTART:                                                           0131 00066000
*   IOSRST=WKREG;                   /* SET RESTART ADDR Y02990       */ 00067000
RSTART   ST    WKREG,IOSRST(,IOSBPTR)                              0131 00068000
*   RFY                                                            0132 00069000
*     WKREG UNRSTD;                 /* Y02990                        */ 00070000
*                                                                  0132 00071000
*   /*****************************************************************/ 00072000
*   /*                                                               */ 00073000
*   /* TEST STATUS INFORMATION                                       */ 00074000
*   /*                                                               */ 00075000
*   /*****************************************************************/ 00076000
*                                                                  0133 00077000
*STATUS:                                                           0133 00078000
*   ERRLNK=BASEREG;                 /* SAVE BASEREG Y02990           */ 00079000
STATUS   LR    ERRLNK,BASEREG                                      0133 00080000
*   CALL XLTE;                      /* XFER CONTROL TO INTERPRETER   */ 00081000
         L     @12,CVTPTR                                          0134 00082000
         L     @15,CVTXITP(,@12)                                   0134 00083000
         BALR  @14,@15                                             0134 00084000
*STATBY:                                                           0135 00085000
*   GENERATE;                                                      0135 00086000
*                                                                  0135 00087000
STATBY   DS    0H                                                  0135 00088000
*                                       /* INTEROGATE STATUS         */ 00089000
*      THE FOLLOWING BYTES INDICATE THE ORDER IN WHICH THE STATUS BITS  00090000
*      ARE TO BE TESTED FOLLOWED BY AN INDEX FALUE USED BY THE          00091000
*      INTERPRETER TO RETURN TO THIS ROUTINE.                           00092000
         SPACE                                                          00093000
         DC    X'1D'                    CHANNEL CONTROL CHECK           00094000
         DC    AL1(ERR2+4-STATBY)                                       00095000
         DC    X'1E'                    INTERFACE CONTROL CHECK         00096000
         DC    AL1(ERR2+8-STATBY-2)                                     00097000
         DC    X'1C'                    CHANNEL DATA CHECK              00098000
         DC    AL1(ERR2-STATBY-4)                                       00099000
         DC    X'10'                    ATTENTION - SHOULD NOT OCCUR    00100000
         DC    AL1(ERR1-STATBY-6)                                       00101000
         DC    X'12'                    CU END - SHOULD NOT OCCUR       00102000
         DC    AL1(ERR1-STATBY-8)                                       00103000
         DC    X'1F'                    CHAINING CHECK                  00104000
         DC    AL1(ERR2+12-STATBY-10)                            YM2501 00105000
         DC    X'16'                    UNIT CHECK                      00106000
         DC    AL1(ERR3-STATBY-12)                                      00107000
         DC    X'1A'                    PROGRAM CHECK                   00108000
         DC    AL1(ERR1+4-STATBY-14)                                    00109000
         DC    X'1B'                    PROTECTION CHECK                00110000
         DC    AL1(ERR1+4-STATBY-16)                                    00111000
         DC    X'19'                    INCORRECT LENGTH                00112000
         DC    AL1(ERR2+16-STATBY-18)                            YM2501 00113000
         DC    X'17'                    UNIT EXCEPTION                  00114000
         DC    AL1(ERR4+4-STATBY-20)                                    00115000
         DC    X'2F'                    END OF TEST                     00116000
         DC    AL1(ERR4-STATBY-22)                                      00117000
*   /*****************************************************************/ 00118000
*   /*                                                               */ 00119000
*   /* TEST SENSE BYTE                                               */ 00120000
*   /*                                                               */ 00121000
*   /*****************************************************************/ 00122000
*                                                                  0136 00123000
*SENSE:                                                            0136 00124000
*   ERRLNK=BASEREG;                 /* SAVE BASEREG Y02990           */ 00125000
SENSE    LR    ERRLNK,BASEREG                                      0136 00126000
*   CALL XLTE;                      /* XFER CONTROL TO INTERPRETER   */ 00127000
         L     @12,CVTPTR                                          0137 00128000
         L     @15,CVTXITP(,@12)                                   0137 00129000
         BALR  @14,@15                                             0137 00130000
*SNSBYT:                                                           0138 00131000
*   GENERATE;                                                      0138 00132000
*                                                                  0138 00133000
SNSBYT   DS    0H                                                  0138 00134000
*                                       /* INTEROGATE SENSE          */ 00135000
*      THE FOLLOWING BYTES INDICATE THE ORDER IN WHICH THE SENSE BITS   00136000
*      ARE TO BE TESTED FOLLOWED BY AN INDEX VALUE USED BY THE          00137000
*      INTERPRETER TO RETURN TO THIS ROUTINE.                           00138000
         SPACE                                                          00139000
         DC    X'05'                    OVERRUN - SHOULD NOT OCCUR      00140000
         DC    AL1(ERR6-SNSBYT)                                         00141000
         DC    X'03'                    EQUIPMENT CHECK                 00142000
         DC    AL1(ERR6+4-SNSBYT-2)                                     00143000
         DC    X'02'                    BUSOUT CHECK                    00144000
         DC    AL1(ERR6+8-SNSBYT-4)                                     00145000
         DC    X'04'                    DATA CHECK                      00146000
         DC    AL1(ERR6+12-SNSBYT-6)                                    00147000
         DC    X'00'                    COMMAND REJECT                  00148000
         DC    AL1(ERR6+16-SNSBYT-8)                                    00149000
         DC    X'01'                    INTERVENTION REQUIRED           00150000
         DC    AL1(ERR6+20-SNSBYT-10)                                   00151000
         DC    X'07'                    RUNNING                         00152000
         DC    AL1(ERR6+20-SNSBYT-12)                                   00153000
         DC    X'06'                    NOT INITIALIZED                 00154000
         DC    AL1(ERR6+20-SNSBYT-14)                                   00155000
         DC    X'2F'                    END OF TEST                     00156000
         DC    AL1(ERR1+8-SNSBYT-16)                                    00157000
         SPACE                                                          00158000
*   /*****************************************************************/ 00159000
*   /*              ERROR DIRECTORY                                  *1 00160000
*   /*****************************************************************/ 00161000
         SPACE                                                          00162000
ERR1     BC    15,EXIT12                PERMANENT ERROR - LOGOUT        00163000
         BC    15,EXIT22                PERMANENT ERROR - NO LOGOUT     00164000
         BC    15,ERR075               RETRY THE COMMAND                00165000
ERR2     BC    15,ERR002                CONTROL UNIT INOPERATIVE        00166000
         BC    15,ERR001                CHANNEL INOPERATIVE - CCC       00167000
         BC    15,ERR011                CHANNEL INOPERATIVE - ICC       00168000
         BC    15,ERR004                CHAINING CHECK                  00169000
         BC    15,ERR006               INCORRECT LENGTH                 00170000
ERR3     BC    15,ERR005                DO BASIC SENSE & CONTINUE       00171000
ERR4     BC    15,EXIT01                NORMAL CONDITION                00172000
         BC    15,EXIT01A               UNIT EXCEPTION                  00173000
ERR6     BC    15,ERR015                UNIT CHECK - OVERRUN            00174000
         BC    15,ERR025                UNIT CHECK - EQUIPMENT CHK      00175000
         BC    15,ERR035                UNIT CHECK - BUSOUT CHK         00176000
         BC    15,ERR045                UNIT CHECK - DATA CHK           00177000
         BC    15,ERR055                UNIT CHECK - COMMAND REJECT     00178000
         BC    15,ERR065                UNIT CHECK-IRV,NI,OR R          00179000
*   /*****************************************************************/ 00180000
*   /*                                                               */ 00181000
*   /* CHANNEL ERROR                                                 */ 00182000
*   /*                                                               */ 00183000
*   /*****************************************************************/ 00184000
*                                                                  0139 00185000
*ERR001:                                                           0139 00186000
*   IF IOSCCC='1'B                  /* PREVIOUS CCC? Y02990          */ 00187000
*     THEN                          /* YES - PERMANENT ERROR         */ 00188000
ERR001   TM    IOSCCC(EWAPTR),B'00100000'                          0139 00189000
         BNO   @RF00139                                            0139 00190000
*     EWACNTR3=ONE;                 /* IND ERROR ON RETRY Y02990     */ 00191000
         MVI   EWACNTR3(EWAPTR),X'01'                              0140 00192000
*   ELSE                            /* NO - SET CCC ERROR IND.       */ 00193000
*     IOSCCC='1'B;                  /* SET ERROR CTR TO 1 Y02990     */ 00194000
         B     @RC00139                                            0141 00195000
@RF00139 OI    IOSCCC(EWAPTR),B'00100000'                          0141 00196000
*   GO TO ERR021;                   /* GET ERPIB                     */ 00197000
         B     ERR021                                              0142 00198000
*ERR011:                                                           0143 00199000
*   IF IOSICC='1'B                  /* PREVIOUS ICC? Y02990          */ 00200000
*     THEN                          /* YES - PERMANENT ERROR         */ 00201000
ERR011   TM    IOSICC(EWAPTR),B'00010000'                          0143 00202000
         BNO   @RF00143                                            0143 00203000
*     EWACNTR3=ONE;                 /* IND ERROR ON RETRY Y02990     */ 00204000
         MVI   EWACNTR3(EWAPTR),X'01'                              0144 00205000
*   ELSE                            /* NO - SET ICC ERR IND          */ 00206000
*     IOSICC='1'B;                  /* SET ETTOR CTR TO 1 Y02990     */ 00207000
         B     @RC00143                                            0145 00208000
@RF00143 OI    IOSICC(EWAPTR),B'00010000'                          0145 00209000
*ERR021:                                                           0146 00210000
*   IF IOSCOD='7E'X                 /* TEST FOR INTERCEPT Y02990     */ 00211000
*     THEN                          /* YES - PERMANENT ERROR         */ 00212000
@RC00143 DS    0H                                                  0146 00213000
ERR021   CLI   IOSCOD(IOSBPTR),X'7E'                               0146 00214000
         BE    @RT00146                                            0146 00215000
*     GO TO ERR051;                 /* CLEAR ERPIB AND EXIT          */ 00216000
*   IF EWACNTR3=ONE                 /* YES PERMANENT ERR Y02990      */ 00217000
*     THEN                          /* YES - PERMANENT ERROR         */ 00218000
         CLI   EWACNTR3(EWAPTR),1                                  0148 00219000
         BE    @RT00148                                            0148 00220000
*     GO TO ERR051;                 /* CLEAR ERPIB AND EXIT          */ 00221000
*   IF IBSEQ='000'B                 /* TEST FOR SEQ CODE ZERO        */ 00222000
*     THEN                          /* YES - PERMANENT ERROR         */ 00223000
         TM    IBSEQ(EWAPTR),B'00000111'                           0150 00224000
         BZ    @RT00150                                            0150 00225000
*     GO TO ERR051;                 /* CLEAR ERPIB AND EXIT          */ 00226000
*   IF IBSEQ='110'B                 /* TEST FOR SEQ CODE SIX         */ 00227000
*     THEN                          /* YES - PERMANENT ERROR         */ 00228000
         TM    IBSEQ(EWAPTR),B'00000110'                           0152 00229000
         BNO   @RF00152                                            0152 00230000
         TM    IBSEQ(EWAPTR),B'00000001'                           0152 00231000
         BZ    @RT00152                                            0152 00232000
*     GO TO ERR051;                 /* CLEAR ERPIB AND EXIT          */ 00233000
*   IF IBFL3='0'B                   /* TEST FOR VALID CCW            */ 00234000
*     THEN                          /* NO - PERMANENT ERROR          */ 00235000
@RF00152 TM    IBFL3(EWAPTR),B'00000100'                           0154 00236000
         BZ    @RT00154                                            0154 00237000
*     GO TO ERR051;                 /* CLEAR ERPIB AND EXIT          */ 00238000
*   ELSE                            /* YES - REISSUE COMMAND         */ 00239000
*     DO;                                                          0156 00240000
*       ERPIB=ZERO;                 /* ZERO OUT ERPIB                */ 00241000
         MVC   ERPIB(8,EWAPTR),ZERO                                0157 00242000
*       GO TO EXIT24;               /* RETRY                         */ 00243000
         B     EXIT24                                              0158 00244000
*     END;                                                         0159 00245000
*ERR051:                                                           0160 00246000
*   ERPIB=ZERO;                     /* ZERO ERPIB                    */ 00247000
ERR051   MVC   ERPIB(8,EWAPTR),ZERO                                0160 00248000
*   GO TO EXIT12;                   /* LOGOUT, MSG FLAG & EXIT       */ 00249000
*                                                                  0161 00250000
         B     EXIT12                                              0161 00251000
*   /*****************************************************************/ 00252000
*   /*                                                               */ 00253000
*   /* CHANNEL DATA CHECK                                            */ 00254000
*   /*                                                               */ 00255000
*   /*****************************************************************/ 00256000
*                                                                  0162 00257000
*ERR002:                                                           0162 00258000
*   IF IOSCOD='7E'X                 /* TEST FOR INTERCEPT Y02990     */ 00259000
*     THEN                          /* YES - PERMANENT ERROR         */ 00260000
ERR002   CLI   IOSCOD(IOSBPTR),X'7E'                               0162 00261000
         BE    @RT00162                                            0162 00262000
*     GO TO EXIT12;                 /* LOGOUT, SET MSG & EXIT        */ 00263000
*   IF IOSCDC='1'B                  /* COMMAND RETRIED? Y02990       */ 00264000
*     THEN                          /* YES - PERMANENT ERROR         */ 00265000
         TM    IOSCDC(EWAPTR),B'00001000'                          0164 00266000
         BO    @RT00164                                            0164 00267000
*     GO TO EXIT12;                 /* SET MSGFLAG,LOG & EXIT        */ 00268000
*   ELSE                            /* NO:                           */ 00269000
*     IOSCDC='1'B;                  /* SET ERROR CTR Y02990          */ 00270000
         OI    IOSCDC(EWAPTR),B'00001000'                          0166 00271000
*   GO TO EXIT24;                   /* RETRY                         */ 00272000
*                                                                  0167 00273000
         B     EXIT24                                              0167 00274000
*   /*****************************************************************/ 00275000
*   /*                                                               */ 00276000
*   /* CHAINING CHECK                                                */ 00277000
*   /*                                                               */ 00278000
*   /*****************************************************************/ 00279000
*                                                                  0168 00280000
*ERR004:                                                           0168 00281000
*   IF IOSCOD='7E'X                 /* TEST FOR INTERCEPT Y02990     */ 00282000
*     THEN                          /* YES - PERMANENT               */ 00283000
ERR004   CLI   IOSCOD(IOSBPTR),X'7E'                               0168 00284000
         BE    @RT00168                                            0168 00285000
*     GO TO EXIT12;                 /* LOGOUT, SET MSGFLAG, EXIT     */ 00286000
*   IF IOSCNC='1'B                  /* COMMAND RETRIED? Y02990       */ 00287000
*     THEN                          /* YES - PERMANENT ERROR         */ 00288000
         TM    IOSCNC(EWAPTR),B'00000010'                          0170 00289000
         BO    @RT00170                                            0170 00290000
*     GO TO EXIT12;                 /* SET MSG FLAG,LOGOUT & EXIT    */ 00291000
*   ELSE                            /* NO:                           */ 00292000
*     IOSCNC='1'B;                  /* SET ERROR CTR Y02990          */ 00293000
         OI    IOSCNC(EWAPTR),B'00000010'                          0172 00294000
*   GO TO EXIT24;                   /* RETRY                         */ 00295000
*                                                                  0173 00296000
         B     EXIT24                                              0173 00297000
*   /*****************************************************************/ 00298000
*   /*                                                               */ 00299000
*   /* UNIT CHECK                                                    */ 00300000
*   /*                                                               */ 00301000
*   /*****************************************************************/ 00302000
*                                                                  0174 00303000
*ERR005:                                                           0174 00304000
*   IF IOSCOD='7E'X                 /* TEST FOR INTERCEPT Y02990     */ 00305000
*     THEN                          /* YES - PERMANENT ERROR         */ 00306000
ERR005   CLI   IOSCOD(IOSBPTR),X'7E'                               0174 00307000
         BE    @RT00174                                            0174 00308000
*     GO TO EXIT12;                 /* LOGOUT, SET MSG & EXIT        */ 00309000
*   ELSE                            /* NO:                           */ 00310000
*     GO TO SENSE;                  /* EXAMINE SENSE BYTE            */ 00311000
         B     SENSE                                               0176 00312000
*ERR015:                                                           0177 00313000
*   IF IOSOVR='1'B                  /* COMMAND RETRIED? Y02990       */ 00314000
*     THEN                          /* YES - PERMANENT ERROR         */ 00315000
ERR015   TM    IOSOVR(EWAPTR),B'10000000'                          0177 00316000
         BO    @RT00177                                            0177 00317000
*     GO TO EXIT12;                 /* SET MSGFLAG,LOGOUT & EXIT     */ 00318000
*   ELSE                            /* NO:                           */ 00319000
*     IOSOVR='1'B;                  /* SET ERROR COUNTER Y02990      */ 00320000
         OI    IOSOVR(EWAPTR),B'10000000'                          0179 00321000
*   GO TO EXIT04;                   /* KEEP STATISTICS & RETRY       */ 00322000
         B     EXIT04                                              0180 00323000
*ERR025:                                                           0181 00324000
*   IF IOSEQP='1'B                  /* COMMAND RETRIED? Y02990       */ 00325000
*     THEN                          /* YES - PERMANENT ERROR         */ 00326000
ERR025   TM    IOSEQP(EWAPTR),B'00001000'                          0181 00327000
         BO    @RT00181                                            0181 00328000
*     GO TO EXIT12;                 /* SET MSG FLAG,LOGOUT & EXIT    */ 00329000
*   ELSE                            /* NO:                           */ 00330000
*     IOSEQP='1'B;                  /* SET ERROR COUNTER Y02990      */ 00331000
         OI    IOSEQP(EWAPTR),B'00001000'                          0183 00332000
*   GO TO EXIT04;                   /* KEEP STATISTICS & RETRY       */ 00333000
         B     EXIT04                                              0184 00334000
*ERR035:                                                           0185 00335000
*   IF IOSBUS='1'B                  /* COMMAND RETRIED? Y02990       */ 00336000
*     THEN                          /* YES - PERMANENT ERROR         */ 00337000
ERR035   TM    IOSBUS(EWAPTR),B'00010000'                          0185 00338000
         BO    @RT00185                                            0185 00339000
*     GO TO EXIT12;                 /* SET MSG FLAG,LOGOUT & EXIT    */ 00340000
*   ELSE                            /* NO:                           */ 00341000
*     IOSBUS='1'B;                  /* SET ERROR COUNTER Y02990      */ 00342000
         OI    IOSBUS(EWAPTR),B'00010000'                          0187 00343000
*   GO TO EXIT04;                   /* KEEP STATISTICS & RETRY       */ 00344000
         B     EXIT04                                              0188 00345000
*ERR045:                                                           0189 00346000
*   IF IOSDCK='1'B                  /* COMMAND RETRIED? Y02990       */ 00347000
*     THEN                          /* YES - PERMANENT ERROR         */ 00348000
ERR045   TM    IOSDCK(EWAPTR),B'00100000'                          0189 00349000
         BO    @RT00189                                            0189 00350000
*     GO TO EXIT12;                 /* SET MSG FLAG,LOGOUT & EXIT    */ 00351000
*   ELSE                            /* NO:                           */ 00352000
*     IOSDCK='1'B;                  /* SET ERROR COUNTER Y02990      */ 00353000
         OI    IOSDCK(EWAPTR),B'00100000'                          0191 00354000
*   GO TO EXIT04;                   /* KEEP STATISTICS & RETRY       */ 00355000
         B     EXIT04                                              0192 00356000
*ERR055:                                                           0193 00357000
*   IF IOSREJ='1'B                  /* COMMAND RETRIED? Y02990       */ 00358000
*     THEN                          /* YES - PERMANENT ERROR         */ 00359000
ERR055   TM    IOSREJ(EWAPTR),B'01000000'                          0193 00360000
         BO    @RT00193                                            0193 00361000
*     GO TO EXIT12;                 /* SET MSGFLAG,LOGOUT & EXIT     */ 00362000
*   ELSE                            /* NO:                           */ 00363000
*     IOSREJ='1'B;                  /* SET ERROR COUNTER Y02990      */ 00364000
         OI    IOSREJ(EWAPTR),B'01000000'                          0195 00365000
*   GO TO EXIT04;                   /* KEEP STATISTICS & RETRY       */ 00366000
         B     EXIT04                                              0196 00367000
*ERR065:                                                           0197 00368000
*   IF ILCSTAT='1'B THEN            /* IF ILC ALSO OCCURRED          */ 00369000
ERR065   TM    ILCSTAT(IOSBPTR),B'01000000'                        0197 00370000
         BO    @RT00197                                            0197 00371000
*     GOTO ERR006;                  /* HANDLE BEFORE UC              */ 00372000
*   IF PRGSTAT='1'B|PRTSTAT='1'B THEN/* IF PRG OR PROT.CHK           */ 00373000
         TM    PRGSTAT(IOSBPTR),B'00110000'                        0199 00374000
         BNZ   @RT00199                                            0199 00375000
*     GOTO EXIT22;                  /* HANDLE BEFORE U C             */ 00376000
*   IF IOSS0B1¬='1'B THEN           /* IRV                   @YM00646*/ 00377000
         TM    IOSS0B1(IOSBPTR),B'01000000'                        0201 00378000
         BO    @RF00201                                            0201 00379000
*     DO;                           /* NO                    @YM00646*/ 00380000
*       IF IOSS0B7='1'B THEN        /* RUNNING               @YM00646*/ 00381000
         TM    IOSS0B7(IOSBPTR),B'00000001'                        0203 00382000
         BO    @RT00203                                            0203 00383000
*         GOTO EXIT01;              /* YES                   @YM00646*/ 00384000
*     END;                          /*                       @YM00646*/ 00385000
*   IF UNITEXP='1'B THEN            /* UNIT EXCEPTION        @YM00626*/ 00386000
@RF00201 TM    UNITEXP(IOSBPTR),B'00000001'                        0206 00387000
         BNO   @RF00206                                            0206 00388000
*     IF IOSEXCP='1'B               /* EXCP ID               @YM00626*/ 00389000
*       THEN                        /*                       @YM00626*/ 00390000
         TM    IOSEXCP(IOSBPTR),B'00000010'                        0207 00391000
         BNO   @RF00207                                            0207 00392000
*       DO;                         /* YES IOB EXISTS        @YM00626*/ 00393000
*         ERREG1=RQEPRT;            /*                       @ZA29842*/ 00394000
         L     @15,IOSUSE(,IOSBPTR)                                0209 00395000
         SLR   ERREG1,ERREG1                                       0209 00396000
         IC    ERREG1,RQEPRT(,@15)                                 0209 00397000
*         GEN(MODESET KEYADDR=(2)); /*                       @ZA34114*/ 00398000
         MODESET KEYADDR=(2)                                            00399000
*         MRFLG='1'B;               /* INDICATE SCI PAUSE    @YM00626*/ 00400000
         L     @15,IOSUSE(,IOSBPTR)                                0211 00401000
         L     @15,RQEDEB(,@15)                                    0211 00402000
         L     @15,DEBDCBAD(,@15)                                  0211 00403000
         OI    MRFLG(@15),B'00000001'                              0211 00404000
*         GEN(MODESET EXTKEY=ZERO); /*                       @ZA34114*/ 00405000
         MODESET EXTKEY=ZERO                                            00406000
*         IOSCOD='7F'X;             /* NORMAL END OF COMPLETION      */ 00407000
         MVI   IOSCOD(IOSBPTR),X'7F'                               0213 00408000
*       END;                        /*                       @YM00626*/ 00409000
*     ELSE                                                         0215 00410000
*       ;                           /*                       @YM00626*/ 00411000
@RF00207 DS    0H                                                  0216 00412000
*   ELSE                                                           0216 00413000
*     ;                             /* NOT UNIT EXP          @YM00626*/ 00414000
@RF00206 DS    0H                                                  0217 00415000
*   IF IOSS0B1¬='1'B&IOSS0B6='1'B THEN/* NON-INITIALIZED     @ZA00778*/ 00416000
         TM    IOSS0B6(IOSBPTR),B'00000010'                        0217 00417000
         BNO   @RF00217                                            0217 00418000
         TM    IOSS0B1(IOSBPTR),B'01000000'                        0217 00419000
         BZ    @RT00217                                            0217 00420000
*     GOTO EXIT01;                  /* AND NOT IRV           @ZA00778*/ 00421000
*   XCTLPTR=ADDR(EWCSAVES);         /* SAVE FOR IOSGEN Y02990        */ 00422000
@RF00217 LA    XCTLPTR,EWCSAVES(,EWAPTR)                           0219 00423000
*   GEN(IOSGEN UCBFLG,UCB=(8),VAR=ON,TABLE=UCBNRY,REG=COND)/* Y02990 */ 00424000
*   REFS(UCBFLC,CVTPTR,CVTIXAVL,IOCGENA,UCBBGN);/* Y02990            */ 00425000
         IOSGEN UCBFLG,UCB=(8),VAR=ON,TABLE=UCBNRY,REG=COND             00426000
*   IOSCOD='7F'X;                   /* NORMATL COMPLETION Y02990     */ 00427000
         MVI   IOSCOD(IOSBPTR),X'7F'                               0221 00428000
*   IF SIOCC3=NOTOPER               /* SIO CC=3              @ZA04493*/ 00429000
*     THEN                          /* YES, GO ISSUE 'NO     @ZA04493*/ 00430000
         TM    SIOCC3(IOSBPTR),B'00110000'                         0222 00431000
         BO    @RT00222                                            0222 00432000
*     GOTO EXIT30;                  /* PATHS AVAILABLE' MSG  @ZA04493*/ 00433000
*   GOTO EXIT01;                    /* CLEAR INDICATORS              */ 00434000
         B     EXIT01                                              0224 00435000
*ERR075:                                                           0225 00436000
*   IF UNITEXP='1'B THEN            /* UNIT EXCEPTION?       @YM00626*/ 00437000
ERR075   TM    UNITEXP(IOSBPTR),B'00000001'                        0225 00438000
         BNO   @RF00225                                            0225 00439000
*     DO;                           /*                       @YM00626*/ 00440000
*       IOSCOD='7F'X;               /* NORMAL END OF COMPLETION      */ 00441000
         MVI   IOSCOD(IOSBPTR),X'7F'                               0227 00442000
*       GOTO EXIT01A;               /* GO INDICATE SCI PAUSE         */ 00443000
         B     EXIT01A                                             0228 00444000
*     END;                          /*                       @YM00626*/ 00445000
*   IF IOSUC='1'B THEN              /* FIRST TIME?           @YM00626*/ 00446000
@RF00225 TM    IOSUC(EWAPTR),B'00000100'                           0230 00447000
         BO    @RT00230                                            0230 00448000
*     GO TO EXIT12;                 /* NO,PERMANENT ERROR    @YM00626*/ 00449000
*   ELSE                                                           0232 00450000
*     IOSUC='1'B;                   /* SET ERROR CTR         @YM00626*/ 00451000
         OI    IOSUC(EWAPTR),B'00000100'                           0232 00452000
*   GO TO EXIT24;                   /* GO RETRY              @YM00626*/ 00453000
*                                                                  0233 00454000
         B     EXIT24                                              0233 00455000
*   /*****************************************************************/ 00456000
*   /*                                                               */ 00457000
*   /* INCORRECT LENGTH                                              */ 00458000
*   /*                                                               */ 00459000
*   /*****************************************************************/ 00460000
*                                                                  0234 00461000
*ERR006:                                                           0234 00462000
*   IF IOSICL='1'B                  /* COMMAND RETRIED? Y02990       */ 00463000
*     THEN                          /* YES - PERMANENT ERROR         */ 00464000
ERR006   TM    IOSICL(EWAPTR),B'00000001'                          0234 00465000
         BO    @RT00234                                            0234 00466000
*     GO TO EXIT12;                 /* SET MSG FLAG,LOGOUT & EXIT    */ 00467000
*   ELSE                            /* NO:                           */ 00468000
*     IOSICL='1'B;                  /* SET ERROR COUNTER Y02990      */ 00469000
         OI    IOSICL(EWAPTR),B'00000001'                          0236 00470000
*   GO TO EXIT24;                   /* RETRY                         */ 00471000
*                                                                  0237 00472000
         B     EXIT24                                              0237 00473000
*   /*****************************************************************/ 00474000
*   /*                                                               */ 00475000
*   /* ERROR CORRECTED                                               */ 00476000
*   /*                                                               */ 00477000
*   /*****************************************************************/ 00478000
*                                                                  0238 00479000
*EXIT01A:                                                          0238 00480000
*   IF IOSEXCP='1'B                 /* ID EXCP Y02990                */ 00481000
*     THEN                          /* YES IOB EXISTS Y02990         */ 00482000
EXIT01A  TM    IOSEXCP(IOSBPTR),B'00000010'                        0238 00483000
         BNO   @RF00238                                            0238 00484000
*     DO;                           /*                       @ZA29842*/ 00485000
*       ERREG1=RQEPRT;              /*                       @ZA29842*/ 00486000
         L     @15,IOSUSE(,IOSBPTR)                                0240 00487000
         SLR   ERREG1,ERREG1                                       0240 00488000
         IC    ERREG1,RQEPRT(,@15)                                 0240 00489000
*       GEN(MODESET KEYADDR=(2));   /*                       @ZA34114*/ 00490000
         MODESET KEYADDR=(2)                                            00491000
*       MRFLG='1'B;                 /* SET MRFLG ON IN DCBY02990     */ 00492000
         L     @15,IOSUSE(,IOSBPTR)                                0242 00493000
         L     @15,RQEDEB(,@15)                                    0242 00494000
         L     @15,DEBDCBAD(,@15)                                  0242 00495000
         OI    MRFLG(@15),B'00000001'                              0242 00496000
*       GEN(MODESET EXTKEY=ZERO);   /*                       @ZA34114*/ 00497000
         MODESET EXTKEY=ZERO                                            00498000
*     END;                          /*                       @ZA29842*/ 00499000
*   ELSE                                                           0245 00500000
*     ;                             /* Y02990                        */ 00501000
@RF00238 DS    0H                                                  0246 00502000
*EXIT01:                                                           0246 00503000
*   IOSTATUS='0000'X;               /* CLEAR STATUS BYTES Y02990     */ 00504000
EXIT01   MVC   IOSTATUS(2,IOSBPTR),@CB01553                        0246 00505000
*   IOSFLG1='000000'B;              /* CLEAR IOSFLA Y02990           */ 00506000
         NI    IOSFLG1(IOSBPTR),B'11000000'                        0247 00507000
*   IOSFLC='00'X;                   /* CLEAR IOSB FLAG3 Y02990       */ 00508000
         MVI   IOSFLC(IOSBPTR),X'00'                               0248 00509000
*   IOSFL4='00'X;                   /* CLEAR IOSB FLAG 4 Y02990      */ 00510000
         MVI   IOSFL4(EWAPTR),X'00'                                0249 00511000
*   EWACNTR3='00'X;                 /* CLEAR ERR CTR FIELDY02990     */ 00512000
         MVI   EWACNTR3(EWAPTR),X'00'                              0250 00513000
*   GO TO EXIT13;                   /* XFER CNTL TO STAT UPD RTN     */ 00514000
*                                                                  0251 00515000
         B     EXIT13                                              0251 00516000
*   /*****************************************************************/ 00517000
*   /*                                                               */ 00518000
*   /* KEEP STATISTICS AND RETRY                                     */ 00519000
*   /*                                                               */ 00520000
*   /*****************************************************************/ 00521000
*                                                                  0252 00522000
*EXIT04:                                                           0252 00523000
*   EWASTUP=EWASTUP|IOSSNS;         /* OR SENSE BYTES Y02990         */ 00524000
EXIT04   OC    EWASTUP(2,EWAPTR),IOSSNS(IOSBPTR)                   0252 00525000
*EXIT24:                                                           0253 00526000
*   IF COMCODE='53'X THEN           /* LOAD CCW                      */ 00527000
EXIT24   CLI   COMCODE(CCWREG),X'53'                               0253 00528000
         BNE   @RF00253                                            0253 00529000
*     IF UCSTAT¬='1'B THEN          /* & NOT UC STATUS               */ 00530000
         TM    UCSTAT(IOSBPTR),B'00000010'                         0254 00531000
         BNO   @RT00254                                            0254 00532000
*       GOTO EXIT22;                /* DO NOT RETRY                  */ 00533000
*     ELSE                                                         0256 00534000
*       ;                           /* NULL ELSE                     */ 00535000
*   ELSE                                                           0257 00536000
*     ;                             /* NULL ELSE                     */ 00537000
@RF00253 DS    0H                                                  0258 00538000
*   IOSERR='1'B;                    /* SET IOSB ERROR FLAGY02990     */ 00539000
         OI    IOSERR(IOSBPTR),B'00100000'                         0258 00540000
*   GENERATE;                                                      0259 00541000
*                                                                  0259 00542000
*                                       /* RETURN TO IOS             */ 00543000
         SVC   15                       ERROR EXCP                      00544000
         SVC   3                        RETURN                          00545000
*   /*****************************************************************/ 00546000
*   /*                                                               */ 00547000
*   /* PERMANENT ERROR                                               */ 00548000
*   /*                                                               */ 00549000
*   /*****************************************************************/ 00550000
*                                                                  0260 00551000
*EXIT12:                                                           0260 00552000
*   IOSLOG='1'B;                    /* SET LOGOUT FLAG Y02990        */ 00553000
EXIT12   OI    IOSLOG(IOSBPTR),B'00000001'                         0260 00554000
*   EWAMDR='0'B;                    /* SET OBR FLAG Y02990           */ 00555000
         NI    EWAMDR(EWAPTR),B'01111111'                          0261 00556000
*EXIT22:                                                           0262 00557000
*   IOSEX='1'B;                     /* I/O EXCEPTION FLAG ON Y02990  */ 00558000
EXIT22   OI    IOSEX(IOSBPTR),B'00000100'                          0262 00559000
*   IOSMSG='1'B;                    /* SET MSG TYPE FLAG Y02990      */ 00560000
         OI    IOSMSG(IOSBPTR),B'00000100'                         0263 00561000
*EXIT30:                                                           0264 00562000
*   IOSERR='0'B;                    /* ERP NOT IN CONTROL    @ZA04493*/ 00563000
EXIT30   NI    IOSERR(IOSBPTR),B'11011111'                         0264 00564000
*   XCTLPTR=WTORTN;                 /* GET LOAD NAME OF WTO RTN      */ 00565000
         L     XCTLPTR,WTORTN-1                                    0265 00566000
         LA    XCTLPTR,0(,XCTLPTR)                                 0265 00567000
*   XCTLREG=CVTXTLER;               /* GET ADDR OF XCTL ROUTINE      */ 00568000
         L     @12,CVTPTR                                          0266 00569000
         L     @12,CVTXTLER(,@12)                                  0266 00570000
         LR    XCTLREG,@12                                         0266 00571000
*   GO TO XCTL;                     /* XFER CONTROL TO WTO OR OBR    */ 00572000
*                                                                  0267 00573000
         BR    @12                                                 0267 00574000
*   /*****************************************************************/ 00575000
*   /*                                                               */ 00576000
*   /* STATISTICS UPDATE ROUTINE                                     */ 00577000
*   /*                                                               */ 00578000
*   /*****************************************************************/ 00579000
*                                                                  0268 00580000
*EXIT13:                                                           0268 00581000
*   XCTLPTR=STUPDT;                 /* GET LOAD NAME OF UPDAT RTN    */ 00582000
EXIT13   L     XCTLPTR,STUPDT-1                                    0268 00583000
         LA    XCTLPTR,0(,XCTLPTR)                                 0268 00584000
*   XCTLREG=CVTXTLER;               /* GET ADDR OF XCTL ROUTINE      */ 00585000
         L     @12,CVTPTR                                          0269 00586000
         L     @12,CVTXTLER(,@12)                                  0269 00587000
         LR    XCTLREG,@12                                         0269 00588000
*   GO TO XCTL;                     /* XFER CONTROL TO STAT UPDT     */ 00589000
         BR    @12                                                 0270 00590000
*   END ER3890                                                     0271 00591000
*                                                                  0271 00592000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00593000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 00594000
*/*%INCLUDE SYSLIB  (EWAMAP  )                                       */ 00595000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */ 00596000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 00597000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00598000
*                                                                  0271 00599000
*       ;                                                          0271 00600000
@DATA    DS    0H                                                       00601000
         DS    0F                                                       00602000
         DS    0F                                                       00603000
@CF00183 DC    XL4'08'                                                  00604000
         DS    0D                                                       00605000
IOCOMPTR DS    A                                                        00606000
         DS    CL1                                                      00607000
WTORTN   DC    AL3(253)                                                 00608000
         DS    CL1                                                      00609000
STUPDT   DC    AL3(254)                                                 00610000
@CB01553 DC    X'0000'                                                  00611000
ZERO     DS    CL8                                                      00612000
         ORG   ZERO                                                     00613000
Z1       DC    8X'00'                                                   00614000
         ORG   ZERO+8                                                   00615000
MTAREA   DS    CL50                                                     00616000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00617000
@01      EQU   01                                                       00618000
@02      EQU   02                                                       00619000
@03      EQU   03                                                       00620000
@04      EQU   04                                                       00621000
@05      EQU   05                                                       00622000
@06      EQU   06                                                       00623000
@07      EQU   07                                                       00624000
@08      EQU   08                                                       00625000
@09      EQU   09                                                       00626000
@10      EQU   10                                                       00627000
@11      EQU   11                                                       00628000
@12      EQU   12                                                       00629000
@13      EQU   13                                                       00630000
@14      EQU   14                                                       00631000
@15      EQU   15                                                       00632000
IOSBPTR  EQU   @01                                                      00633000
ERREG1   EQU   @02                                                      00634000
CVTREG   EQU   @04                                                      00635000
CCWREG   EQU   @05                                                      00636000
BASEREG  EQU   @06                                                      00637000
ERPBRG   EQU   @07                                                      00638000
UCBPTR   EQU   @08                                                      00639000
ERRLNK   EQU   @09                                                      00640000
EWAPTR   EQU   @10                                                      00641000
WKREG    EQU   @11                                                      00642000
XCTLPTR  EQU   @13                                                      00643000
XCTLREG  EQU   @14                                                      00644000
CVTPTR   EQU   16                                                       00645000
IOSB     EQU   0                                                        00646000
IOSFLA   EQU   IOSB                                                     00647000
IOSACHN  EQU   IOSFLA                                                   00648000
IOSCCHN  EQU   IOSACHN                                                  00649000
IOSERR   EQU   IOSFLA                                                   00650000
IOSEX    EQU   IOSFLA                                                   00651000
IOSFLB   EQU   IOSB+1                                                   00652000
IOSMSG   EQU   IOSFLB                                                   00653000
IOSLOG   EQU   IOSFLB                                                   00654000
IOSFLC   EQU   IOSB+2                                                   00655000
IOSDVALT EQU   IOSFLC                                                   00656000
IOSDVRID EQU   IOSB+4                                                   00657000
IOSPKEY  EQU   IOSB+12                                                  00658000
IOSCOD   EQU   IOSB+13                                                  00659000
IOSOPT   EQU   IOSB+14                                                  00660000
IOSOPT2  EQU   IOSB+15                                                  00661000
IOSUCB   EQU   IOSB+16                                                  00662000
@NM00002 EQU   IOSB+20                                                  00663000
IOSCC    EQU   @NM00002                                                 00664000
IOSCSW   EQU   @NM00002+1                                               00665000
IOSCSWCA EQU   IOSCSW                                                   00666000
IOSTATUS EQU   IOSCSW+3                                                 00667000
IOSTSA   EQU   IOSTATUS                                                 00668000
IOSUSE   EQU   IOSB+32                                                  00669000
IOSSNS   EQU   IOSB+42                                                  00670000
IOSIPIB  EQU   IOSB+44                                                  00671000
IOSERP   EQU   IOSB+52                                                  00672000
IOSRST   EQU   IOSB+72                                                  00673000
IOSPATH  EQU   IOSB+86                                                  00674000
IOSCHN   EQU   IOSPATH                                                  00675000
IOSCKEY  EQU   IOSB+89                                                  00676000
IOSEEKA  EQU   IOSB+100                                                 00677000
IOSCCHH  EQU   IOSEEKA+3                                                00678000
IOSSKHH  EQU   IOSCCHH+2                                                00679000
EWA      EQU   0                                                        00680000
EWAHDR   EQU   EWA                                                      00681000
EWAFLAGS EQU   EWA+4                                                    00682000
EWAFLG1  EQU   EWAFLAGS                                                 00683000
EWASCCD  EQU   EWAFLG1                                                  00684000
EWASCC3  EQU   EWASCCD                                                  00685000
EWAFLG2  EQU   EWAFLAGS+1                                               00686000
EWAMDR   EQU   EWAFLG2                                                  00687000
EWAFLG3  EQU   EWAFLAGS+2                                               00688000
EWASNSCT EQU   EWAFLAGS+3                                               00689000
EWACNTRS EQU   EWA+10                                                   00690000
EWACNTR1 EQU   EWACNTRS                                                 00691000
EWACNTR3 EQU   EWACNTRS+2                                               00692000
EWASTUP  EQU   EWA+14                                                   00693000
EWAERPIB EQU   EWA+16                                                   00694000
EWARGFG1 EQU   EWAERPIB+4                                               00695000
EWARGFG2 EQU   EWAERPIB+5                                               00696000
EWAXCSW1 EQU   EWAERPIB+6                                               00697000
EWAXCSW2 EQU   EWAERPIB+7                                               00698000
EWAIERP  EQU   EWA+32                                                   00699000
IOCOM    EQU   0                                                        00700000
IOCGENA  EQU   IOCOM+84                                                 00701000
UCB      EQU   0                                                        00702000
UCBOB    EQU   0                                                        00703000
UCBJBNR  EQU   UCBOB                                                    00704000
UCBFL5   EQU   UCBOB+1                                                  00705000
UCBAF    EQU   UCBFL5                                                   00706000
UCBSTAT  EQU   UCBOB+3                                                  00707000
UCBCHAN  EQU   UCBOB+4                                                  00708000
UCBSFLS  EQU   UCBOB+6                                                  00709000
UCBFLA   EQU   UCBSFLS                                                  00710000
UCBFL1   EQU   UCBFLA                                                   00711000
UCBBSY   EQU   UCBFL1                                                   00712000
UCBNRY   EQU   UCBFL1                                                   00713000
UCBPST   EQU   UCBFL1                                                   00714000
UCBCUB   EQU   UCBFL1                                                   00715000
UCBFLB   EQU   UCBSFLS+1                                                00716000
UCBCHM   EQU   UCBOB+8                                                  00717000
UCBCHM1  EQU   UCBCHM                                                   00718000
UCBPTH0  EQU   UCBCHM1                                                  00719000
UCBPTH1  EQU   UCBCHM1                                                  00720000
UCBWGT   EQU   UCBOB+12                                                 00721000
UCBTYP   EQU   UCBOB+16                                                 00722000
UCBTBYT1 EQU   UCBTYP                                                   00723000
UCB1FEA5 EQU   UCBTBYT1                                                 00724000
UCB1FEA6 EQU   UCBTBYT1                                                 00725000
UCBTBYT2 EQU   UCBTYP+1                                                 00726000
UCB2OPT2 EQU   UCBTBYT2                                                 00727000
UCBDUDN1 EQU   UCB2OPT2                                                 00728000
UCB2OPT3 EQU   UCBTBYT2                                                 00729000
UCBDUDN2 EQU   UCB2OPT3                                                 00730000
UCB2OPT4 EQU   UCBTBYT2                                                 00731000
UCBRWTAU EQU   UCB2OPT4                                                 00732000
UCB2OPT6 EQU   UCBTBYT2                                                 00733000
UCB2OPT7 EQU   UCBTBYT2                                                 00734000
UCBTBYT3 EQU   UCBTYP+2                                                 00735000
UCBDVCLS EQU   UCBTBYT3                                                 00736000
UCBTBYT4 EQU   UCBTYP+3                                                 00737000
UCBEXTPT EQU   UCBOB+20                                                 00738000
UCBFLC   EQU   UCBEXTPT                                                 00739000
UCBDEV   EQU   UCBOB+24                                                 00740000
UCBCMEXT EQU   0                                                        00741000
UCBATI   EQU   UCBCMEXT+3                                               00742000
@NM00032 EQU   UCBATI                                                   00743000
UCBFLP1  EQU   UCBCMEXT+5                                               00744000
UCBMT    EQU   0                                                        00745000
UCBOCR   EQU   0                                                        00746000
UCB3540X EQU   0                                                        00747000
UCBDKBYT EQU   UCB3540X+6                                               00748000
UCBUCS   EQU   0                                                        00749000
UCBUCSOP EQU   UCBUCS+4                                                 00750000
UCBFCBOP EQU   UCBUCS+5                                                 00751000
UCBBGN   EQU   0                                                        00752000
CVTMAP   EQU   0                                                        00753000
CVTXTLER EQU   CVTMAP+44                                                00754000
CVTXITP  EQU   CVTMAP+68                                                00755000
CVTDAR   EQU   CVTMAP+72                                                00756000
CVTFLGS1 EQU   CVTDAR                                                   00757000
CVTDCB   EQU   CVTMAP+116                                               00758000
CVTDCBA  EQU   CVTMAP+117                                               00759000
CVTIXAVL EQU   CVTMAP+124                                               00760000
CVTIERLC EQU   CVTMAP+144                                               00761000
CVTOPTA  EQU   CVTMAP+182                                               00762000
CVTOPTB  EQU   CVTMAP+183                                               00763000
CVTGTF   EQU   CVTMAP+236                                               00764000
CVTGTFST EQU   CVTGTF                                                   00765000
CVTGTFS  EQU   CVTGTFST                                                 00766000
CVTSTATE EQU   CVTGTFST                                                 00767000
CVTTMODE EQU   CVTGTFST                                                 00768000
CVTFORM  EQU   CVTGTFST                                                 00769000
CVTAQAVT EQU   CVTMAP+240                                               00770000
CVTTCMFG EQU   CVTAQAVT                                                 00771000
CVTVOLM2 EQU   CVTMAP+244                                               00772000
CVTTATA  EQU   CVTVOLM2                                                 00773000
CVTTSKS  EQU   CVTTATA                                                  00774000
CVTVOLF2 EQU   CVTTSKS                                                  00775000
CVTTAT   EQU   CVTTATA+1                                                00776000
CVTATER  EQU   CVTMAP+248                                               00777000
CVTEXT1  EQU   CVTMAP+252                                               00778000
CVTPURG  EQU   CVTMAP+260                                               00779000
CVTQMSG  EQU   CVTMAP+268                                               00780000
CVTDMSR  EQU   CVTMAP+272                                               00781000
CVTERPV  EQU   CVTMAP+316                                               00782000
CVTINTLA EQU   CVTMAP+320                                               00783000
CVTAPF   EQU   CVTMAP+324                                               00784000
CVTEXT2  EQU   CVTMAP+328                                               00785000
CVTHJES  EQU   CVTMAP+332                                               00786000
CVTPGSIA EQU   CVTMAP+348                                               00787000
CVTA1F1  EQU   CVTMAP+356                                               00788000
CVTSYSK  EQU   CVTMAP+357                                               00789000
CVTVOLM1 EQU   CVTMAP+380                                               00790000
CVTVOLF1 EQU   CVTVOLM1                                                 00791000
CVTATMCT EQU   CVTMAP+388                                               00792000
CVTXTNT1 EQU   0                                                        00793000
CVTXTNT2 EQU   0                                                        00794000
CVTDSSV  EQU   CVTXTNT2                                                 00795000
CVTFLGBT EQU   CVTXTNT2+5                                               00796000
CVTQID   EQU   CVTXTNT2+24                                              00797000
CVTRV400 EQU   CVTXTNT2+52                                              00798000
CVTRV409 EQU   CVTXTNT2+53                                              00799000
CVTATCVT EQU   CVTXTNT2+64                                              00800000
CVTRV429 EQU   CVTXTNT2+84                                              00801000
CVTRV438 EQU   CVTXTNT2+85                                              00802000
CVTRV457 EQU   CVTXTNT2+112                                             00803000
CVTRV466 EQU   CVTXTNT2+113                                             00804000
CVTFIX   EQU   0                                                        00805000
CVTRELNO EQU   CVTFIX+252                                               00806000
XCTL     EQU   0                                                        00807000
XLTE     EQU   0                                                        00808000
CCW      EQU   0                                                        00809000
COMCODE  EQU   CCW                                                      00810000
RQE      EQU   0                                                        00811000
RQEDEB   EQU   RQE+8                                                    00812000
RQEPRT   EQU   RQE+36                                                   00813000
DEB      EQU   0                                                        00814000
DEBDCBAD EQU   DEB+24                                                   00815000
DCB      EQU   0                                                        00816000
DCBMRFLG EQU   DCB+16                                                   00817000
MRFLG    EQU   DCBMRFLG                                                 00818000
LOGREC   EQU   0                                                        00819000
LGRCPTR  EQU   LOGREC+1                                                 00820000
PARMTAB  EQU   0                                                        00821000
WRKPTR   EQU   0                                                        00822000
IOSATTSC EQU   IOSIPIB                                                  00823000
IOSWTOWA EQU   IOSIPIB                                                  00824000
IOSPCISC EQU   IOSIPIB                                                  00825000
EWADDIOS EQU   EWAIERP                                                  00826000
IOBSTABY EQU   IOSTATUS                                                 00827000
UCSTAT   EQU   IOBSTABY                                                 00828000
ILCSTAT  EQU   IOBSTABY+1                                               00829000
PRGSTAT  EQU   IOBSTABY+1                                               00830000
PRTSTAT  EQU   IOBSTABY+1                                               00831000
IOSFL1   EQU   IOSFLA                                                   00832000
IOSFLG1  EQU   IOSFL1                                                   00833000
IOSFL3   EQU   EWAFLG3                                                  00834000
IOSCCC   EQU   IOSFL3                                                   00835000
IOSICC   EQU   IOSFL3                                                   00836000
IOSCDC   EQU   IOSFL3                                                   00837000
IOSENT   EQU   IOSFL3                                                   00838000
IOSCNC   EQU   IOSFL3                                                   00839000
IOSICL   EQU   IOSFL3                                                   00840000
IOSFL4   EQU   EWACNTR1                                                 00841000
IOSOVR   EQU   IOSFL4                                                   00842000
IOSREJ   EQU   IOSFL4                                                   00843000
IOSDCK   EQU   IOSFL4                                                   00844000
IOSBUS   EQU   IOSFL4                                                   00845000
IOSEQP   EQU   IOSFL4                                                   00846000
IOSUC    EQU   IOSFL4                                                   00847000
ERPIB    EQU   EWAERPIB                                                 00848000
IBERRS   EQU   ERPIB+5                                                  00849000
IBFLG1   EQU   ERPIB+6                                                  00850000
IBFL3    EQU   IBFLG1                                                   00851000
IBFLG2   EQU   ERPIB+7                                                  00852000
IBSEQ    EQU   IBFLG2                                                   00853000
UCBOBS01 EQU   UCBDEV                                                   00854000
UCBSTAB  EQU   UCBOBS01+10                                              00855000
UCBBSVL  EQU   UCBSTAB                                                  00856000
UCBPRSRS EQU   UCBSTAB                                                  00857000
UCBDMCT  EQU   UCBOBS01+11                                              00858000
UCBFL4   EQU   UCBOBS01+13                                              00859000
UCBOBS02 EQU   UCBDEV                                                   00860000
UCBTFL1  EQU   UCBOBS02+19                                              00861000
UCBXTN   EQU   UCBOBS02+20                                              00862000
UCBVOPT  EQU   UCBXTN                                                   00863000
UCBOBS03 EQU   UCBDEV                                                   00864000
UCBXTADR EQU   UCBOBS03                                                 00865000
UCBOBS04 EQU   UCBDEV                                                   00866000
UCBBTA   EQU   UCBOBS04+12                                              00867000
UCBOBS06 EQU   UCBDEV                                                   00868000
UCBAOF   EQU   UCBOBS06                                                 00869000
UCBAOF1  EQU   UCBAOF                                                   00870000
UCBAOF2  EQU   UCBAOF+1                                                 00871000
@NM00031 EQU   UCBOBS06+3                                               00872000
UCBIRB   EQU   UCBOBS06+4                                               00873000
UCBGRAF  EQU   UCBIRB                                                   00874000
UCBLDNCA EQU   UCBOBS06+8                                               00875000
UCBRDYQ  EQU   UCBLDNCA                                                 00876000
UCBIRLN  EQU   UCBRDYQ                                                  00877000
UCBLDNCB EQU   UCBRDYQ+1                                                00878000
UCBCTLNK EQU   UCBOBS06+12                                              00879000
UCBOBS07 EQU   UCBDEV                                                   00880000
UCBOBS08 EQU   UCBDEV                                                   00881000
UCBOBS09 EQU   UCBDEV                                                   00882000
CVTS01   EQU   CVTPGSIA                                                 00883000
CVTLPDIA EQU   CVTS01+12                                                00884000
CVTDIRST EQU   CVTLPDIA                                                 00885000
CVTSLIDA EQU   CVTS01+24                                                00886000
CVTCTLFG EQU   CVTS01+50                                                00887000
CVTRV210 EQU   CVTS01+424                                               00888000
CVTRV219 EQU   CVTS01+425                                               00889000
CVTRV228 EQU   CVTS01+426                                               00890000
CVTRV237 EQU   CVTS01+427                                               00891000
CVTMFRTR EQU   CVTS01+452                                               00892000
CVTRV262 EQU   CVTS01+468                                               00893000
CVTRV271 EQU   CVTS01+469                                               00894000
CVTRV280 EQU   CVTS01+470                                               00895000
CVTRV289 EQU   CVTS01+471                                               00896000
CVTGSDA  EQU   CVTS01+600                                               00897000
IOSSENS  EQU   IOSSNS                                                   00898000
IOSS0B1  EQU   IOSSENS                                                  00899000
IOSS0B6  EQU   IOSSENS                                                  00900000
IOSS0B7  EQU   IOSSENS                                                  00901000
DEVSTAT  EQU   IOSTSA                                                   00902000
UNITEXP  EQU   DEVSTAT                                                  00903000
SIOCC    EQU   IOSCC                                                    00904000
SIOCC3   EQU   SIOCC                                                    00905000
IOSDVR   EQU   IOSDVRID                                                 00906000
IOSEXCP  EQU   IOSDVR                                                   00907000
EWC      EQU   EWAIERP                                                  00908000
EWCSAVES EQU   EWC+8                                                    00909000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00910000
EWCSNS   EQU   EWC                                                      00911000
@NM00046 EQU   IOSDVR                                                   00912000
@NM00045 EQU   IOSDVR                                                   00913000
@NM00044 EQU   SIOCC                                                    00914000
@NM00043 EQU   SIOCC                                                    00915000
@NM00042 EQU   DEVSTAT                                                  00916000
@NM00036 EQU   IOSSENS                                                  00917000
@NM00035 EQU   IOSSENS                                                  00918000
CVTRV628 EQU   CVTS01+728                                               00919000
CVTRV627 EQU   CVTS01+724                                               00920000
CVTRV626 EQU   CVTS01+720                                               00921000
CVTRV625 EQU   CVTS01+716                                               00922000
CVTRV624 EQU   CVTS01+712                                               00923000
CVTRV623 EQU   CVTS01+708                                               00924000
CVTRV622 EQU   CVTS01+704                                               00925000
CVTRV621 EQU   CVTS01+700                                               00926000
CVTRV620 EQU   CVTS01+696                                               00927000
CVTRV619 EQU   CVTS01+692                                               00928000
CVTRV618 EQU   CVTS01+688                                               00929000
CVTRV617 EQU   CVTS01+684                                               00930000
CVTRV616 EQU   CVTS01+680                                               00931000
CVTRV615 EQU   CVTS01+676                                               00932000
CVTRV614 EQU   CVTS01+672                                               00933000
CVTRV613 EQU   CVTS01+668                                               00934000
CVTRV612 EQU   CVTS01+664                                               00935000
CVTRV611 EQU   CVTS01+660                                               00936000
CVTRV610 EQU   CVTS01+656                                               00937000
CVTRV609 EQU   CVTS01+652                                               00938000
CVTRV608 EQU   CVTS01+648                                               00939000
CVTRV607 EQU   CVTS01+644                                               00940000
CVTRV606 EQU   CVTS01+640                                               00941000
CVTRV605 EQU   CVTS01+636                                               00942000
CVTRV604 EQU   CVTS01+632                                               00943000
CVTEFF02 EQU   CVTS01+628                                               00944000
CVTCBBR  EQU   CVTS01+624                                               00945000
CVTSSCR  EQU   CVTS01+620                                               00946000
CVTEVENT EQU   CVTS01+616                                               00947000
CVTCRCA  EQU   CVTS01+612                                               00948000
CVTTPIO  EQU   CVTS01+608                                               00949000
CVTADV   EQU   CVTS01+604                                               00950000
CVTGSDAB EQU   CVTGSDA                                                  00951000
CVTQV3   EQU   CVTS01+596                                               00952000
CVTQV2   EQU   CVTS01+592                                               00953000
CVTQV1   EQU   CVTS01+588                                               00954000
CVTRPT   EQU   CVTS01+584                                               00955000
CVTSSRB  EQU   CVTS01+580                                               00956000
CVTCSDRL EQU   CVTS01+576                                               00957000
CVTEXP1  EQU   CVTS01+572                                               00958000
CVTRMPMT EQU   CVTS01+568                                               00959000
CVTRMPTT EQU   CVTS01+564                                               00960000
CVTVPSA  EQU   CVTS01+560                                               00961000
CVTVSTOP EQU   CVTS01+556                                               00962000
CVTGTFR8 EQU   CVTS01+552                                               00963000
CVTQUIT  EQU   CVTS01+548                                               00964000
CVTVACR  EQU   CVTS01+544                                               00965000
CVTWTCB  EQU   CVTS01+540                                               00966000
CVTSTPRS EQU   CVTS01+536                                               00967000
CVT0PT02 EQU   CVTS01+532                                               00968000
CVTDARCM EQU   CVTS01+528                                               00969000
CVTIRECM EQU   CVTS01+524                                               00970000
CVTJRECM EQU   CVTS01+520                                               00971000
CVTVEMS0 EQU   CVTS01+516                                               00972000
CVTSPFRR EQU   CVTS01+512                                               00973000
CVTRLSTG EQU   CVTS01+508                                               00974000
CVT0TC0A EQU   CVTS01+504                                               00975000
CVTGMBR  EQU   CVTS01+500                                               00976000
CVTLFRM  EQU   CVTS01+496                                               00977000
CVTRMBR  EQU   CVTS01+492                                               00978000
CVTVIOP  EQU   CVTS01+488                                               00979000
CVTRV307 EQU   CVTS01+486                                               00980000
CVTRV306 EQU   CVTS01+484                                               00981000
CVTRV305 EQU   CVTS01+482                                               00982000
CVTRV304 EQU   CVTS01+480                                               00983000
CVTRV303 EQU   CVTS01+478                                               00984000
CVTRV302 EQU   CVTS01+476                                               00985000
CVTTRCA  EQU   CVTS01+472                                               00986000
CVTRV297 EQU   CVTRV289                                                 00987000
CVTRV296 EQU   CVTRV289                                                 00988000
CVTRV295 EQU   CVTRV289                                                 00989000
CVTRV294 EQU   CVTRV289                                                 00990000
CVTRV293 EQU   CVTRV289                                                 00991000
CVTRV292 EQU   CVTRV289                                                 00992000
CVTRV291 EQU   CVTRV289                                                 00993000
CVTRV290 EQU   CVTRV289                                                 00994000
CVTRV288 EQU   CVTRV280                                                 00995000
CVTRV287 EQU   CVTRV280                                                 00996000
CVTRV286 EQU   CVTRV280                                                 00997000
CVTRV285 EQU   CVTRV280                                                 00998000
CVTRV284 EQU   CVTRV280                                                 00999000
CVTRV283 EQU   CVTRV280                                                 01000000
CVTRV282 EQU   CVTRV280                                                 01001000
CVTRV281 EQU   CVTRV280                                                 01002000
CVTRV279 EQU   CVTRV271                                                 01003000
CVTRV278 EQU   CVTRV271                                                 01004000
CVTRV277 EQU   CVTRV271                                                 01005000
CVTRV276 EQU   CVTRV271                                                 01006000
CVTRV275 EQU   CVTRV271                                                 01007000
CVTRV274 EQU   CVTRV271                                                 01008000
CVTRV273 EQU   CVTRV271                                                 01009000
CVTRV272 EQU   CVTRV271                                                 01010000
CVTRV270 EQU   CVTRV262                                                 01011000
CVTRV269 EQU   CVTRV262                                                 01012000
CVTRV268 EQU   CVTRV262                                                 01013000
CVTRV267 EQU   CVTRV262                                                 01014000
CVTRV266 EQU   CVTRV262                                                 01015000
CVTRV265 EQU   CVTRV262                                                 01016000
CVTRV264 EQU   CVTRV262                                                 01017000
CVTRV263 EQU   CVTRV262                                                 01018000
CVTVFP   EQU   CVTS01+464                                               01019000
CVTVSI   EQU   CVTS01+460                                               01020000
CVTVPSIB EQU   CVTS01+456                                               01021000
CVTMFACT EQU   CVTMFRTR                                                 01022000
CVTMFCTL EQU   CVTS01+448                                               01023000
CVTPVBP  EQU   CVTS01+444                                               01024000
CVTPWI   EQU   CVTS01+440                                               01025000
CVTRV254 EQU   CVTS01+438                                               01026000
CVTRV253 EQU   CVTS01+436                                               01027000
CVTRV252 EQU   CVTS01+434                                               01028000
CVTRV251 EQU   CVTS01+433                                               01029000
CVTRV250 EQU   CVTS01+432                                               01030000
CVTRV249 EQU   CVTS01+431                                               01031000
CVTRV248 EQU   CVTS01+430                                               01032000
CVTRV247 EQU   CVTS01+429                                               01033000
CVTRV246 EQU   CVTS01+428                                               01034000
CVTRV245 EQU   CVTRV237                                                 01035000
CVTRV244 EQU   CVTRV237                                                 01036000
CVTRV243 EQU   CVTRV237                                                 01037000
CVTRV242 EQU   CVTRV237                                                 01038000
CVTRV241 EQU   CVTRV237                                                 01039000
CVTRV240 EQU   CVTRV237                                                 01040000
CVTRV239 EQU   CVTRV237                                                 01041000
CVTRV238 EQU   CVTRV237                                                 01042000
CVTRV236 EQU   CVTRV228                                                 01043000
CVTRV235 EQU   CVTRV228                                                 01044000
CVTRV234 EQU   CVTRV228                                                 01045000
CVTRV233 EQU   CVTRV228                                                 01046000
CVTRV232 EQU   CVTRV228                                                 01047000
CVTRV231 EQU   CVTRV228                                                 01048000
CVTRV230 EQU   CVTRV228                                                 01049000
CVTRV229 EQU   CVTRV228                                                 01050000
CVTRV227 EQU   CVTRV219                                                 01051000
CVTRV226 EQU   CVTRV219                                                 01052000
CVTRV225 EQU   CVTRV219                                                 01053000
CVTRV224 EQU   CVTRV219                                                 01054000
CVTRV223 EQU   CVTRV219                                                 01055000
CVTRV222 EQU   CVTRV219                                                 01056000
CVTRV221 EQU   CVTRV219                                                 01057000
CVTRV220 EQU   CVTRV219                                                 01058000
CVTRV218 EQU   CVTRV210                                                 01059000
CVTRV217 EQU   CVTRV210                                                 01060000
CVTRV216 EQU   CVTRV210                                                 01061000
CVTRV215 EQU   CVTRV210                                                 01062000
CVTRV214 EQU   CVTRV210                                                 01063000
CVTRV213 EQU   CVTRV210                                                 01064000
CVTRV212 EQU   CVTRV210                                                 01065000
CVTRV211 EQU   CVTRV210                                                 01066000
CVTLCCAT EQU   CVTS01+420                                               01067000
CVTPCCAT EQU   CVTS01+416                                               01068000
CVTIPCRP EQU   CVTS01+412                                               01069000
CVTIPCRI EQU   CVTS01+408                                               01070000
CVTIPCDS EQU   CVTS01+404                                               01071000
CVTAIDVT EQU   CVTS01+400                                               01072000
CVTSSAP  EQU   CVTS01+396                                               01073000
CVTEHCIR EQU   CVTS01+392                                               01074000
CVTEHDEF EQU   CVTS01+388                                               01075000
CVTDAIR  EQU   CVTS01+384                                               01076000
CVTPERFM EQU   CVTS01+380                                               01077000
CVT044R2 EQU   CVTS01+376                                               01078000
CVTFETCH EQU   CVTS01+372                                               01079000
CVTRSTWD EQU   CVTS01+368                                               01080000
CVTSPOST EQU   CVTS01+364                                               01081000
CVTIOBP  EQU   CVTS01+360                                               01082000
CVTASMVT EQU   CVTS01+356                                               01083000
CVTRECRQ EQU   CVTS01+352                                               01084000
CVTWSAC  EQU   CVTS01+348                                               01085000
CVTRV149 EQU   CVTS01+344                                               01086000
CVTWSAL  EQU   CVTS01+340                                               01087000
CVTSPSA  EQU   CVTS01+336                                               01088000
CVTGLMN  EQU   CVTS01+332                                               01089000
CVTVEAC0 EQU   CVTS01+328                                               01090000
CVT062R1 EQU   CVTS01+324                                               01091000
CVTRPOST EQU   CVTS01+320                                               01092000
CVTDQIQE EQU   CVTS01+316                                               01093000
CVTCSD   EQU   CVTS01+312                                               01094000
CVTLKRMA EQU   CVTS01+308                                               01095000
CVTRSPIE EQU   CVTS01+304                                               01096000
CVTRENQ  EQU   CVTS01+300                                               01097000
CVTLQCB  EQU   CVTS01+296                                               01098000
CVTFQCB  EQU   CVTS01+292                                               01099000
CVTQCS01 EQU   CVTS01+288                                               01100000
CVTAPFT  EQU   CVTS01+284                                               01101000
CVTPARRL EQU   CVTS01+280                                               01102000
CVTVWAIT EQU   CVTS01+276                                               01103000
CVTGSPL  EQU   CVTS01+272                                               01104000
CVTLSMQ  EQU   CVTS01+268                                               01105000
CVTGSMQ  EQU   CVTS01+264                                               01106000
CVTEXPRO EQU   CVTS01+260                                               01107000
CVTOPCTP EQU   CVTS01+256                                               01108000
CVTSIC   EQU   CVTS01+252                                               01109000
CVTTPIOS EQU   CVTS01+248                                               01110000
CVTRTMS  EQU   CVTS01+244                                               01111000
CVTSDBF  EQU   CVTS01+240                                               01112000
CVTSCBP  EQU   CVTS01+236                                               01113000
CVTSDMP  EQU   CVTS01+232                                               01114000
CVTSV60  EQU   CVTS01+228                                               01115000
CVTRTMCT EQU   CVTS01+224                                               01116000
CVTASCBL EQU   CVTS01+220                                               01117000
CVTASCBH EQU   CVTS01+216                                               01118000
CVTGDA   EQU   CVTS01+212                                               01119000
CVTASVT  EQU   CVTS01+208                                               01120000
CVTVVMDI EQU   CVTS01+204                                               01121000
CVTAQTOP EQU   CVTS01+200                                               01122000
CVTIOSCS EQU   CVTS01+196                                               01123000
CVTSDRM  EQU   CVTS01+192                                               01124000
CVTOPTE  EQU   CVTS01+188                                               01125000
CVTSTXU  EQU   CVTS01+184                                               01126000
CVTQUIS  EQU   CVTS01+180                                               01127000
CVTPARS  EQU   CVTS01+176                                               01128000
CVTS1EE  EQU   CVTS01+172                                               01129000
CVTFRAS  EQU   CVTS01+168                                               01130000
CVTQSAS  EQU   CVTS01+164                                               01131000
CVTCRAS  EQU   CVTS01+160                                               01132000
CVTCRMN  EQU   CVTS01+156                                               01133000
CVTDELCP EQU   CVTS01+152                                               01134000
CVTFRECL EQU   CVTS01+148                                               01135000
CVTGETCL EQU   CVTS01+144                                               01136000
CVTBLDCP EQU   CVTS01+140                                               01137000
CVTAUTHL EQU   CVTS01+136                                               01138000
CVTSCAN  EQU   CVTS01+132                                               01139000
CVTRV144 EQU   CVTS01+130                                               01140000
CVTMAXMP EQU   CVTS01+128                                               01141000
CVTSTCK  EQU   CVTS01+124                                               01142000
CVTRV139 EQU   CVTS01+123                                               01143000
CVTDSSAC EQU   CVTS01+122                                               01144000
CVTRV513 EQU   CVTS01+121                                               01145000
CVTIOSPL EQU   CVTS01+120                                               01146000
CVTPTGT  EQU   CVTS01+116                                               01147000
CVTCSPIE EQU   CVTS01+112                                               01148000
CVTSMFEX EQU   CVTS01+108                                               01149000
CVTOLT0A EQU   CVTS01+104                                               01150000
CVTSRBRT EQU   CVTS01+100                                               01151000
CVTPUTL  EQU   CVTS01+96                                                01152000
CVTRV519 EQU   CVTS01+92                                                01153000
CVTRV327 EQU   CVTS01+88                                                01154000
CVTRV326 EQU   CVTS01+84                                                01155000
CVTRV325 EQU   CVTS01+80                                                01156000
CVTRV324 EQU   CVTS01+76                                                01157000
CVT0VL01 EQU   CVTS01+72                                                01158000
CVTSHRVM EQU   CVTS01+68                                                01159000
CVTRV332 EQU   CVTS01+64                                                01160000
CVTTAS   EQU   CVTS01+60                                                01161000
CVTRSCN  EQU   CVTS01+56                                                01162000
CVTTRAC2 EQU   CVTS01+54                                                01163000
CVTTRACE EQU   CVTS01+52                                                01164000
CVTAPG   EQU   CVTS01+51                                                01165000
CVTSDTRC EQU   CVTCTLFG                                                 01166000
CVTGTRCE EQU   CVTCTLFG                                                 01167000
CVTNOMP  EQU   CVTCTLFG                                                 01168000
CVTRSV79 EQU   CVTCTLFG                                                 01169000
CVTDSTAT EQU   CVTCTLFG                                                 01170000
CVTRSV78 EQU   CVTCTLFG                                                 01171000
CVTRV333 EQU   CVTCTLFG                                                 01172000
CVTRV323 EQU   CVTCTLFG                                                 01173000
CVTSPVLK EQU   CVTS01+49                                                01174000
CVTRSV77 EQU   CVTS01+48                                                01175000
CVTRV331 EQU   CVTS01+44                                                01176000
CVTRV330 EQU   CVTS01+40                                                01177000
CVTRV329 EQU   CVTS01+36                                                01178000
CVTRV328 EQU   CVTS01+32                                                01179000
CVTRV322 EQU   CVTS01+28                                                01180000
CVTSLID  EQU   CVTSLIDA+1                                               01181000
CVTSYLK  EQU   CVTSLIDA                                                 01182000
CVTRV321 EQU   CVTS01+20                                                01183000
CVTRV320 EQU   CVTS01+16                                                01184000
CVTLPDIR EQU   CVTLPDIA+1                                               01185000
CVTRSV69 EQU   CVTDIRST                                                 01186000
CVTRSV68 EQU   CVTDIRST                                                 01187000
CVTRSV67 EQU   CVTDIRST                                                 01188000
CVTRSV66 EQU   CVTDIRST                                                 01189000
CVTRSV65 EQU   CVTDIRST                                                 01190000
CVTRSV64 EQU   CVTDIRST                                                 01191000
CVTRSV63 EQU   CVTDIRST                                                 01192000
CVTDICOM EQU   CVTDIRST                                                 01193000
CVTPVTP  EQU   CVTS01+8                                                 01194000
CVTLPDSR EQU   CVTS01+4                                                 01195000
CVTGETL  EQU   CVTS01                                                   01196000
UCBRV066 EQU   UCBOBS09+4                                               01197000
UCBIOSBA EQU   UCBOBS09                                                 01198000
UCBRV042 EQU   UCBOBS08+5                                               01199000
UCBCTCF1 EQU   UCBOBS08+4                                               01200000
UCBCTCAD EQU   UCBOBS08                                                 01201000
UCBICNCB EQU   UCBOBS07+4                                               01202000
UCBRV040 EQU   UCBOBS07                                                 01203000
UCBCTLNA EQU   UCBCTLNK+1                                               01204000
UCBRLN   EQU   UCBCTLNK                                                 01205000
UCBRDYQA EQU   UCBLDNCB                                                 01206000
UCBINRLN EQU   UCBIRLN                                                  01207000
UCBIRBA  EQU   UCBIRB+1                                                 01208000
UCBRV039 EQU   UCBGRAF                                                  01209000
UCBDWNR  EQU   UCBGRAF                                                  01210000
UCBRPND  EQU   UCBGRAF                                                  01211000
UCBUPM   EQU   UCBGRAF                                                  01212000
UCBBTAM  EQU   UCBGRAF                                                  01213000
UCBDRNO  EQU   UCBGRAF                                                  01214000
UCBDRO   EQU   UCBGRAF                                                  01215000
UCBOIP   EQU   UCBGRAF                                                  01216000
UCBATRCD EQU   @NM00031                                                 01217000
UCBSKPFG EQU   @NM00031                                                 01218000
UCBRIPND EQU   @NM00031                                                 01219000
UCBRTIAC EQU   @NM00031                                                 01220000
UCBRSV79 EQU   @NM00031                                                 01221000
UCBRSV78 EQU   @NM00031                                                 01222000
UCBRSV77 EQU   @NM00031                                                 01223000
UCBOLTEP EQU   @NM00031                                                 01224000
UCBATNCT EQU   UCBOBS06+2                                               01225000
UCBRSV76 EQU   UCBAOF2                                                  01226000
UCBRSV75 EQU   UCBAOF2                                                  01227000
UCBRSV74 EQU   UCBAOF2                                                  01228000
UCBRSV73 EQU   UCBAOF2                                                  01229000
UCBRSV72 EQU   UCBAOF2                                                  01230000
UCBRSV71 EQU   UCBAOF2                                                  01231000
UCBRSV70 EQU   UCBAOF2                                                  01232000
UCBRSV69 EQU   UCBAOF2                                                  01233000
UCBRSV68 EQU   UCBAOF1                                                  01234000
UCBRSV67 EQU   UCBAOF1                                                  01235000
UCBRSV66 EQU   UCBAOF1                                                  01236000
UCBRSV65 EQU   UCBAOF1                                                  01237000
UCBRSV64 EQU   UCBAOF1                                                  01238000
UCBOFNL  EQU   UCBAOF1                                                  01239000
UCBOFSP  EQU   UCBAOF1                                                  01240000
UCBOFMCR EQU   UCBAOF1                                                  01241000
UCBBTB   EQU   UCBBTA+1                                                 01242000
UCBDI    EQU   UCBBTA                                                   01243000
UCBSNS   EQU   UCBOBS04+8                                               01244000
UCBTEB   EQU   UCBOBS04+4                                               01245000
UCBGCB   EQU   UCBOBS04+3                                               01246000
UCBOPEN  EQU   UCBOBS04+2                                               01247000
UCBSTART EQU   UCBOBS04                                                 01248000
UCBXTNB  EQU   UCBXTN+1                                                 01249000
UCBRSV22 EQU   UCBVOPT                                                  01250000
UCBRSV21 EQU   UCBVOPT                                                  01251000
UCBRSV20 EQU   UCBVOPT                                                  01252000
UCBESVE  EQU   UCBVOPT                                                  01253000
UCBERPC  EQU   UCBVOPT                                                  01254000
UCBESVC  EQU   UCBVOPT                                                  01255000
UCBEVA   EQU   UCBVOPT                                                  01256000
UCBESV   EQU   UCBVOPT                                                  01257000
UCBRV009 EQU   UCBTFL1                                                  01258000
UCBRV008 EQU   UCBTFL1                                                  01259000
UCBRV007 EQU   UCBTFL1                                                  01260000
UCBRV006 EQU   UCBTFL1                                                  01261000
UCBRV005 EQU   UCBTFL1                                                  01262000
UCBRV038 EQU   UCBTFL1                                                  01263000
UCBNSLTP EQU   UCBTFL1                                                  01264000
UCBNLTP  EQU   UCBTFL1                                                  01265000
UCBRES1B EQU   UCBOBS02+18                                              01266000
UCBFSER  EQU   UCBOBS02+12                                              01267000
@NM00030 EQU   UCBOBS02+4                                               01268000
UCBFSEQ  EQU   UCBOBS02+2                                               01269000
UCBFSCT  EQU   UCBOBS02                                                 01270000
UCBNEXP  EQU   UCBOBS01+20                                              01271000
UCBBASE  EQU   UCBOBS01+16                                              01272000
UCBRES1A EQU   UCBOBS01+15                                              01273000
UCBUSER  EQU   UCBOBS01+14                                              01274000
UCBFL47  EQU   UCBFL4                                                   01275000
UCBFL46  EQU   UCBFL4                                                   01276000
UCBFL45  EQU   UCBFL4                                                   01277000
UCBRV065 EQU   UCBFL4                                                   01278000
UCBDSS   EQU   UCBFL4                                                   01279000
UCBRV028 EQU   UCBFL4                                                   01280000
UCBWDAV  EQU   UCBFL4                                                   01281000
UCBDAVV  EQU   UCBFL4                                                   01282000
UCBSQC   EQU   UCBOBS01+12                                              01283000
UCBDATP  EQU   UCBOBS01+12                                              01284000
UCBDMC   EQU   UCBDMCT                                                  01285000
UCBMOUNT EQU   UCBDMCT                                                  01286000
UCBBNUL  EQU   UCBSTAB                                                  01287000
UCBSHAR  EQU   UCBSTAB                                                  01288000
UCBBSTR  EQU   UCBSTAB                                                  01289000
UCBBPUB  EQU   UCBSTAB                                                  01290000
UCBBPRV  EQU   UCBSTAB                                                  01291000
UCBBALB  EQU   UCBPRSRS                                                 01292000
UCBPGFL  EQU   UCBSTAB                                                  01293000
UCBDVSHR EQU   UCBBSVL                                                  01294000
UCBVOLI  EQU   UCBOBS01+4                                               01295000
UCBVTOC  EQU   UCBOBS01                                                 01296000
IBALRT   EQU   IBFLG2                                                   01297000
@NM00026 EQU   IBFLG2                                                   01298000
IBTERM   EQU   IBFLG2                                                   01299000
IBFL4    EQU   IBFLG1                                                   01300000
IBFL2    EQU   IBFLG1                                                   01301000
@NM00025 EQU   IBFLG1                                                   01302000
IBFL1    EQU   IBFLG1                                                   01303000
@NM00024 EQU   IBERRS                                                   01304000
IBCHRT   EQU   IBERRS                                                   01305000
@NM00023 EQU   IBERRS                                                   01306000
IBERSR   EQU   IBERRS                                                   01307000
IBPROG   EQU   ERPIB+4                                                  01308000
IBUCB    EQU   ERPIB+1                                                  01309000
@NM00022 EQU   ERPIB                                                    01310000
@NM00021 EQU   IOSFL4                                                   01311000
@NM00020 EQU   IOSFL3                                                   01312000
@NM00019 EQU   IOSFL1                                                   01313000
@NM00018 EQU   IOBSTABY                                                 01314000
@NM00017 EQU   IOBSTABY                                                 01315000
EWAEND   EQU   EWADDIOS+71                                              01316000
EWASCSW  EQU   EWADDIOS+64                                              01317000
EWASNS   EQU   EWADDIOS                                                 01318000
IOSPCIWA EQU   IOSPCISC+44                                              01319000
IOSPCIRS EQU   IOSPCISC+8                                               01320000
@NM00007 EQU   IOSPCISC+4                                               01321000
@NM00006 EQU   IOSPCISC                                                 01322000
IOSWRNDR EQU   IOSWTOWA+4                                               01323000
IOSWTOPT EQU   IOSWTOWA+3                                               01324000
IOSWTOCP EQU   IOSWTOWA+2                                               01325000
IOSWTOCH EQU   IOSWTOWA                                                 01326000
IOSATTWA EQU   IOSATTSC+40                                              01327000
@NM00005 EQU   IOSATTSC+24                                              01328000
IOSATTSN EQU   IOSATTSC                                                 01329000
ERPIBAD  EQU   PARMTAB                                                  01330000
@NM00041 EQU   DCBMRFLG                                                 01331000
@NM00040 EQU   DCB                                                      01332000
@NM00039 EQU   DEB                                                      01333000
@NM00038 EQU   RQE+12                                                   01334000
IOBPTR   EQU   RQE+4                                                    01335000
@NM00037 EQU   RQE                                                      01336000
CVTLEVL  EQU   CVTRELNO+2                                               01337000
CVTNUMB  EQU   CVTRELNO                                                 01338000
CVTMDL   EQU   CVTFIX+250                                               01339000
@NM00034 EQU   CVTFIX+248                                               01340000
@NM00033 EQU   CVTFIX                                                   01341000
CVTRV482 EQU   CVTXTNT2+128                                             01342000
CVTRV481 EQU   CVTXTNT2+124                                             01343000
CVTRV480 EQU   CVTXTNT2+120                                             01344000
CVTRV479 EQU   CVTXTNT2+118                                             01345000
CVTRV478 EQU   CVTXTNT2+117                                             01346000
CVTRV477 EQU   CVTXTNT2+116                                             01347000
CVTRV476 EQU   CVTXTNT2+115                                             01348000
CVTRV475 EQU   CVTXTNT2+114                                             01349000
CVTRV474 EQU   CVTRV466                                                 01350000
CVTRV473 EQU   CVTRV466                                                 01351000
CVTRV472 EQU   CVTRV466                                                 01352000
CVTRV471 EQU   CVTRV466                                                 01353000
CVTRV470 EQU   CVTRV466                                                 01354000
CVTRV469 EQU   CVTRV466                                                 01355000
CVTRV468 EQU   CVTRV466                                                 01356000
CVTRV467 EQU   CVTRV466                                                 01357000
CVTRV465 EQU   CVTRV457                                                 01358000
CVTRV464 EQU   CVTRV457                                                 01359000
CVTRV463 EQU   CVTRV457                                                 01360000
CVTRV462 EQU   CVTRV457                                                 01361000
CVTRV461 EQU   CVTRV457                                                 01362000
CVTRV460 EQU   CVTRV457                                                 01363000
CVTRV459 EQU   CVTRV457                                                 01364000
CVTRV458 EQU   CVTRV457                                                 01365000
CVTRV456 EQU   CVTXTNT2+108                                             01366000
CVTRV455 EQU   CVTXTNT2+104                                             01367000
CVTRV454 EQU   CVTXTNT2+100                                             01368000
CVTRV453 EQU   CVTXTNT2+96                                              01369000
CVTRV452 EQU   CVTXTNT2+94                                              01370000
CVTRV451 EQU   CVTXTNT2+92                                              01371000
CVTRV450 EQU   CVTXTNT2+90                                              01372000
CVTRV449 EQU   CVTXTNT2+88                                              01373000
CVTRV448 EQU   CVTXTNT2+87                                              01374000
CVTRV447 EQU   CVTXTNT2+86                                              01375000
CVTRV446 EQU   CVTRV438                                                 01376000
CVTRV445 EQU   CVTRV438                                                 01377000
CVTRV444 EQU   CVTRV438                                                 01378000
CVTRV443 EQU   CVTRV438                                                 01379000
CVTRV442 EQU   CVTRV438                                                 01380000
CVTRV441 EQU   CVTRV438                                                 01381000
CVTRV440 EQU   CVTRV438                                                 01382000
CVTRV439 EQU   CVTRV438                                                 01383000
CVTRV437 EQU   CVTRV429                                                 01384000
CVTRV436 EQU   CVTRV429                                                 01385000
CVTRV435 EQU   CVTRV429                                                 01386000
CVTRV434 EQU   CVTRV429                                                 01387000
CVTRV433 EQU   CVTRV429                                                 01388000
CVTRV432 EQU   CVTRV429                                                 01389000
CVTRV431 EQU   CVTRV429                                                 01390000
CVTRV430 EQU   CVTRV429                                                 01391000
CVTRV428 EQU   CVTXTNT2+80                                              01392000
CVTRV427 EQU   CVTXTNT2+76                                              01393000
CVTRV426 EQU   CVTXTNT2+72                                              01394000
CVTRV425 EQU   CVTXTNT2+68                                              01395000
CVTATACT EQU   CVTATCVT                                                 01396000
CVTRV423 EQU   CVTXTNT2+62                                              01397000
CVTRV422 EQU   CVTXTNT2+60                                              01398000
CVTRV421 EQU   CVTXTNT2+58                                              01399000
CVTRV420 EQU   CVTXTNT2+56                                              01400000
CVTRV419 EQU   CVTXTNT2+55                                              01401000
CVTRV418 EQU   CVTXTNT2+54                                              01402000
CVTRV417 EQU   CVTRV409                                                 01403000
CVTRV416 EQU   CVTRV409                                                 01404000
CVTRV415 EQU   CVTRV409                                                 01405000
CVTRV414 EQU   CVTRV409                                                 01406000
CVTRV413 EQU   CVTRV409                                                 01407000
CVTRV412 EQU   CVTRV409                                                 01408000
CVTRV411 EQU   CVTRV409                                                 01409000
CVTRV410 EQU   CVTRV409                                                 01410000
CVTRV408 EQU   CVTRV400                                                 01411000
CVTRV407 EQU   CVTRV400                                                 01412000
CVTRV406 EQU   CVTRV400                                                 01413000
CVTRV405 EQU   CVTRV400                                                 01414000
CVTRV404 EQU   CVTRV400                                                 01415000
CVTRV403 EQU   CVTRV400                                                 01416000
CVTRV402 EQU   CVTRV400                                                 01417000
CVTRV401 EQU   CVTRV400                                                 01418000
CVTICB   EQU   CVTXTNT2+48                                              01419000
CVTSKTA  EQU   CVTXTNT2+44                                              01420000
CVTRSV99 EQU   CVTXTNT2+40                                              01421000
CVTRSV98 EQU   CVTXTNT2+36                                              01422000
CVTRSV97 EQU   CVTXTNT2+34                                              01423000
CVTRSV96 EQU   CVTXTNT2+32                                              01424000
CVTOLTEP EQU   CVTXTNT2+28                                              01425000
CVTQIDA  EQU   CVTQID+1                                                 01426000
CVTRSV95 EQU   CVTQID                                                   01427000
CVTRSV94 EQU   CVTXTNT2+20                                              01428000
CVTRSV93 EQU   CVTXTNT2+16                                              01429000
CVTRSV92 EQU   CVTXTNT2+12                                              01430000
CVTDEBVR EQU   CVTXTNT2+8                                               01431000
CVTRSV91 EQU   CVTXTNT2+6                                               01432000
CVTRSV9H EQU   CVTFLGBT                                                 01433000
CVTRSV9G EQU   CVTFLGBT                                                 01434000
CVTRSV9F EQU   CVTFLGBT                                                 01435000
CVTRSV9E EQU   CVTFLGBT                                                 01436000
CVTRSV9D EQU   CVTFLGBT                                                 01437000
CVTRSV9C EQU   CVTFLGBT                                                 01438000
CVTVME   EQU   CVTFLGBT                                                 01439000
CVTNPE   EQU   CVTFLGBT                                                 01440000
CVTNUCLS EQU   CVTXTNT2+4                                               01441000
CVTDSSVA EQU   CVTDSSV+1                                                01442000
CVTRSV89 EQU   CVTDSSV                                                  01443000
CVTRSV88 EQU   CVTXTNT1+8                                               01444000
CVTRSV87 EQU   CVTXTNT1+4                                               01445000
CVTFACHN EQU   CVTXTNT1                                                 01446000
CVTRV488 EQU   CVTMAP+412                                               01447000
CVTRV487 EQU   CVTMAP+408                                               01448000
CVTRV486 EQU   CVTMAP+404                                               01449000
CVTRV485 EQU   CVTMAP+400                                               01450000
CVTACTAP EQU   CVTMAP+396                                               01451000
CVTAUTH  EQU   CVTMAP+392                                               01452000
CVTATMCA EQU   CVTATMCT+1                                               01453000
CVTATMST EQU   CVTATMCT                                                 01454000
CVTRSV61 EQU   CVTMAP+384                                               01455000
CVTVOLT1 EQU   CVTVOLM1+1                                               01456000
CVTVOLI1 EQU   CVTVOLF1                                                 01457000
CVTSTOA  EQU   CVTMAP+376                                               01458000
CVTRSV58 EQU   CVTMAP+374                                               01459000
CVTRSV57 EQU   CVTMAP+372                                               01460000
CVTDDCE  EQU   CVTMAP+368                                               01461000
CVTPNWFR EQU   CVTMAP+364                                               01462000
CVTSMF   EQU   CVTMAP+360                                               01463000
CVTSULK  EQU   CVTMAP+358                                               01464000
CVTSLKO  EQU   CVTSYSK                                                  01465000
CVTSLKP  EQU   CVTSYSK                                                  01466000
CVTSLKQ  EQU   CVTSYSK                                                  01467000
CVTSLKR  EQU   CVTSYSK                                                  01468000
CVTRSV56 EQU   CVTSYSK                                                  01469000
CVTRSV55 EQU   CVTSYSK                                                  01470000
CVTRSV54 EQU   CVTSYSK                                                  01471000
CVTRSV53 EQU   CVTSYSK                                                  01472000
CVTRSV52 EQU   CVTA1F1                                                  01473000
CVTRSV51 EQU   CVTA1F1                                                  01474000
CVTRSV50 EQU   CVTA1F1                                                  01475000
CVTRSV49 EQU   CVTA1F1                                                  01476000
CVTRSV48 EQU   CVTA1F1                                                  01477000
CVTRSV47 EQU   CVTA1F1                                                  01478000
CVTSRSW  EQU   CVTA1F1                                                  01479000
CVTPFSW  EQU   CVTA1F1                                                  01480000
CVTPCVT  EQU   CVTMAP+352                                               01481000
CVTRSV46 EQU   CVTMAP+344                                               01482000
CVTRSV45 EQU   CVTMAP+340                                               01483000
CVTRSV44 EQU   CVTMAP+338                                               01484000
CVTRSV43 EQU   CVTMAP+336                                               01485000
CVTHJESA EQU   CVTHJES+1                                                01486000
CVTRSV42 EQU   CVTHJES                                                  01487000
CVTEXT2A EQU   CVTEXT2+1                                                01488000
CVTRSV41 EQU   CVTEXT2                                                  01489000
CVTAPFA  EQU   CVTAPF+1                                                 01490000
CVTRSV40 EQU   CVTAPF                                                   01491000
CVTRV518 EQU   CVTINTLA                                                 01492000
CVTRV517 EQU   CVTERPV                                                  01493000
CVTEORM  EQU   CVTMAP+312                                               01494000
CVTMCHPR EQU   CVTMAP+308                                               01495000
CVTTZ    EQU   CVTMAP+304                                               01496000
CVTJEPS  EQU   CVTMAP+300                                               01497000
CVTJESCT EQU   CVTMAP+296                                               01498000
CVTMODE  EQU   CVTMAP+292                                               01499000
CVTPTRV  EQU   CVTMAP+288                                               01500000
CVTREAL  EQU   CVTMAP+284                                               01501000
CVTRSV39 EQU   CVTMAP+280                                               01502000
CVTRSV38 EQU   CVTMAP+276                                               01503000
CVTDMSRA EQU   CVTDMSR+1                                                01504000
CVTRSV37 EQU   CVTDMSR                                                  01505000
CVTQMSGA EQU   CVTQMSG+1                                                01506000
CVTRSV36 EQU   CVTQMSG                                                  01507000
CVTAMFF  EQU   CVTMAP+264                                               01508000
CVTPURGA EQU   CVTPURG+1                                                01509000
CVTRSV35 EQU   CVTPURG                                                  01510000
CVTCBSP  EQU   CVTMAP+256                                               01511000
CVTATERA EQU   CVTATER+1                                                01512000
CVTSYST  EQU   CVTATER                                                  01513000
CVTVOLT2 EQU   CVTTAT                                                   01514000
CVTVOLI2 EQU   CVTVOLF2                                                 01515000
CVTAQAVB EQU   CVTAQAVT+1                                               01516000
CVTRSV34 EQU   CVTTCMFG                                                 01517000
CVTRSV33 EQU   CVTTCMFG                                                 01518000
CVTRSV32 EQU   CVTTCMFG                                                 01519000
CVTRSV31 EQU   CVTTCMFG                                                 01520000
CVTRSV30 EQU   CVTTCMFG                                                 01521000
CVTRSV29 EQU   CVTTCMFG                                                 01522000
CVTRSV28 EQU   CVTTCMFG                                                 01523000
CVTTCRDY EQU   CVTTCMFG                                                 01524000
CVTGTFA  EQU   CVTGTF+1                                                 01525000
CVTRSV27 EQU   CVTGTFST                                                 01526000
CVTRNIO  EQU   CVTGTFST                                                 01527000
CVTUSR   EQU   CVTGTFST                                                 01528000
CVTRV318 EQU   CVTFORM                                                  01529000
CVTRV317 EQU   CVTTMODE                                                 01530000
CVTRV316 EQU   CVTSTATE                                                 01531000
CVTRV315 EQU   CVTGTFS                                                  01532000
CVTGTFAV EQU   CVTGTFS                                                  01533000
CVT0SCR1 EQU   CVTMAP+232                                               01534000
CVTRV515 EQU   CVTMAP+228                                               01535000
CVTRMS   EQU   CVTMAP+224                                               01536000
CVTPATCH EQU   CVTMAP+220                                               01537000
CVTTSCE  EQU   CVTMAP+216                                               01538000
CVTLNKSC EQU   CVTMAP+214                                               01539000
CVTQABST EQU   CVTMAP+212                                               01540000
CVTMDLDS EQU   CVTMAP+208                                               01541000
CVTUSER  EQU   CVTMAP+204                                               01542000
CVTABEND EQU   CVTMAP+200                                               01543000
CVTSMCA  EQU   CVTMAP+196                                               01544000
CVTRSV18 EQU   CVTMAP+192                                               01545000
CVTQLPAQ EQU   CVTMAP+188                                               01546000
CVTQCDSR EQU   CVTMAP+184                                               01547000
CVTRSV17 EQU   CVTOPTB                                                  01548000
CVTRSV16 EQU   CVTOPTB                                                  01549000
CVTFP    EQU   CVTOPTB                                                  01550000
CVTAPTHR EQU   CVTOPTB                                                  01551000
CVTNLOG  EQU   CVTOPTB                                                  01552000
CVTTOD   EQU   CVTOPTB                                                  01553000
CVTCTIMS EQU   CVTOPTB                                                  01554000
CVTPROT  EQU   CVTOPTB                                                  01555000
CVTXPFP  EQU   CVTOPTA                                                  01556000
CVTASCII EQU   CVTOPTA                                                  01557000
CVTRSV13 EQU   CVTOPTA                                                  01558000
CVTRSV12 EQU   CVTOPTA                                                  01559000
CVTNIP   EQU   CVTOPTA                                                  01560000
CVTDDR   EQU   CVTOPTA                                                  01561000
CVTAPR   EQU   CVTOPTA                                                  01562000
CVTCCH   EQU   CVTOPTA                                                  01563000
CVTSNCTR EQU   CVTMAP+180                                               01564000
CVTQMWR  EQU   CVTMAP+176                                               01565000
CVTQOCR  EQU   CVTMAP+172                                               01566000
CVT1EF00 EQU   CVTMAP+168                                               01567000
CVTMZ00  EQU   CVTMAP+164                                               01568000
CVTHEAD  EQU   CVTMAP+160                                               01569000
CVTRSV11 EQU   CVTMAP+156                                               01570000
CVT0PT01 EQU   CVTMAP+152                                               01571000
CVTMSER  EQU   CVTMAP+148                                               01572000
CVTRV516 EQU   CVTIERLC                                                 01573000
CVTILCH  EQU   CVTMAP+140                                               01574000
CVT0DS   EQU   CVTMAP+136                                               01575000
CVTFBOSV EQU   CVTMAP+132                                               01576000
CVTNUCB  EQU   CVTMAP+128                                               01577000
CVTIOQET EQU   CVTMAP+120                                               01578000
CVTMVS2  EQU   CVTDCB                                                   01579000
CVT6DAT  EQU   CVTDCB                                                   01580000
CVT4MPS  EQU   CVTDCB                                                   01581000
CVTRSV09 EQU   CVTDCB                                                   01582000
CVT4MS1  EQU   CVTDCB                                                   01583000
CVT2SPS  EQU   CVTDCB                                                   01584000
CVT1SSS  EQU   CVTDCB                                                   01585000
CVTRSV08 EQU   CVTDCB                                                   01586000
CVTSTB   EQU   CVTMAP+112                                               01587000
CVTQTD00 EQU   CVTMAP+108                                               01588000
CVTQTE00 EQU   CVTMAP+104                                               01589000
CVTCUCB  EQU   CVTMAP+100                                               01590000
CVTSJQ   EQU   CVTMAP+96                                                01591000
CVTPBLDL EQU   CVTMAP+92                                                01592000
CVTTPC   EQU   CVTMAP+88                                                01593000
CVTSVDCB EQU   CVTMAP+84                                                01594000
CVTBRET  EQU   CVTMAP+82                                                01595000
CVTEXIT  EQU   CVTMAP+80                                                01596000
CVT0FN00 EQU   CVTMAP+76                                                01597000
CVTDARA  EQU   CVTDAR+1                                                 01598000
CVTRSV07 EQU   CVTFLGS1                                                 01599000
CVTRSV06 EQU   CVTFLGS1                                                 01600000
CVTRSV05 EQU   CVTFLGS1                                                 01601000
CVTRSV04 EQU   CVTFLGS1                                                 01602000
CVTRSV03 EQU   CVTFLGS1                                                 01603000
CVTRSV02 EQU   CVTFLGS1                                                 01604000
CVTRSV01 EQU   CVTFLGS1                                                 01605000
CVTDMPLK EQU   CVTFLGS1                                                 01606000
CVTZDTAB EQU   CVTMAP+64                                                01607000
CVTMSLT  EQU   CVTMAP+60                                                01608000
CVTDATE  EQU   CVTMAP+56                                                01609000
CVTBTERM EQU   CVTMAP+52                                                01610000
CVTSYSAD EQU   CVTMAP+48                                                01611000
CVTILK2  EQU   CVTMAP+40                                                01612000
CVTILK1  EQU   CVTMAP+36                                                01613000
CVTPRLTV EQU   CVTMAP+32                                                01614000
CVTPCNVT EQU   CVTMAP+28                                                01615000
CVT0VL00 EQU   CVTMAP+24                                                01616000
CVTXAPG  EQU   CVTMAP+20                                                01617000
CVTBUF   EQU   CVTMAP+16                                                01618000
CVTJOB   EQU   CVTMAP+12                                                01619000
CVTLINK  EQU   CVTMAP+8                                                 01620000
CVT0EF00 EQU   CVTMAP+4                                                 01621000
CVTTCBP  EQU   CVTMAP                                                   01622000
CVT      EQU   CVTMAP                                                   01623000
UCBERADR EQU   UCBUCS+12                                                01624000
UCBFCBID EQU   UCBUCS+8                                                 01625000
UCBERCNT EQU   UCBUCS+7                                                 01626000
UCBRSV51 EQU   UCBUCS+6                                                 01627000
UCBRSV50 EQU   UCBFCBOP                                                 01628000
UCBRSV49 EQU   UCBFCBOP                                                 01629000
UCBRSV48 EQU   UCBFCBOP                                                 01630000
UCBRSV47 EQU   UCBFCBOP                                                 01631000
UCBRSV46 EQU   UCBFCBOP                                                 01632000
UCBRSV45 EQU   UCBFCBOP                                                 01633000
UCBRSV44 EQU   UCBFCBOP                                                 01634000
UCBFCBO1 EQU   UCBFCBOP                                                 01635000
UCBUCSPE EQU   UCBUCSOP                                                 01636000
UCBRSV43 EQU   UCBUCSOP                                                 01637000
UCBRSV42 EQU   UCBUCSOP                                                 01638000
UCBRSV41 EQU   UCBUCSOP                                                 01639000
UCBRSV40 EQU   UCBUCSOP                                                 01640000
UCBRSV39 EQU   UCBUCSOP                                                 01641000
UCBUCSO2 EQU   UCBUCSOP                                                 01642000
UCBUCSO1 EQU   UCBUCSOP                                                 01643000
UCBUCSID EQU   UCBUCS                                                   01644000
UCBRV073 EQU   UCB3540X+7                                               01645000
UCBRV072 EQU   UCBDKBYT                                                 01646000
UCBRV071 EQU   UCBDKBYT                                                 01647000
UCBRV070 EQU   UCBDKBYT                                                 01648000
UCBRV069 EQU   UCBDKBYT                                                 01649000
UCBRV068 EQU   UCBDKBYT                                                 01650000
UCBRV067 EQU   UCBDKBYT                                                 01651000
UCBVLVER EQU   UCBDKBYT                                                 01652000
UCBDKAMX EQU   UCBDKBYT                                                 01653000
UCBVLSER EQU   UCB3540X                                                 01654000
UCBRDATA EQU   UCBOCR+4                                                 01655000
UCBFRID  EQU   UCBOCR                                                   01656000
UCBCLN   EQU   UCBMT+14                                                 01657000
UCBERG   EQU   UCBMT+12                                                 01658000
UCBMS    EQU   UCBMT+11                                                 01659000
UCBNB    EQU   UCBMT+10                                                 01660000
UCBPW    EQU   UCBMT+9                                                  01661000
UCBPR    EQU   UCBMT+8                                                  01662000
UCBSIO   EQU   UCBMT+6                                                  01663000
UCBTW    EQU   UCBMT+5                                                  01664000
UCBTR    EQU   UCBMT+4                                                  01665000
UCBTWT   EQU   UCBMT+3                                                  01666000
UCBTRT   EQU   UCBMT+2                                                  01667000
UCBCTD   EQU   UCBMT                                                    01668000
UCBWTOID EQU   UCBCMEXT+17                                              01669000
UCBRV043 EQU   UCBCMEXT+16                                              01670000
UCBASID  EQU   UCBCMEXT+14                                              01671000
UCBMFCNT EQU   UCBCMEXT+12                                              01672000
UCBPMSK  EQU   UCBCMEXT+10                                              01673000
UCBCCWOF EQU   UCBCMEXT+8                                               01674000
UCBRV041 EQU   UCBCMEXT+6                                               01675000
UCBRV036 EQU   UCBFLP1                                                  01676000
UCBRV035 EQU   UCBFLP1                                                  01677000
UCBRV034 EQU   UCBFLP1                                                  01678000
UCBRV033 EQU   UCBFLP1                                                  01679000
UCBRV032 EQU   UCBFLP1                                                  01680000
UCBRV031 EQU   UCBFLP1                                                  01681000
UCBSHRUP EQU   UCBFLP1                                                  01682000
UCBNSRCH EQU   UCBFLP1                                                  01683000
UCBSNSCT EQU   UCBCMEXT+4                                               01684000
UCBHPDV  EQU   @NM00032                                                 01685000
UCBHALI  EQU   @NM00032                                                 01686000
UCBRSV09 EQU   @NM00032                                                 01687000
UCBRSV08 EQU   @NM00032                                                 01688000
UCBRSV07 EQU   @NM00032                                                 01689000
UCBRSV06 EQU   @NM00032                                                 01690000
UCBRSV05 EQU   @NM00032                                                 01691000
UCBRSV04 EQU   @NM00032                                                 01692000
UCBDTI   EQU   UCBCMEXT+2                                               01693000
UCBSTI   EQU   UCBCMEXT+1                                               01694000
UCBETI   EQU   UCBCMEXT                                                 01695000
UCBEXTP  EQU   UCBEXTPT+1                                               01696000
UCBDDRSW EQU   UCBFLC                                                   01697000
UCBTICBT EQU   UCBFLC                                                   01698000
UCBIVRR  EQU   UCBFLC                                                   01699000
UCBIVRS  EQU   UCBFLC                                                   01700000
UCBITF   EQU   UCBFLC                                                   01701000
UCBUDE   EQU   UCBFLC                                                   01702000
UCBWAA   EQU   UCBFLC                                                   01703000
UCBATTP  EQU   UCBFLC                                                   01704000
UCBUNTYP EQU   UCBTBYT4                                                 01705000
UCBRSV11 EQU   UCBDVCLS                                                 01706000
UCBRSV10 EQU   UCBDVCLS                                                 01707000
UCB3CHAR EQU   UCBDVCLS                                                 01708000
UCB3UREC EQU   UCBDVCLS                                                 01709000
UCB3DISP EQU   UCBDVCLS                                                 01710000
UCB3DACC EQU   UCBDVCLS                                                 01711000
UCB3COMM EQU   UCBDVCLS                                                 01712000
UCB3TAPE EQU   UCBDVCLS                                                 01713000
UCBDVPWR EQU   UCB2OPT7                                                 01714000
UCBVLPWR EQU   UCB2OPT6                                                 01715000
UCB2OPT5 EQU   UCBTBYT2                                                 01716000
UCBRVDEV EQU   UCBRWTAU                                                 01717000
UCBRPS   EQU   UCBDUDN2                                                 01718000
UCBRR    EQU   UCBDUDN1                                                 01719000
UCB2OPT1 EQU   UCBTBYT2                                                 01720000
UCB2OPT0 EQU   UCBTBYT2                                                 01721000
UCB1FEA7 EQU   UCBTBYT1                                                 01722000
UCBD6250 EQU   UCB1FEA6                                                 01723000
UCBD1600 EQU   UCB1FEA5                                                 01724000
UCB1FEA4 EQU   UCBTBYT1                                                 01725000
UCB1FEA3 EQU   UCBTBYT1                                                 01726000
UCB1FEA2 EQU   UCBTBYT1                                                 01727000
UCB1FEA1 EQU   UCBTBYT1                                                 01728000
UCB1FEA0 EQU   UCBTBYT1                                                 01729000
UCBNAME  EQU   UCBOB+13                                                 01730000
UCBRV029 EQU   UCBWGT                                                   01731000
UCBVHRSN EQU   UCBWGT                                                   01732000
UCBVORSN EQU   UCBWGT                                                   01733000
UCBMTPXP EQU   UCBWGT                                                   01734000
UCBREW   EQU   UCBWGT                                                   01735000
UCBPUB   EQU   UCBWGT                                                   01736000
UCBOUT   EQU   UCBWGT                                                   01737000
UCBIN    EQU   UCBWGT                                                   01738000
UCBCPU   EQU   UCBOB+11                                                 01739000
UCBLCI   EQU   UCBOB+10                                                 01740000
UCBCNT   EQU   UCBOB+9                                                  01741000
UCBRV017 EQU   UCBCHM1                                                  01742000
UCBRV016 EQU   UCBCHM1                                                  01743000
UCBRV015 EQU   UCBCHM1                                                  01744000
UCBRV014 EQU   UCBCHM1                                                  01745000
UCBSPB   EQU   UCBPTH1                                                  01746000
UCBPPB   EQU   UCBPTH1                                                  01747000
UCBSPA   EQU   UCBPTH0                                                  01748000
UCBPPA   EQU   UCBPTH0                                                  01749000
UCBFLB7  EQU   UCBFLB                                                   01750000
UCBVALPH EQU   UCBFLB                                                   01751000
UCBCRHSN EQU   UCBFLB                                                   01752000
UCBCRHRV EQU   UCBFLB                                                   01753000
UCBRESVH EQU   UCBFLB                                                   01754000
UCBSPST  EQU   UCBFLB                                                   01755000
UCBASNS  EQU   UCBFLB                                                   01756000
UCBIORST EQU   UCBFLB                                                   01757000
UCBQISCE EQU   UCBFL1                                                   01758000
UCBACTV  EQU   UCBFL1                                                   01759000
UCBSAP   EQU   UCBFL1                                                   01760000
UCBNOTRC EQU   UCBCUB                                                   01761000
UCBPSNS  EQU   UCBFL1                                                   01762000
UCBUSING EQU   UCBPST                                                   01763000
UCBNOTRD EQU   UCBNRY                                                   01764000
UCBBUSYD EQU   UCBBSY                                                   01765000
UCBUA    EQU   UCBCHAN+1                                                01766000
UCBCHA   EQU   UCBCHAN                                                  01767000
UCBDADI  EQU   UCBSTAT                                                  01768000
UCBSYSR  EQU   UCBSTAT                                                  01769000
UCBPRES  EQU   UCBSTAT                                                  01770000
UCBALOC  EQU   UCBSTAT                                                  01771000
UCBUNLD  EQU   UCBSTAT                                                  01772000
UCBRESV  EQU   UCBSTAT                                                  01773000
UCBCHGS  EQU   UCBSTAT                                                  01774000
UCBONLI  EQU   UCBSTAT                                                  01775000
UCBID    EQU   UCBOB+2                                                  01776000
UCBALTPH EQU   UCBFL5                                                   01777000
UCBALTCU EQU   UCBFL5                                                   01778000
UCBNALOC EQU   UCBFL5                                                   01779000
UCBENVRD EQU   UCBFL5                                                   01780000
UCBVSDR  EQU   UCBFL5                                                   01781000
UCBSASK  EQU   UCBFL5                                                   01782000
UCBAMV   EQU   UCBAF                                                    01783000
UCBDCC   EQU   UCBFL5                                                   01784000
UCBMONT  EQU   UCBJBNR                                                  01785000
UCBRV011 EQU   UCBJBNR                                                  01786000
UCBRSV02 EQU   UCBJBNR                                                  01787000
UCBOLDSM EQU   UCBJBNR                                                  01788000
UCBRV003 EQU   UCBJBNR                                                  01789000
UCBRV002 EQU   UCBJBNR                                                  01790000
UCBJES3  EQU   UCBJBNR                                                  01791000
UCBVRDEV EQU   UCBJBNR                                                  01792000
UCBCMSEG EQU   UCBOB                                                    01793000
UCBPFXND EQU   UCB+512                                                  01794000
UCBIOQ   EQU   UCB+508                                                  01795000
UCBLOCK  EQU   UCB+504                                                  01796000
UCBPXST  EQU   UCB+504                                                  01797000
@NM00029 EQU   UCB                                                      01798000
IOCOEND  EQU   IOCOM+128                                                01799000
IOCPATCH EQU   IOCOM+124                                                01800000
IOCUCBBM EQU   IOCOM+120                                                01801000
IOCQCNT  EQU   IOCOM+116                                                01802000
IOCIOSDQ EQU   IOCOM+112                                                01803000
IOCIOSEQ EQU   IOCOM+108                                                01804000
IOCSVCF  EQU   IOCOM+104                                                01805000
IOCTCCW  EQU   IOCOM+100                                                01806000
IOCRSVTB EQU   IOCOM+96                                                 01807000
IOCMFCNT EQU   IOCOM+92                                                 01808000
IOCMFHK  EQU   IOCOM+88                                                 01809000
IOCCCH   EQU   IOCOM+80                                                 01810000
IOCASYNQ EQU   IOCOM+76                                                 01811000
IOCLCHTB EQU   IOCOM+72                                                 01812000
IOCATTBL EQU   IOCOM+68                                                 01813000
IOCOMEX  EQU   IOCOM+64                                                 01814000
IOCSYNCH EQU   IOCOM+56                                                 01815000
IOCCATLK EQU   IOCOM+48                                                 01816000
IOCPRGID EQU   IOCOM+44                                                 01817000
IOCIOSCP EQU   IOCOM+40                                                 01818000
IOCORMGT EQU   IOCOM+36                                                 01819000
IOCVOID  EQU   IOCOM+32                                                 01820000
IOCSTIO  EQU   IOCOM+28                                                 01821000
@NM00028 EQU   IOCOM+24                                                 01822000
@NM00027 EQU   IOCOM+20                                                 01823000
IOCINT   EQU   IOCOM+16                                                 01824000
IOCCTBL  EQU   IOCOM+12                                                 01825000
IOCHIO   EQU   IOCOM+8                                                  01826000
IOCPST   EQU   IOCOM+4                                                  01827000
IOCPGCT  EQU   IOCOM+2                                                  01828000
IOCVOICT EQU   IOCOM                                                    01829000
EWADDISP EQU   EWA+29                                                   01830000
EWADCNT  EQU   EWA+28                                                   01831000
EWACPU   EQU   EWA+27                                                   01832000
@NM00016 EQU   EWA+26                                                   01833000
EWACHA   EQU   EWA+24                                                   01834000
EWACSEQ  EQU   EWAXCSW2                                                 01835000
EWACDIN  EQU   EWAXCSW2                                                 01836000
@NM00015 EQU   EWAXCSW2                                                 01837000
EWACTEC  EQU   EWAXCSW2                                                 01838000
EWACDAV  EQU   EWAXCSW1                                                 01839000
EWACCHV  EQU   EWAXCSW1                                                 01840000
EWACCMD  EQU   EWAXCSW1                                                 01841000
EWACUNS  EQU   EWAXCSW1                                                 01842000
EWACSQV  EQU   EWAXCSW1                                                 01843000
@NM00014 EQU   EWAXCSW1                                                 01844000
EWACITF  EQU   EWAXCSW1                                                 01845000
@NM00013 EQU   EWARGFG2                                                 01846000
EWACCUE  EQU   EWARGFG2                                                 01847000
EWACSTG  EQU   EWARGFG2                                                 01848000
EWACSCU  EQU   EWARGFG2                                                 01849000
EWACCHA  EQU   EWARGFG2                                                 01850000
EWACCPU  EQU   EWARGFG2                                                 01851000
EWANORTY EQU   EWARGFG1                                                 01852000
EWACCNT  EQU   EWARGFG1                                                 01853000
EWACSNS  EQU   EWARGFG1                                                 01854000
@NM00012 EQU   EWARGFG1                                                 01855000
EWACHIO  EQU   EWARGFG1                                                 01856000
EWACTIO  EQU   EWARGFG1                                                 01857000
EWACINT  EQU   EWARGFG1                                                 01858000
EWACSIO  EQU   EWARGFG1                                                 01859000
EWAUCB   EQU   EWAERPIB+1                                               01860000
@NM00011 EQU   EWAERPIB                                                 01861000
EWACNTR4 EQU   EWACNTRS+3                                               01862000
EWACNTR2 EQU   EWACNTRS+1                                               01863000
EWASSTAT EQU   EWA+8                                                    01864000
EWASCTMX EQU   EWASNSCT                                                 01865000
@NM00010 EQU   EWASNSCT                                                 01866000
@NM00009 EQU   EWAFLG2                                                  01867000
EWADIR   EQU   EWAFLG2                                                  01868000
EWACOVF  EQU   EWAFLG2                                                  01869000
EWAWTEMP EQU   EWAFLG2                                                  01870000
EWABDSNS EQU   EWAFLG1                                                  01871000
EWADDMSG EQU   EWAFLG1                                                  01872000
EWASCC1  EQU   EWASCC3                                                  01873000
EWASCC2  EQU   EWASCC3                                                  01874000
@NM00008 EQU   EWAFLG1                                                  01875000
EWASLIS  EQU   EWAFLG1                                                  01876000
EWAEXT   EQU   EWAHDR                                                   01877000
IOSEND   EQU   IOSB+108                                                 01878000
IOSSKR   EQU   IOSEEKA+7                                                01879000
IOSSKH2  EQU   IOSSKHH+1                                                01880000
IOSSKH1  EQU   IOSSKHH                                                  01881000
IOSSKCC  EQU   IOSCCHH                                                  01882000
IOSSKBB  EQU   IOSEEKA+1                                                01883000
IOSSKM   EQU   IOSEEKA                                                  01884000
IOSEEK   EQU   IOSB+92                                                  01885000
IOSMDM   EQU   IOSB+91                                                  01886000
IOSMDB   EQU   IOSB+90                                                  01887000
IOSCKEY7 EQU   IOSCKEY                                                  01888000
IOSCKEY6 EQU   IOSCKEY                                                  01889000
IOSCKEY5 EQU   IOSCKEY                                                  01890000
IOSCKEY4 EQU   IOSCKEY                                                  01891000
@NM00004 EQU   IOSCKEY                                                  01892000
IOSFMSK  EQU   IOSB+88                                                  01893000
IOSCUDEV EQU   IOSPATH+1                                                01894000
@NM00003 EQU   IOSCHN                                                   01895000
IOSPATH3 EQU   IOSCHN                                                   01896000
IOSPATH2 EQU   IOSCHN                                                   01897000
IOSEXP   EQU   IOSCHN                                                   01898000
IOSGDP   EQU   IOSCHN                                                   01899000
IOSAFF   EQU   IOSB+85                                                  01900000
IOSRSS1B EQU   IOSB+84                                                  01901000
IOSDSID  EQU   IOSB+80                                                  01902000
IOSVST   EQU   IOSB+76                                                  01903000
IOSDIE   EQU   IOSB+68                                                  01904000
IOSABN   EQU   IOSB+64                                                  01905000
IOSNRM   EQU   IOSB+60                                                  01906000
IOSPCI   EQU   IOSB+56                                                  01907000
IOSPCHN  EQU   IOSB+48                                                  01908000
IOSAPMSK EQU   IOSB+40                                                  01909000
IOSRES4A EQU   IOSB+36                                                  01910000
IOSSRB   EQU   IOSB+28                                                  01911000
IOSCSWRC EQU   IOSCSW+5                                                 01912000
IOSTSB   EQU   IOSTATUS+1                                               01913000
IOSOPT2X EQU   IOSOPT2                                                  01914000
IOSHTP   EQU   IOSOPT2                                                  01915000
IOSRELSE EQU   IOSOPT                                                   01916000
IOSAPR   EQU   IOSOPT                                                   01917000
IOSTSLL  EQU   IOSOPT                                                   01918000
IOSNERP  EQU   IOSOPT                                                   01919000
IOSPSLL  EQU   IOSOPT                                                   01920000
IOSQISCE EQU   IOSOPT                                                   01921000
IOSDEP   EQU   IOSOPT                                                   01922000
IOSBYP   EQU   IOSOPT                                                   01923000
IOSPKY7  EQU   IOSPKEY                                                  01924000
IOSPGDPX EQU   IOSPKEY                                                  01925000
IOSIDR   EQU   IOSPKEY                                                  01926000
IOSLCL   EQU   IOSPKEY                                                  01927000
@NM00001 EQU   IOSPKEY                                                  01928000
IOSPGAD  EQU   IOSB+8                                                   01929000
IOSASID  EQU   IOSB+6                                                   01930000
IOSPRLVL EQU   IOSB+5                                                   01931000
IOSPROC  EQU   IOSB+3                                                   01932000
IOSFLC7  EQU   IOSFLC                                                   01933000
IOSFLC6  EQU   IOSFLC                                                   01934000
IOSGLC5  EQU   IOSFLC                                                   01935000
IOSFLC4  EQU   IOSFLC                                                   01936000
IOSTP    EQU   IOSFLC                                                   01937000
IOSCC3WE EQU   IOSFLC                                                   01938000
IOSVERIF EQU   IOSDVALT                                                 01939000
IOSDVMNT EQU   IOSFLC                                                   01940000
IOSBDCST EQU   IOSFLB                                                   01941000
IOSFLB4  EQU   IOSFLB                                                   01942000
IOSFLB3  EQU   IOSFLB                                                   01943000
IOSFLB2  EQU   IOSFLB                                                   01944000
IOSFLB1  EQU   IOSFLB                                                   01945000
IOSDIESE EQU   IOSFLB                                                   01946000
IOSIOSB  EQU   IOSFLA                                                   01947000
IOSDOM   EQU   IOSFLA                                                   01948000
IOSSMDB  EQU   IOSFLA                                                   01949000
IOSSMDA  EQU   IOSFLA                                                   01950000
IOSDCHN  EQU   IOSACHN                                                  01951000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01952000
@RT00112 EQU   EXIT22                                                   01953000
@RT00115 EQU   STATUS                                                   01954000
@RT00125 EQU   STATUS                                                   01955000
@RC00139 EQU   ERR021                                                   01956000
@RT00146 EQU   ERR051                                                   01957000
@RT00148 EQU   ERR051                                                   01958000
@RT00150 EQU   ERR051                                                   01959000
@RT00152 EQU   ERR051                                                   01960000
@RT00154 EQU   ERR051                                                   01961000
@RT00162 EQU   EXIT12                                                   01962000
@RT00164 EQU   EXIT12                                                   01963000
@RT00168 EQU   EXIT12                                                   01964000
@RT00170 EQU   EXIT12                                                   01965000
@RT00174 EQU   EXIT12                                                   01966000
@RF00174 EQU   SENSE                                                    01967000
@RT00177 EQU   EXIT12                                                   01968000
@RT00181 EQU   EXIT12                                                   01969000
@RT00185 EQU   EXIT12                                                   01970000
@RT00189 EQU   EXIT12                                                   01971000
@RT00193 EQU   EXIT12                                                   01972000
@RT00197 EQU   ERR006                                                   01973000
@RT00199 EQU   EXIT22                                                   01974000
@RT00203 EQU   EXIT01                                                   01975000
@RT00217 EQU   EXIT01                                                   01976000
@RT00222 EQU   EXIT30                                                   01977000
@RT00230 EQU   EXIT12                                                   01978000
@RT00234 EQU   EXIT12                                                   01979000
@RT00254 EQU   EXIT22                                                   01980000
@ENDDATA EQU   *                                                        01981000
         END   ER3890,(C'PLS1456',0701,78209)                           01982000
./  ADD  SSI=60050061,NAME=IGG019UM
         TITLE 'IGG019UM, 3890 SYNC MODULE                             *00001000
                        '                                               00002000
IGG019UM CSECT ,                                                   0001 00003000
@PROLOG  BALR  @06,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@06                                         0001 00006000
         STM RETR,ENTR,12(SAVR)                                         00007000
*   IOBAR=DCBIOBA;                  /* REG3 POINTS TO IOB            */ 00008000
         L     IOBAR,DCBIOBA+52(,DCBPTR)                           0045 00009000
*   GEN(LA     IOBSTPTR,8(IOBAR));  /* ADDR OF IOB STANDARD          */ 00010000
         LA     IOBSTPTR,8(IOBAR)                                       00011000
*   MRWRITE='0'B;                   /* TURN WRITE FLAG OFF           */ 00012000
         NI    MRWRITE(DCBPTR),B'01111111'                         0047 00013000
*   IMGEOF=OFF;                     /* SET IMAG FILE EOF OFF @ZA04468*/ 00014000
         NI    IMGEOF(DCBPTR),B'01111111'                          0048 00015000
*   RPARA1=ADDR(CCWEND);            /* REG1 PT TO END CCW CHAIN      */ 00016000
         L     RPARA1,IOBSTART(,IOBSTPTR)                          0049 00017000
         LA    RPARA1,CCWEND(,RPARA1)                              0049 00018000
*   RPARA1=RPARA1+DCBBLKSI-TWELVE;  /* HEADER OF LAST IMAGE          */ 00019000
         LR    @00,RPARA1                                          0050 00020000
         AH    @00,DCBBLKSI+52(,DCBPTR)                            0050 00021000
         SL    @00,@CF00754                                        0050 00022000
         LR    RPARA1,@00                                          0050 00023000
*   IF IMGPROC=ON THEN              /* IMAGE PROCESS ACTIVE  @ZA04477*/ 00024000
         TM    IMGPROC(DCBPTR),B'00000001'                         0051 00025000
         BNO   @RF00051                                            0051 00026000
*     GEN( OC    IMGFLGS(1,DCBPTR),0(RPARA1));/* IMAGE EOF IND     0052 00027000
*                                                            @ZA04468*/ 00028000
          OC    IMGFLGS(1,DCBPTR),0(RPARA1)                             00029000
*A1:                                                               0053 00030000
*   IF CMPCODE=IOWAIT THEN          /* TEST COMPLETION               */ 00031000
@RF00051 DS    0H                                                  0053 00032000
A1       L     @01,DCBIOBA+52(,DCBPTR)                             0053 00033000
         CLI   CMPCODE+4(@01),X'00'                                0053 00034000
         BNE   @RF00053                                            0053 00035000
*     DO;                           /* NOT COMPLETE          @Y30GECD*/ 00036000
*       IF DCBQSMEX=ZERO4 THEN      /* IS A USER EXIT SPECIFIED    0055 00037000
*                                                            @Y30GECD*/ 00038000
         L     @15,DCBQSMEX(,DCBPTR)                               0055 00039000
         LTR   @15,@15                                             0055 00040000
         BNZ   @RF00055                                            0055 00041000
*         GEN(WAIT ECB=4(IOBAR));   /* NO, ISSUE WAIT MACRO          */ 00042000
         WAIT ECB=4(IOBAR)                                              00043000
*       ELSE                                                       0057 00044000
*         DO;                       /* AN EXIT IS SPECIFIED  @Y30GECD*/ 00045000
         B     @RC00055                                            0057 00046000
@RF00055 DS    0H                                                  0058 00047000
*           RPARA1=ADDR(ECB);       /* REG1 = ECB ADDRESS    @Y30GECD*/ 00048000
         LA    RPARA1,4                                            0058 00049000
         AL    RPARA1,DCBIOBA+52(,DCBPTR)                          0058 00050000
*           ENTR=DCBQSMEX;          /* REG15 = ADDR OF USER EXIT   0059 00051000
*                                                            @Y30GECD*/ 00052000
         L     ENTR,DCBQSMEX(,DCBPTR)                              0059 00053000
*           GEN( BALR 14,15);       /* GO TO USERS EXIT      @Y30GECD*/ 00054000
          BALR 14,15                                                    00055000
*           IF CMPCODE=IOWAIT THEN  /* TEST IO COMPLETE      @Y30GECD*/ 00056000
         L     @01,DCBIOBA+52(,DCBPTR)                             0061 00057000
         CLI   CMPCODE+4(@01),X'00'                                0061 00058000
         BNE   @RF00061                                            0061 00059000
*             GEN(WAIT ECB=4(IOBAR));/* NOT COMPLETE - WAIT  @Y30GECD*/ 00060000
         WAIT ECB=4(IOBAR)                                              00061000
*         END;                      /*                       @Y30GECD*/ 00062000
@RF00061 DS    0H                                                  0064 00063000
*     END;                          /*                       @Y30GECD*/ 00064000
@RC00055 DS    0H                                                  0065 00065000
*A2:                                                               0065 00066000
*   IF CMPCODE¬=CMPNOER THEN        /* COMPLETE WITH ERROR           */ 00067000
@RF00053 DS    0H                                                  0065 00068000
A2       L     @01,DCBIOBA+52(,DCBPTR)                             0065 00069000
         CLC   CMPCODE+4(1,@01),CMPNOER                            0065 00070000
         BE    @RF00065                                            0065 00071000
*     DO;                                                          0066 00072000
*                                                                  0066 00073000
*/********************************************************************/ 00074000
*/*  HANDLE ERROR CONDITIONS                                         */ 00075000
*/********************************************************************/ 00076000
*                                                                  0067 00077000
*B1:                                                               0067 00078000
*       RPARA1=DCBPTR;              /* DCB ADDR IS IN R1 FOR EOV     */ 00079000
B1       LR    RPARA1,DCBPTR                                       0067 00080000
*       RPARA0=IOBAR;               /* IOB ADDR IN REG 0             */ 00081000
         LR    RPARA0,IOBAR                                        0068 00082000
*       GEN CODE;                                                  0069 00083000
*                                                          /*@YM00625*/ 00084000
         STM   RPARA0,RPARA1,64(SAVR)    SAVE DCB AND IOB               00085000
         EOV   0(1)                    SVC 55                           00086000
         LTR   ENTR,ENTR               PERMANENT ERROR AND SYNAD        00087000
         BZ    A1                      NO,WAIT ON ECB                   00088000
         BALR  RETR,ENTR               YES,GO TO USERS SYNAD ROUTINE    00089000
         LM    RPARA0,RPARA1,64(SAVR)  RESTORE DCB AND IOB ADDR         00090000
         EOV   0(1)                    SVC 55                           00091000
*       GOTO A1;                    /* RETEST ECB            @YM00625*/ 00092000
         B     A1                                                  0070 00093000
*     END;                                                         0071 00094000
*   ELSE                                                           0072 00095000
*     DO;                           /* NO, PROCESS ORMALLY           */ 00096000
@RF00065 DS    0H                                                  0073 00097000
*/********************************************************************/ 00098000
*/*  ECB COMPLETE                                                    */ 00099000
*/********************************************************************/ 00100000
*                                                                  0073 00101000
*CONE:                                                             0073 00102000
*       USHDR=ZERO;                 /* ZERO OUT HEADER       @YM00645*/ 00103000
CONE     L     @01,DCBHDR(,DCBPTR)                                 0073 00104000
         MVC   USHDR(12,@01),ZERO                                  0073 00105000
*       IF UXFLG=ON|IOBS0B1=ON|IOBS0B6=ON THEN/* UX,UC       @YM00645*/ 00106000
         TM    UXFLG(DCBPTR),B'00000001'                           0074 00107000
         BO    @RT00074                                            0074 00108000
         TM    IOBS0B1(IOBSTPTR),B'01000010'                       0074 00109000
         BZ    @RF00074                                            0074 00110000
@RT00074 DS    0H                                                  0075 00111000
*         DO;                       /* YES                           */ 00112000
*           HDRSENS0=IOBSENS0;      /* SENSE BYTE 1 INTO HDR         */ 00113000
         L     @01,DCBHDR(,DCBPTR)                                 0076 00114000
         MVC   HDRSENS0(1,@01),IOBSENS0(IOBSTPTR)                  0076 00115000
*           HDRSENS1=IOBSENS1;      /* SENSE BYTE 2 INTO HDR         */ 00116000
         L     @01,DCBHDR(,DCBPTR)                                 0077 00117000
         MVC   HDRSENS1(1,@01),IOBSENS1(IOBSTPTR)                  0077 00118000
*           IF UXFLG=ON THEN        /* IF JUST UNIT EXCEPTION      0078 00119000
*                                                            @YM00613*/ 00120000
         TM    UXFLG(DCBPTR),B'00000001'                           0078 00121000
         BNO   @RF00078                                            0078 00122000
*             HDRTYP=ONE;           /* HDR TYPE IS X'01'     @YM00613*/ 00123000
         L     @01,DCBHDR(,DCBPTR)                                 0079 00124000
         MVI   HDRTYP(@01),X'01'                                   0079 00125000
*           ELSE                                                   0080 00126000
*             HDRTYP=TWO;           /* JUST UC, TYPE=X'02'   @YM00613*/ 00127000
         B     @RC00078                                            0080 00128000
@RF00078 L     @01,DCBHDR(,DCBPTR)                                 0080 00129000
         MVI   HDRTYP(@01),X'02'                                   0080 00130000
*           IF UXFLG=ON&IOBS0B1=ON THEN/* IF UNIT EXC & IRV          */ 00131000
@RC00078 TM    UXFLG(DCBPTR),B'00000001'                           0081 00132000
         BNO   @RF00081                                            0081 00133000
         TM    IOBS0B1(IOBSTPTR),B'01000000'                       0081 00134000
         BNO   @RF00081                                            0081 00135000
*             HDRTYP=THREE;         /* HDR TYPE IS X'03'             */ 00136000
         L     @01,DCBHDR(,DCBPTR)                                 0082 00137000
         MVI   HDRTYP(@01),X'03'                                   0082 00138000
*           IF UXFLG=ON&IOBS0B6=ON THEN/* IF UNIT EXC & NI           */ 00139000
@RF00081 TM    UXFLG(DCBPTR),B'00000001'                           0083 00140000
         BNO   @RF00083                                            0083 00141000
         TM    IOBS0B6(IOBSTPTR),B'00000010'                       0083 00142000
         BNO   @RF00083                                            0083 00143000
*             HDRTYP=THREE;         /* HDR TYPE IS X'03'             */ 00144000
         L     @01,DCBHDR(,DCBPTR)                                 0084 00145000
         MVI   HDRTYP(@01),X'03'                                   0084 00146000
*           UXFLG=OFF;              /* TYRN UX FLAG OFF              */ 00147000
@RF00083 NI    UXFLG(DCBPTR),B'11111110'                           0085 00148000
*           RECLEN=DCBLRECL-TWELVE; /* LENGTH OF DATA RECORD         */ 00149000
         LH    RECLEN,DCBLRECL+72(,DCBPTR)                         0086 00150000
         SL    RECLEN,@CF00754                                     0086 00151000
*           USDTA(1:RECLEN)=ZERO(1:RECLEN);/* 0 OUT REC.             */ 00152000
         LR    @15,RECLEN                                          0087 00153000
         BCTR  @15,0                                               0087 00154000
         EX    @15,@SM00774                                        0087 00155000
*           IF COMADR¬=ADDR(CCWEND)&COMADR¬=ADDR(ANTCPT)&/*  @ZA04468*/ 00156000
*               IMGEOF¬=ON&IMGPROC=ON THEN/* WRITE & IMAGE PROCESS 0088 00157000
*                                                            @ZA04477*/ 00158000
         L     @01,IOBSTART(,IOBSTPTR)                             0088 00159000
         LA    @15,CCWEND(,@01)                                    0088 00160000
         L     @14,COMADR-1(,IOBSTPTR)                             0088 00161000
         LA    @14,0(,@14)                                         0088 00162000
         CR    @15,@14                                             0088 00163000
         BE    @RF00088                                            0088 00164000
         L     @01,IOBSTART(,IOBSTPTR)                             0088 00165000
         LA    @15,ANTCPT(,@01)                                    0088 00166000
         L     @14,COMADR-1(,IOBSTPTR)                             0088 00167000
         LA    @14,0(,@14)                                         0088 00168000
         CR    @15,@14                                             0088 00169000
         BE    @RF00088                                            0088 00170000
         TM    IMGPROC(DCBPTR),B'00000001'                         0088 00171000
         BNO   @RF00088                                            0088 00172000
         TM    IMGEOF(DCBPTR),B'10000000'                          0088 00173000
         BNZ   @RF00088                                            0088 00174000
*             DO;                   /* & NOT IMAGE FILE EOF  @ZA04477*/ 00175000
*               SAVE17=R6;          /* SAVE BASE REG         @ZA00779*/ 00176000
         ST    R6,SAVE17(,SAVR)                                    0090 00177000
*               SAVE18=IOBSTPTR;    /* SAVE IOB ADDR         @ZA00779*/ 00178000
         ST    IOBSTPTR,SAVE18(,SAVR)                              0091 00179000
*               GEN CODE;                                          0092 00180000
*                                                          /*@ZA00779*/ 00181000
         LM    RETR,R8,20(SAVR)         RESTORE USERS REGS     @ZA00779 00182000
         LR    RPARA0,RPARA1            PUT ADDR OF DCB IN REG 0        00183000
*                                                              @ZA00779 00184000
         L     ENTR,4(RPARA1)           CALL DCBIMG            @ZA00779 00185000
         BALR  RETR,ENTR                GO TO IMAGE TRN        @ZA00779 00186000
         L     WORK,28(,SAVR)           RESTORE WORK AREA REG  @ZA00779 00187000
         L     DCBPTR,32(,SAVR)         RESTORE DCB PTR REG    @ZA00779 00188000
*               IOBSTPTR=SAVE18;    /* RESTORE IOB PTR       @ZA00779*/ 00189000
         L     IOBSTPTR,SAVE18(,SAVR)                              0093 00190000
*               R6=SAVE17;          /* RESTORE BASE REG      @ZA00779*/ 00191000
         L     R6,SAVE17(,SAVR)                                    0094 00192000
*               RPARA1=DCBBLKSI;    /* SET UP FOR MVCL INSTRUCTION 0095 00193000
*                                                            @ZA00779*/ 00194000
         LH    RPARA1,DCBBLKSI+52(,DCBPTR)                         0095 00195000
*               RETR=ADDR(CCWEND);  /*                       @ZA00779*/ 00196000
         L     RETR,IOBSTART(,IOBSTPTR)                            0096 00197000
         LA    RETR,CCWEND(,RETR)                                  0096 00198000
*               ENTR=DCBBLKSI;      /*                       @ZA00779*/ 00199000
         LH    ENTR,DCBBLKSI+52(,DCBPTR)                           0097 00200000
*               GEN(MVCL  14,0);    /*                       @ZA00779*/ 00201000
         MVCL  14,0                                                     00202000
*               IF COMADR=ADDR(WRITEND) THEN/* JUST A WRITE DONE   0099 00203000
*                                                            @ZA00779*/ 00204000
         L     @01,IOBSTART(,IOBSTPTR)                             0099 00205000
         LA    @15,WRITEND(,@01)                                   0099 00206000
         L     @14,COMADR-1(,IOBSTPTR)                             0099 00207000
         LA    @14,0(,@14)                                         0099 00208000
         CR    @15,@14                                             0099 00209000
         BNE   @RF00099                                            0099 00210000
*                 MRWRITE='1'B;     /* YES,TURN WRITE FLAG ON      0100 00211000
*                                                            @ZA00779*/ 00212000
         OI    MRWRITE(DCBPTR),B'10000000'                         0100 00213000
*             END;                  /*                       @ZA00779*/ 00214000
*         END;                      /*                       @ZA00779*/ 00215000
*       ELSE                                                       0103 00216000
*         DO;                       /* NO, NOT UX OR UC              */ 00217000
         B     @RC00074                                            0103 00218000
@RF00074 DS    0H                                                  0104 00219000
*           IF NIBIT=ON THEN        /* DEVICE STILL NOT INIT.        */ 00220000
         L     @01,DCBHDR(,DCBPTR)                                 0104 00221000
         TM    NIBIT(@01),B'00000010'                              0104 00222000
         BNO   @RF00104                                            0104 00223000
*             DO;                                                  0105 00224000
*               IOBSENS0=HDRSENS0;  /* RESTORE IOB SENSE             */ 00225000
         L     @01,DCBHDR(,DCBPTR)                                 0106 00226000
         MVC   IOBSENS0(1,IOBSTPTR),HDRSENS0(@01)                  0106 00227000
*               GOTO A3;            /* RETURN TO USER WITH NI        */ 00228000
         B     A3                                                  0107 00229000
*             END;                                                 0108 00230000
*           IF COMADR¬=ADDR(CCWEND)&COMADR¬=ADDR(ANTCPT)&/*  @ZA04468*/ 00231000
*               IMGEOF¬=ON&IMGPROC=ON THEN/* WRITE & IMAGE PROCESS 0109 00232000
*                                                            @ZA04477*/ 00233000
@RF00104 L     @01,IOBSTART(,IOBSTPTR)                             0109 00234000
         LA    @15,CCWEND(,@01)                                    0109 00235000
         L     @14,COMADR-1(,IOBSTPTR)                             0109 00236000
         LA    @14,0(,@14)                                         0109 00237000
         CR    @15,@14                                             0109 00238000
         BE    @RF00109                                            0109 00239000
         L     @01,IOBSTART(,IOBSTPTR)                             0109 00240000
         LA    @15,ANTCPT(,@01)                                    0109 00241000
         L     @14,COMADR-1(,IOBSTPTR)                             0109 00242000
         LA    @14,0(,@14)                                         0109 00243000
         CR    @15,@14                                             0109 00244000
         BE    @RF00109                                            0109 00245000
         TM    IMGPROC(DCBPTR),B'00000001'                         0109 00246000
         BNO   @RF00109                                            0109 00247000
         TM    IMGEOF(DCBPTR),B'10000000'                          0109 00248000
         BNZ   @RF00109                                            0109 00249000
*             DO;                   /* & NOT IMAGE FILE EOF  @ZA04477*/ 00250000
*               SAVE17=R6;          /* SAVE BASE REG                 */ 00251000
         ST    R6,SAVE17(,SAVR)                                    0111 00252000
*               SAVE18=IOBSTPTR;    /* SAVE IOB ADDR                 */ 00253000
         ST    IOBSTPTR,SAVE18(,SAVR)                              0112 00254000
*               GEN CODE;                                          0113 00255000
         LM    RETR,R8,20(SAVR)         RESTORE USERS REGS              00256000
         LR    RPARA0,RPARA1            PUT ADDR OF DCB IN REG 0        00257000
         L     ENTR,4(RPARA1)           CALL DCBIMG                     00258000
         BALR  RETR,ENTR                GO TO IMAGE TRN                 00259000
         L     WORK,28(,SAVR)           RESTORE WORK AREA REG           00260000
         L     DCBPTR,32(,SAVR)         RESTORE DCB PTR REG             00261000
*               IOBSTPTR=SAVE18;    /* RESTORE IOB PTR               */ 00262000
         L     IOBSTPTR,SAVE18(,SAVR)                              0114 00263000
*               R6=SAVE17;          /* RESTORE BASE REG              */ 00264000
         L     R6,SAVE17(,SAVR)                                    0115 00265000
*               RPARA1=DCBBLKSI;    /* SET UP FOR MVCL INSTRUCTIO    */ 00266000
         LH    RPARA1,DCBBLKSI+52(,DCBPTR)                         0116 00267000
*               RETR=ADDR(CCWEND);                                 0117 00268000
         L     RETR,IOBSTART(,IOBSTPTR)                            0117 00269000
         LA    RETR,CCWEND(,RETR)                                  0117 00270000
*               ENTR=DCBBLKSI;                                     0118 00271000
         LH    ENTR,DCBBLKSI+52(,DCBPTR)                           0118 00272000
*               GEN(MVCL  14,0);                                   0119 00273000
         MVCL  14,0                                                     00274000
*               IF COMADR=ADDR(WRITEND) THEN/* JUST A WRITE DONE     */ 00275000
         L     @01,IOBSTART(,IOBSTPTR)                             0120 00276000
         LA    @15,WRITEND(,@01)                                   0120 00277000
         L     @14,COMADR-1(,IOBSTPTR)                             0120 00278000
         LA    @14,0(,@14)                                         0120 00279000
         CR    @15,@14                                             0120 00280000
         BNE   @RF00120                                            0120 00281000
*                 MRWRITE='1'B;     /* YES,TURN WRITE FLAG ON        */ 00282000
         OI    MRWRITE(DCBPTR),B'10000000'                         0121 00283000
*             END;                                                 0122 00284000
@RF00120 DS    0H                                                  0123 00285000
*         END;                                                     0123 00286000
@RF00109 DS    0H                                                  0124 00287000
*     END;                                                         0124 00288000
@RC00074 DS    0H                                                  0125 00289000
*A3:                                                               0125 00290000
*   GEN CODE;                                                      0125 00291000
A3       DS    0H                                                  0125 00292000
*                                       /* RETURN TO CALLER          */ 00293000
         L     8,24(SAVR)                                               00294000
         LM    RETR,ENTR,12(SAVR)       RESTORE REGS 14 & 15            00295000
         BR    RETR                     RETURN ON REG 14                00296000
*   END IGG019UM                    /* RESTORE REGS & RETURN         */ 00297000
*                                                                  0126 00298000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00299000
*/*%INCLUDE SYSUT5  (IGG019UM)                                       */ 00300000
*/*%INCLUDE SYSUT5  (PROLG   )                                       */ 00301000
*/*%INCLUDE SYSUT5  (DCLARS  )                                       */ 00302000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00303000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00304000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                       */ 00305000
*/*%INCLUDE SYSUT5  (ERROR   )                                       */ 00306000
*/*%INCLUDE SYSUT5  (NOERR   )                                       */ 00307000
*                                                                  0126 00308000
*       ;                                                          0126 00309000
@EL00001 DS    0H                                                  0126 00310000
@EF00001 DS    0H                                                  0126 00311000
@ER00001 BR    @14                                                 0126 00312000
@DATA    DS    0H                                                       00313000
@SM00774 MVC   USDTA(0,WORK),ZERO                                       00314000
         DS    0F                                                       00315000
         DS    0F                                                       00316000
@CF00754 DC    XL4'0C'                                                  00317000
         DS    0D                                                       00318000
IOBPRPTR DS    A                                                        00319000
ZERO     DS    CL48                                                     00320000
         ORG   ZERO                                                     00321000
Z1       DC    48X'00'                                                  00322000
         ORG   ZERO+48                                                  00323000
CMPNOER  DC    X'7F'                                                    00324000
         DS    CL3                                                      00325000
NOPERM   DC    X'00000000'                                              00326000
UNITEX   DC    X'01'                                                    00327000
MTAREA   DS    CL50                                                     00328000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00329000
@01      EQU   01                                                       00330000
@02      EQU   02                                                       00331000
@03      EQU   03                                                       00332000
@04      EQU   04                                                       00333000
@05      EQU   05                                                       00334000
@06      EQU   06                                                       00335000
@07      EQU   07                                                       00336000
@08      EQU   08                                                       00337000
@09      EQU   09                                                       00338000
@10      EQU   10                                                       00339000
@11      EQU   11                                                       00340000
@12      EQU   12                                                       00341000
@13      EQU   13                                                       00342000
@14      EQU   14                                                       00343000
@15      EQU   15                                                       00344000
DCBPTR   EQU   @02                                                      00345000
IOBSTPTR EQU   @07                                                      00346000
RPARA0   EQU   @00                                                      00347000
RPARA1   EQU   @01                                                      00348000
IOBAR    EQU   @03                                                      00349000
WORK     EQU   @04                                                      00350000
RECLEN   EQU   @05                                                      00351000
R6       EQU   @06                                                      00352000
R8       EQU   @08                                                      00353000
R9       EQU   @09                                                      00354000
R10      EQU   @10                                                      00355000
R11      EQU   @11                                                      00356000
R12      EQU   @12                                                      00357000
SAVR     EQU   @13                                                      00358000
RETR     EQU   @14                                                      00359000
ENTR     EQU   @15                                                      00360000
IHADCB   EQU   0                                                        00361000
IHADCS07 EQU   0                                                        00362000
DCBWTOID EQU   IHADCS07                                                 00363000
IHADCS09 EQU   0                                                        00364000
DCBSSID  EQU   IHADCS09                                                 00365000
IHADCS10 EQU   0                                                        00366000
@NM00003 EQU   IHADCS10                                                 00367000
DCBQSMEX EQU   @NM00003                                                 00368000
DCBSSAD  EQU   IHADCS10+4                                               00369000
DCBIMG   EQU   DCBSSAD                                                  00370000
DCBIMAGE EQU   IHADCS10+8                                               00371000
DCBMRFG  EQU   DCBIMAGE                                                 00372000
DCBECBLT EQU   IHADCS10+12                                              00373000
DCBHDR   EQU   DCBECBLT                                                 00374000
DCBMRIND EQU   DCBHDR                                                   00375000
DCBMRFLG EQU   IHADCS10+16                                              00376000
IHADCS11 EQU   0                                                        00377000
DCBRELB  EQU   IHADCS11                                                 00378000
DCBREL   EQU   DCBRELB+1                                                00379000
DCBBUFCB EQU   IHADCS11+4                                               00380000
DCBDSORG EQU   IHADCS11+10                                              00381000
DCBDSRG1 EQU   DCBDSORG                                                 00382000
DCBDSRG2 EQU   DCBDSORG+1                                               00383000
DCBIOBAD EQU   IHADCS11+12                                              00384000
DCBODEB  EQU   DCBIOBAD                                                 00385000
DCBLNP   EQU   DCBODEB                                                  00386000
DCBQSLM  EQU   DCBLNP                                                   00387000
DCBIOBAA EQU   DCBODEB+1                                                00388000
IHADCS50 EQU   0                                                        00389000
DCBSVCXL EQU   IHADCS50                                                 00390000
DCBEODAD EQU   IHADCS50+4                                               00391000
DCBBFALN EQU   DCBEODAD                                                 00392000
DCBHIARC EQU   DCBBFALN                                                 00393000
DCBBFTEK EQU   DCBHIARC                                                 00394000
DCBBFT   EQU   DCBBFTEK                                                 00395000
DCBEXLST EQU   IHADCS50+8                                               00396000
DCBRECFM EQU   DCBEXLST                                                 00397000
DCBRECLA EQU   DCBRECFM                                                 00398000
IHADCS24 EQU   0                                                        00399000
DCBOFLGS EQU   IHADCS24+8                                               00400000
DCBOFLWR EQU   DCBOFLGS                                                 00401000
DCBIFLG  EQU   IHADCS24+9                                               00402000
DCBMACR  EQU   IHADCS24+10                                              00403000
DCBMACR1 EQU   DCBMACR                                                  00404000
DCBMRFE  EQU   DCBMACR1                                                 00405000
DCBMRGET EQU   DCBMRFE                                                  00406000
DCBMRAPG EQU   DCBMACR1                                                 00407000
DCBMRRD  EQU   DCBMRAPG                                                 00408000
DCBMRCI  EQU   DCBMACR1                                                 00409000
DCBMRMVG EQU   DCBMRCI                                                  00410000
DCBMRLCG EQU   DCBMACR1                                                 00411000
DCBMRABC EQU   DCBMACR1                                                 00412000
DCBMRPT1 EQU   DCBMRABC                                                 00413000
DCBMRSBG EQU   DCBMRPT1                                                 00414000
DCBMRCRL EQU   DCBMACR1                                                 00415000
DCBMRCHK EQU   DCBMRCRL                                                 00416000
DCBMRRDX EQU   DCBMRCHK                                                 00417000
DCBMRDMG EQU   DCBMACR1                                                 00418000
DCBMACR2 EQU   DCBMACR+1                                                00419000
DCBMRPUT EQU   DCBMACR2                                                 00420000
DCBMRWRT EQU   DCBMACR2                                                 00421000
DCBMRMVP EQU   DCBMACR2                                                 00422000
DCBMR5WD EQU   DCBMACR2                                                 00423000
DCBMRLDM EQU   DCBMR5WD                                                 00424000
DCBMRLCP EQU   DCBMRLDM                                                 00425000
DCBMR4WD EQU   DCBMACR2                                                 00426000
DCBMRPT2 EQU   DCBMR4WD                                                 00427000
DCBMRTMD EQU   DCBMRPT2                                                 00428000
DCBMR3WD EQU   DCBMACR2                                                 00429000
DCBMRCTL EQU   DCBMR3WD                                                 00430000
DCBMRSTK EQU   DCBMRCTL                                                 00431000
DCBMR1WD EQU   DCBMACR2                                                 00432000
DCBMRSWA EQU   DCBMR1WD                                                 00433000
DCBMRDMD EQU   DCBMRSWA                                                 00434000
IHADCS25 EQU   0                                                        00435000
DCBMACRF EQU   IHADCS25+2                                               00436000
DCBMACF1 EQU   DCBMACRF                                                 00437000
DCBMFFE  EQU   DCBMACF1                                                 00438000
DCBMFGET EQU   DCBMFFE                                                  00439000
DCBMFAPG EQU   DCBMACF1                                                 00440000
DCBMFRD  EQU   DCBMFAPG                                                 00441000
DCBMFCI  EQU   DCBMACF1                                                 00442000
DCBMFMVG EQU   DCBMFCI                                                  00443000
DCBMFLCG EQU   DCBMACF1                                                 00444000
DCBMFABC EQU   DCBMACF1                                                 00445000
DCBMFPT1 EQU   DCBMFABC                                                 00446000
DCBMFSBG EQU   DCBMFPT1                                                 00447000
DCBMFCRL EQU   DCBMACF1                                                 00448000
DCBMFCHK EQU   DCBMFCRL                                                 00449000
DCBMFDMG EQU   DCBMACF1                                                 00450000
DCBMACF2 EQU   DCBMACRF+1                                               00451000
DCBMFPUT EQU   DCBMACF2                                                 00452000
DCBMFWRT EQU   DCBMACF2                                                 00453000
DCBMFMVP EQU   DCBMACF2                                                 00454000
DCBMF5WD EQU   DCBMACF2                                                 00455000
DCBMFLDM EQU   DCBMF5WD                                                 00456000
DCBMFLCP EQU   DCBMFLDM                                                 00457000
DCBMF4WD EQU   DCBMACF2                                                 00458000
DCBMFPT2 EQU   DCBMF4WD                                                 00459000
DCBMFTMD EQU   DCBMFPT2                                                 00460000
DCBMF3WD EQU   DCBMACF2                                                 00461000
DCBMFCTL EQU   DCBMF3WD                                                 00462000
DCBMFSTK EQU   DCBMFCTL                                                 00463000
DCBMF1WD EQU   DCBMACF2                                                 00464000
DCBMFSWA EQU   DCBMF1WD                                                 00465000
DCBMFDMD EQU   DCBMFSWA                                                 00466000
DCBDEBAD EQU   IHADCS25+4                                               00467000
DCBIFLGS EQU   DCBDEBAD                                                 00468000
IHADCS26 EQU   0                                                        00469000
DCBWRITE EQU   IHADCS26                                                 00470000
DCBREAD  EQU   DCBWRITE                                                 00471000
DCBWRITA EQU   DCBREAD+1                                                00472000
IHADCS27 EQU   0                                                        00473000
DCBGET   EQU   IHADCS27                                                 00474000
DCBPUT   EQU   DCBGET                                                   00475000
DCBGETA  EQU   DCBPUT+1                                                 00476000
IHADCS36 EQU   0                                                        00477000
DCBGERR  EQU   IHADCS36                                                 00478000
DCBPERR  EQU   DCBGERR                                                  00479000
DCBCHECK EQU   DCBPERR                                                  00480000
DCBOPTCD EQU   DCBCHECK                                                 00481000
DCBOPTH  EQU   DCBOPTCD                                                 00482000
DCBOPTO  EQU   DCBOPTH                                                  00483000
DCBOPTZ  EQU   DCBOPTCD                                                 00484000
DCBGERRA EQU   DCBCHECK+1                                               00485000
DCBPERRA EQU   DCBGERRA                                                 00486000
DCBSYNAD EQU   IHADCS36+4                                               00487000
DCBCIND1 EQU   IHADCS36+8                                               00488000
DCBCIND2 EQU   IHADCS36+9                                               00489000
DCBBLKSI EQU   IHADCS36+10                                              00490000
DCBIOBA  EQU   IHADCS36+16                                              00491000
DCBCICB  EQU   DCBIOBA                                                  00492000
IHADCS52 EQU   0                                                        00493000
DCBDIRCT EQU   IHADCS52                                                 00494000
DCBQSWS  EQU   DCBDIRCT                                                 00495000
DCBUSASI EQU   DCBQSWS                                                  00496000
DCBQADFS EQU   DCBUSASI                                                 00497000
DCBBUFOF EQU   DCBDIRCT+1                                               00498000
IHADCS37 EQU   0                                                        00499000
DCBFLAG1 EQU   IHADCS37                                                 00500000
IHADCS38 EQU   0                                                        00501000
DCBEOBR  EQU   IHADCS38                                                 00502000
DCBLRECL EQU   IHADCS38+10                                              00503000
DCBPOINT EQU   IHADCS38+12                                              00504000
DCBCNTRL EQU   DCBPOINT                                                 00505000
IHADCS40 EQU   0                                                        00506000
DCBEOBAD EQU   IHADCS40                                                 00507000
DCBCCCW  EQU   IHADCS40+4                                               00508000
DCBRECAD EQU   DCBCCCW                                                  00509000
DCBRECBT EQU   DCBRECAD                                                 00510000
DCBRCREL EQU   DCBRECBT                                                 00511000
@NM00028 EQU   IHADCS40+12                                              00512000
DCBEROPT EQU   @NM00028                                                 00513000
IOBPREFX EQU   0                                                        00514000
IOBCFLG1 EQU   IOBPREFX                                                 00515000
IOBSTDRD EQU   0                                                        00516000
IOBFLAG1 EQU   IOBSTDRD                                                 00517000
IOBCYCCK EQU   IOBFLAG1                                                 00518000
IOBRSTRT EQU   IOBFLAG1                                                 00519000
IOBFLAG2 EQU   IOBSTDRD+1                                               00520000
IOBPURGE EQU   IOBFLAG2                                                 00521000
IOBRDHA0 EQU   IOBFLAG2                                                 00522000
IOBSENS0 EQU   IOBSTDRD+2                                               00523000
IOBS0B1  EQU   IOBSENS0                                                 00524000
IOBS0B6  EQU   IOBSENS0                                                 00525000
IOBS0B7  EQU   IOBSENS0                                                 00526000
IOBSENS1 EQU   IOBSTDRD+3                                               00527000
IOBECBPT EQU   IOBSTDRD+4                                               00528000
IOBFLAG3 EQU   IOBSTDRD+8                                               00529000
IOBFL3   EQU   IOBFLAG3                                                 00530000
IOBCSW   EQU   IOBSTDRD+9                                               00531000
IOBIOCSW EQU   IOBCSW                                                   00532000
IOBSTART EQU   IOBSTDRD+16                                              00533000
IOBDCBPT EQU   IOBSTDRD+20                                              00534000
IOBFLAG4 EQU   IOBDCBPT                                                 00535000
IOBRESTR EQU   IOBSTDRD+24                                              00536000
IOBINCAM EQU   IOBSTDRD+28                                              00537000
IOBBTAMF EQU   IOBINCAM                                                 00538000
ECB      EQU   0                                                        00539000
CMPCODE  EQU   ECB                                                      00540000
CCW      EQU   0                                                        00541000
USHDR    EQU   0                                                        00542000
HDRSENS0 EQU   USHDR                                                    00543000
NIBIT    EQU   HDRSENS0                                                 00544000
HDRSENS1 EQU   USHDR+1                                                  00545000
HDRTYP   EQU   USHDR+11                                                 00546000
SAVEAR   EQU   0                                                        00547000
SAVE17   EQU   SAVEAR+64                                                00548000
SAVE18   EQU   SAVEAR+68                                                00549000
USDTA    EQU   0                                                        00550000
IMGDATA  EQU   0                                                        00551000
SAVAR    EQU   0                                                        00552000
IOBORG01 EQU   IOBPREFX+8                                               00553000
IOBNIOBA EQU   IOBORG01                                                 00554000
IOBNFLG1 EQU   IOBNIOBA                                                 00555000
IOBORG02 EQU   IOBPREFX+8                                               00556000
IOBDQADA EQU   IOBORG02                                                 00557000
IOBDEQIN EQU   IOBDQADA                                                 00558000
IOBORG03 EQU   IOBPREFX+12                                              00559000
IOBORG04 EQU   IOBINCAM                                                 00560000
IOBORG12 EQU   IOBINCAM                                                 00561000
IOBFL4   EQU   IOBORG12                                                 00562000
IOBEXTEN EQU   IOBSTDRD+32                                              00563000
IOBSEEK  EQU   IOBEXTEN                                                 00564000
IOBBB    EQU   IOBSEEK+1                                                00565000
IOBCC    EQU   IOBSEEK+3                                                00566000
IOBHH    EQU   IOBSEEK+5                                                00567000
IOBORG05 EQU   IOBEXTEN                                                 00568000
IOBORG06 EQU   IOBEXTEN                                                 00569000
IOBNXTPT EQU   IOBORG06+4                                               00570000
IOBSTATA EQU   IOBNXTPT                                                 00571000
IOBORG07 EQU   IOBEXTEN+8                                               00572000
W1IEXTEN EQU   IOBORG07                                                 00573000
IOBORG08 EQU   IOBEXTEN+8                                               00574000
IOBINDCT EQU   IOBORG08+4                                               00575000
IOBUNSQR EQU   IOBORG08+5                                               00576000
IOBFCHAD EQU   IOBORG08+8                                               00577000
IOBORG09 EQU   IOBEXTEN+8                                               00578000
IOBDPLAD EQU   IOBORG09+4                                               00579000
IOBDTYPE EQU   IOBORG09+8                                               00580000
IOBDTYP2 EQU   IOBORG09+9                                               00581000
IOBDSTAT EQU   IOBORG09+10                                              00582000
IOBSTAT1 EQU   IOBDSTAT                                                 00583000
IOBORG10 EQU   IOBEXTEN+8                                               00584000
IOBSEEK2 EQU   IOBORG10                                                 00585000
IOBORG11 EQU   IOBEXTEN                                                 00586000
IOBERCT  EQU   IOBORG11                                                 00587000
IOBUCBXV EQU   IOBERCT                                                  00588000
IOBNAME  EQU   IOBORG11+4                                               00589000
IOBORG13 EQU   IOBEXTEN                                                 00590000
IOBSKADR EQU   IOBORG13                                                 00591000
CSW      EQU   IOBCSW                                                   00592000
COMADR   EQU   CSW                                                      00593000
CMDCHAIN EQU   CCW                                                      00594000
ANTCPT   EQU   CMDCHAIN+8                                               00595000
WRITEND  EQU   CMDCHAIN+72                                              00596000
CCWEND   EQU   CMDCHAIN+136                                             00597000
MRFLG    EQU   DCBMRFLG                                                 00598000
MRWRITE  EQU   MRFLG                                                    00599000
UXFLG    EQU   MRFLG                                                    00600000
IMGFLGS  EQU   MRFLG+3                                                  00601000
IMGEOF   EQU   IMGFLGS                                                  00602000
IMGPROC  EQU   IMGFLGS                                                  00603000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00604000
@NM00042 EQU   IMGFLGS                                                  00605000
@NM00041 EQU   MRFLG+1                                                  00606000
@NM00040 EQU   MRFLG                                                    00607000
@NM00034 EQU   CMDCHAIN+80                                              00608000
@NM00033 EQU   CMDCHAIN+16                                              00609000
@NM00032 EQU   CMDCHAIN                                                 00610000
CSWSTAT  EQU   CSW+3                                                    00611000
IOBSKSS  EQU   IOBSKADR+3                                               00612000
IOBSK0   EQU   IOBSKADR+2                                               00613000
IOBSKTT  EQU   IOBSKADR+1                                               00614000
IOBSKRV  EQU   IOBSKADR                                                 00615000
IOBCSWSV EQU   IOBORG11+17                                              00616000
IOBSENSV EQU   IOBORG11+16                                              00617000
IOBRCD   EQU   IOBORG11+12                                              00618000
IOBMDREC EQU   IOBORG11+8                                               00619000
IOBNAMEA EQU   IOBNAME+1                                                00620000
IOBNAMSZ EQU   IOBNAME                                                  00621000
IOBERCTA EQU   IOBERCT+1                                                00622000
IOBRTYPE EQU   IOBUCBXV                                                 00623000
IOBRDCHP EQU   IOBORG10+20                                              00624000
IOBNEXTA EQU   IOBORG10+16                                              00625000
IOBREADA EQU   IOBORG10+12                                              00626000
IOBBUFC  EQU   IOBORG10+8                                               00627000
IOBSK2R  EQU   IOBSEEK2+7                                               00628000
IOBSK2HH EQU   IOBSEEK2+5                                               00629000
IOBSK2CC EQU   IOBSEEK2+3                                               00630000
IOBSK2BB EQU   IOBSEEK2+1                                               00631000
IOBSK2M  EQU   IOBSEEK2                                                 00632000
IOBCHNPR EQU   IOBORG09+40                                              00633000
IOBDNCRF EQU   IOBORG09+32                                              00634000
IOBRSV35 EQU   IOBORG09+24                                              00635000
IOBDQPTR EQU   IOBORG09+20                                              00636000
IOBRSV34 EQU   IOBORG09+18                                              00637000
IOBDBYTN EQU   IOBORG09+16                                              00638000
IOBDCPND EQU   IOBORG09+12                                              00639000
IOBSTAT2 EQU   IOBDSTAT+1                                               00640000
IOBSIORT EQU   IOBSTAT1                                                 00641000
IOBADDVU EQU   IOBSTAT1                                                 00642000
IOBBUFF  EQU   IOBSTAT1                                                 00643000
IOBENQUE EQU   IOBSTAT1                                                 00644000
IOBPASS2 EQU   IOBSTAT1                                                 00645000
IOBSYNCH EQU   IOBSTAT1                                                 00646000
IOBNEWVL EQU   IOBSTAT1                                                 00647000
IOBABNRM EQU   IOBSTAT1                                                 00648000
IOBRELEX EQU   IOBDTYP2                                                 00649000
IOBADDTY EQU   IOBDTYP2                                                 00650000
IOBTYPE  EQU   IOBDTYP2                                                 00651000
IOBRQUST EQU   IOBDTYP2                                                 00652000
IOBSUFFX EQU   IOBDTYP2                                                 00653000
IOBSBLKL EQU   IOBDTYP2                                                 00654000
IOBSKEY  EQU   IOBDTYP2                                                 00655000
IOBRELBL EQU   IOBDTYPE                                                 00656000
IOBRDEXC EQU   IOBDTYPE                                                 00657000
IOBDYNBF EQU   IOBDTYPE                                                 00658000
IOBACTAD EQU   IOBDTYPE                                                 00659000
IOBFDBCK EQU   IOBDTYPE                                                 00660000
IOBEXTSC EQU   IOBDTYPE                                                 00661000
IOBOVFLO EQU   IOBDTYPE                                                 00662000
IOBVERFY EQU   IOBDTYPE                                                 00663000
IOBDPLB  EQU   IOBDPLAD+1                                               00664000
IOBDAYLI EQU   IOBDPLAD                                                 00665000
IOBDIOBS EQU   IOBORG09+2                                               00666000
IOBDBYTR EQU   IOBORG09                                                 00667000
IOBBCHAD EQU   IOBORG08+12                                              00668000
IOBFCHNB EQU   IOBFCHAD+1                                               00669000
IOBCOUNT EQU   IOBFCHAD                                                 00670000
IOBASYN  EQU   IOBORG08+7                                               00671000
IOBAPP   EQU   IOBORG08+6                                               00672000
IOBRSV32 EQU   IOBUNSQR                                                 00673000
IOBRSV31 EQU   IOBUNSQR                                                 00674000
IOBRSV30 EQU   IOBUNSQR                                                 00675000
IOBKNRWR EQU   IOBUNSQR                                                 00676000
IOBKNWR  EQU   IOBUNSQR                                                 00677000
IOBNTAV2 EQU   IOBUNSQR                                                 00678000
IOBNTAV1 EQU   IOBUNSQR                                                 00679000
IOBCPBSY EQU   IOBUNSQR                                                 00680000
IOBCHNNL EQU   IOBINDCT                                                 00681000
IOBRSV29 EQU   IOBINDCT                                                 00682000
IOBRSV28 EQU   IOBINDCT                                                 00683000
IOBRSV27 EQU   IOBINDCT                                                 00684000
IOBKEYAD EQU   IOBINDCT                                                 00685000
IOBOVPTR EQU   IOBINDCT                                                 00686000
IOBUNSCH EQU   IOBINDCT                                                 00687000
IOBDEQCP EQU   IOBINDCT                                                 00688000
IOBCCWAD EQU   IOBORG08                                                 00689000
W1OEXTEN EQU   W1IEXTEN                                                 00690000
IOBCCW   EQU   IOBORG06+8                                               00691000
IOBNXTPB EQU   IOBNXTPT+1                                               00692000
IOBRSV26 EQU   IOBSTATA                                                 00693000
IOBRSV25 EQU   IOBSTATA                                                 00694000
IOBRSV24 EQU   IOBSTATA                                                 00695000
IOBRSV23 EQU   IOBSTATA                                                 00696000
IOBRSV22 EQU   IOBSTATA                                                 00697000
IOBRSV21 EQU   IOBSTATA                                                 00698000
IOBRSV20 EQU   IOBSTATA                                                 00699000
IOBAVLFL EQU   IOBSTATA                                                 00700000
IOBRSV37 EQU   IOBORG06+1                                               00701000
IOBUCBXG EQU   IOBORG06                                                 00702000
IOBCPA   EQU   IOBORG05+32                                              00703000
IOBERINF EQU   IOBORG05+16                                              00704000
IOBERCCW EQU   IOBORG05+8                                               00705000
IOBSNDPT EQU   IOBORG05+7                                               00706000
IOBRCVPT EQU   IOBORG05+6                                               00707000
IOBWORK  EQU   IOBORG05+1                                               00708000
IOBUCBX  EQU   IOBORG05                                                 00709000
IOBR     EQU   IOBSEEK+7                                                00710000
IOBHH2   EQU   IOBHH+1                                                  00711000
IOBHH1   EQU   IOBHH                                                    00712000
IOBCC2   EQU   IOBCC+1                                                  00713000
IOBCC1   EQU   IOBCC                                                    00714000
IOBBB2   EQU   IOBBB+1                                                  00715000
IOBBB1   EQU   IOBBB                                                    00716000
IOBM     EQU   IOBSEEK                                                  00717000
IOBRSV46 EQU   IOBFL4                                                   00718000
IOBRSV47 EQU   IOBFL4                                                   00719000
IOBENT   EQU   IOBFL4                                                   00720000
IOBEQP   EQU   IOBFL4                                                   00721000
IOBBUS   EQU   IOBFL4                                                   00722000
IOBDCK   EQU   IOBFL4                                                   00723000
IOBREJ   EQU   IOBFL4                                                   00724000
IOBOVR   EQU   IOBFL4                                                   00725000
IOBCRILC EQU   IOBORG04+1                                               00726000
IOBCRDCC EQU   IOBORG04                                                 00727000
IOBGQECB EQU   IOBORG03                                                 00728000
IOBSWAP  EQU   IOBORG02+4                                               00729000
IOBDQADB EQU   IOBDQADA+1                                               00730000
IOBRSV13 EQU   IOBDEQIN                                                 00731000
IOBRSV12 EQU   IOBDEQIN                                                 00732000
IOBRSV11 EQU   IOBDEQIN                                                 00733000
IOBRSV10 EQU   IOBDEQIN                                                 00734000
IOBRSV09 EQU   IOBDEQIN                                                 00735000
IOBRSV08 EQU   IOBDEQIN                                                 00736000
IOBRSV07 EQU   IOBDEQIN                                                 00737000
IOBDEQ   EQU   IOBDEQIN                                                 00738000
IOBNECB  EQU   IOBORG01+4                                               00739000
IOBNIOBB EQU   IOBNIOBA+1                                               00740000
IOBFIRST EQU   IOBNFLG1                                                 00741000
IOBUPERR EQU   IOBNFLG1                                                 00742000
IOBSPAN  EQU   IOBNFLG1                                                 00743000
IOBBKSPC EQU   IOBNFLG1                                                 00744000
IOBUPDAT EQU   IOBNFLG1                                                 00745000
IOBREAD  EQU   IOBNFLG1                                                 00746000
IOBWRITE EQU   IOBNFLG1                                                 00747000
IOBPRTOV EQU   IOBNFLG1                                                 00748000
@NM00039 EQU   SAVEAR+36                                                00749000
SAVE9    EQU   SAVEAR+32                                                00750000
@NM00038 EQU   SAVEAR                                                   00751000
@NM00037 EQU   USHDR+2                                                  00752000
@NM00036 EQU   HDRSENS0                                                 00753000
@NM00035 EQU   HDRSENS0                                                 00754000
RQADDR   EQU   ECB+1                                                    00755000
IOBERRCT EQU   IOBSTDRD+30                                              00756000
IOBRSV19 EQU   IOBINCAM+1                                               00757000
IOBOLTST EQU   IOBBTAMF                                                 00758000
IOBRFTMG EQU   IOBBTAMF                                                 00759000
IOBRSV17 EQU   IOBBTAMF                                                 00760000
IOBRSV16 EQU   IOBBTAMF                                                 00761000
IOBRSV15 EQU   IOBBTAMF                                                 00762000
IOBRSV14 EQU   IOBBTAMF                                                 00763000
IOBINUSE EQU   IOBBTAMF                                                 00764000
IOBPRMER EQU   IOBBTAMF                                                 00765000
IOBRSTRB EQU   IOBRESTR+1                                               00766000
IOBREPOS EQU   IOBRESTR                                                 00767000
IOBDCBPB EQU   IOBDCBPT+1                                               00768000
IOBRSV44 EQU   IOBFLAG4                                                 00769000
IOBJES3I EQU   IOBFLAG4                                                 00770000
IOBRSV42 EQU   IOBFLAG4                                                 00771000
IOBRSV41 EQU   IOBFLAG4                                                 00772000
IOBRSV40 EQU   IOBFLAG4                                                 00773000
IOBPMERR EQU   IOBFLAG4                                                 00774000
IOBCC3WE EQU   IOBFLAG4                                                 00775000
IOBGDPOL EQU   IOBFLAG4                                                 00776000
IOBSTRTB EQU   IOBSTART+1                                               00777000
IOBSIOCC EQU   IOBSTART                                                 00778000
IOBSTBYT EQU   IOBIOCSW+3                                               00779000
IOBCMDA  EQU   IOBIOCSW                                                 00780000
IOBLOG   EQU   IOBFL3                                                   00781000
IOBICL   EQU   IOBFL3                                                   00782000
IOBMSG   EQU   IOBFL3                                                   00783000
IOBCNC   EQU   IOBFL3                                                   00784000
IOBACU   EQU   IOBFL3                                                   00785000
IOBCDC   EQU   IOBFL3                                                   00786000
IOBICC   EQU   IOBFL3                                                   00787000
IOBCCC   EQU   IOBFL3                                                   00788000
IOBECBPB EQU   IOBECBPT+1                                               00789000
IOBECBCC EQU   IOBECBPT                                                 00790000
IOBS1B7  EQU   IOBSENS1                                                 00791000
IOBS1B6  EQU   IOBSENS1                                                 00792000
IOBS1B5  EQU   IOBSENS1                                                 00793000
IOBS1B4  EQU   IOBSENS1                                                 00794000
IOBS1B3  EQU   IOBSENS1                                                 00795000
IOBS1B2  EQU   IOBSENS1                                                 00796000
IOBS1B1  EQU   IOBSENS1                                                 00797000
IOBS1B0  EQU   IOBSENS1                                                 00798000
IOBSNSC9 EQU   IOBS0B7                                                  00799000
IOBS0B5  EQU   IOBSENS0                                                 00800000
IOBS0B4  EQU   IOBSENS0                                                 00801000
IOBS0B3  EQU   IOBSENS0                                                 00802000
IOBS0B2  EQU   IOBSENS0                                                 00803000
IOBS0B0  EQU   IOBSENS0                                                 00804000
IOBPNCH  EQU   IOBFLAG2                                                 00805000
IOBSTATO EQU   IOBFLAG2                                                 00806000
IOBSKUPD EQU   IOBFLAG2                                                 00807000
IOBALTTR EQU   IOBFLAG2                                                 00808000
IOBRRT2  EQU   IOBRDHA0                                                 00809000
IOBRRT3  EQU   IOBPURGE                                                 00810000
IOBSENSE EQU   IOBFLAG2                                                 00811000
IOBHALT  EQU   IOBFLAG2                                                 00812000
IOBSPSVC EQU   IOBRSTRT                                                 00813000
IOBUNREL EQU   IOBFLAG1                                                 00814000
IOBIOERR EQU   IOBFLAG1                                                 00815000
IOBFCREX EQU   IOBCYCCK                                                 00816000
IOBRPSTN EQU   IOBFLAG1                                                 00817000
IOBERRTN EQU   IOBFLAG1                                                 00818000
IOBCMDCH EQU   IOBFLAG1                                                 00819000
IOBDATCH EQU   IOBFLAG1                                                 00820000
IOBCNOPA EQU   IOBPREFX+12                                              00821000
IOBCICB  EQU   IOBPREFX+8                                               00822000
IOBCECB  EQU   IOBPREFX+4                                               00823000
IOBCONOP EQU   IOBPREFX+3                                               00824000
IOBCINOP EQU   IOBPREFX+2                                               00825000
IOBRSV05 EQU   IOBPREFX+1                                               00826000
IOBPCI   EQU   IOBCFLG1                                                 00827000
IOBRSTCH EQU   IOBCFLG1                                                 00828000
IOBABAPP EQU   IOBCFLG1                                                 00829000
IOBPTST  EQU   IOBCFLG1                                                 00830000
IOBRSV04 EQU   IOBCFLG1                                                 00831000
IOBRSV03 EQU   IOBCFLG1                                                 00832000
IOBRSV02 EQU   IOBCFLG1                                                 00833000
IOBRSV01 EQU   IOBCFLG1                                                 00834000
DCBEOB   EQU   IHADCS40+20                                              00835000
DCBPRECL EQU   IHADCS40+18                                              00836000
@NM00031 EQU   IHADCS40+16                                              00837000
@NM00030 EQU   @NM00028+1                                               00838000
@NM00029 EQU   DCBEROPT                                                 00839000
DCBERABE EQU   DCBEROPT                                                 00840000
DCBERSKP EQU   DCBEROPT                                                 00841000
DCBERACC EQU   DCBEROPT                                                 00842000
@NM00027 EQU   IHADCS40+10                                              00843000
@NM00026 EQU   IHADCS40+9                                               00844000
@NM00025 EQU   IHADCS40+8                                               00845000
DCBRECA  EQU   DCBRECAD+1                                               00846000
@NM00024 EQU   DCBRECBT                                                 00847000
DCBRCFGT EQU   DCBRCREL                                                 00848000
DCBRCTRU EQU   DCBRCREL                                                 00849000
DCBLCCW  EQU   DCBEOBAD                                                 00850000
DCBNOTE  EQU   DCBCNTRL                                                 00851000
@NM00023 EQU   IHADCS38+8                                               00852000
DCBEOBW  EQU   IHADCS38+4                                               00853000
DCBEOBRA EQU   DCBEOBR+1                                                00854000
DCBNCP   EQU   DCBEOBR                                                  00855000
@NM00022 EQU   DCBFLAG1                                                 00856000
DCBSTFLS EQU   DCBFLAG1                                                 00857000
DCBSTQCK EQU   DCBFLAG1                                                 00858000
DCBDIRCQ EQU   DCBBUFOF                                                 00859000
DCBQSTRU EQU   DCBUSASI                                                 00860000
@NM00021 EQU   DCBUSASI                                                 00861000
DCBQADF3 EQU   DCBQADFS                                                 00862000
DCBQADF2 EQU   DCBQADFS                                                 00863000
DCBQADF1 EQU   DCBQADFS                                                 00864000
DCBBLBP  EQU   DCBUSASI                                                 00865000
@NM00020 EQU   DCBUSASI                                                 00866000
DCBCICBA EQU   DCBCICB+1                                                00867000
@NM00019 EQU   DCBCICB                                                  00868000
DCBOFFSW EQU   IHADCS36+15                                              00869000
DCBOFFSR EQU   IHADCS36+14                                              00870000
DCBWCPL  EQU   IHADCS36+13                                              00871000
DCBWCPO  EQU   IHADCS36+12                                              00872000
DCBCNQSM EQU   DCBCIND2                                                 00873000
DCBCNFEO EQU   DCBCIND2                                                 00874000
DCBCNCHS EQU   DCBCIND2                                                 00875000
DCBCNBFP EQU   DCBCIND2                                                 00876000
DCBCNIOE EQU   DCBCIND2                                                 00877000
DCBCNCLO EQU   DCBCIND2                                                 00878000
DCBCNWRO EQU   DCBCIND2                                                 00879000
DCBCNSTO EQU   DCBCIND2                                                 00880000
DCBCNEXB EQU   DCBCIND1                                                 00881000
@NM00018 EQU   DCBCIND1                                                 00882000
DCBCNBRM EQU   DCBCIND1                                                 00883000
@NM00017 EQU   DCBCIND1                                                 00884000
DCBCNEVA EQU   DCBCIND1                                                 00885000
DCBCNEVB EQU   DCBCIND1                                                 00886000
DCBCNSRD EQU   DCBCIND1                                                 00887000
DCBCNTOV EQU   DCBCIND1                                                 00888000
DCBSYNA  EQU   DCBSYNAD+1                                               00889000
DCBIOBL  EQU   DCBSYNAD                                                 00890000
DCBCHCKA EQU   DCBPERRA                                                 00891000
@NM00016 EQU   DCBOPTCD                                                 00892000
DCBOPTT  EQU   DCBOPTCD                                                 00893000
DCBSRCHD EQU   DCBOPTZ                                                  00894000
DCBOPTQ  EQU   DCBOPTCD                                                 00895000
DCBBCKPT EQU   DCBOPTO                                                  00896000
DCBOPTC  EQU   DCBOPTCD                                                 00897000
DCBOPTU  EQU   DCBOPTCD                                                 00898000
DCBOPTW  EQU   DCBOPTCD                                                 00899000
DCBPUTA  EQU   DCBGETA                                                  00900000
@NM00015 EQU   DCBPUT                                                   00901000
DCBREADA EQU   DCBWRITA                                                 00902000
@NM00014 EQU   DCBREAD                                                  00903000
DCBDEBA  EQU   DCBDEBAD+1                                               00904000
@NM00013 EQU   DCBIFLGS                                                 00905000
DCBIFIOE EQU   DCBIFLGS                                                 00906000
DCBIFPCT EQU   DCBIFLGS                                                 00907000
DCBIFEC  EQU   DCBIFLGS                                                 00908000
DCBMFSTI EQU   DCBMFDMD                                                 00909000
DCBMFAWR EQU   DCBMFSTK                                                 00910000
DCBMFUIP EQU   DCBMFTMD                                                 00911000
DCBMFIDW EQU   DCBMFLCP                                                 00912000
DCBMFWRK EQU   DCBMFMVP                                                 00913000
DCBMFRDQ EQU   DCBMFWRT                                                 00914000
DCBMFGTQ EQU   DCBMFPUT                                                 00915000
DCBMFSTL EQU   DCBMACF2                                                 00916000
DCBMFCK  EQU   DCBMFDMG                                                 00917000
DCBMFRDX EQU   DCBMFCHK                                                 00918000
DCBMFDBF EQU   DCBMFSBG                                                 00919000
DCBMFRDI EQU   DCBMFLCG                                                 00920000
DCBMFRDK EQU   DCBMFMVG                                                 00921000
DCBMFWRQ EQU   DCBMFRD                                                  00922000
DCBMFPTQ EQU   DCBMFGET                                                 00923000
DCBMFECP EQU   DCBMACF1                                                 00924000
DCBTIOT  EQU   IHADCS25                                                 00925000
DCBMRSTI EQU   DCBMRDMD                                                 00926000
DCBMRAWR EQU   DCBMRSTK                                                 00927000
DCBMRUIP EQU   DCBMRTMD                                                 00928000
DCBMRIDW EQU   DCBMRLCP                                                 00929000
DCBMRWRK EQU   DCBMRMVP                                                 00930000
DCBMRRDQ EQU   DCBMRWRT                                                 00931000
DCBMRGTQ EQU   DCBMRPUT                                                 00932000
DCBMRSTL EQU   DCBMACR2                                                 00933000
DCBMRCK  EQU   DCBMRDMG                                                 00934000
DCBPGFXA EQU   DCBMRRDX                                                 00935000
DCBMRDBF EQU   DCBMRSBG                                                 00936000
DCBMRRDI EQU   DCBMRLCG                                                 00937000
DCBMRRDK EQU   DCBMRMVG                                                 00938000
DCBMRWRQ EQU   DCBMRRD                                                  00939000
DCBMRPTQ EQU   DCBMRGET                                                 00940000
DCBMRECP EQU   DCBMACR1                                                 00941000
@NM00012 EQU   DCBIFLG                                                  00942000
DCBIBIOE EQU   DCBIFLG                                                  00943000
DCBIBPCT EQU   DCBIFLG                                                  00944000
DCBIBEC  EQU   DCBIFLG                                                  00945000
DCBOFIOF EQU   DCBOFLGS                                                 00946000
DCBOFUEX EQU   DCBOFLGS                                                 00947000
DCBOFTM  EQU   DCBOFLGS                                                 00948000
DCBOFPPC EQU   DCBOFLGS                                                 00949000
DCBOFOPN EQU   DCBOFLGS                                                 00950000
DCBOFEOV EQU   DCBOFLGS                                                 00951000
DCBOFLRB EQU   DCBOFLGS                                                 00952000
DCBOFIOD EQU   DCBOFLWR                                                 00953000
DCBDDNAM EQU   IHADCS24                                                 00954000
DCBEXLSA EQU   DCBEXLST+1                                               00955000
DCBRECKL EQU   DCBRECFM                                                 00956000
DCBRECCC EQU   DCBRECFM                                                 00957000
DCBRECSB EQU   DCBRECFM                                                 00958000
DCBRECBR EQU   DCBRECFM                                                 00959000
DCBRECTO EQU   DCBRECLA                                                 00960000
DCBRECL  EQU   DCBRECLA                                                 00961000
DCBEODA  EQU   DCBEODAD+1                                               00962000
DCBBFA   EQU   DCBBFTEK                                                 00963000
DCBH0    EQU   DCBBFTEK                                                 00964000
DCBBFTKD EQU   DCBBFTEK                                                 00965000
DCBBFTE  EQU   DCBBFT                                                   00966000
DCBBFTKR EQU   DCBBFT                                                   00967000
DCBBFTS  EQU   DCBBFT                                                   00968000
DCBH1    EQU   DCBBFTEK                                                 00969000
DCBSVCXA EQU   DCBSVCXL+1                                               00970000
@NM00011 EQU   DCBSVCXL                                                 00971000
DCBODEBA EQU   DCBIOBAA                                                 00972000
@NM00010 EQU   DCBQSLM                                                  00973000
DCBUPDBT EQU   DCBQSLM                                                  00974000
DCBUPDCM EQU   DCBQSLM                                                  00975000
DCB1DVDS EQU   DCBQSLM                                                  00976000
@NM00009 EQU   DCBDSRG2                                                 00977000
DCBDSGTR EQU   DCBDSRG2                                                 00978000
DCBACBM  EQU   DCBDSRG2                                                 00979000
@NM00008 EQU   DCBDSRG2                                                 00980000
DCBDSGTQ EQU   DCBDSRG2                                                 00981000
DCBDSGTX EQU   DCBDSRG2                                                 00982000
DCBDSGGS EQU   DCBDSRG2                                                 00983000
DCBDSGU  EQU   DCBDSRG1                                                 00984000
DCBDSGPO EQU   DCBDSRG1                                                 00985000
DCBDSGMQ EQU   DCBDSRG1                                                 00986000
DCBDSGCQ EQU   DCBDSRG1                                                 00987000
DCBDSGCX EQU   DCBDSRG1                                                 00988000
DCBDSGDA EQU   DCBDSRG1                                                 00989000
DCBDSGPS EQU   DCBDSRG1                                                 00990000
DCBDSGIS EQU   DCBDSRG1                                                 00991000
DCBBUFL  EQU   IHADCS11+8                                               00992000
DCBBUFCA EQU   DCBBUFCB+1                                               00993000
DCBBUFNO EQU   DCBBUFCB                                                 00994000
DCBDEVT  EQU   DCBREL                                                   00995000
DCBKEYLE EQU   DCBRELB                                                  00996000
@NM00007 EQU   IHADCS10+19                                              00997000
DCBAPPIN EQU   IHADCS10+18                                              00998000
@NM00006 EQU   IHADCS10+17                                              00999000
DCBMRUE  EQU   DCBMRFLG                                                 01000000
DCBMRDWT EQU   DCBMRFLG                                                 01001000
DCBMRPCC EQU   DCBMRFLG                                                 01002000
DCBMRDR  EQU   DCBMRFLG                                                 01003000
DCBMRDRU EQU   DCBMRFLG                                                 01004000
DCBMRDBG EQU   DCBMRFLG                                                 01005000
DCBMRSCC EQU   DCBMRFLG                                                 01006000
DCBECBLA EQU   DCBHDR+1                                                 01007000
DCBMRERS EQU   DCBMRIND                                                 01008000
DCBMRERP EQU   DCBMRIND                                                 01009000
DCBMRPLS EQU   DCBMRIND                                                 01010000
DCBMRPLO EQU   DCBMRIND                                                 01011000
DCBMRSCU EQU   DCBMRIND                                                 01012000
DCBMRDCT EQU   DCBMRIND                                                 01013000
DCBIMAGA EQU   DCBIMAGE+1                                               01014000
@NM00005 EQU   DCBMRFG                                                  01015000
DCBMRBCT EQU   DCBMRFG                                                  01016000
DCBSSADA EQU   DCBIMG+1                                                 01017000
@NM00004 EQU   DCBIMG                                                   01018000
DCBWTOIA EQU   DCBWTOID+1                                               01019000
@NM00002 EQU   DCBWTOID                                                 01020000
@NM00001 EQU   IHADCB                                                   01021000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      01022000
@RF00088 EQU   @RC00074                                                 01023000
@RF00099 EQU   @RC00074                                                 01024000
@ENDDATA EQU   *                                                        01025000
         END   IGG019UM,(C'PLS1239',0603,76005)                         01026000
./  ADD  SSI=61410174,NAME=IGG019UN
         TITLE 'IGG019UN, SENECA GET MODULE                            *00001000
                        '                                               00002000
*********************************************************************** 00003000
*   ESTABLISH ADDRESSIBILITY, DETERMINE IF RELEASE, SAVE USERS REGS   * 00004000
*********************************************************************** 00005000
IGG019UN CSECT                                                          00006000
         USING IGG019UN,ENTRYR                                          00007000
         USING IHADCB,RPARA1                                            00008000
         B     START-REL+8(,ENTRYR)     BRANCH TO GET                   00009000
         DS    F                       PROVIDE ALIGNMENT                00010000
REL      EQU   *                       RELEASE SPECIFIED                00011000
         LR    DCBPTR,RPARA1                                            00012000
         MVC   76(4,DCBPTR),72(DCBPTR)  SET END OF BLOCK CONDITION      00013000
         OC    68(1,DCBPTR),RELEASE     SET RELEASE INDICATOR ON        00014000
START    EQU   *                       GET FUNCTION SPECIFIED           00015000
         STM   RETR,BASR,20(SAVR)       SAVE USERS REGS                 00016000
         DROP  ENTRYR                                                   00017000
         DROP  RPARA1                                                   00018000
         USING IGG019UN,BASR                                            00019000
         LR    BASR,ENTRYR              SET UP BASE ADDR                00020000
         LR    DCBPTR,RPARA1                                            00021000
         LR    WORK,RPARA0                                              00022000
*A1:                                                               0027 00023000
*   IF RELSW¬=RELEASE THEN          /* WAS RELEASE SPECIFIED         */ 00024000
A1       CLC   RELSW+52(1,DCBPTR),RELEASE                          0027 00025000
         BE    @RF00027                                            0027 00026000
*     DO;                           /* NO, GET NEXT RECORD           */ 00027000
*       IF RECTYP=UNITCK|RECTYP=UNITEX|RECTYP=UNITCKEX THEN/*      0029 00028000
*                                                            @YM00645*/ 00029000
         L     @05,DCBHDR(,DCBPTR)                                 0029 00030000
         CLI   RECTYP(@05),X'02'                                   0029 00031000
         BE    @RT00029                                            0029 00032000
         L     @05,DCBHDR(,DCBPTR)                                 0029 00033000
         CLI   RECTYP(@05),X'01'                                   0029 00034000
         BE    @RT00029                                            0029 00035000
         L     @05,DCBHDR(,DCBPTR)                                 0029 00036000
         CLI   RECTYP(@05),X'03'                                   0029 00037000
         BNE   @RF00029                                            0029 00038000
@RT00029 DS    0H                                                  0030 00039000
*         DO;                       /*                       @YM00645*/ 00040000
*           IOBPTR=DCBIOBA;         /* PTR TO IOB FOR EOB            */ 00041000
         L     IOBPTR,DCBIOBA+52(,DCBPTR)                          0031 00042000
*           RFY                                                    0032 00043000
*            (BASR,                                                0032 00044000
*             SAVR,                                                0032 00045000
*             ENTRYR) RSTD;         /*                       @ZA04481*/ 00046000
*           IF(RECTYP=UNITEX|RECTYP=UNITCKEX)&/* SCI PAUS,   @ZA04468*/ 00047000
*               IMGPROC=ON THEN     /* IMAGE PROCESSING      @ZA04481*/ 00048000
         L     @14,DCBHDR(,DCBPTR)                                 0033 00049000
         CLI   RECTYP(@14),X'01'                                   0033 00050000
         BE    @GL00003                                            0033 00051000
         L     @14,DCBHDR(,DCBPTR)                                 0033 00052000
         CLI   RECTYP(@14),X'03'                                   0033 00053000
         BNE   @RF00033                                            0033 00054000
@GL00003 TM    IMGPROC(DCBPTR),B'00000001'                         0033 00055000
         BNO   @RF00033                                            0033 00056000
*             DO;                   /*                       @ZA04481*/ 00057000
*               SAVE17=BASR;        /* SAVE BASE REGISTER    @ZA04468*/ 00058000
         ST    BASR,SAVE17(,SAVR)                                  0035 00059000
*               SAVE18=IOBPTR;      /* SAVE IOB POINTER      @ZA04468*/ 00060000
         ST    IOBPTR,SAVE18(,SAVR)                                0036 00061000
*               GEN CODE;                                          0037 00062000
*                                                          /*@ZA04468   00063000
         LM    RETR,BASR,20(SAVR) RESTORE USER'S REGS          @ZA04468 00064000
         LR    RPARA0,RPARA1      ADDR OF DCB IN REG 0         @ZA04468 00065000
         L     ENTRYR,4(,RPARA1)  GET ADDR OF IMAGE ROUTINE    @ZA04468 00066000
         BALR  RETR,ENTRYR        LINK TO IMAGE ROUTINE        @ZA04468 00067000
         L     WORK,28(,SAVR)     RESTORE WORK AREA REGISTER   @ZA04468 00068000
         L     DCBPTR,32(,SAVR)   RESTORE DCB POINTER          @ZA04468 00069000
*               RFY                                                0038 00070000
*                 RPARA1 RSTD;      /*                       @ZA04481*/ 00071000
*               IOBPTR=SAVE18;      /* RESTORE IOB ADDRESS   @ZA04468*/ 00072000
         L     IOBPTR,SAVE18(,SAVR)                                0039 00073000
*               BASR=SAVE17;        /* RESTORE BASE REGISTER @ZA04468*/ 00074000
         L     BASR,SAVE17(,SAVR)                                  0040 00075000
*               RPARA1=DCBBLKSI;    /* LOAD BLOCK SIZE       @ZA04468*/ 00076000
         LH    RPARA1,DCBBLKSI+52(,DCBPTR)                         0041 00077000
*               GEN CODE;                                          0042 00078000
*                                                          /*@ZA04468   00079000
         LA    IOBSTPTR,8(,IOBPTR) POINT TO IOB STANDARD       @ZA04468 00080000
         L     RETR,16(,IOBSTPTR)  POINT TO START OF CCW CHAIN @ZA04468 00081000
         LA    RETR,136(,RETR)     POINT TO END OF CCW CHAIN   @ZA04468 00082000
*               ENTRYR=DCBBLKSI;    /* LOAD BLOCK SIZE       @ZA04468*/ 00083000
         LH    ENTRYR,DCBBLKSI+52(,DCBPTR)                         0043 00084000
*               GEN(MVCL  14,0);    /* MOVE IMAGES TO BUFFER @ZA04468*/ 00085000
         MVCL  14,0                                                     00086000
*               RFY                                                0045 00087000
*                (BASR,                                            0045 00088000
*                 SAVR,                                            0045 00089000
*                 ENTRYR,                                          0045 00090000
*                 RPARA1) UNRSTD;   /*                       @ZA04481*/ 00091000
*             END;                  /*                       @ZA04468*/ 00092000
*           CALL EOBMOD;            /* GO TO EOB ROUTINE     @YM00645*/ 00093000
@RF00033 L     @15,EOBMOD+72(,DCBPTR)                              0047 00094000
         BALR  @14,@15                                             0047 00095000
*         END;                      /*                       @YM00645*/ 00096000
*NXTREC:                                                           0049 00097000
*       IF DCBRECAD=DCBEOBAD THEN   /* Q - END OF BLOCK              */ 00098000
@RF00029 DS    0H                                                  0049 00099000
NXTREC   CLC   DCBRECAD+72(4,DCBPTR),DCBEOBAD+72(DCBPTR)           0049 00100000
         BNE   @RF00049                                            0049 00101000
*         DO;                       /* YES,EOB                       */ 00102000
*SYNCH:                                                            0051 00103000
*           CALL SYNCMOD;           /* GO TO SYNCHRONIZING TRN       */ 00104000
SYNCH    L     @15,SYNCMOD+52(,DCBPTR)                             0051 00105000
         BALR  @14,@15                                             0051 00106000
*           IF RECTYP¬=UNITCK&RECTYP¬=UNITEX&RECTYP¬=UNITCKEX/* NOT     00107000
*                                      DM RECORD             @YM00623*/ 00108000
*             THEN                                                 0052 00109000
         L     @05,DCBHDR(,DCBPTR)                                 0052 00110000
         CLI   RECTYP(@05),X'02'                                   0052 00111000
         BE    @RF00052                                            0052 00112000
         L     @05,DCBHDR(,DCBPTR)                                 0052 00113000
         CLI   RECTYP(@05),X'01'                                   0052 00114000
         BE    @RF00052                                            0052 00115000
         L     @05,DCBHDR(,DCBPTR)                                 0052 00116000
         CLI   RECTYP(@05),X'03'                                   0052 00117000
         BE    @RF00052                                            0052 00118000
*             DO;                   /*                       @YM00623*/ 00119000
*               IF MRWRITE=OFF THEN /* MULTIPLE WRITE        @ZA04481*/ 00120000
         TM    MRWRITE(DCBPTR),B'10000000'                         0054 00121000
         BNZ   @RF00054                                            0054 00122000
*                 DO;               /* NO                            */ 00123000
*                   DCBRECAD=CCWADR;/* SET REC ADR TO NEW BUFFER     */ 00124000
         SLR   @05,@05                                             0056 00125000
         IC    @05,DCBOFFSR+52(,DCBPTR)                            0056 00126000
         AL    @05,DCBIOBA+52(,DCBPTR)                             0056 00127000
         L     @05,CCWADR-1(,@05)                                  0056 00128000
         LA    @05,0(,@05)                                         0056 00129000
         ST    @05,DCBRECAD+72(,DCBPTR)                            0056 00130000
*                   DCBEOBAD=CCWADR+DCBBLKSI;/* NEW EOB ADDR         */ 00131000
         SLR   @05,@05                                             0057 00132000
         IC    @05,DCBOFFSR+52(,DCBPTR)                            0057 00133000
         AL    @05,DCBIOBA+52(,DCBPTR)                             0057 00134000
         L     @05,CCWADR-1(,@05)                                  0057 00135000
         LA    @05,0(,@05)                                         0057 00136000
         AH    @05,DCBBLKSI+52(,DCBPTR)                            0057 00137000
         ST    @05,DCBEOBAD+72(,DCBPTR)                            0057 00138000
*                   RFY                                            0058 00139000
*                     RECLEN RSTD;  /*                       @ZA04481*/ 00140000
*                   USHDR=GETHDR;   /* MOVE HEADER TO USER'S AREA    */ 00141000
         L     @01,DCBHDR(,DCBPTR)                                 0059 00142000
         LH    @15,DCBLRECL+72(,DCBPTR)                            0059 00143000
         AL    @15,DCBRECAD+72(,DCBPTR)                            0059 00144000
         AL    @15,@CF00472                                        0059 00145000
         MVC   USHDR(12,@01),GETHDR(@15)                           0059 00146000
*                   RECLEN=DCBLRECL-TWELVE;/* LENGTH OF DATA RECORD     00147000
*                                      MOVE DATA TO USER'S AREA      */ 00148000
         LH    RECLEN,DCBLRECL+72(,DCBPTR)                         0060 00149000
         SL    RECLEN,@CF00453                                     0060 00150000
*                   USDTA(1:RECLEN)=GETDTA(1:RECLEN);              0061 00151000
         LR    @15,RECLEN                                          0061 00152000
         BCTR  @15,0                                               0061 00153000
         L     @01,DCBRECAD+72(,DCBPTR)                            0061 00154000
         EX    @15,@SM00473                                        0061 00155000
*                   RFY                                            0062 00156000
*                     RECLEN UNRSTD;/*                       @ZA04481*/ 00157000
*                   DCBRECAD=DCBRECAD+DCBLRECL;/* NEXT REC ADDR IS 0063 00158000
*                                      NEXT RECORD ZERO'S            */ 00159000
         LH    @05,DCBLRECL+72(,DCBPTR)                            0063 00160000
         AL    @05,DCBRECAD+72(,DCBPTR)                            0063 00161000
         ST    @05,DCBRECAD+72(,DCBPTR)                            0063 00162000
*                   IF DCBRECAD=DCBEOBAD THEN/* END OF BLOCK @YM00645*/ 00163000
         CLC   DCBRECAD+72(4,DCBPTR),DCBEOBAD+72(DCBPTR)           0064 00164000
         BE    @RT00064                                            0064 00165000
*                     GO TO A2;     /* YES                   @YM00645*/ 00166000
*                   ELSE            /*                       @YM00645*/ 00167000
*                     IF GETDTA(1:DCBLRECL)=ZERO(1:DCBLRECL) THEN  0066 00168000
         L     @05,DCBRECAD+72(,DCBPTR)                            0066 00169000
         LH    @15,DCBLRECL+72(,DCBPTR)                            0066 00170000
         BCTR  @15,0                                               0066 00171000
         EX    @15,@SC00475                                        0066 00172000
         BNE   @RF00066                                            0066 00173000
*                       DCBRECAD=DCBEOBAD;/* YES,SET END OF BLOCK    */ 00174000
         L     @05,DCBEOBAD+72(,DCBPTR)                            0067 00175000
         ST    @05,DCBRECAD+72(,DCBPTR)                            0067 00176000
*                 END;                                             0068 00177000
*             END;                                                 0069 00178000
*         END;                                                     0070 00179000
*       ELSE                                                       0071 00180000
*         DO;                       /* NOT EOB                       */ 00181000
         B     @RC00049                                            0071 00182000
@RF00049 DS    0H                                                  0072 00183000
*           RFY                                                    0072 00184000
*             RECLEN RSTD;          /*                       @ZA04481*/ 00185000
*           USHDR=GETHDR;           /* MOVE HEADER TO USER'S AREA    */ 00186000
         L     @01,DCBHDR(,DCBPTR)                                 0073 00187000
         LH    @15,DCBLRECL+72(,DCBPTR)                            0073 00188000
         AL    @15,DCBRECAD+72(,DCBPTR)                            0073 00189000
         AL    @15,@CF00472                                        0073 00190000
         MVC   USHDR(12,@01),GETHDR(@15)                           0073 00191000
*           RECLEN=DCBLRECL-TWELVE; /* LENGTH OF DATA RECORD MOVE  0074 00192000
*                                      DATA TO USER'S AREA           */ 00193000
         LH    RECLEN,DCBLRECL+72(,DCBPTR)                         0074 00194000
         SL    RECLEN,@CF00453                                     0074 00195000
*           USDTA(1:RECLEN)=GETDTA(1:RECLEN);                      0075 00196000
         LR    @15,RECLEN                                          0075 00197000
         BCTR  @15,0                                               0075 00198000
         L     @01,DCBRECAD+72(,DCBPTR)                            0075 00199000
         EX    @15,@SM00473                                        0075 00200000
*           RFY                                                    0076 00201000
*             RECLEN UNRSTD;        /*                       @ZA04481*/ 00202000
*           DCBRECAD=DCBRECAD+DCBLRECL;/* NEXT REC ADDR IS NEXT    0077 00203000
*                                      RECORD ZERO'S                 */ 00204000
         LH    @05,DCBLRECL+72(,DCBPTR)                            0077 00205000
         AL    @05,DCBRECAD+72(,DCBPTR)                            0077 00206000
         ST    @05,DCBRECAD+72(,DCBPTR)                            0077 00207000
*           IF DCBRECAD=DCBEOBAD THEN/* END OF BLOCK         @YM00645*/ 00208000
         CLC   DCBRECAD+72(4,DCBPTR),DCBEOBAD+72(DCBPTR)           0078 00209000
         BE    @RT00078                                            0078 00210000
*             GO TO A2;             /* YES                   @YM00645*/ 00211000
*           ELSE                    /*                       @YM00645*/ 00212000
*             IF GETDTA(1:DCBLRECL)=ZERO(1:DCBLRECL) THEN          0080 00213000
         L     @05,DCBRECAD+72(,DCBPTR)                            0080 00214000
         LH    @15,DCBLRECL+72(,DCBPTR)                            0080 00215000
         BCTR  @15,0                                               0080 00216000
         EX    @15,@SC00475                                        0080 00217000
         BNE   @RF00080                                            0080 00218000
*               DCBRECAD=DCBEOBAD;  /* YES,SET END OF BLOCK          */ 00219000
         L     @05,DCBEOBAD+72(,DCBPTR)                            0081 00220000
         ST    @05,DCBRECAD+72(,DCBPTR)                            0081 00221000
*         END;                                                     0082 00222000
*     END;                                                         0083 00223000
*   ELSE                            /* YES, SET OFF RELEASE          */ 00224000
*     RELSW=RLSOFF;                 /* SET RELEASE OFF       @ZA04481*/ 00225000
         B     @RC00027                                            0084 00226000
@RF00027 MVI   RELSW+52(DCBPTR),B'00000000'                        0084 00227000
*A2:                                                               0085 00228000
*   IF DCBRECAD=DCBEOBAD THEN       /* END OF BLOCK                  */ 00229000
@RC00027 DS    0H                                                  0085 00230000
A2       CLC   DCBRECAD+72(4,DCBPTR),DCBEOBAD+72(DCBPTR)           0085 00231000
         BNE   @RF00085                                            0085 00232000
*     DO;                           /* YES                           */ 00233000
*       IOBPTR=DCBIOBA;             /* PTR TO IOB FOR EOB            */ 00234000
         L     IOBPTR,DCBIOBA+52(,DCBPTR)                          0087 00235000
*       IF RECTYP=UNITCK|RECTYP=UNITEX|RECTYP=UNITCKEX THEN        0088 00236000
         L     @05,DCBHDR(,DCBPTR)                                 0088 00237000
         CLI   RECTYP(@05),X'02'                                   0088 00238000
         BE    @RT00088                                            0088 00239000
         L     @05,DCBHDR(,DCBPTR)                                 0088 00240000
         CLI   RECTYP(@05),X'01'                                   0088 00241000
         BE    @RT00088                                            0088 00242000
         L     @05,DCBHDR(,DCBPTR)                                 0088 00243000
         CLI   RECTYP(@05),X'03'                                   0088 00244000
         BE    @RT00088                                            0088 00245000
*         GOTO A3;                  /*                       @YM00623*/ 00246000
*       DO;                         /* BUFFER END AND NOT DM REC     */ 00247000
*         CALL EOBMOD;              /* GO TO END OF BLOCK RTN        */ 00248000
         L     @15,EOBMOD+72(,DCBPTR)                              0091 00249000
         BALR  @14,@15                                             0091 00250000
*         IF MRWRITE=ON THEN        /* WAS MULTIPLE WRITE ON @ZA04481*/ 00251000
         TM    MRWRITE(DCBPTR),B'10000000'                         0092 00252000
         BO    @RT00092                                            0092 00253000
*           GOTO SYNCH;             /* YES, GO TO SYNCH RTN          */ 00254000
*       END;                                                       0094 00255000
*     END;                                                         0095 00256000
*A3:                                                               0096 00257000
*   GEN CODE;                                                      0096 00258000
@RF00085 DS    0H                                                  0096 00259000
A3       DS    0H                                                  0096 00260000
*                                   /* RETURN TO CALLER              */ 00261000
         LM    RETR,BASR,20(SAVR)       RESOTRE REGS                    00262000
         LR    RPARA1,RPARA0             DATA ADR RETURNED IN REG1      00263000
         BCR   15,RETR                  RETURN                          00264000
*   END IGG019UN                                                   0097 00265000
*                                                                  0097 00266000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00267000
*/*%INCLUDE SYSUT5  (IGG019UN)                                       */ 00268000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00269000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00270000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00271000
*/*%INCLUDE SYSUT5  (DCLAR   )                                       */ 00272000
*/*%INCLUDE SYSUT5  (SETUP   )                                       */ 00273000
*/*%INCLUDE SYSUT5  (MOVREC  )                                       */ 00274000
*/*%INCLUDE SYSUT5  (MOVREC  )                                       */ 00275000
*                                                                  0097 00276000
*       ;                                                          0097 00277000
@EL00001 DS    0H                                                  0097 00278000
@EF00001 DS    0H                                                  0097 00279000
@ER00001 LM    @14,@12,12(@13)                                     0097 00280000
         BR    @14                                                 0097 00281000
@DATA    DS    0H                                                       00282000
@SM00473 MVC   USDTA(0,WORK),GETDTA(@01)                                00283000
@SC00475 CLC   GETDTA(0,@05),ZERO                                       00284000
         DS    0F                                                       00285000
         DS    0F                                                       00286000
@CF00472 DC    F'-12'                                                   00287000
@CF00453 DC    BL4'00001100'                                            00288000
         DS    0D                                                       00289000
ZERO     DS    CL48                                                     00290000
         ORG   ZERO                                                     00291000
Z1       DC    48X'00'                                                  00292000
         ORG   ZERO+48                                                  00293000
RELEASE  DC    B'11110000'                                              00294000
MTAREA   DC    X'00'                                                    00295000
         DC    XL49'0'                                                  00296000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00297000
@01      EQU   01                                                       00298000
@02      EQU   02                                                       00299000
@03      EQU   03                                                       00300000
@04      EQU   04                                                       00301000
@05      EQU   05                                                       00302000
@06      EQU   06                                                       00303000
@07      EQU   07                                                       00304000
@08      EQU   08                                                       00305000
@09      EQU   09                                                       00306000
@10      EQU   10                                                       00307000
@11      EQU   11                                                       00308000
@12      EQU   12                                                       00309000
@13      EQU   13                                                       00310000
@14      EQU   14                                                       00311000
@15      EQU   15                                                       00312000
DCBPTR   EQU   @02                                                      00313000
RPARA1   EQU   @01                                                      00314000
IOBPTR   EQU   @03                                                      00315000
WORK     EQU   @04                                                      00316000
RECLEN   EQU   @05                                                      00317000
BASR     EQU   @08                                                      00318000
R9       EQU   @09                                                      00319000
R10      EQU   @10                                                      00320000
R11      EQU   @11                                                      00321000
R12      EQU   @12                                                      00322000
SAVR     EQU   @13                                                      00323000
ENTRYR   EQU   @15                                                      00324000
IOBSTPTR EQU   @07                                                      00325000
RETR     EQU   @14                                                      00326000
RPARA0   EQU   @00                                                      00327000
IHADCB   EQU   0                                                        00328000
IHADCS07 EQU   0                                                        00329000
DCBWTOID EQU   IHADCS07                                                 00330000
IHADCS09 EQU   0                                                        00331000
DCBSSID  EQU   IHADCS09                                                 00332000
IHADCS10 EQU   0                                                        00333000
@NM00003 EQU   IHADCS10                                                 00334000
DCBSSAD  EQU   IHADCS10+4                                               00335000
DCBIMG   EQU   DCBSSAD                                                  00336000
DCBIMAGE EQU   IHADCS10+8                                               00337000
DCBMRFG  EQU   DCBIMAGE                                                 00338000
DCBECBLT EQU   IHADCS10+12                                              00339000
DCBHDR   EQU   DCBECBLT                                                 00340000
DCBMRIND EQU   DCBHDR                                                   00341000
DCBMRFLG EQU   IHADCS10+16                                              00342000
IHADCS11 EQU   0                                                        00343000
DCBRELB  EQU   IHADCS11                                                 00344000
DCBREL   EQU   DCBRELB+1                                                00345000
DCBBUFCB EQU   IHADCS11+4                                               00346000
DCBDSORG EQU   IHADCS11+10                                              00347000
DCBDSRG1 EQU   DCBDSORG                                                 00348000
DCBDSRG2 EQU   DCBDSORG+1                                               00349000
DCBIOBAD EQU   IHADCS11+12                                              00350000
DCBODEB  EQU   DCBIOBAD                                                 00351000
DCBLNP   EQU   DCBODEB                                                  00352000
DCBQSLM  EQU   DCBLNP                                                   00353000
DCBIOBAA EQU   DCBODEB+1                                                00354000
IHADCS50 EQU   0                                                        00355000
DCBSVCXL EQU   IHADCS50                                                 00356000
DCBEODAD EQU   IHADCS50+4                                               00357000
DCBBFALN EQU   DCBEODAD                                                 00358000
DCBHIARC EQU   DCBBFALN                                                 00359000
DCBBFTEK EQU   DCBHIARC                                                 00360000
DCBBFT   EQU   DCBBFTEK                                                 00361000
DCBEXLST EQU   IHADCS50+8                                               00362000
DCBRECFM EQU   DCBEXLST                                                 00363000
DCBRECLA EQU   DCBRECFM                                                 00364000
IHADCS24 EQU   0                                                        00365000
DCBOFLGS EQU   IHADCS24+8                                               00366000
DCBOFLWR EQU   DCBOFLGS                                                 00367000
DCBIFLG  EQU   IHADCS24+9                                               00368000
DCBMACR  EQU   IHADCS24+10                                              00369000
DCBMACR1 EQU   DCBMACR                                                  00370000
DCBMRFE  EQU   DCBMACR1                                                 00371000
DCBMRGET EQU   DCBMRFE                                                  00372000
DCBMRAPG EQU   DCBMACR1                                                 00373000
DCBMRRD  EQU   DCBMRAPG                                                 00374000
DCBMRCI  EQU   DCBMACR1                                                 00375000
DCBMRMVG EQU   DCBMRCI                                                  00376000
DCBMRLCG EQU   DCBMACR1                                                 00377000
DCBMRABC EQU   DCBMACR1                                                 00378000
DCBMRPT1 EQU   DCBMRABC                                                 00379000
DCBMRSBG EQU   DCBMRPT1                                                 00380000
DCBMRCRL EQU   DCBMACR1                                                 00381000
DCBMRCHK EQU   DCBMRCRL                                                 00382000
DCBMRRDX EQU   DCBMRCHK                                                 00383000
DCBMRDMG EQU   DCBMACR1                                                 00384000
DCBMACR2 EQU   DCBMACR+1                                                00385000
DCBMRPUT EQU   DCBMACR2                                                 00386000
DCBMRWRT EQU   DCBMACR2                                                 00387000
DCBMRMVP EQU   DCBMACR2                                                 00388000
DCBMR5WD EQU   DCBMACR2                                                 00389000
DCBMRLDM EQU   DCBMR5WD                                                 00390000
DCBMRLCP EQU   DCBMRLDM                                                 00391000
DCBMR4WD EQU   DCBMACR2                                                 00392000
DCBMRPT2 EQU   DCBMR4WD                                                 00393000
DCBMRTMD EQU   DCBMRPT2                                                 00394000
DCBMR3WD EQU   DCBMACR2                                                 00395000
DCBMRCTL EQU   DCBMR3WD                                                 00396000
DCBMRSTK EQU   DCBMRCTL                                                 00397000
DCBMR1WD EQU   DCBMACR2                                                 00398000
DCBMRSWA EQU   DCBMR1WD                                                 00399000
DCBMRDMD EQU   DCBMRSWA                                                 00400000
IHADCS25 EQU   0                                                        00401000
DCBMACRF EQU   IHADCS25+2                                               00402000
DCBMACF1 EQU   DCBMACRF                                                 00403000
DCBMFFE  EQU   DCBMACF1                                                 00404000
DCBMFGET EQU   DCBMFFE                                                  00405000
DCBMFAPG EQU   DCBMACF1                                                 00406000
DCBMFRD  EQU   DCBMFAPG                                                 00407000
DCBMFCI  EQU   DCBMACF1                                                 00408000
DCBMFMVG EQU   DCBMFCI                                                  00409000
DCBMFLCG EQU   DCBMACF1                                                 00410000
DCBMFABC EQU   DCBMACF1                                                 00411000
DCBMFPT1 EQU   DCBMFABC                                                 00412000
DCBMFSBG EQU   DCBMFPT1                                                 00413000
DCBMFCRL EQU   DCBMACF1                                                 00414000
DCBMFCHK EQU   DCBMFCRL                                                 00415000
DCBMFDMG EQU   DCBMACF1                                                 00416000
DCBMACF2 EQU   DCBMACRF+1                                               00417000
DCBMFPUT EQU   DCBMACF2                                                 00418000
DCBMFWRT EQU   DCBMACF2                                                 00419000
DCBMFMVP EQU   DCBMACF2                                                 00420000
DCBMF5WD EQU   DCBMACF2                                                 00421000
DCBMFLDM EQU   DCBMF5WD                                                 00422000
DCBMFLCP EQU   DCBMFLDM                                                 00423000
DCBMF4WD EQU   DCBMACF2                                                 00424000
DCBMFPT2 EQU   DCBMF4WD                                                 00425000
DCBMFTMD EQU   DCBMFPT2                                                 00426000
DCBMF3WD EQU   DCBMACF2                                                 00427000
DCBMFCTL EQU   DCBMF3WD                                                 00428000
DCBMFSTK EQU   DCBMFCTL                                                 00429000
DCBMF1WD EQU   DCBMACF2                                                 00430000
DCBMFSWA EQU   DCBMF1WD                                                 00431000
DCBMFDMD EQU   DCBMFSWA                                                 00432000
DCBDEBAD EQU   IHADCS25+4                                               00433000
DCBIFLGS EQU   DCBDEBAD                                                 00434000
IHADCS26 EQU   0                                                        00435000
DCBWRITE EQU   IHADCS26                                                 00436000
DCBREAD  EQU   DCBWRITE                                                 00437000
DCBWRITA EQU   DCBREAD+1                                                00438000
IHADCS27 EQU   0                                                        00439000
DCBGET   EQU   IHADCS27                                                 00440000
DCBPUT   EQU   DCBGET                                                   00441000
DCBGETA  EQU   DCBPUT+1                                                 00442000
IHADCS36 EQU   0                                                        00443000
DCBGERR  EQU   IHADCS36                                                 00444000
DCBPERR  EQU   DCBGERR                                                  00445000
DCBCHECK EQU   DCBPERR                                                  00446000
DCBOPTCD EQU   DCBCHECK                                                 00447000
DCBOPTH  EQU   DCBOPTCD                                                 00448000
DCBOPTO  EQU   DCBOPTH                                                  00449000
DCBOPTZ  EQU   DCBOPTCD                                                 00450000
DCBGERRA EQU   DCBCHECK+1                                               00451000
DCBPERRA EQU   DCBGERRA                                                 00452000
DCBSYNAD EQU   IHADCS36+4                                               00453000
DCBCIND1 EQU   IHADCS36+8                                               00454000
DCBCIND2 EQU   IHADCS36+9                                               00455000
DCBBLKSI EQU   IHADCS36+10                                              00456000
DCBOFFSR EQU   IHADCS36+14                                              00457000
DCBIOBA  EQU   IHADCS36+16                                              00458000
DCBCICB  EQU   DCBIOBA                                                  00459000
IHADCS52 EQU   0                                                        00460000
DCBDIRCT EQU   IHADCS52                                                 00461000
DCBQSWS  EQU   DCBDIRCT                                                 00462000
DCBUSASI EQU   DCBQSWS                                                  00463000
DCBQADFS EQU   DCBUSASI                                                 00464000
DCBBUFOF EQU   DCBDIRCT+1                                               00465000
IHADCS37 EQU   0                                                        00466000
DCBFLAG1 EQU   IHADCS37                                                 00467000
IHADCS38 EQU   0                                                        00468000
DCBEOBR  EQU   IHADCS38                                                 00469000
DCBLRECL EQU   IHADCS38+10                                              00470000
DCBPOINT EQU   IHADCS38+12                                              00471000
DCBCNTRL EQU   DCBPOINT                                                 00472000
IHADCS40 EQU   0                                                        00473000
DCBEOBAD EQU   IHADCS40                                                 00474000
DCBCCCW  EQU   IHADCS40+4                                               00475000
DCBRECAD EQU   DCBCCCW                                                  00476000
DCBRECBT EQU   DCBRECAD                                                 00477000
DCBRCREL EQU   DCBRECBT                                                 00478000
@NM00028 EQU   IHADCS40+12                                              00479000
DCBEROPT EQU   @NM00028                                                 00480000
DCBEOB   EQU   IHADCS40+20                                              00481000
CCW      EQU   0                                                        00482000
CCWADR   EQU   CCW+1                                                    00483000
IOBSENSE EQU   0                                                        00484000
SAVAR    EQU   0                                                        00485000
SAVE17   EQU   SAVAR+64                                                 00486000
SAVE18   EQU   SAVAR+68                                                 00487000
USHDR    EQU   0                                                        00488000
RECTYP   EQU   USHDR+11                                                 00489000
GETDTA   EQU   0                                                        00490000
GETHDR   EQU   0                                                        00491000
USDTA    EQU   0                                                        00492000
MRFLG    EQU   DCBMRFLG                                                 00493000
MRWRITE  EQU   MRFLG                                                    00494000
IMGFLGS  EQU   MRFLG+3                                                  00495000
IMGPROC  EQU   IMGFLGS                                                  00496000
EOBMOD   EQU   DCBEOB                                                   00497000
RELSW    EQU   DCBIOBA                                                  00498000
SYNCMOD  EQU   DCBGERR                                                  00499000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00500000
@NM00035 EQU   IMGFLGS                                                  00501000
IMGEOF   EQU   IMGFLGS                                                  00502000
@NM00034 EQU   MRFLG+1                                                  00503000
@NM00033 EQU   MRFLG                                                    00504000
@NM00038 EQU   USHDR                                                    00505000
@NM00037 EQU   SAVAR                                                    00506000
IOBSENS0 EQU   IOBSENSE+10                                              00507000
@NM00036 EQU   IOBSENSE                                                 00508000
CCWL     EQU   CCW+6                                                    00509000
@NM00032 EQU   CCW+4                                                    00510000
CCWCODE  EQU   CCW                                                      00511000
DCBPRECL EQU   IHADCS40+18                                              00512000
@NM00031 EQU   IHADCS40+16                                              00513000
@NM00030 EQU   @NM00028+1                                               00514000
@NM00029 EQU   DCBEROPT                                                 00515000
DCBERABE EQU   DCBEROPT                                                 00516000
DCBERSKP EQU   DCBEROPT                                                 00517000
DCBERACC EQU   DCBEROPT                                                 00518000
@NM00027 EQU   IHADCS40+10                                              00519000
@NM00026 EQU   IHADCS40+9                                               00520000
@NM00025 EQU   IHADCS40+8                                               00521000
DCBRECA  EQU   DCBRECAD+1                                               00522000
@NM00024 EQU   DCBRECBT                                                 00523000
DCBRCFGT EQU   DCBRCREL                                                 00524000
DCBRCTRU EQU   DCBRCREL                                                 00525000
DCBLCCW  EQU   DCBEOBAD                                                 00526000
DCBNOTE  EQU   DCBCNTRL                                                 00527000
@NM00023 EQU   IHADCS38+8                                               00528000
DCBEOBW  EQU   IHADCS38+4                                               00529000
DCBEOBRA EQU   DCBEOBR+1                                                00530000
DCBNCP   EQU   DCBEOBR                                                  00531000
@NM00022 EQU   DCBFLAG1                                                 00532000
DCBSTFLS EQU   DCBFLAG1                                                 00533000
DCBSTQCK EQU   DCBFLAG1                                                 00534000
DCBDIRCQ EQU   DCBBUFOF                                                 00535000
DCBQSTRU EQU   DCBUSASI                                                 00536000
@NM00021 EQU   DCBUSASI                                                 00537000
DCBQADF3 EQU   DCBQADFS                                                 00538000
DCBQADF2 EQU   DCBQADFS                                                 00539000
DCBQADF1 EQU   DCBQADFS                                                 00540000
DCBBLBP  EQU   DCBUSASI                                                 00541000
@NM00020 EQU   DCBUSASI                                                 00542000
DCBCICBA EQU   DCBCICB+1                                                00543000
@NM00019 EQU   DCBCICB                                                  00544000
DCBOFFSW EQU   IHADCS36+15                                              00545000
DCBWCPL  EQU   IHADCS36+13                                              00546000
DCBWCPO  EQU   IHADCS36+12                                              00547000
DCBCNQSM EQU   DCBCIND2                                                 00548000
DCBCNFEO EQU   DCBCIND2                                                 00549000
DCBCNCHS EQU   DCBCIND2                                                 00550000
DCBCNBFP EQU   DCBCIND2                                                 00551000
DCBCNIOE EQU   DCBCIND2                                                 00552000
DCBCNCLO EQU   DCBCIND2                                                 00553000
DCBCNWRO EQU   DCBCIND2                                                 00554000
DCBCNSTO EQU   DCBCIND2                                                 00555000
DCBCNEXB EQU   DCBCIND1                                                 00556000
@NM00018 EQU   DCBCIND1                                                 00557000
DCBCNBRM EQU   DCBCIND1                                                 00558000
@NM00017 EQU   DCBCIND1                                                 00559000
DCBCNEVA EQU   DCBCIND1                                                 00560000
DCBCNEVB EQU   DCBCIND1                                                 00561000
DCBCNSRD EQU   DCBCIND1                                                 00562000
DCBCNTOV EQU   DCBCIND1                                                 00563000
DCBSYNA  EQU   DCBSYNAD+1                                               00564000
DCBIOBL  EQU   DCBSYNAD                                                 00565000
DCBCHCKA EQU   DCBPERRA                                                 00566000
@NM00016 EQU   DCBOPTCD                                                 00567000
DCBOPTT  EQU   DCBOPTCD                                                 00568000
DCBSRCHD EQU   DCBOPTZ                                                  00569000
DCBOPTQ  EQU   DCBOPTCD                                                 00570000
DCBBCKPT EQU   DCBOPTO                                                  00571000
DCBOPTC  EQU   DCBOPTCD                                                 00572000
DCBOPTU  EQU   DCBOPTCD                                                 00573000
DCBOPTW  EQU   DCBOPTCD                                                 00574000
DCBPUTA  EQU   DCBGETA                                                  00575000
@NM00015 EQU   DCBPUT                                                   00576000
DCBREADA EQU   DCBWRITA                                                 00577000
@NM00014 EQU   DCBREAD                                                  00578000
DCBDEBA  EQU   DCBDEBAD+1                                               00579000
@NM00013 EQU   DCBIFLGS                                                 00580000
DCBIFIOE EQU   DCBIFLGS                                                 00581000
DCBIFPCT EQU   DCBIFLGS                                                 00582000
DCBIFEC  EQU   DCBIFLGS                                                 00583000
DCBMFSTI EQU   DCBMFDMD                                                 00584000
DCBMFAWR EQU   DCBMFSTK                                                 00585000
DCBMFUIP EQU   DCBMFTMD                                                 00586000
DCBMFIDW EQU   DCBMFLCP                                                 00587000
DCBMFWRK EQU   DCBMFMVP                                                 00588000
DCBMFRDQ EQU   DCBMFWRT                                                 00589000
DCBMFGTQ EQU   DCBMFPUT                                                 00590000
DCBMFSTL EQU   DCBMACF2                                                 00591000
DCBMFCK  EQU   DCBMFDMG                                                 00592000
DCBMFRDX EQU   DCBMFCHK                                                 00593000
DCBMFDBF EQU   DCBMFSBG                                                 00594000
DCBMFRDI EQU   DCBMFLCG                                                 00595000
DCBMFRDK EQU   DCBMFMVG                                                 00596000
DCBMFWRQ EQU   DCBMFRD                                                  00597000
DCBMFPTQ EQU   DCBMFGET                                                 00598000
DCBMFECP EQU   DCBMACF1                                                 00599000
DCBTIOT  EQU   IHADCS25                                                 00600000
DCBMRSTI EQU   DCBMRDMD                                                 00601000
DCBMRAWR EQU   DCBMRSTK                                                 00602000
DCBMRUIP EQU   DCBMRTMD                                                 00603000
DCBMRIDW EQU   DCBMRLCP                                                 00604000
DCBMRWRK EQU   DCBMRMVP                                                 00605000
DCBMRRDQ EQU   DCBMRWRT                                                 00606000
DCBMRGTQ EQU   DCBMRPUT                                                 00607000
DCBMRSTL EQU   DCBMACR2                                                 00608000
DCBMRCK  EQU   DCBMRDMG                                                 00609000
DCBPGFXA EQU   DCBMRRDX                                                 00610000
DCBMRDBF EQU   DCBMRSBG                                                 00611000
DCBMRRDI EQU   DCBMRLCG                                                 00612000
DCBMRRDK EQU   DCBMRMVG                                                 00613000
DCBMRWRQ EQU   DCBMRRD                                                  00614000
DCBMRPTQ EQU   DCBMRGET                                                 00615000
DCBMRECP EQU   DCBMACR1                                                 00616000
@NM00012 EQU   DCBIFLG                                                  00617000
DCBIBIOE EQU   DCBIFLG                                                  00618000
DCBIBPCT EQU   DCBIFLG                                                  00619000
DCBIBEC  EQU   DCBIFLG                                                  00620000
DCBOFIOF EQU   DCBOFLGS                                                 00621000
DCBOFUEX EQU   DCBOFLGS                                                 00622000
DCBOFTM  EQU   DCBOFLGS                                                 00623000
DCBOFPPC EQU   DCBOFLGS                                                 00624000
DCBOFOPN EQU   DCBOFLGS                                                 00625000
DCBOFEOV EQU   DCBOFLGS                                                 00626000
DCBOFLRB EQU   DCBOFLGS                                                 00627000
DCBOFIOD EQU   DCBOFLWR                                                 00628000
DCBDDNAM EQU   IHADCS24                                                 00629000
DCBEXLSA EQU   DCBEXLST+1                                               00630000
DCBRECKL EQU   DCBRECFM                                                 00631000
DCBRECCC EQU   DCBRECFM                                                 00632000
DCBRECSB EQU   DCBRECFM                                                 00633000
DCBRECBR EQU   DCBRECFM                                                 00634000
DCBRECTO EQU   DCBRECLA                                                 00635000
DCBRECL  EQU   DCBRECLA                                                 00636000
DCBEODA  EQU   DCBEODAD+1                                               00637000
DCBBFA   EQU   DCBBFTEK                                                 00638000
DCBH0    EQU   DCBBFTEK                                                 00639000
DCBBFTKD EQU   DCBBFTEK                                                 00640000
DCBBFTE  EQU   DCBBFT                                                   00641000
DCBBFTKR EQU   DCBBFT                                                   00642000
DCBBFTS  EQU   DCBBFT                                                   00643000
DCBH1    EQU   DCBBFTEK                                                 00644000
DCBSVCXA EQU   DCBSVCXL+1                                               00645000
@NM00011 EQU   DCBSVCXL                                                 00646000
DCBODEBA EQU   DCBIOBAA                                                 00647000
@NM00010 EQU   DCBQSLM                                                  00648000
DCBUPDBT EQU   DCBQSLM                                                  00649000
DCBUPDCM EQU   DCBQSLM                                                  00650000
DCB1DVDS EQU   DCBQSLM                                                  00651000
@NM00009 EQU   DCBDSRG2                                                 00652000
DCBDSGTR EQU   DCBDSRG2                                                 00653000
DCBACBM  EQU   DCBDSRG2                                                 00654000
@NM00008 EQU   DCBDSRG2                                                 00655000
DCBDSGTQ EQU   DCBDSRG2                                                 00656000
DCBDSGTX EQU   DCBDSRG2                                                 00657000
DCBDSGGS EQU   DCBDSRG2                                                 00658000
DCBDSGU  EQU   DCBDSRG1                                                 00659000
DCBDSGPO EQU   DCBDSRG1                                                 00660000
DCBDSGMQ EQU   DCBDSRG1                                                 00661000
DCBDSGCQ EQU   DCBDSRG1                                                 00662000
DCBDSGCX EQU   DCBDSRG1                                                 00663000
DCBDSGDA EQU   DCBDSRG1                                                 00664000
DCBDSGPS EQU   DCBDSRG1                                                 00665000
DCBDSGIS EQU   DCBDSRG1                                                 00666000
DCBBUFL  EQU   IHADCS11+8                                               00667000
DCBBUFCA EQU   DCBBUFCB+1                                               00668000
DCBBUFNO EQU   DCBBUFCB                                                 00669000
DCBDEVT  EQU   DCBREL                                                   00670000
DCBKEYLE EQU   DCBRELB                                                  00671000
@NM00007 EQU   IHADCS10+19                                              00672000
DCBAPPIN EQU   IHADCS10+18                                              00673000
@NM00006 EQU   IHADCS10+17                                              00674000
DCBMRUE  EQU   DCBMRFLG                                                 00675000
DCBMRDWT EQU   DCBMRFLG                                                 00676000
DCBMRPCC EQU   DCBMRFLG                                                 00677000
DCBMRDR  EQU   DCBMRFLG                                                 00678000
DCBMRDRU EQU   DCBMRFLG                                                 00679000
DCBMRDBG EQU   DCBMRFLG                                                 00680000
DCBMRSCC EQU   DCBMRFLG                                                 00681000
DCBECBLA EQU   DCBHDR+1                                                 00682000
DCBMRERS EQU   DCBMRIND                                                 00683000
DCBMRERP EQU   DCBMRIND                                                 00684000
DCBMRPLS EQU   DCBMRIND                                                 00685000
DCBMRPLO EQU   DCBMRIND                                                 00686000
DCBMRSCU EQU   DCBMRIND                                                 00687000
DCBMRDCT EQU   DCBMRIND                                                 00688000
DCBIMAGA EQU   DCBIMAGE+1                                               00689000
@NM00005 EQU   DCBMRFG                                                  00690000
DCBMRBCT EQU   DCBMRFG                                                  00691000
DCBSSADA EQU   DCBIMG+1                                                 00692000
@NM00004 EQU   DCBIMG                                                   00693000
DCBQSMEX EQU   @NM00003                                                 00694000
DCBWTOIA EQU   DCBWTOID+1                                               00695000
@NM00002 EQU   DCBWTOID                                                 00696000
@NM00001 EQU   IHADCB                                                   00697000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00698000
@RT00064 EQU   A2                                                       00699000
@RT00078 EQU   A2                                                       00700000
@RC00049 EQU   @RC00027                                                 00701000
@RF00080 EQU   @RC00027                                                 00702000
@RT00088 EQU   A3                                                       00703000
@RT00092 EQU   SYNCH                                                    00704000
@RF00052 EQU   @RC00049                                                 00705000
@RF00054 EQU   @RC00049                                                 00706000
@RF00066 EQU   @RC00049                                                 00707000
@ENDDATA EQU   *                                                        00708000
         END   IGG019UN,(C'PLS1547',0701,76141)                         00709000
./  ADD  SSI=31360016,NAME=IGG019UO
         TITLE 'IGG019UO, CONTROL MODULE FOR 3890 MICR READER        '  00001000
IGG019UO CSECT ,                                                   0001 00002000
@PROLOG  STM   @14,@12,12(@13)                                     0001 00003000
         BALR  @12,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@12                                         0001 00006000
*                                                                  0037 00007000
*/*****************************                                      */ 00008000
*/* HANDLE ENG OR DSG FUNCTION                                       */ 00009000
*/*****************************                                      */ 00010000
*                                                                  0037 00011000
*   IOBSTPTR=DCBIOBA+PRFXLN;        /* ESTABLISH POINTER TO IOB      */ 00012000
         LA    IOBSTPTR,8                                          0037 00013000
         A     IOBSTPTR,DCBIOBA+52(,DCBPTR)                        0037 00014000
*   CCWPTR=IOBSTART;                /* ESTABLISH PTR TO 3890 CCWCHAIN*/ 00015000
         L     CCWPTR,IOBSTART(,IOBSTPTR)                          0038 00016000
*   IF FUNCTION=ENGAGE THEN         /* IF ENGAGE REQUESTED,SET CCW   */ 00017000
         LR    @15,PRMPTR                                          0039 00018000
         CLI   FUNCTION(@15),4                                     0039 00019000
         BNE   @RF00039                                            0039 00020000
*     CCWOPCDE=STARTCMD;            /* COMMAND CODE TO ANTICIPATE.   */ 00021000
         MVI   CCWOPCDE(CCWPTR),X'23'                              0040 00022000
*   ELSE                            /* ELSE,TEST FOR DISENGAGE...    */ 00023000
*     IF FUNCTION=DISENG THEN       /* IF DISENGAGE REQUESTED,SET CCW*/ 00024000
         B     @RC00039                                            0041 00025000
@RF00039 LR    @15,PRMPTR                                          0041 00026000
         CLI   FUNCTION(@15),8                                     0041 00027000
         BNE   @RF00041                                            0041 00028000
*       CCWOPCDE=STOPCMD;           /* OP CODE TO ANTICIPATE AND STOP*/ 00029000
         MVI   CCWOPCDE(CCWPTR),X'33'                              0042 00030000
*   END IGG019UO                                                   0043 00031000
*                                                                  0043 00032000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00033000
*/*%INCLUDE SYSUT5  (CONTROL )                                       */ 00034000
*/*%INCLUDE SYSUT5  (PROLOG  )                                       */ 00035000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                       */ 00036000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00037000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00038000
*                                                                  0043 00039000
*       ;                                                          0043 00040000
@EL00001 DS    0H                                                  0043 00041000
@EF00001 DS    0H                                                  0043 00042000
@ER00001 LM    @14,@12,12(@13)                                     0043 00043000
         BR    @14                                                 0043 00044000
@DATA    DS    0H                                                       00045000
         DS    0F                                                       00046000
         DS    0F                                                       00047000
         DS    0D                                                       00048000
MTAREA   DC    13CL4'ZAPS'                                              00049000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00050000
@01      EQU   01                                                       00051000
@02      EQU   02                                                       00052000
@03      EQU   03                                                       00053000
@04      EQU   04                                                       00054000
@05      EQU   05                                                       00055000
@06      EQU   06                                                       00056000
@07      EQU   07                                                       00057000
@08      EQU   08                                                       00058000
@09      EQU   09                                                       00059000
@10      EQU   10                                                       00060000
@11      EQU   11                                                       00061000
@12      EQU   12                                                       00062000
@13      EQU   13                                                       00063000
@14      EQU   14                                                       00064000
@15      EQU   15                                                       00065000
IOBPRPTR EQU   @04                                                      00066000
IOBSTPTR EQU   @02                                                      00067000
DCBPTR   EQU   @01                                                      00068000
PRMPTR   EQU   @00                                                      00069000
CCWPTR   EQU   @03                                                      00070000
IOBPREFX EQU   0                                                        00071000
IOBCFLG1 EQU   IOBPREFX                                                 00072000
IOBSTDRD EQU   0                                                        00073000
IOBFLAG1 EQU   IOBSTDRD                                                 00074000
IOBCYCCK EQU   IOBFLAG1                                                 00075000
IOBRSTRT EQU   IOBFLAG1                                                 00076000
IOBFLAG2 EQU   IOBSTDRD+1                                               00077000
IOBPURGE EQU   IOBFLAG2                                                 00078000
IOBRDHA0 EQU   IOBFLAG2                                                 00079000
IOBSENS0 EQU   IOBSTDRD+2                                               00080000
IOBS0B7  EQU   IOBSENS0                                                 00081000
IOBSENS1 EQU   IOBSTDRD+3                                               00082000
IOBECBPT EQU   IOBSTDRD+4                                               00083000
IOBFLAG3 EQU   IOBSTDRD+8                                               00084000
IOBFL3   EQU   IOBFLAG3                                                 00085000
IOBCSW   EQU   IOBSTDRD+9                                               00086000
IOBIOCSW EQU   IOBCSW                                                   00087000
IOBSTART EQU   IOBSTDRD+16                                              00088000
IOBDCBPT EQU   IOBSTDRD+20                                              00089000
IOBFLAG4 EQU   IOBDCBPT                                                 00090000
IOBRESTR EQU   IOBSTDRD+24                                              00091000
IOBINCAM EQU   IOBSTDRD+28                                              00092000
IOBBTAMF EQU   IOBINCAM                                                 00093000
IHADCB   EQU   0                                                        00094000
IHADCS07 EQU   0                                                        00095000
DCBWTOID EQU   IHADCS07                                                 00096000
IHADCS09 EQU   0                                                        00097000
DCBSSID  EQU   IHADCS09                                                 00098000
IHADCS10 EQU   0                                                        00099000
DCBSSAD  EQU   IHADCS10+4                                               00100000
DCBIMG   EQU   DCBSSAD                                                  00101000
DCBIMAGE EQU   IHADCS10+8                                               00102000
DCBMRFG  EQU   DCBIMAGE                                                 00103000
DCBECBLT EQU   IHADCS10+12                                              00104000
DCBHDR   EQU   DCBECBLT                                                 00105000
DCBMRIND EQU   DCBHDR                                                   00106000
DCBMRFLG EQU   IHADCS10+16                                              00107000
IHADCS11 EQU   0                                                        00108000
DCBRELB  EQU   IHADCS11                                                 00109000
DCBREL   EQU   DCBRELB+1                                                00110000
DCBBUFCB EQU   IHADCS11+4                                               00111000
DCBDSORG EQU   IHADCS11+10                                              00112000
DCBDSRG1 EQU   DCBDSORG                                                 00113000
DCBDSRG2 EQU   DCBDSORG+1                                               00114000
DCBIOBAD EQU   IHADCS11+12                                              00115000
DCBODEB  EQU   DCBIOBAD                                                 00116000
DCBLNP   EQU   DCBODEB                                                  00117000
DCBQSLM  EQU   DCBLNP                                                   00118000
DCBIOBAA EQU   DCBODEB+1                                                00119000
IHADCS50 EQU   0                                                        00120000
DCBSVCXL EQU   IHADCS50                                                 00121000
DCBEODAD EQU   IHADCS50+4                                               00122000
DCBBFALN EQU   DCBEODAD                                                 00123000
DCBHIARC EQU   DCBBFALN                                                 00124000
DCBBFTEK EQU   DCBHIARC                                                 00125000
DCBBFT   EQU   DCBBFTEK                                                 00126000
DCBEXLST EQU   IHADCS50+8                                               00127000
DCBRECFM EQU   DCBEXLST                                                 00128000
DCBRECLA EQU   DCBRECFM                                                 00129000
IHADCS24 EQU   0                                                        00130000
DCBOFLGS EQU   IHADCS24+8                                               00131000
DCBOFLWR EQU   DCBOFLGS                                                 00132000
DCBIFLG  EQU   IHADCS24+9                                               00133000
DCBMACR  EQU   IHADCS24+10                                              00134000
DCBMACR1 EQU   DCBMACR                                                  00135000
DCBMRFE  EQU   DCBMACR1                                                 00136000
DCBMRGET EQU   DCBMRFE                                                  00137000
DCBMRAPG EQU   DCBMACR1                                                 00138000
DCBMRRD  EQU   DCBMRAPG                                                 00139000
DCBMRCI  EQU   DCBMACR1                                                 00140000
DCBMRMVG EQU   DCBMRCI                                                  00141000
DCBMRLCG EQU   DCBMACR1                                                 00142000
DCBMRABC EQU   DCBMACR1                                                 00143000
DCBMRPT1 EQU   DCBMRABC                                                 00144000
DCBMRSBG EQU   DCBMRPT1                                                 00145000
DCBMRCRL EQU   DCBMACR1                                                 00146000
DCBMRCHK EQU   DCBMRCRL                                                 00147000
DCBMRRDX EQU   DCBMRCHK                                                 00148000
DCBMRDMG EQU   DCBMACR1                                                 00149000
DCBMACR2 EQU   DCBMACR+1                                                00150000
DCBMRPUT EQU   DCBMACR2                                                 00151000
DCBMRWRT EQU   DCBMACR2                                                 00152000
DCBMRMVP EQU   DCBMACR2                                                 00153000
DCBMR5WD EQU   DCBMACR2                                                 00154000
DCBMRLDM EQU   DCBMR5WD                                                 00155000
DCBMRLCP EQU   DCBMRLDM                                                 00156000
DCBMR4WD EQU   DCBMACR2                                                 00157000
DCBMRPT2 EQU   DCBMR4WD                                                 00158000
DCBMRTMD EQU   DCBMRPT2                                                 00159000
DCBMR3WD EQU   DCBMACR2                                                 00160000
DCBMRCTL EQU   DCBMR3WD                                                 00161000
DCBMRSTK EQU   DCBMRCTL                                                 00162000
DCBMR1WD EQU   DCBMACR2                                                 00163000
DCBMRSWA EQU   DCBMR1WD                                                 00164000
DCBMRDMD EQU   DCBMRSWA                                                 00165000
IHADCS25 EQU   0                                                        00166000
DCBMACRF EQU   IHADCS25+2                                               00167000
DCBMACF1 EQU   DCBMACRF                                                 00168000
DCBMFFE  EQU   DCBMACF1                                                 00169000
DCBMFGET EQU   DCBMFFE                                                  00170000
DCBMFAPG EQU   DCBMACF1                                                 00171000
DCBMFRD  EQU   DCBMFAPG                                                 00172000
DCBMFCI  EQU   DCBMACF1                                                 00173000
DCBMFMVG EQU   DCBMFCI                                                  00174000
DCBMFLCG EQU   DCBMACF1                                                 00175000
DCBMFABC EQU   DCBMACF1                                                 00176000
DCBMFPT1 EQU   DCBMFABC                                                 00177000
DCBMFSBG EQU   DCBMFPT1                                                 00178000
DCBMFCRL EQU   DCBMACF1                                                 00179000
DCBMFCHK EQU   DCBMFCRL                                                 00180000
DCBMFDMG EQU   DCBMACF1                                                 00181000
DCBMACF2 EQU   DCBMACRF+1                                               00182000
DCBMFPUT EQU   DCBMACF2                                                 00183000
DCBMFWRT EQU   DCBMACF2                                                 00184000
DCBMFMVP EQU   DCBMACF2                                                 00185000
DCBMF5WD EQU   DCBMACF2                                                 00186000
DCBMFLDM EQU   DCBMF5WD                                                 00187000
DCBMFLCP EQU   DCBMFLDM                                                 00188000
DCBMF4WD EQU   DCBMACF2                                                 00189000
DCBMFPT2 EQU   DCBMF4WD                                                 00190000
DCBMFTMD EQU   DCBMFPT2                                                 00191000
DCBMF3WD EQU   DCBMACF2                                                 00192000
DCBMFCTL EQU   DCBMF3WD                                                 00193000
DCBMFSTK EQU   DCBMFCTL                                                 00194000
DCBMF1WD EQU   DCBMACF2                                                 00195000
DCBMFSWA EQU   DCBMF1WD                                                 00196000
DCBMFDMD EQU   DCBMFSWA                                                 00197000
DCBDEBAD EQU   IHADCS25+4                                               00198000
DCBIFLGS EQU   DCBDEBAD                                                 00199000
IHADCS26 EQU   0                                                        00200000
DCBWRITE EQU   IHADCS26                                                 00201000
IHADCS27 EQU   0                                                        00202000
DCBGET   EQU   IHADCS27                                                 00203000
IHADCS36 EQU   0                                                        00204000
DCBGERR  EQU   IHADCS36                                                 00205000
DCBPERR  EQU   DCBGERR                                                  00206000
DCBCHECK EQU   DCBPERR                                                  00207000
DCBOPTCD EQU   DCBCHECK                                                 00208000
DCBOPTH  EQU   DCBOPTCD                                                 00209000
DCBOPTO  EQU   DCBOPTH                                                  00210000
DCBOPTZ  EQU   DCBOPTCD                                                 00211000
DCBGERRA EQU   DCBCHECK+1                                               00212000
DCBPERRA EQU   DCBGERRA                                                 00213000
DCBSYNAD EQU   IHADCS36+4                                               00214000
DCBCIND1 EQU   IHADCS36+8                                               00215000
DCBCIND2 EQU   IHADCS36+9                                               00216000
DCBIOBA  EQU   IHADCS36+16                                              00217000
DCBCICB  EQU   IHADCS36+20                                              00218000
IHADCS52 EQU   0                                                        00219000
DCBDIRCT EQU   IHADCS52                                                 00220000
DCBQSWS  EQU   DCBDIRCT                                                 00221000
DCBUSASI EQU   DCBQSWS                                                  00222000
DCBQADFS EQU   DCBUSASI                                                 00223000
DCBBUFOF EQU   DCBDIRCT+1                                               00224000
IHADCS37 EQU   0                                                        00225000
DCBFLAG1 EQU   IHADCS37                                                 00226000
IHADCS38 EQU   0                                                        00227000
DCBEOBR  EQU   IHADCS38                                                 00228000
DCBPOINT EQU   IHADCS38+12                                              00229000
DCBCNTRL EQU   DCBPOINT                                                 00230000
IHADCS40 EQU   0                                                        00231000
DCBEOBAD EQU   IHADCS40                                                 00232000
DCBCCCW  EQU   IHADCS40+4                                               00233000
DCBRECAD EQU   DCBCCCW                                                  00234000
DCBRECBT EQU   DCBRECAD                                                 00235000
DCBRCREL EQU   DCBRECBT                                                 00236000
@NM00026 EQU   IHADCS40+12                                              00237000
DCBEROPT EQU   @NM00026                                                 00238000
PLIST    EQU   0                                                        00239000
FUNCTION EQU   PLIST                                                    00240000
CCW      EQU   0                                                        00241000
CCWOPCDE EQU   CCW                                                      00242000
IOBORG01 EQU   IOBPREFX+8                                               00243000
IOBNIOBA EQU   IOBORG01                                                 00244000
IOBNFLG1 EQU   IOBNIOBA                                                 00245000
IOBORG02 EQU   IOBPREFX+8                                               00246000
IOBDQADA EQU   IOBORG02                                                 00247000
IOBDEQIN EQU   IOBDQADA                                                 00248000
IOBORG03 EQU   IOBPREFX+12                                              00249000
IOBORG04 EQU   IOBINCAM                                                 00250000
IOBORG12 EQU   IOBINCAM                                                 00251000
IOBFL4   EQU   IOBORG12                                                 00252000
IOBEXTEN EQU   IOBSTDRD+32                                              00253000
IOBSEEK  EQU   IOBEXTEN                                                 00254000
IOBBB    EQU   IOBSEEK+1                                                00255000
IOBCC    EQU   IOBSEEK+3                                                00256000
IOBHH    EQU   IOBSEEK+5                                                00257000
IOBORG05 EQU   IOBEXTEN                                                 00258000
IOBORG06 EQU   IOBEXTEN                                                 00259000
IOBNXTPT EQU   IOBORG06+4                                               00260000
IOBSTATA EQU   IOBNXTPT                                                 00261000
IOBORG07 EQU   IOBEXTEN+8                                               00262000
W1OEXTEN EQU   IOBORG07                                                 00263000
IOBORG08 EQU   IOBEXTEN+8                                               00264000
IOBINDCT EQU   IOBORG08+4                                               00265000
IOBUNSQR EQU   IOBORG08+5                                               00266000
IOBFCHAD EQU   IOBORG08+8                                               00267000
IOBORG09 EQU   IOBEXTEN+8                                               00268000
IOBDPLAD EQU   IOBORG09+4                                               00269000
IOBDTYPE EQU   IOBORG09+8                                               00270000
IOBDTYP2 EQU   IOBORG09+9                                               00271000
IOBDSTAT EQU   IOBORG09+10                                              00272000
IOBSTAT1 EQU   IOBDSTAT                                                 00273000
IOBORG10 EQU   IOBEXTEN+8                                               00274000
IOBSEEK2 EQU   IOBORG10                                                 00275000
IOBORG11 EQU   IOBEXTEN                                                 00276000
IOBERCT  EQU   IOBORG11                                                 00277000
IOBUCBXV EQU   IOBERCT                                                  00278000
IOBNAME  EQU   IOBORG11+4                                               00279000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    00280000
IOBCSWSV EQU   IOBORG11+17                                              00281000
IOBSENSV EQU   IOBORG11+16                                              00282000
IOBRCD   EQU   IOBORG11+12                                              00283000
IOBMDREC EQU   IOBORG11+8                                               00284000
IOBNAMEA EQU   IOBNAME+1                                                00285000
IOBNAMSZ EQU   IOBNAME                                                  00286000
IOBERCTA EQU   IOBERCT+1                                                00287000
IOBRTYPE EQU   IOBUCBXV                                                 00288000
IOBRDCHP EQU   IOBORG10+20                                              00289000
IOBNEXTA EQU   IOBORG10+16                                              00290000
IOBREADA EQU   IOBORG10+12                                              00291000
IOBBUFC  EQU   IOBORG10+8                                               00292000
IOBSK2R  EQU   IOBSEEK2+7                                               00293000
IOBSK2HH EQU   IOBSEEK2+5                                               00294000
IOBSK2CC EQU   IOBSEEK2+3                                               00295000
IOBSK2BB EQU   IOBSEEK2+1                                               00296000
IOBSK2M  EQU   IOBSEEK2                                                 00297000
IOBCHNPR EQU   IOBORG09+40                                              00298000
IOBDNCRF EQU   IOBORG09+32                                              00299000
IOBRSV35 EQU   IOBORG09+24                                              00300000
IOBDQPTR EQU   IOBORG09+20                                              00301000
IOBRSV34 EQU   IOBORG09+18                                              00302000
IOBDBYTN EQU   IOBORG09+16                                              00303000
IOBDCPND EQU   IOBORG09+12                                              00304000
IOBSTAT2 EQU   IOBDSTAT+1                                               00305000
IOBSIORT EQU   IOBSTAT1                                                 00306000
IOBADDVU EQU   IOBSTAT1                                                 00307000
IOBBUFF  EQU   IOBSTAT1                                                 00308000
IOBENQUE EQU   IOBSTAT1                                                 00309000
IOBPASS2 EQU   IOBSTAT1                                                 00310000
IOBSYNCH EQU   IOBSTAT1                                                 00311000
IOBNEWVL EQU   IOBSTAT1                                                 00312000
IOBABNRM EQU   IOBSTAT1                                                 00313000
IOBRELEX EQU   IOBDTYP2                                                 00314000
IOBADDTY EQU   IOBDTYP2                                                 00315000
IOBTYPE  EQU   IOBDTYP2                                                 00316000
IOBRQUST EQU   IOBDTYP2                                                 00317000
IOBSUFFX EQU   IOBDTYP2                                                 00318000
IOBSBLKL EQU   IOBDTYP2                                                 00319000
IOBSKEY  EQU   IOBDTYP2                                                 00320000
IOBRELBL EQU   IOBDTYPE                                                 00321000
IOBRDEXC EQU   IOBDTYPE                                                 00322000
IOBDYNBF EQU   IOBDTYPE                                                 00323000
IOBACTAD EQU   IOBDTYPE                                                 00324000
IOBFDBCK EQU   IOBDTYPE                                                 00325000
IOBEXTSC EQU   IOBDTYPE                                                 00326000
IOBOVFLO EQU   IOBDTYPE                                                 00327000
IOBVERFY EQU   IOBDTYPE                                                 00328000
IOBDPLB  EQU   IOBDPLAD+1                                               00329000
IOBDAYLI EQU   IOBDPLAD                                                 00330000
IOBDIOBS EQU   IOBORG09+2                                               00331000
IOBDBYTR EQU   IOBORG09                                                 00332000
IOBBCHAD EQU   IOBORG08+12                                              00333000
IOBFCHNB EQU   IOBFCHAD+1                                               00334000
IOBCOUNT EQU   IOBFCHAD                                                 00335000
IOBASYN  EQU   IOBORG08+7                                               00336000
IOBAPP   EQU   IOBORG08+6                                               00337000
IOBRSV32 EQU   IOBUNSQR                                                 00338000
IOBRSV31 EQU   IOBUNSQR                                                 00339000
IOBRSV30 EQU   IOBUNSQR                                                 00340000
IOBKNRWR EQU   IOBUNSQR                                                 00341000
IOBKNWR  EQU   IOBUNSQR                                                 00342000
IOBNTAV2 EQU   IOBUNSQR                                                 00343000
IOBNTAV1 EQU   IOBUNSQR                                                 00344000
IOBCPBSY EQU   IOBUNSQR                                                 00345000
IOBCHNNL EQU   IOBINDCT                                                 00346000
IOBRSV29 EQU   IOBINDCT                                                 00347000
IOBRSV28 EQU   IOBINDCT                                                 00348000
IOBRSV27 EQU   IOBINDCT                                                 00349000
IOBKEYAD EQU   IOBINDCT                                                 00350000
IOBOVPTR EQU   IOBINDCT                                                 00351000
IOBUNSCH EQU   IOBINDCT                                                 00352000
IOBDEQCP EQU   IOBINDCT                                                 00353000
IOBCCWAD EQU   IOBORG08                                                 00354000
W1IEXTEN EQU   W1OEXTEN                                                 00355000
IOBCCW   EQU   IOBORG06+8                                               00356000
IOBNXTPB EQU   IOBNXTPT+1                                               00357000
IOBRSV26 EQU   IOBSTATA                                                 00358000
IOBRSV25 EQU   IOBSTATA                                                 00359000
IOBRSV24 EQU   IOBSTATA                                                 00360000
IOBRSV23 EQU   IOBSTATA                                                 00361000
IOBRSV22 EQU   IOBSTATA                                                 00362000
IOBRSV21 EQU   IOBSTATA                                                 00363000
IOBRSV20 EQU   IOBSTATA                                                 00364000
IOBAVLFL EQU   IOBSTATA                                                 00365000
IOBRSV37 EQU   IOBORG06+1                                               00366000
IOBUCBXG EQU   IOBORG06                                                 00367000
IOBCPA   EQU   IOBORG05+32                                              00368000
IOBERINF EQU   IOBORG05+16                                              00369000
IOBERCCW EQU   IOBORG05+8                                               00370000
IOBSNDPT EQU   IOBORG05+7                                               00371000
IOBRCVPT EQU   IOBORG05+6                                               00372000
IOBWORK  EQU   IOBORG05+1                                               00373000
IOBUCBX  EQU   IOBORG05                                                 00374000
IOBR     EQU   IOBSEEK+7                                                00375000
IOBHH2   EQU   IOBHH+1                                                  00376000
IOBHH1   EQU   IOBHH                                                    00377000
IOBCC2   EQU   IOBCC+1                                                  00378000
IOBCC1   EQU   IOBCC                                                    00379000
IOBBB2   EQU   IOBBB+1                                                  00380000
IOBBB1   EQU   IOBBB                                                    00381000
IOBM     EQU   IOBSEEK                                                  00382000
IOBRSV46 EQU   IOBFL4                                                   00383000
IOBRSV47 EQU   IOBFL4                                                   00384000
IOBENT   EQU   IOBFL4                                                   00385000
IOBEQP   EQU   IOBFL4                                                   00386000
IOBBUS   EQU   IOBFL4                                                   00387000
IOBDCK   EQU   IOBFL4                                                   00388000
IOBREJ   EQU   IOBFL4                                                   00389000
IOBOVR   EQU   IOBFL4                                                   00390000
IOBCRILC EQU   IOBORG04+1                                               00391000
IOBCRDCC EQU   IOBORG04                                                 00392000
IOBGQECB EQU   IOBORG03                                                 00393000
IOBSWAP  EQU   IOBORG02+4                                               00394000
IOBDQADB EQU   IOBDQADA+1                                               00395000
IOBRSV13 EQU   IOBDEQIN                                                 00396000
IOBRSV12 EQU   IOBDEQIN                                                 00397000
IOBRSV11 EQU   IOBDEQIN                                                 00398000
IOBRSV10 EQU   IOBDEQIN                                                 00399000
IOBRSV09 EQU   IOBDEQIN                                                 00400000
IOBRSV08 EQU   IOBDEQIN                                                 00401000
IOBRSV07 EQU   IOBDEQIN                                                 00402000
IOBDEQ   EQU   IOBDEQIN                                                 00403000
IOBNECB  EQU   IOBORG01+4                                               00404000
IOBNIOBB EQU   IOBNIOBA+1                                               00405000
IOBFIRST EQU   IOBNFLG1                                                 00406000
IOBUPERR EQU   IOBNFLG1                                                 00407000
IOBSPAN  EQU   IOBNFLG1                                                 00408000
IOBBKSPC EQU   IOBNFLG1                                                 00409000
IOBUPDAT EQU   IOBNFLG1                                                 00410000
IOBREAD  EQU   IOBNFLG1                                                 00411000
IOBWRITE EQU   IOBNFLG1                                                 00412000
IOBPRTOV EQU   IOBNFLG1                                                 00413000
@NM00031 EQU   CCW+1                                                    00414000
@NM00030 EQU   PLIST+1                                                  00415000
DCBEOB   EQU   IHADCS40+20                                              00416000
DCBPRECL EQU   IHADCS40+18                                              00417000
@NM00029 EQU   IHADCS40+16                                              00418000
@NM00028 EQU   @NM00026+1                                               00419000
@NM00027 EQU   DCBEROPT                                                 00420000
DCBERABE EQU   DCBEROPT                                                 00421000
DCBERSKP EQU   DCBEROPT                                                 00422000
DCBERACC EQU   DCBEROPT                                                 00423000
@NM00025 EQU   IHADCS40+10                                              00424000
@NM00024 EQU   IHADCS40+9                                               00425000
@NM00023 EQU   IHADCS40+8                                               00426000
DCBRECA  EQU   DCBRECAD+1                                               00427000
@NM00022 EQU   DCBRECBT                                                 00428000
DCBRCFGT EQU   DCBRCREL                                                 00429000
DCBRCTRU EQU   DCBRCREL                                                 00430000
DCBLCCW  EQU   DCBEOBAD                                                 00431000
DCBNOTE  EQU   DCBCNTRL                                                 00432000
DCBLRECL EQU   IHADCS38+10                                              00433000
@NM00021 EQU   IHADCS38+8                                               00434000
DCBEOBW  EQU   IHADCS38+4                                               00435000
DCBEOBRA EQU   DCBEOBR+1                                                00436000
DCBNCP   EQU   DCBEOBR                                                  00437000
@NM00020 EQU   DCBFLAG1                                                 00438000
DCBSTFLS EQU   DCBFLAG1                                                 00439000
DCBSTQCK EQU   DCBFLAG1                                                 00440000
DCBDIRCQ EQU   DCBBUFOF                                                 00441000
DCBQSTRU EQU   DCBUSASI                                                 00442000
@NM00019 EQU   DCBUSASI                                                 00443000
DCBQADF3 EQU   DCBQADFS                                                 00444000
DCBQADF2 EQU   DCBQADFS                                                 00445000
DCBQADF1 EQU   DCBQADFS                                                 00446000
DCBBLBP  EQU   DCBUSASI                                                 00447000
@NM00018 EQU   DCBUSASI                                                 00448000
DCBCICBA EQU   DCBCICB+1                                                00449000
@NM00017 EQU   DCBCICB                                                  00450000
DCBOFFSW EQU   IHADCS36+15                                              00451000
DCBOFFSR EQU   IHADCS36+14                                              00452000
DCBWCPL  EQU   IHADCS36+13                                              00453000
DCBWCPO  EQU   IHADCS36+12                                              00454000
DCBBLKSI EQU   IHADCS36+10                                              00455000
DCBCNQSM EQU   DCBCIND2                                                 00456000
DCBCNFEO EQU   DCBCIND2                                                 00457000
DCBCNCHS EQU   DCBCIND2                                                 00458000
DCBCNBFP EQU   DCBCIND2                                                 00459000
DCBCNIOE EQU   DCBCIND2                                                 00460000
DCBCNCLO EQU   DCBCIND2                                                 00461000
DCBCNWRO EQU   DCBCIND2                                                 00462000
DCBCNSTO EQU   DCBCIND2                                                 00463000
DCBCNEXB EQU   DCBCIND1                                                 00464000
@NM00016 EQU   DCBCIND1                                                 00465000
DCBCNBRM EQU   DCBCIND1                                                 00466000
@NM00015 EQU   DCBCIND1                                                 00467000
DCBCNEVA EQU   DCBCIND1                                                 00468000
DCBCNEVB EQU   DCBCIND1                                                 00469000
DCBCNSRD EQU   DCBCIND1                                                 00470000
DCBCNTOV EQU   DCBCIND1                                                 00471000
DCBSYNA  EQU   DCBSYNAD+1                                               00472000
DCBIOBL  EQU   DCBSYNAD                                                 00473000
DCBCHCKA EQU   DCBPERRA                                                 00474000
@NM00014 EQU   DCBOPTCD                                                 00475000
DCBOPTT  EQU   DCBOPTCD                                                 00476000
DCBSRCHD EQU   DCBOPTZ                                                  00477000
DCBOPTQ  EQU   DCBOPTCD                                                 00478000
DCBBCKPT EQU   DCBOPTO                                                  00479000
DCBOPTC  EQU   DCBOPTCD                                                 00480000
DCBOPTU  EQU   DCBOPTCD                                                 00481000
DCBOPTW  EQU   DCBOPTCD                                                 00482000
DCBPUT   EQU   DCBGET                                                   00483000
DCBREAD  EQU   DCBWRITE                                                 00484000
DCBDEBA  EQU   DCBDEBAD+1                                               00485000
@NM00013 EQU   DCBIFLGS                                                 00486000
DCBIFIOE EQU   DCBIFLGS                                                 00487000
DCBIFPCT EQU   DCBIFLGS                                                 00488000
DCBIFEC  EQU   DCBIFLGS                                                 00489000
DCBMFSTI EQU   DCBMFDMD                                                 00490000
DCBMFAWR EQU   DCBMFSTK                                                 00491000
DCBMFUIP EQU   DCBMFTMD                                                 00492000
DCBMFIDW EQU   DCBMFLCP                                                 00493000
DCBMFWRK EQU   DCBMFMVP                                                 00494000
DCBMFRDQ EQU   DCBMFWRT                                                 00495000
DCBMFGTQ EQU   DCBMFPUT                                                 00496000
DCBMFSTL EQU   DCBMACF2                                                 00497000
DCBMFCK  EQU   DCBMFDMG                                                 00498000
DCBMFRDX EQU   DCBMFCHK                                                 00499000
DCBMFDBF EQU   DCBMFSBG                                                 00500000
DCBMFRDI EQU   DCBMFLCG                                                 00501000
DCBMFRDK EQU   DCBMFMVG                                                 00502000
DCBMFWRQ EQU   DCBMFRD                                                  00503000
DCBMFPTQ EQU   DCBMFGET                                                 00504000
DCBMFECP EQU   DCBMACF1                                                 00505000
DCBTIOT  EQU   IHADCS25                                                 00506000
DCBMRSTI EQU   DCBMRDMD                                                 00507000
DCBMRAWR EQU   DCBMRSTK                                                 00508000
DCBMRUIP EQU   DCBMRTMD                                                 00509000
DCBMRIDW EQU   DCBMRLCP                                                 00510000
DCBMRWRK EQU   DCBMRMVP                                                 00511000
DCBMRRDQ EQU   DCBMRWRT                                                 00512000
DCBMRGTQ EQU   DCBMRPUT                                                 00513000
DCBMRSTL EQU   DCBMACR2                                                 00514000
DCBMRCK  EQU   DCBMRDMG                                                 00515000
DCBPGFXA EQU   DCBMRRDX                                                 00516000
DCBMRDBF EQU   DCBMRSBG                                                 00517000
DCBMRRDI EQU   DCBMRLCG                                                 00518000
DCBMRRDK EQU   DCBMRMVG                                                 00519000
DCBMRWRQ EQU   DCBMRRD                                                  00520000
DCBMRPTQ EQU   DCBMRGET                                                 00521000
DCBMRECP EQU   DCBMACR1                                                 00522000
@NM00012 EQU   DCBIFLG                                                  00523000
DCBIBIOE EQU   DCBIFLG                                                  00524000
DCBIBPCT EQU   DCBIFLG                                                  00525000
DCBIBEC  EQU   DCBIFLG                                                  00526000
DCBOFIOF EQU   DCBOFLGS                                                 00527000
DCBOFUEX EQU   DCBOFLGS                                                 00528000
DCBOFTM  EQU   DCBOFLGS                                                 00529000
DCBOFPPC EQU   DCBOFLGS                                                 00530000
DCBOFOPN EQU   DCBOFLGS                                                 00531000
DCBOFEOV EQU   DCBOFLGS                                                 00532000
DCBOFLRB EQU   DCBOFLGS                                                 00533000
DCBOFIOD EQU   DCBOFLWR                                                 00534000
DCBDDNAM EQU   IHADCS24                                                 00535000
DCBEXLSA EQU   DCBEXLST+1                                               00536000
DCBRECKL EQU   DCBRECFM                                                 00537000
DCBRECCC EQU   DCBRECFM                                                 00538000
DCBRECSB EQU   DCBRECFM                                                 00539000
DCBRECBR EQU   DCBRECFM                                                 00540000
DCBRECTO EQU   DCBRECLA                                                 00541000
DCBRECL  EQU   DCBRECLA                                                 00542000
DCBEODA  EQU   DCBEODAD+1                                               00543000
DCBBFA   EQU   DCBBFTEK                                                 00544000
DCBH0    EQU   DCBBFTEK                                                 00545000
DCBBFTKD EQU   DCBBFTEK                                                 00546000
DCBBFTE  EQU   DCBBFT                                                   00547000
DCBBFTKR EQU   DCBBFT                                                   00548000
DCBBFTS  EQU   DCBBFT                                                   00549000
DCBH1    EQU   DCBBFTEK                                                 00550000
DCBSVCXA EQU   DCBSVCXL+1                                               00551000
@NM00011 EQU   DCBSVCXL                                                 00552000
DCBODEBA EQU   DCBIOBAA                                                 00553000
@NM00010 EQU   DCBQSLM                                                  00554000
DCBUPDBT EQU   DCBQSLM                                                  00555000
DCBUPDCM EQU   DCBQSLM                                                  00556000
DCB1DVDS EQU   DCBQSLM                                                  00557000
@NM00009 EQU   DCBDSRG2                                                 00558000
DCBACBM  EQU   DCBDSRG2                                                 00559000
@NM00008 EQU   DCBDSRG2                                                 00560000
DCBDSGTQ EQU   DCBDSRG2                                                 00561000
DCBDSGTX EQU   DCBDSRG2                                                 00562000
DCBDSGGS EQU   DCBDSRG2                                                 00563000
DCBDSGU  EQU   DCBDSRG1                                                 00564000
DCBDSGPO EQU   DCBDSRG1                                                 00565000
DCBDSGMQ EQU   DCBDSRG1                                                 00566000
DCBDSGCQ EQU   DCBDSRG1                                                 00567000
DCBDSGCX EQU   DCBDSRG1                                                 00568000
DCBDSGDA EQU   DCBDSRG1                                                 00569000
DCBDSGPS EQU   DCBDSRG1                                                 00570000
DCBDSGIS EQU   DCBDSRG1                                                 00571000
DCBBUFL  EQU   IHADCS11+8                                               00572000
DCBBUFCA EQU   DCBBUFCB+1                                               00573000
DCBBUFNO EQU   DCBBUFCB                                                 00574000
DCBDEVT  EQU   DCBREL                                                   00575000
DCBKEYLE EQU   DCBRELB                                                  00576000
@NM00007 EQU   IHADCS10+19                                              00577000
DCBAPPIN EQU   IHADCS10+18                                              00578000
@NM00006 EQU   IHADCS10+17                                              00579000
DCBMRUE  EQU   DCBMRFLG                                                 00580000
DCBMRDWT EQU   DCBMRFLG                                                 00581000
DCBMRPCC EQU   DCBMRFLG                                                 00582000
DCBMRDR  EQU   DCBMRFLG                                                 00583000
DCBMRDRU EQU   DCBMRFLG                                                 00584000
DCBMRDBG EQU   DCBMRFLG                                                 00585000
DCBMRSCC EQU   DCBMRFLG                                                 00586000
DCBECBLA EQU   DCBHDR+1                                                 00587000
DCBMRERS EQU   DCBMRIND                                                 00588000
DCBMRERP EQU   DCBMRIND                                                 00589000
DCBMRPLS EQU   DCBMRIND                                                 00590000
DCBMRPLO EQU   DCBMRIND                                                 00591000
DCBMRSCU EQU   DCBMRIND                                                 00592000
DCBMRDCT EQU   DCBMRIND                                                 00593000
DCBIMAGA EQU   DCBIMAGE+1                                               00594000
@NM00005 EQU   DCBMRFG                                                  00595000
DCBMRBCT EQU   DCBMRFG                                                  00596000
DCBSSADA EQU   DCBIMG+1                                                 00597000
@NM00004 EQU   DCBIMG                                                   00598000
@NM00003 EQU   IHADCS10                                                 00599000
DCBWTOIA EQU   DCBWTOID+1                                               00600000
@NM00002 EQU   DCBWTOID                                                 00601000
@NM00001 EQU   IHADCB                                                   00602000
IOBERRCT EQU   IOBSTDRD+30                                              00603000
IOBRSV19 EQU   IOBINCAM+1                                               00604000
IOBOLTST EQU   IOBBTAMF                                                 00605000
IOBRFTMG EQU   IOBBTAMF                                                 00606000
IOBRSV17 EQU   IOBBTAMF                                                 00607000
IOBRSV16 EQU   IOBBTAMF                                                 00608000
IOBRSV15 EQU   IOBBTAMF                                                 00609000
IOBRSV14 EQU   IOBBTAMF                                                 00610000
IOBINUSE EQU   IOBBTAMF                                                 00611000
IOBPRMER EQU   IOBBTAMF                                                 00612000
IOBRSTRB EQU   IOBRESTR+1                                               00613000
IOBREPOS EQU   IOBRESTR                                                 00614000
IOBDCBPB EQU   IOBDCBPT+1                                               00615000
IOBRSV44 EQU   IOBFLAG4                                                 00616000
IOBRSV43 EQU   IOBFLAG4                                                 00617000
IOBRSV42 EQU   IOBFLAG4                                                 00618000
IOBRSV41 EQU   IOBFLAG4                                                 00619000
IOBRSV40 EQU   IOBFLAG4                                                 00620000
IOBRSV39 EQU   IOBFLAG4                                                 00621000
IOBRSV38 EQU   IOBFLAG4                                                 00622000
IOBGDPOL EQU   IOBFLAG4                                                 00623000
IOBSTRTB EQU   IOBSTART+1                                               00624000
IOBSIOCC EQU   IOBSTART                                                 00625000
IOBSTBYT EQU   IOBIOCSW+3                                               00626000
IOBCMDA  EQU   IOBIOCSW                                                 00627000
IOBLOG   EQU   IOBFL3                                                   00628000
IOBICL   EQU   IOBFL3                                                   00629000
IOBMSG   EQU   IOBFL3                                                   00630000
IOBCNC   EQU   IOBFL3                                                   00631000
IOBACU   EQU   IOBFL3                                                   00632000
IOBCDC   EQU   IOBFL3                                                   00633000
IOBICC   EQU   IOBFL3                                                   00634000
IOBCCC   EQU   IOBFL3                                                   00635000
IOBECBPB EQU   IOBECBPT+1                                               00636000
IOBECBCC EQU   IOBECBPT                                                 00637000
IOBS1B7  EQU   IOBSENS1                                                 00638000
IOBS1B6  EQU   IOBSENS1                                                 00639000
IOBS1B5  EQU   IOBSENS1                                                 00640000
IOBS1B4  EQU   IOBSENS1                                                 00641000
IOBS1B3  EQU   IOBSENS1                                                 00642000
IOBS1B2  EQU   IOBSENS1                                                 00643000
IOBS1B1  EQU   IOBSENS1                                                 00644000
IOBS1B0  EQU   IOBSENS1                                                 00645000
IOBSNSC9 EQU   IOBS0B7                                                  00646000
IOBS0B6  EQU   IOBSENS0                                                 00647000
IOBS0B5  EQU   IOBSENS0                                                 00648000
IOBS0B4  EQU   IOBSENS0                                                 00649000
IOBS0B3  EQU   IOBSENS0                                                 00650000
IOBS0B2  EQU   IOBSENS0                                                 00651000
IOBS0B1  EQU   IOBSENS0                                                 00652000
IOBS0B0  EQU   IOBSENS0                                                 00653000
IOBPNCH  EQU   IOBFLAG2                                                 00654000
IOBSTATO EQU   IOBFLAG2                                                 00655000
IOBSKUPD EQU   IOBFLAG2                                                 00656000
IOBALTTR EQU   IOBFLAG2                                                 00657000
IOBRRT2  EQU   IOBRDHA0                                                 00658000
IOBRRT3  EQU   IOBPURGE                                                 00659000
IOBSENSE EQU   IOBFLAG2                                                 00660000
IOBHALT  EQU   IOBFLAG2                                                 00661000
IOBSPSVC EQU   IOBRSTRT                                                 00662000
IOBUNREL EQU   IOBFLAG1                                                 00663000
IOBIOERR EQU   IOBFLAG1                                                 00664000
IOBFCREX EQU   IOBCYCCK                                                 00665000
IOBRPSTN EQU   IOBFLAG1                                                 00666000
IOBERRTN EQU   IOBFLAG1                                                 00667000
IOBCMDCH EQU   IOBFLAG1                                                 00668000
IOBDATCH EQU   IOBFLAG1                                                 00669000
IOBCNOPA EQU   IOBPREFX+12                                              00670000
IOBCICB  EQU   IOBPREFX+8                                               00671000
IOBCECB  EQU   IOBPREFX+4                                               00672000
IOBCONOP EQU   IOBPREFX+3                                               00673000
IOBCINOP EQU   IOBPREFX+2                                               00674000
IOBRSV05 EQU   IOBPREFX+1                                               00675000
IOBPCI   EQU   IOBCFLG1                                                 00676000
IOBRSTCH EQU   IOBCFLG1                                                 00677000
IOBABAPP EQU   IOBCFLG1                                                 00678000
IOBPTST  EQU   IOBCFLG1                                                 00679000
IOBRSV04 EQU   IOBCFLG1                                                 00680000
IOBRSV03 EQU   IOBCFLG1                                                 00681000
IOBRSV02 EQU   IOBCFLG1                                                 00682000
IOBRSV01 EQU   IOBCFLG1                                                 00683000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      00684000
@RF00041 EQU   @EL00001                                                 00685000
@RC00039 EQU   @EL00001                                                 00686000
@ENDDATA EQU   *                                                        00687000
         END   IGG019UO,(C'PL/S-II',0402,73136)                         00688000
./  ADD  SSI=61550233,NAME=IGG0197V
         TITLE 'IGG0197V, OPEN EXECUTOR FOR 3890 MICR READER           *00001000
                        '                                               00002000
IGG0197V CSECT ,                                                   0001 00003000
@PROLOG  BALR  @03,0                                               0001 00004000
@PSTART  DS    0H                                                  0001 00005000
         USING @PSTART,@03                                         0001 00006000
RBPRFXLN EQU 64                                                         00007000
RBPRFLNA EQU 32                                                         00008000
PRBLEN   EQU 136                                                        00009000
SIRBLEN  EQU 200                                                        00010000
TIRBLEN  EQU 136                                                        00011000
IRBLEN   EQU 128                                                        00012000
SVRBLEN  EQU 200                                                        00013000
         USING WTG,RWTG                                                 00014000
         USING FORCORE,RCORE                                            00015000
*   DO WHILE(EXECID¬=OPENID&        /* DO UNTIL LAST ENTRY IN WTG OR */ 00016000
*         EXECID¬=PDLOADID);        /* ID FOR PROBLEM DETERMINATION  */ 00017000
         B     @DE00102                                            0102 00018000
@DL00102 DS    0H                                                  0103 00019000
*     IF EXECID=ACMETHID THEN       /* WTG ID FOR THIS EXECUTOR ?    */ 00020000
         CLC   EXECID(2,RWTGC),ACMETHID                            0103 00021000
         BNE   @RF00103                                            0103 00022000
*       DO;                         /* YES,THEN DO...                */ 00023000
*         RCORE=OPNWRK;             /* SET POINTER TO OPEN WORKAREA  */ 00024000
         L     RCORE,OPNWRK-1(,RWTGC)                              0105 00025000
         LA    RCORE,0(,RCORE)                                     0105 00026000
*/********************************                                   */ 00027000
*/* VERIFY OPEN MODULE PARAMETERS                                    */ 00028000
*/********************************                                   */ 00029000
*                                                                  0106 00030000
*VERIFY:                                                           0106 00031000
*         RDCB=DCBADDR;             /* INITIALIZE POINTER TO USER DCB*/ 00032000
VERIFY   L     RDCB,DCBADDR-1(,RPARC)                              0106 00033000
         LA    RDCB,0(,RDCB)                                       0106 00034000
*         DEBPTR=DCBDEBAD;          /* GET DEB ADDRESS       @ZA04478*/ 00035000
         L     @14,DCBDEBAD+40(,DCBPTR)                            0107 00036000
         ST    @14,DEBPTR                                          0107 00037000
*         TCBPTR=DEBTCBAD;          /* GET TCB ADDRESS       @ZA04478*/ 00038000
         L     @14,DEBPTR                                          0108 00039000
         L     TCBPTR,DEBTCBAD(,@14)                               0108 00040000
*         IF OPTIONX=INPUT THEN     /* VERIFY DCB OPENED FOR INPUT   */ 00041000
         TM    OPTIONX(RPARC),B'01111111'                          0109 00042000
         BNZ   @RF00109                                            0109 00043000
*           IF DCBDSGPS='1'B&       /* VERIFY DSORG=PS               */ 00044000
*               DCBMFMVG='1'B THEN  /* VERIFY MACRF=GM               */ 00045000
         TM    DCBDSGPS+16(DCBPTR),B'01000000'                     0110 00046000
         BNO   @RF00110                                            0110 00047000
         TM    DCBMFMVG+40(DCBPTR),B'00010000'                     0110 00048000
         BNO   @RF00110                                            0110 00049000
*             IF DCBHDR¬=0 THEN     /* VERIFY DCBHDR SPECIFIED       */ 00050000
         L     @14,DCBHDR(,DCBPTR)                                 0111 00051000
         LTR   @14,@14                                             0111 00052000
         BZ    @RF00111                                            0111 00053000
*               REG0=0;             /* INDICATE VALID PARAMETERS     */ 00054000
         SLR   REG0,REG0                                           0112 00055000
*             ELSE                  /* IF DCBHDR NOT SPECIFIED,THEN  */ 00056000
*               REG0=RTNCODE3;      /* RETURN CODE-DCBHDR ERROR      */ 00057000
         B     @RC00111                                            0113 00058000
@RF00111 LA    REG0,223                                            0113 00059000
*           ELSE                    /* SET RETURN CODE FOR INVALID...*/ 00060000
*             REG0=RTNCODE2;        /* MACRF OR DCB NOT QSAM         */ 00061000
         B     @RC00110                                            0114 00062000
@RF00110 LA    REG0,116                                            0114 00063000
*         ELSE                      /* SET RETURN CODE FOR...        */ 00064000
*           REG0=RTNCODE1;          /* DCB NOT INPUT                 */ 00065000
         B     @RC00109                                            0115 00066000
@RF00109 LA    REG0,113                                            0115 00067000
*         IF REG0¬=0 THEN           /* IF INVALID PARAMETER EXISTS...*/ 00068000
@RC00109 LTR   REG0,REG0                                           0116 00069000
         BZ    @RF00116                                            0116 00070000
*           DO;                     /* THEN DO THE FOLLOWING...      */ 00071000
*             RCORE=OPNWRK;         /* SET POINTER TO OPEN WORKAREA  */ 00072000
         L     RCORE,OPNWRK-1(,RWTGC)                              0118 00073000
         LA    RCORE,0(,RCORE)                                     0118 00074000
*             DXCALLID=WTGID01;     /* SAVE ID OF CALLING MODULE   0119 00075000
*                                                            @YM02504*/ 00076000
         MVC   DXCALLID(2),WTGID01(RWTG)                           0119 00077000
*             IDTTR=PDLOAD;         /* MOVE ID & TTR INTO WTG TABLE  */ 00078000
         MVC   IDTTR(5,RWTGC),PDLOAD                               0120 00079000
*           END;                                                   0121 00080000
*         DCBBFT=SIMPLE;            /* SET BFTEK=SIMPLE              */ 00081000
@RF00116 NI    DCBBFT+28(DCBPTR),B'11001111'                       0122 00082000
         OI    DCBBFT+28(DCBPTR),B'01000000'                       0122 00083000
*         IF EXECID¬=PDLOADID THEN  /* IF ID STILL FOR THIS EXECUTOR */ 00084000
         CLC   EXECID(2,RWTGC),PDLOADID                            0123 00085000
         BE    @RF00123                                            0123 00086000
*           DO;                     /* THEN DO THE FOLLOWING...      */ 00087000
*/******************************************                         */ 00088000
*/* GET CORE FOR IOB ,CCWS AND WRITE BUFFER                          */ 00089000
*/******************************************                         */ 00090000
*                                                                  0125 00091000
*IOBGET:                                                           0125 00092000
*             REG0=IOBLEN+CCWSLEN;  /* CORE SIZE=IOB + CCWS LENGTH   */ 00093000
IOBGET   LA    REG0,192                                            0125 00094000
*             IF DCBIMG¬=0 THEN     /* IF IMAGE PROCESSING WANTED,   */ 00095000
         L     @14,DCBIMG(,DCBPTR)                                 0126 00096000
         LTR   @14,@14                                             0126 00097000
         BZ    @RF00126                                            0126 00098000
*               REG0=REG0+DCBBLKSI; /* THEN ADD SIZE OF WRITE BUFFER */ 00099000
         AH    REG0,DCBBLKSI+52(,DCBPTR)                           0127 00100000
*             REG1=REG0;            /* SAVE LENGTH OF CORE NEEDED    */ 00101000
@RF00126 LR    REG1,REG0                                           0128 00102000
*             GEN(SRA REG0,3                 DOUBLEWORDS);         0129 00103000
         SRA REG0,3                 DOUBLEWORDS                         00104000
*             DCBIOBL=REG0;         /* SAVE DOUBLEWORD LEN IN DCB  0130 00105000
*                                                            @ZA08239*/ 00106000
         STC   REG0,DCBIOBL+52(,DCBPTR)                            0130 00107000
*             DO;                   /* MODESET EXTKEY(DATAMGT)       */ 00108000
*               SPKA(80);           /* SET PSW KEY                   */ 00109000
         LA    @14,80                                              0132 00110000
         SPKA  0(@14)                                              0132 00111000
*             END;                  /* MODESET EXTKEY(DATAMGT) GET D.   00112000
*                                      M. KEY                @YM02504*/ 00113000
*             DO;                   /* MODESET KEYADDR(DXUKEY)     0134 00114000
*                                      WORKREG(REG15)                */ 00115000
*               REG15=DXUKEY;       /* GET KEY FORM SAVE LOCATION    */ 00116000
         SLR   REG15,REG15                                         0135 00117000
         IC    REG15,DXUKEY                                        0135 00118000
*               SPKA(REG15);        /* SET PSW KEY                   */ 00119000
         SPKA  0(REG15)                                            0136 00120000
*             END;                  /* MODESET KEYADDR(DXUKEY)     0137 00121000
*                                      WORKREG(REG15) GET USER KEY 0137 00122000
*                                                            @YM02504*/ 00123000
*             GEN(GETMAIN R,LV=(1),SP=250    GET CORE FOR IOB);    0138 00124000
         GETMAIN R,LV=(1),SP=250    GET CORE FOR IOB                    00125000
*             DO;                   /* MODESET EXTKEY(DATAMGT)       */ 00126000
*               SPKA(80);           /* SET PSW KEY                   */ 00127000
         LA    @14,80                                              0140 00128000
         SPKA  0(@14)                                              0140 00129000
*             END;                  /* MODESET EXTKEY(DATAMGT) GET 0141 00130000
*                                      D.M. PROTECT KEY      @YM02504*/ 00131000
*             DCBIOBA=IOBPRPTR;     /* SAVE IOB ADDRESS IN DCB       */ 00132000
         ST    IOBPRPTR,DCBIOBA+52(,DCBPTR)                        0142 00133000
*             DO;                   /* MODESET KEYADDR(DXUKEY)     0143 00134000
*                                      WORKREG(REG15)                */ 00135000
*               REG15=DXUKEY;       /* GET KEY FORM SAVE LOCATION    */ 00136000
         SLR   REG15,REG15                                         0144 00137000
         IC    REG15,DXUKEY                                        0144 00138000
*               SPKA(REG15);        /* SET PSW KEY                   */ 00139000
         SPKA  0(REG15)                                            0145 00140000
*             END;                  /* MODESET KEYADDR(DXUKEY)     0146 00141000
*                                      WORKREG(REG15) GET USR KEY  0146 00142000
*                                                            @YM02504*/ 00143000
*/************************                                           */ 00144000
*/* INITIALIZE IOB FIELDS                                            */ 00145000
*/************************                                           */ 00146000
*                                                                  0147 00147000
*IOBINIT:                                                          0147 00148000
*             IOBSTPTR=IOBPRPTR+PRFXLN;/* SET PTR TO IOB STANDARD  0147 00149000
*                                                             SEGMENT*/ 00150000
IOBINIT  LA    IOBSTPTR,8                                          0147 00151000
         ALR   IOBSTPTR,IOBPRPTR                                   0147 00152000
*             IOB=IOB&&IOB;         /* INIT IOB AND CCW'S    @ZA04453*/ 00153000
         XC    IOB-8(192,IOBPRPTR),IOB-8(IOBPRPTR)                 0148 00154000
*             IOBNIOBA=IOBPRPTR;    /* LINK IOB TO ITSELF            */ 00155000
         ST    IOBPRPTR,IOBNIOBA-8(,IOBPRPTR)                      0149 00156000
*             IOBCMDCH='1'B;        /* INDICATE COMMAND CHAINING     */ 00157000
         OI    IOBCMDCH(IOBSTPTR),B'01000000'                      0150 00158000
*             IOBECBPT=ADDR(IOBNECB);/* SET POINTER TO ECB IN IOB    */ 00159000
         LA    @14,IOBNECB-8(,IOBPRPTR)                            0151 00160000
         ST    @14,IOBECBPT(,IOBSTPTR)                             0151 00161000
*             IOBSTART=IOBPRPTR+IOBLEN;/* SET POINTER TO CCW CHAIN   */ 00162000
         LA    @14,56                                              0152 00163000
         ALR   @14,IOBPRPTR                                        0152 00164000
         ST    @14,IOBSTART(,IOBSTPTR)                             0152 00165000
*             IOBDCBPT=DXUDCBAD;    /* SET POINTER TO USER DCY02990  */ 00166000
         L     @14,DXUDCBAD                                        0153 00167000
         ST    @14,IOBDCBPT(,IOBSTPTR)                             0153 00168000
*             IOBFIRST='1'B;        /* SET FIRST IOB INDICATOR ON    */ 00169000
         OI    IOBFIRST-8(IOBPRPTR),B'00000001'                    0154 00170000
*/*****************                                                  */ 00171000
*/* BUILD CCWCHAIN                                                   */ 00172000
*/*****************                                                  */ 00173000
*                                                                  0155 00174000
*IOBCCWS:                                                          0155 00175000
*             CCWREG=IOBPRPTR+IOBLEN;/* SET POINTER TO CCW STRING  0155 00176000
*                                      AREA                          */ 00177000
IOBCCWS  LA    CCWREG,56                                           0155 00178000
         ALR   CCWREG,IOBPRPTR                                     0155 00179000
*             CCW1A2=CCWCHAIN;      /* BUILD ANTICIPATE CCW1,TIC CCW2*/ 00180000
         MVC   CCW1A2(16,CCWREG),CCWCHAIN                          0156 00181000
*             CCWADDR(2)=ADDR(CCW(14));/* DETERMINE TIC CCW2 TARGET     00182000
*                                      ADDR                          */ 00183000
         LA    @14,CCW+104(,CCWREG)                                0157 00184000
         STCM  @14,7,CCWADDR+8(CCWREG)                             0157 00185000
*             COUNT=DCBLRECL*4;     /* DETERMINE WRITE/READ CCW COUNT*/ 00186000
         LH    COUNT,DCBLRECL+72(,DCBPTR)                          0158 00187000
         SLA   COUNT,2                                             0158 00188000
*             DATADR=0;             /* SET BUFFER ADDRESS TO ZERO    */ 00189000
         SLR   DATADR,DATADR                                       0159 00190000
*             IF DCBIMG¬=0 THEN     /* IF IMAGE PROCESSING ACTIVE... */ 00191000
         L     @14,DCBIMG(,DCBPTR)                                 0160 00192000
         LTR   @14,@14                                             0160 00193000
         BZ    @RF00160                                            0160 00194000
*               DATADR=DCBIOBA+IOBLEN+CCWSLEN;/* SET IMAGE BUFFER  0161 00195000
*                                      ADDRESS                       */ 00196000
         LA    DATADR,192                                          0161 00197000
         AL    DATADR,DCBIOBA+52(,DCBPTR)                          0161 00198000
*             OPCODE=ADDR(WRTCODES);/* SET PTR TO WRITE CCW OP CODES */ 00199000
@RF00160 LA    OPCODE,WRTCODES                                     0162 00200000
*             STARTBLD=ADDR(CCW(3));/* SET PTR TO FIRST WRITE CCW    */ 00201000
         LA    STARTBLD,CCW+16(,CCWREG)                            0163 00202000
*             ENDBLD=ADDR(CCW(6));  /* SET PTR TO END OF WRITE CCWS  */ 00203000
         LA    ENDBLD,CCW+40(,CCWREG)                              0164 00204000
*             CALL BLDCCWS;         /* BUILD WRITE CCWS 3,4,5,AND 6  */ 00205000
         BAL   @14,BLDCCWS                                         0165 00206000
*             CCW7A8A9=CCWCHAIN;    /* BUILD ANTICIPATE CCW7,TIC   0166 00207000
*                                      CCW8,SENSE CCW9               */ 00208000
         LA    @14,CCW+48(,CCWREG)                                 0166 00209000
         MVC   CCW7A8A9(24,@14),CCWCHAIN                           0166 00210000
*             CCWADDR(8)=ADDR(CCW(10));/* DETERMINE TIC CCW TARGET 0167 00211000
*                                      ADDR                          */ 00212000
         LA    @14,CCW+72(,CCWREG)                                 0167 00213000
         STCM  @14,7,CCWADDR+56(CCWREG)                            0167 00214000
*             DATADR=IOBUFFER;      /* DETERMINE READ BUFFER ADDRESS */ 00215000
         L     @14,DCBBUFCB+16(,DCBPTR)                            0168 00216000
         L     DATADR,IOBUFFER(,@14)                               0168 00217000
*             OPCODE=ADDR(RDRCODES);/* SET PTR TO READ CCW OP CODES  */ 00218000
         LA    OPCODE,RDRCODES                                     0169 00219000
*             STARTBLD=ADDR(CCW(10));/* SET PTR TO START OF READ CCWS*/ 00220000
         LA    STARTBLD,CCW+72(,CCWREG)                            0170 00221000
*             ENDBLD=ADDR(CCW(13)); /* SET PTR TO END OF READ CCWS   */ 00222000
         LA    ENDBLD,CCW+96(,CCWREG)                              0171 00223000
*             CALL BLDCCWS;         /* BUILD READ CCWS 10,11,12,AND     00224000
*                                      13                            */ 00225000
         BAL   @14,BLDCCWS                                         0172 00226000
*             RDCHAIN2=RDCHAIN1;    /* DUPLICATE READ CCWS TO      0173 00227000
*                                      COMPLETE                      */ 00228000
         LA    @14,CCW+104(,CCWREG)                                0173 00229000
         LA    @12,CCW+72(,CCWREG)                                 0173 00230000
         MVC   RDCHAIN2(32,@14),RDCHAIN1(@12)                      0173 00231000
*/**************************************                             */ 00232000
*/* BUILD WRITE AND READ CCW SUBROUTINE                              */ 00233000
*/**************************************                             */ 00234000
*                                                                  0174 00235000
*BLDCCWS:                                                          0174 00236000
*             PROC OPTIONS(NOSAVE,NOSAVEAREA);                     0174 00237000
         B     @PB00002                                            0174 00238000
BLDCCWS  DS    0H                                                  0175 00239000
*             DO CCWPTR=STARTBLD TO ENDBLD BY 8;/* BUILD 4 WRT OR  0175 00240000
*                                      READ CCWS                     */ 00241000
         LR    CCWPTR,STARTBLD                                     0175 00242000
         B     @DE00175                                            0175 00243000
@DL00175 DS    0H                                                  0176 00244000
*               CCWOPCDE=CMDCODE;   /* CCW COMMAND CODE              */ 00245000
         MVC   CCWOPCDE(1,CCWPTR),CMDCODE(OPCODE)                  0176 00246000
*               CCWADR=DATADR;      /* CCW BUFFER ADDRESS            */ 00247000
         STCM  DATADR,7,CCWADR(CCWPTR)                             0177 00248000
*               CCWFLAGS=CMDCHAIN;  /* CCW FLAGS FIELD               */ 00249000
         MVI   CCWFLAGS(CCWPTR),X'40'                              0178 00250000
*               CCWCOUNT=COUNT;     /* CCW COUNT FIELD               */ 00251000
         STH   COUNT,CCWCOUNT(,CCWPTR)                             0179 00252000
*               DATADR=DATADR+COUNT;/* UPDATE BUFFER ADDRESS         */ 00253000
         ALR   DATADR,COUNT                                        0180 00254000
*               OPCODE=OPCODE+1;    /* UPDATE OP CODE POINTER        */ 00255000
         AL    OPCODE,@CF00085                                     0181 00256000
*             END;                  /*                               */ 00257000
         AL    CCWPTR,@CF00101                                     0182 00258000
@DE00175 CR    CCWPTR,ENDBLD                                       0182 00259000
         BNH   @DL00175                                            0182 00260000
*             CCWPTR=CCWPTR-8;      /* BACK PTR TO LAST CCW BUILT    */ 00261000
         SL    CCWPTR,@CF00101                                     0183 00262000
*             IF CCWRDROP='1'B THEN /* IF LAST CCW A READ CCW THEN...*/ 00263000
         TM    CCWRDROP(CCWPTR),B'00000010'                        0184 00264000
         BNO   @RF00184                                            0184 00265000
*               CCWFLAGS=NOCHAIN;   /* SET OFF COMMAND CHAINING FLAG */ 00266000
         MVI   CCWFLAGS(CCWPTR),X'00'                              0185 00267000
*             RETURN;               /* ON LAST CCW AND RETURN TO THE */ 00268000
@EL00002 DS    0H                                                  0186 00269000
@EF00002 DS    0H                                                  0186 00270000
@ER00002 BR    @14                                                 0186 00271000
*           END;                    /* MAINLINE ROUTINE              */ 00272000
         B     @EL00002                                            0187 00273000
@PB00002 DS    0H                                                  0188 00274000
*/*****************************************                          */ 00275000
*/* INITIALIZE DCB AND LOAD ACCESS MODULES                           */ 00276000
*/*****************************************                          */ 00277000
*                                                                  0188 00278000
*DCBINIT:                                                          0188 00279000
*         DO;                       /* MODESET EXTKEY(DATAMGT)       */ 00280000
DCBINIT  DS    0H                                                  0189 00281000
*           SPKA(80);               /* SET PSW KEY                   */ 00282000
         LA    @14,80                                              0189 00283000
         SPKA  0(@14)                                              0189 00284000
*         END;                      /* MODESET EXTKEY(DATAMGT) GET 0190 00285000
*                                      SYSTEM KEY Y02990             */ 00286000
*         DCBOFFSR=OFFSR;           /* OFFSET TO READ CCW FROM IOB   */ 00287000
         MVI   DCBOFFSR+52(DCBPTR),X'80'                           0191 00288000
*         DCBEOBAD=0;               /* SET END-OF-BLOCK CONDITION    */ 00289000
         SLR   @14,@14                                             0192 00290000
         ST    @14,DCBEOBAD+72(,DCBPTR)                            0192 00291000
*         DCBRECAD=0;               /* SET END-OF-BLOCK CONDITION    */ 00292000
         SLR   @14,@14                                             0193 00293000
         ST    @14,DCBRECAD+72(,DCBPTR)                            0193 00294000
*         REG1=ADDR(EOBID);         /* POINT TO EOB MODULE ID ENTRY  */ 00295000
         LA    REG1,EOBID                                          0194 00296000
*         CALL LOADMOD;             /* LINK TO LOAD ACCESS MODULE    */ 00297000
         BAL   @14,LOADMOD                                         0195 00298000
*         DCBEOB=REG0;              /* SAVE ADDRESS OF EOB MODULE    */ 00299000
         ST    REG0,DCBEOB+72(,DCBPTR)                             0196 00300000
*         REG1=ADDR(SYNCHID);       /* POINT TO SYNCH MODULE ID ENTRY*/ 00301000
         LA    REG1,SYNCHID                                        0197 00302000
*         CALL LOADMOD;             /* LINK TO LOAD ACCESS MODULE    */ 00303000
         BAL   @14,LOADMOD                                         0198 00304000
*         DCBGERR=REG0;             /* SAVE ADDRESS OF SYNCH MODULE  */ 00305000
         ST    REG0,DCBGERR+52(,DCBPTR)                            0199 00306000
*         REG1=ADDR(GETMID);        /* POINT TO GET MODULE ID ENTRY  */ 00307000
         LA    REG1,GETMID                                         0200 00308000
*         CALL LOADMOD;             /* LINK TO LOAD ACCESS MODULE    */ 00309000
         BAL   @14,LOADMOD                                         0201 00310000
*         DCBGETM=REG0;             /* SAVE ADDRESS OF GET MODULE    */ 00311000
         STCM  REG0,7,DCBGETM+48(DCBPTR)                           0202 00312000
*         IF DCBMFCRL='1'B THEN     /* IF THE CONTROL MODULE IS    0203 00313000
*                                      NEEDED                        */ 00314000
         TM    DCBMFCRL+40(DCBPTR),B'00000010'                     0203 00315000
         BNO   @RF00203                                            0203 00316000
*           DO;                     /* THEN DO THE FOLLOWING...      */ 00317000
*             REG1=ADDR(CNTRLID);   /* POINT TO CNTRL MODULE ID ENTRY*/ 00318000
         LA    REG1,CNTRLID                                        0205 00319000
*             CALL LOADMOD;         /* LINK TO LOAD ACCESS MODULE    */ 00320000
         BAL   @14,LOADMOD                                         0206 00321000
*             DCBCNTRL=REG0;        /* SAVE ADDRESS OF CNTRL MODULE  */ 00322000
         ST    REG0,DCBCNTRL+72(,DCBPTR)                           0207 00323000
*           END;                                                   0208 00324000
*                                                                  0208 00325000
*/*********************************                                  */ 00326000
*/* LOAD ACCESS MODULES SUBROUTINE                                   */ 00327000
*/*********************************                                  */ 00328000
*                                                                  0209 00329000
*LOADMOD:                           /* LOAD ACCESS MODULES SUBROUTINE*/ 00330000
*         PROC OPTIONS(NOSAVE,NOSAVEAREA);                         0209 00331000
         B     @PB00003                                            0209 00332000
LOADMOD  DS    0H                                                  0210 00333000
*         RFY                                                      0210 00334000
*           REG14 RSTD;                                            0210 00335000
*         WTGTTR01=AMODTTR;         /* MOVE ACCESS MODULE TTR TO DE     00336000
*                                                            @YM02504*/ 00337000
         MVC   WTGTTR01(3,RWTG),AMODTTR(REG1)                      0211 00338000
*         WTGID01=AMODID;           /* MOVE ACCESS MODULE ID TO DE 0212 00339000
*                                                            @YM02504*/ 00340000
         MVC   WTGID01(2,RWTG),AMODID(REG1)                        0212 00341000
*         REG0=AMODLN*DBLWRD;       /* CALCULATE ACCESS MODULE LENGTH*/ 00342000
         SLR   REG0,REG0                                           0213 00343000
         IC    REG0,AMODLN(,REG1)                                  0213 00344000
         SLA   REG0,3                                              0213 00345000
*         WTGMODLN=REG0;            /* SAVE MODULE LENGTH IN DE      */ 00346000
         STCM  REG0,7,WTGMODLN(RWTG)                               0214 00347000
*         WTGTEXT1=REG0;            /* STORE 2 BYTE MODULE LENGTH  0215 00348000
*                                                            @YM02504*/ 00349000
         STCM  REG0,3,WTGTEXT1(RWTG)                               0215 00350000
*         REG1=CVTSVDCB;            /* GET SVCLIB DCB ADDRESS        */ 00351000
         L     @12,CVTPTR                                          0216 00352000
         L     REG1,CVTSVDCB(,@12)                                 0216 00353000
*         DO;                       /* MODESET KEYADDR(DXUKEY)     0217 00354000
*                                      WORKREG(REG15)                */ 00355000
*           REG15=DXUKEY;           /* GET KEY FORM SAVE LOCATION    */ 00356000
         SLR   REG15,REG15                                         0218 00357000
         IC    REG15,DXUKEY                                        0218 00358000
*           SPKA(REG15);            /* SET PSW KEY                   */ 00359000
         SPKA  0(REG15)                                            0219 00360000
*         END;                      /* MODESET KEYADDR(DXUKEY)     0220 00361000
*                                      WORKREG(REG15) GET USER KEY 0220 00362000
*                                                            @YM02504*/ 00363000
*         GEN(LOAD DE=(RWTG),DCB=(REG1) LOAD ACCESS METHOD MODULE);     00364000
         LOAD DE=(RWTG),DCB=(REG1) LOAD ACCESS METHOD MODULE            00365000
*         DO;                       /* MODESET EXTKEY(DATAMGT)       */ 00366000
*           SPKA(80);               /* SET PSW KEY                   */ 00367000
         LA    @12,80                                              0223 00368000
         SPKA  0(@12)                                              0223 00369000
*         END;                      /* MODESET EXTKEY(DATAMGT) GET 0224 00370000
*                                      SYSTEM KEY Y02990             */ 00371000
*         RETURN;                   /* RETURN TO MAINLINE OF DCBINIT */ 00372000
@EL00003 DS    0H                                                  0225 00373000
@EF00003 DS    0H                                                  0225 00374000
@ER00003 BR    @14                                                 0225 00375000
*       END;                                                       0226 00376000
@PB00003 DS    0H                                                  0227 00377000
*     RFY                                                          0227 00378000
*       REG14 UNRSTD;                                              0227 00379000
*     EXECID=COMPLETE;              /* SET CURRENT WTG ENTRY COMPLETE*/ 00380000
         SLR   @14,@14                                             0228 00381000
         STH   @14,EXECID(,RWTGC)                                  0228 00382000
*     TCBPTR=DEBTCBAD;              /* GET TCB ADDRESS Y02990        */ 00383000
         L     @14,DEBPTR                                          0229 00384000
         L     TCBPTR,DEBTCBAD(,@14)                               0229 00385000
*     DO;                           /* MODESET EXTKEY(DATAMGT)       */ 00386000
*       SPKA(80);                   /* SET PSW KEY                   */ 00387000
         LA    @14,80                                              0231 00388000
         SPKA  0(@14)                                              0231 00389000
*     END;                          /* MODESET EXTKEY(DATAMGT) GET D.   00390000
*                                      M. KEY                @YM02504*/ 00391000
*/*                                                           Y02990 */ 00392000
*/* THIS ROUTINE WILL MOVE THE DATA MANGEMENT DCB BACK INTO   Y02990 */ 00393000
*/* THE USER DCB AREA                                         Y02990 */ 00394000
*                                                                  0233 00395000
*     DEBDCBB=DXUDCBAD;             /* PUT USER DCB INTO DEB @YM02504*/ 00396000
         L     @14,DEBPTR                                          0233 00397000
         MVC   DEBDCBB(3,@14),DXUDCBAD+1                           0233 00398000
*     GEN(IECRES INIT,DCBCOPY=FRWKAR,STM=(0,14,WTGPREFX));         0234 00399000
         IECRES INIT,DCBCOPY=FRWKAR,STM=(0,14,WTGPREFX)                 00400000
*     RWTGC=RWTGC+NXTID;            /* ADVANCE WTG PTR TO NEXT ID    */ 00401000
         AL    RWTGC,@CF00101                                      0235 00402000
*     RPARC=RPARC+NXTDCB;           /* ADVANCE DCB PTR TO NEXT ENTRY */ 00403000
         AL    RPARC,@CF00114                                      0236 00404000
*   END;                            /* GO CHECK NEXT EXECUTOR ID     */ 00405000
*   END;                            /* GO CHECK NEXT WTG ID ENTRY    */ 00406000
*   ELSE                            /* IF ID NOT FOR THIS EXECUTOR,  */ 00407000
*     DO;                           /* THEN DO THE FOLLOWING...      */ 00408000
         B     @RC00103                                            0239 00409000
@RF00103 DS    0H                                                  0240 00410000
*       RWTGC=RWTGC+NXTID;          /* ADVANCE WTG PTR TO NEXT ID    */ 00411000
         AL    RWTGC,@CF00101                                      0240 00412000
*       RPARC=RPARC+NXTDCB;         /* ADVANCE DCB PTR TO NEXT ENTRY */ 00413000
         AL    RPARC,@CF00114                                      0241 00414000
*     END;                          /* GO CHECK NEXT WTG ENTRY       */ 00415000
*   END;                            /*                               */ 00416000
@RC00103 DS    0H                                                  0243 00417000
@DE00102 CLC   EXECID(2,RWTGC),OPENID                              0243 00418000
         BE    @DC00102                                            0243 00419000
         CLC   EXECID(2,RWTGC),PDLOADID                            0243 00420000
         BNE   @DL00102                                            0243 00421000
@DC00102 DS    0H                                                  0244 00422000
*   IF EXECID¬=PDLOADID THEN        /* IF ID NOT FOR PD MODULE THEN..*/ 00423000
         CLC   EXECID(2,RWTGC),PDLOADID                            0244 00424000
         BE    @RF00244                                            0244 00425000
*     DO;                           /* DO THE FOLLOWING...           */ 00426000
*       RWTGC=RWTG+EXECID1;         /* POINT TO FIRST ID IN WTG TABLE*/ 00427000
         LA    RWTGC,32                                            0246 00428000
         ALR   RWTGC,RWTG                                          0246 00429000
*       RPARC=RPAR;                 /* POINT TO FIRST DCBLIST ENTRY  */ 00430000
         LR    RPARC,RPAR                                          0247 00431000
*       DO WHILE(EXECID=COMPLETE);  /* DO UNTIL WTG ENTRY NOT      0248 00432000
*                                      COMPLETE                      */ 00433000
         B     @DE00248                                            0248 00434000
@DL00248 DS    0H                                                  0249 00435000
*         RPARC=RPARC+NXTDCB;       /* ADVANCE DCB PTR TO NEXT ENTRY */ 00436000
         AL    RPARC,@CF00114                                      0249 00437000
*         RWTGC=RWTGC+NXTID;        /* ADVANCE WTG PTR TO NEXT ID    */ 00438000
         AL    RWTGC,@CF00101                                      0250 00439000
*       END;                        /* CONTINUE SEARCH FOR NON-ZERO     00440000
*                                      ID                            */ 00441000
@DE00248 LH    @14,EXECID(,RWTGC)                                  0251 00442000
         N     @14,@CF02705                                        0251 00443000
         LTR   @14,@14                                             0251 00444000
         BZ    @DL00248                                            0251 00445000
*       WTGCON=XCTLCON;             /* ATTR.,TOTAL LENGTH,TEXT LENGTH*/ 00446000
         MVC   WTGCON(7,RWTG),XCTLCON                              0252 00447000
*     END;                                                         0253 00448000
*   WTGID01=EXECID;                 /* PICK UP NEXT EXECUTOR ID    0254 00449000
*                                                            @YM02504*/ 00450000
@RF00244 MVC   WTGID01(2,RWTG),EXECID(RWTGC)                       0254 00451000
*   WTGTTR01=EXECTTR;               /* PICK UP NEXT EXECUTOR TRK ADDR   00452000
*                                                            @YM02504*/ 00453000
         MVC   WTGTTR01(3,RWTG),EXECTTR(RWTGC)                     0255 00454000
*   REG15=ADDR(DXXCTL);             /* POINT TO XCTL PARAMETER LIST  */ 00455000
         LA    REG15,DXXCTL                                        0256 00456000
*   GEN(XCTL DE=(RWTG),SF=(E,(REG15)) EXIT TO NEXT OPEN EXECUTOR); 0257 00457000
         XCTL DE=(RWTG),SF=(E,(REG15)) EXIT TO NEXT OPEN EXECUTOR       00458000
*   END IGG0197V                                                   0258 00459000
*                                                                  0258 00460000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 00461000
*/*%INCLUDE SYSUT5  (OPENSTG2)                                       */ 00462000
*/*%INCLUDE SYSUT5  (PROLOGUE)                                       */ 00463000
*/*%INCLUDE SYSUT5  (OPENDCLS)                                       */ 00464000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 00465000
*/*%INCLUDE SYSLIB  (IHARB   )                                       */ 00466000
*/*%INCLUDE SYSLIB  (IKJRB   )                                       */ 00467000
*/*%INCLUDE SYSLIB  (IEZDEB  )                                       */ 00468000
*/*%INCLUDE SYSLIB  (IKJTCB  )                                       */ 00469000
*/*%INCLUDE SYSLIB  (IEZIOB  )                                       */ 00470000
*/*%INCLUDE SYSLIB  (IHADCBDF)                                       */ 00471000
*/*%INCLUDE SYSLIB  (IHADCB  )                                       */ 00472000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 00473000
*/*%INCLUDE SYSUT5  (VERIFY  )                                       */ 00474000
*/*%INCLUDE SYSUT5  (BUILDIOB)                                       */ 00475000
*/*%INCLUDE SYSUT5  (BLDCCWS )                                       */ 00476000
*/*%INCLUDE SYSUT5  (DCBINIT )                                       */ 00477000
*/*%INCLUDE SYSUT5  (LOADMOD )                                       */ 00478000
*                                                                  0258 00479000
*       ;                                                          0258 00480000
@EL00001 DS    0H                                                  0258 00481000
@EF00001 DS    0H                                                  0258 00482000
@ER00001 BR    @14                                                 0258 00483000
@DATA    DS    0H                                                       00484000
         DS    0F                                                       00485000
         DS    0F                                                       00486000
@CF00085 DC    F'1'                                                     00487000
@CF00114 DC    F'4'                                                     00488000
@CF00101 DC    F'8'                                                     00489000
@CF02705 DC    XL4'0000FFFF'                                            00490000
         DS    0D                                                       00491000
RBSECPTR DS    A                                                        00492000
DEBDAPTR DS    A                                                        00493000
DEBEXPTR DS    A                                                        00494000
DEBSBPTR DS    A                                                        00495000
XCTLCON  DC    X'C3780004000400'                                        00496000
ACMETHID DC    CL2'7V'                                                  00497000
OPENID   DC    CL2'0S'                                                  00498000
WRTCODES DC    X'01112131'                                              00499000
RDRCODES DC    X'02122232'                                              00500000
IGG0197V CSECT                                                          00501000
*************                                                           00502000
* 3890 CCWS *                                                           00503000
*************                                                           00504000
CCWCHAIN DS    0D                     3890 CCWS                         00505000
ANTCCW   CCW   X'23',*,X'40',1        ANTICIPATE CCW                    00506000
TICCCW   CCW   X'08',*,X'40',1        TIC CCW                           00507000
SENCCW   CCW   X'04',*,X'30',2        SENSE CCW                         00508000
***********************************                                     00509000
* ACCESS METHOD MODULE LOAD TABLE *                                     00510000
***********************************                                     00511000
         XCTLTABL ID=(EOBID,CC,SYNCHID,UM,GETMID,UN,CNTRLID,UO,PDLOAD,6X00512000
               M),SVC=019          ACCESS MODULE TABLE                  00513000
IGG0197V CSECT                                                          00514000
*                                                           /*Y02990 */ 00515000
         IECDSECS (MAIN,(IOB,NO)),WTG,PREFX,EXPAND=YES                  00516000
*                                                             Y02990 */ 00517000
IGG0197V CSECT                                                          00518000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       00519000
@01      EQU   01                                                       00520000
@02      EQU   02                                                       00521000
@03      EQU   03                                                       00522000
@04      EQU   04                                                       00523000
@05      EQU   05                                                       00524000
@06      EQU   06                                                       00525000
@07      EQU   07                                                       00526000
@08      EQU   08                                                       00527000
@09      EQU   09                                                       00528000
@10      EQU   10                                                       00529000
@11      EQU   11                                                       00530000
@12      EQU   12                                                       00531000
@13      EQU   13                                                       00532000
@14      EQU   14                                                       00533000
@15      EQU   15                                                       00534000
REG0     EQU   @00                                                      00535000
COUNT    EQU   @00                                                      00536000
DATADR   EQU   @01                                                      00537000
REG1     EQU   @01                                                      00538000
IOBPRPTR EQU   @01                                                      00539000
DCBPTR   EQU   @02                                                      00540000
RDCB     EQU   @02                                                      00541000
RCORE    EQU   @04                                                      00542000
RPAR     EQU   @05                                                      00543000
RWTG     EQU   @06                                                      00544000
RPARC    EQU   @07                                                      00545000
RWTGC    EQU   @08                                                      00546000
STARTBLD EQU   @09                                                      00547000
ENDBLD   EQU   @10                                                      00548000
CCWREG   EQU   @11                                                      00549000
IOBSTPTR EQU   @11                                                      00550000
TCBPTR   EQU   @10                                                      00551000
OPCODE   EQU   @13                                                      00552000
REG14    EQU   @14                                                      00553000
REG15    EQU   @15                                                      00554000
CCWPTR   EQU   @15                                                      00555000
PSA      EQU   0                                                        00556000
FLCRNPSW EQU   PSA                                                      00557000
FLCROPSW EQU   PSA+8                                                    00558000
FLCICCW2 EQU   PSA+16                                                   00559000
PSAEEPSW EQU   PSA+132                                                  00560000
PSAESPSW EQU   PSA+136                                                  00561000
FLCSVILC EQU   PSAESPSW+1                                               00562000
PSAEPPSW EQU   PSA+140                                                  00563000
FLCPIILC EQU   PSAEPPSW+1                                               00564000
FLCPICOD EQU   PSAEPPSW+2                                               00565000
PSAPICOD EQU   FLCPICOD+1                                               00566000
FLCTEA   EQU   PSAEPPSW+4                                               00567000
FLCPER   EQU   PSA+152                                                  00568000
FLCMCLA  EQU   PSA+168                                                  00569000
FLCIOEL  EQU   FLCMCLA+4                                                00570000
FLCIOA   EQU   FLCMCLA+16                                               00571000
FLCFSA   EQU   FLCMCLA+80                                               00572000
PSASUPER EQU   PSA+552                                                  00573000
PSASUP1  EQU   PSASUPER                                                 00574000
PSASUP2  EQU   PSASUPER+1                                               00575000
PSASUP3  EQU   PSASUPER+2                                               00576000
PSASUP4  EQU   PSASUPER+3                                               00577000
PSACLHT  EQU   PSA+640                                                  00578000
PSALKSA  EQU   PSA+696                                                  00579000
PSAHLHI  EQU   PSA+760                                                  00580000
PSADSSFL EQU   PSA+836                                                  00581000
PSADSSF1 EQU   PSADSSFL                                                 00582000
PSADSSF3 EQU   PSADSSFL+2                                               00583000
PSADSSF4 EQU   PSADSSFL+3                                               00584000
PSARSVT  EQU   PSA+896                                                  00585000
CVTPTR   EQU   16                                                       00586000
WTGTAB01 EQU   0                                                        00587000
WTGID01  EQU   WTGTAB01+6                                               00588000
WTGTTR01 EQU   WTGTAB01+14                                              00589000
WTGATTR  EQU   WTGTAB01+22                                              00590000
WTGMODLN EQU   WTGTAB01+24                                              00591000
WTGTEXT1 EQU   WTGTAB01+27                                              00592000
WTGSTART EQU   0                                                        00593000
IDTTR    EQU   WTGSTART                                                 00594000
EXECID   EQU   IDTTR                                                    00595000
EXECTTR  EQU   IDTTR+2                                                  00596000
OPNWRK   EQU   WTGSTART+5                                               00597000
DCBLIST  EQU   0                                                        00598000
OPTIONX  EQU   DCBLIST                                                  00599000
DCBADDR  EQU   DCBLIST+1                                                00600000
RBPRFX   EQU   0                                                        00601000
RBBASIC  EQU   0                                                        00602000
RBEXRTNM EQU   RBBASIC                                                  00603000
RBTMFLD  EQU   RBEXRTNM                                                 00604000
RBSTAB   EQU   RBBASIC+10                                               00605000
XSTAB    EQU   RBSTAB                                                   00606000
RBSTAB1  EQU   XSTAB                                                    00607000
XSTAB1   EQU   RBSTAB1                                                  00608000
RBFTCKPT EQU   XSTAB1                                                   00609000
RBSTAB2  EQU   XSTAB+1                                                  00610000
XSTAB2   EQU   RBSTAB2                                                  00611000
RBTCBNXT EQU   XSTAB2                                                   00612000
RBFACTV  EQU   XSTAB2                                                   00613000
RBFDYN   EQU   XSTAB2                                                   00614000
RBECBWT  EQU   XSTAB2                                                   00615000
RBOPSW   EQU   RBBASIC+16                                               00616000
RBLINK   EQU   RBBASIC+28                                               00617000
XRBLNK   EQU   RBLINK                                                   00618000
RBWCF    EQU   XRBLNK                                                   00619000
RBLINKB  EQU   XRBLNK+1                                                 00620000
RBGRSAVE EQU   RBBASIC+32                                               00621000
XRBREG   EQU   RBGRSAVE                                                 00622000
RBGRS0   EQU   XRBREG                                                   00623000
RBGRS1   EQU   XRBREG+4                                                 00624000
RBGRS2   EQU   XRBREG+8                                                 00625000
RBGRS3   EQU   XRBREG+12                                                00626000
RBGRS4   EQU   XRBREG+16                                                00627000
RBGRS5   EQU   XRBREG+20                                                00628000
RBGRS6   EQU   XRBREG+24                                                00629000
RBGRS7   EQU   XRBREG+28                                                00630000
RBGRS8   EQU   XRBREG+32                                                00631000
RBGRS9   EQU   XRBREG+36                                                00632000
RBGRS10  EQU   XRBREG+40                                                00633000
RBGRS11  EQU   XRBREG+44                                                00634000
RBGRS12  EQU   XRBREG+48                                                00635000
RBGRS13  EQU   XRBREG+52                                                00636000
RBGRS14  EQU   XRBREG+56                                                00637000
RBGRS15  EQU   XRBREG+60                                                00638000
XRBESA   EQU   RBBASIC+96                                               00639000
RBPREFIX EQU   0                                                        00640000
RBRSV019 EQU   RBPREFIX+14                                              00641000
RBRSV028 EQU   RBPREFIX+15                                              00642000
RBRSV041 EQU   RBPREFIX+27                                              00643000
RBRSV054 EQU   RBPREFIX+39                                              00644000
RBRTOPSW EQU   RBPREFIX+40                                              00645000
RBRTPSW2 EQU   RBRTOPSW+8                                               00646000
RBRTICIL EQU   RBRTPSW2                                                 00647000
RBFLAGS1 EQU   RBPREFIX+56                                              00648000
RBINTCDA EQU   RBPREFIX+61                                              00649000
RBSECT   EQU   0                                                        00650000
RBPPSAV  EQU   RBSECT                                                   00651000
@NM00040 EQU   RBSECT+10                                                00652000
@NM00041 EQU   @NM00040                                                 00653000
RBTRSVRB EQU   @NM00041                                                 00654000
@NM00043 EQU   @NM00040+1                                               00655000
RBETXR   EQU   @NM00043                                                 00656000
RBEP     EQU   RBSECT+12                                                00657000
RBPGMQ   EQU   RBSECT+24                                                00658000
@NM00050 EQU   RBSECT+28                                                00659000
IRBEND   EQU   RBSECT+96                                                00660000
@NM00054 EQU   RBSECT+96                                                00661000
RBRSV138 EQU   @NM00054+7                                               00662000
RBRSV150 EQU   RBSECT+167                                               00663000
DEBBASIC EQU   0                                                        00664000
DEBTCBAD EQU   DEBBASIC                                                 00665000
DEBDEBAD EQU   DEBBASIC+4                                               00666000
DEBIRBAD EQU   DEBBASIC+8                                               00667000
DEBOFLGS EQU   DEBIRBAD                                                 00668000
DEBOPATB EQU   DEBBASIC+12                                              00669000
DEBFLGS1 EQU   DEBBASIC+14                                              00670000
DEBUSRPG EQU   DEBBASIC+16                                              00671000
DEBRRQ   EQU   DEBBASIC+20                                              00672000
DEBECBAD EQU   DEBRRQ                                                   00673000
DEBDCBAD EQU   DEBBASIC+24                                              00674000
DEBPROTG EQU   DEBDCBAD                                                 00675000
DEBDCBB  EQU   DEBDCBAD+1                                               00676000
DEBAPPAD EQU   DEBBASIC+28                                              00677000
DEBBASND EQU   DEBBASIC+32                                              00678000
DEBDASD  EQU   0                                                        00679000
DEBUCBAD EQU   DEBDASD                                                  00680000
DEBACSMD EQU   0                                                        00681000
DEBVOLSQ EQU   DEBACSMD                                                 00682000
DEBVOLBT EQU   DEBVOLSQ                                                 00683000
DEBDSNM  EQU   DEBACSMD+4                                               00684000
DEBUTSAA EQU   DEBDSNM                                                  00685000
DEBACS01 EQU   0                                                        00686000
DEBDSNAM EQU   DEBACS01                                                 00687000
DEBACS02 EQU   0                                                        00688000
DEBDBLK  EQU   DEBACS02                                                 00689000
DEBACS03 EQU   0                                                        00690000
DEBACS04 EQU   0                                                        00691000
DEBTBFRA EQU   DEBACS04                                                 00692000
DEBTCCWA EQU   DEBACS04+4                                               00693000
DEBACS05 EQU   0                                                        00694000
DEBFUCBA EQU   DEBACS05                                                 00695000
DEBLUCBA EQU   DEBACS05+4                                               00696000
DEBACS06 EQU   0                                                        00697000
DEBACS07 EQU   0                                                        00698000
DEBACS08 EQU   0                                                        00699000
DEBSUBNM EQU   0                                                        00700000
DEB      EQU   0                                                        00701000
DEBAVT   EQU   DEB                                                      00702000
DEBEOEA  EQU   DEBAVT                                                   00703000
DEBEOEAB EQU   DEBEOEA                                                  00704000
DEBSIOA  EQU   DEBAVT+4                                                 00705000
DEBSIOAB EQU   DEBSIOA                                                  00706000
DEBPCIA  EQU   DEBAVT+8                                                 00707000
DEBPCIAB EQU   DEBPCIA                                                  00708000
DEBCEA   EQU   DEBAVT+12                                                00709000
DEBCEAB  EQU   DEBCEA                                                   00710000
DEBXCEA  EQU   DEBAVT+16                                                00711000
DEBXCEAB EQU   DEBXCEA                                                  00712000
DEBPREFX EQU   DEB+20                                                   00713000
DEBXTNP  EQU   DEBPREFX+8                                               00714000
DEBXTN   EQU   0                                                        00715000
DEBXFLG1 EQU   DEBXTN+2                                                 00716000
TCBFIX   EQU   0                                                        00717000
TCBFRS   EQU   TCBFIX                                                   00718000
TCB      EQU   0                                                        00719000
TCBRBP   EQU   TCB                                                      00720000
TCBPIE   EQU   TCB+4                                                    00721000
TCBPMASK EQU   TCBPIE                                                   00722000
TCBCMP   EQU   TCB+16                                                   00723000
TCBCMPF  EQU   TCBCMP                                                   00724000
TCBCPP   EQU   TCBCMPF                                                  00725000
TCBSTCC  EQU   TCBCMPF                                                  00726000
TCBCDBL  EQU   TCBCMPF                                                  00727000
TCBCWTO  EQU   TCBCMPF                                                  00728000
TCBCIND  EQU   TCBCMPF                                                  00729000
TCBCMSG  EQU   TCBCMPF                                                  00730000
TCBTRN   EQU   TCB+20                                                   00731000
TCBABF   EQU   TCBTRN                                                   00732000
TCBMSS   EQU   TCB+24                                                   00733000
TCBPKF   EQU   TCB+28                                                   00734000
TCBFLGS  EQU   TCB+29                                                   00735000
TCBFLGS1 EQU   TCBFLGS                                                  00736000
TCBFLGS2 EQU   TCBFLGS+1                                                00737000
TCBFLGS3 EQU   TCBFLGS+2                                                00738000
TCBFLGS4 EQU   TCBFLGS+3                                                00739000
TCBFLGS5 EQU   TCBFLGS+4                                                00740000
TCBABWF  EQU   TCBFLGS5                                                 00741000
TCBJPQ   EQU   TCB+44                                                   00742000
TCBPURGE EQU   TCBJPQ                                                   00743000
TCBGRS   EQU   TCB+48                                                   00744000
TCBFSA   EQU   TCB+112                                                  00745000
TCBTME   EQU   TCB+120                                                  00746000
TCBJSTCB EQU   TCB+124                                                  00747000
TCBTSFLG EQU   TCB+148                                                  00748000
TCBTSTSK EQU   TCBTSFLG                                                 00749000
TCBSTAB  EQU   TCB+160                                                  00750000
TCBNSTAE EQU   TCBSTAB                                                  00751000
TCBTCT   EQU   TCB+164                                                  00752000
TCBTCTGF EQU   TCBTCT                                                   00753000
TCBSCNDY EQU   TCB+172                                                  00754000
TCBNDSP  EQU   TCBSCNDY                                                 00755000
TCBNDSP1 EQU   TCBNDSP+1                                                00756000
TCBNDSP2 EQU   TCBNDSP+2                                                00757000
TCBNDSP3 EQU   TCBNDSP+3                                                00758000
TCBJSCB  EQU   TCB+180                                                  00759000
TCBRECDE EQU   TCBJSCB                                                  00760000
TCBEXT1  EQU   TCB+196                                                  00761000
TCBBITS  EQU   TCB+200                                                  00762000
TCBNDSP4 EQU   TCBBITS                                                  00763000
TCBNDSP5 EQU   TCBBITS+1                                                00764000
TCBFLGS6 EQU   TCBBITS+2                                                00765000
TCBFLGS7 EQU   TCBBITS+3                                                00766000
TCBDAR   EQU   TCB+204                                                  00767000
TCBDARC  EQU   TCBDAR                                                   00768000
TCBEXT2  EQU   TCB+208                                                  00769000
TCBFOE   EQU   TCB+244                                                  00770000
TCBESTAE EQU   TCB+264                                                  00771000
TCBESTRM EQU   TCBESTAE+1                                               00772000
TCBFBYT1 EQU   TCB+276                                                  00773000
TCBFBYT2 EQU   TCB+277                                                  00774000
TCBRV124 EQU   TCB+278                                                  00775000
TCBRV133 EQU   TCB+279                                                  00776000
TCBXTNT2 EQU   0                                                        00777000
TCBGTF   EQU   TCBXTNT2                                                 00778000
TCBTFLG  EQU   TCBGTF                                                   00779000
TCBRV146 EQU   TCBXTNT2+28                                              00780000
TCBRV155 EQU   TCBXTNT2+29                                              00781000
TCBRV164 EQU   TCBXTNT2+30                                              00782000
TCBRV173 EQU   TCBXTNT2+31                                              00783000
IOBUFFER EQU   0                                                        00784000
AMODTABL EQU   0                                                        00785000
AMODID   EQU   AMODTABL                                                 00786000
AMODTTR  EQU   AMODTABL+2                                               00787000
AMODLN   EQU   AMODTABL+5                                               00788000
CCW      EQU   0                                                        00789000
CCWADDR  EQU   CCW+1                                                    00790000
CCWS     EQU   0                                                        00791000
CCWOPCDE EQU   CCWS                                                     00792000
CCWRDROP EQU   CCWOPCDE                                                 00793000
CCWADR   EQU   CCWS+1                                                   00794000
CCWFLAGS EQU   CCWS+4                                                   00795000
CCWCOUNT EQU   CCWS+6                                                   00796000
CCW7A8A9 EQU   0                                                        00797000
RDCHAIN1 EQU   0                                                        00798000
RDCHAIN2 EQU   0                                                        00799000
CMDCODE  EQU   0                                                        00800000
IOBPREFX EQU   0                                                        00801000
IOBCFLG1 EQU   IOBPREFX                                                 00802000
IOBSTDRD EQU   0                                                        00803000
IOBFLAG1 EQU   IOBSTDRD                                                 00804000
IOBCMDCH EQU   IOBFLAG1                                                 00805000
IOBCYCCK EQU   IOBFLAG1                                                 00806000
IOBRSTRT EQU   IOBFLAG1                                                 00807000
IOBFLAG2 EQU   IOBSTDRD+1                                               00808000
IOBPURGE EQU   IOBFLAG2                                                 00809000
IOBRDHA0 EQU   IOBFLAG2                                                 00810000
IOBSENS0 EQU   IOBSTDRD+2                                               00811000
IOBS0B7  EQU   IOBSENS0                                                 00812000
IOBSENS1 EQU   IOBSTDRD+3                                               00813000
IOBECBPT EQU   IOBSTDRD+4                                               00814000
IOBFLAG3 EQU   IOBSTDRD+8                                               00815000
IOBFL3   EQU   IOBFLAG3                                                 00816000
IOBCSW   EQU   IOBSTDRD+9                                               00817000
IOBIOCSW EQU   IOBCSW                                                   00818000
IOBSTART EQU   IOBSTDRD+16                                              00819000
IOBDCBPT EQU   IOBSTDRD+20                                              00820000
IOBFLAG4 EQU   IOBDCBPT                                                 00821000
IOBRESTR EQU   IOBSTDRD+24                                              00822000
IOBINCAM EQU   IOBSTDRD+28                                              00823000
IOBBTAMF EQU   IOBINCAM                                                 00824000
IHADCB   EQU   0                                                        00825000
IHADCS07 EQU   0                                                        00826000
DCBWTOID EQU   IHADCS07                                                 00827000
IHADCS09 EQU   0                                                        00828000
DCBSSID  EQU   IHADCS09                                                 00829000
IHADCS10 EQU   0                                                        00830000
@NM00070 EQU   IHADCS10                                                 00831000
DCBSSAD  EQU   IHADCS10+4                                               00832000
DCBIMG   EQU   DCBSSAD                                                  00833000
DCBIMAGE EQU   IHADCS10+8                                               00834000
DCBMRFG  EQU   DCBIMAGE                                                 00835000
DCBECBLT EQU   IHADCS10+12                                              00836000
DCBHDR   EQU   DCBECBLT                                                 00837000
DCBMRIND EQU   DCBHDR                                                   00838000
DCBMRFLG EQU   IHADCS10+16                                              00839000
IHADCS11 EQU   0                                                        00840000
DCBRELB  EQU   IHADCS11                                                 00841000
DCBREL   EQU   DCBRELB+1                                                00842000
DCBBUFCB EQU   IHADCS11+4                                               00843000
DCBDSORG EQU   IHADCS11+10                                              00844000
DCBDSRG1 EQU   DCBDSORG                                                 00845000
DCBDSGPS EQU   DCBDSRG1                                                 00846000
DCBDSRG2 EQU   DCBDSORG+1                                               00847000
DCBIOBAD EQU   IHADCS11+12                                              00848000
DCBODEB  EQU   DCBIOBAD                                                 00849000
DCBLNP   EQU   DCBODEB                                                  00850000
DCBQSLM  EQU   DCBLNP                                                   00851000
DCBIOBAA EQU   DCBODEB+1                                                00852000
IHADCS50 EQU   0                                                        00853000
DCBSVCXL EQU   IHADCS50                                                 00854000
DCBEODAD EQU   IHADCS50+4                                               00855000
DCBBFALN EQU   DCBEODAD                                                 00856000
DCBHIARC EQU   DCBBFALN                                                 00857000
DCBBFTEK EQU   DCBHIARC                                                 00858000
DCBBFT   EQU   DCBBFTEK                                                 00859000
DCBEXLST EQU   IHADCS50+8                                               00860000
DCBRECFM EQU   DCBEXLST                                                 00861000
DCBRECLA EQU   DCBRECFM                                                 00862000
IHADCS24 EQU   0                                                        00863000
DCBOFLGS EQU   IHADCS24+8                                               00864000
DCBOFLWR EQU   DCBOFLGS                                                 00865000
DCBIFLG  EQU   IHADCS24+9                                               00866000
DCBMACR  EQU   IHADCS24+10                                              00867000
DCBMACR1 EQU   DCBMACR                                                  00868000
DCBMRFE  EQU   DCBMACR1                                                 00869000
DCBMRGET EQU   DCBMRFE                                                  00870000
DCBMRAPG EQU   DCBMACR1                                                 00871000
DCBMRRD  EQU   DCBMRAPG                                                 00872000
DCBMRCI  EQU   DCBMACR1                                                 00873000
DCBMRMVG EQU   DCBMRCI                                                  00874000
DCBMRLCG EQU   DCBMACR1                                                 00875000
DCBMRABC EQU   DCBMACR1                                                 00876000
DCBMRPT1 EQU   DCBMRABC                                                 00877000
DCBMRSBG EQU   DCBMRPT1                                                 00878000
DCBMRCRL EQU   DCBMACR1                                                 00879000
DCBMRCHK EQU   DCBMRCRL                                                 00880000
DCBMRRDX EQU   DCBMRCHK                                                 00881000
DCBMRDMG EQU   DCBMACR1                                                 00882000
DCBMACR2 EQU   DCBMACR+1                                                00883000
DCBMRPUT EQU   DCBMACR2                                                 00884000
DCBMRWRT EQU   DCBMACR2                                                 00885000
DCBMRMVP EQU   DCBMACR2                                                 00886000
DCBMR5WD EQU   DCBMACR2                                                 00887000
DCBMRLDM EQU   DCBMR5WD                                                 00888000
DCBMRLCP EQU   DCBMRLDM                                                 00889000
DCBMR4WD EQU   DCBMACR2                                                 00890000
DCBMRPT2 EQU   DCBMR4WD                                                 00891000
DCBMRTMD EQU   DCBMRPT2                                                 00892000
DCBMR3WD EQU   DCBMACR2                                                 00893000
DCBMRCTL EQU   DCBMR3WD                                                 00894000
DCBMRSTK EQU   DCBMRCTL                                                 00895000
DCBMR1WD EQU   DCBMACR2                                                 00896000
DCBMRSWA EQU   DCBMR1WD                                                 00897000
DCBMRDMD EQU   DCBMRSWA                                                 00898000
IHADCS25 EQU   0                                                        00899000
DCBMACRF EQU   IHADCS25+2                                               00900000
DCBMACF1 EQU   DCBMACRF                                                 00901000
DCBMFFE  EQU   DCBMACF1                                                 00902000
DCBMFGET EQU   DCBMFFE                                                  00903000
DCBMFAPG EQU   DCBMACF1                                                 00904000
DCBMFRD  EQU   DCBMFAPG                                                 00905000
DCBMFCI  EQU   DCBMACF1                                                 00906000
DCBMFMVG EQU   DCBMFCI                                                  00907000
DCBMFLCG EQU   DCBMACF1                                                 00908000
DCBMFABC EQU   DCBMACF1                                                 00909000
DCBMFPT1 EQU   DCBMFABC                                                 00910000
DCBMFSBG EQU   DCBMFPT1                                                 00911000
DCBMFCRL EQU   DCBMACF1                                                 00912000
DCBMFCHK EQU   DCBMFCRL                                                 00913000
DCBMFDMG EQU   DCBMACF1                                                 00914000
DCBMACF2 EQU   DCBMACRF+1                                               00915000
DCBMFPUT EQU   DCBMACF2                                                 00916000
DCBMFWRT EQU   DCBMACF2                                                 00917000
DCBMFMVP EQU   DCBMACF2                                                 00918000
DCBMF5WD EQU   DCBMACF2                                                 00919000
DCBMFLDM EQU   DCBMF5WD                                                 00920000
DCBMFLCP EQU   DCBMFLDM                                                 00921000
DCBMF4WD EQU   DCBMACF2                                                 00922000
DCBMFPT2 EQU   DCBMF4WD                                                 00923000
DCBMFTMD EQU   DCBMFPT2                                                 00924000
DCBMF3WD EQU   DCBMACF2                                                 00925000
DCBMFCTL EQU   DCBMF3WD                                                 00926000
DCBMFSTK EQU   DCBMFCTL                                                 00927000
DCBMF1WD EQU   DCBMACF2                                                 00928000
DCBMFSWA EQU   DCBMF1WD                                                 00929000
DCBMFDMD EQU   DCBMFSWA                                                 00930000
DCBDEBAD EQU   IHADCS25+4                                               00931000
DCBIFLGS EQU   DCBDEBAD                                                 00932000
IHADCS26 EQU   0                                                        00933000
DCBWRITE EQU   IHADCS26                                                 00934000
DCBREAD  EQU   DCBWRITE                                                 00935000
DCBWRITA EQU   DCBREAD+1                                                00936000
IHADCS27 EQU   0                                                        00937000
DCBGET   EQU   IHADCS27                                                 00938000
DCBPUT   EQU   DCBGET                                                   00939000
DCBGETA  EQU   DCBPUT+1                                                 00940000
IHADCS36 EQU   0                                                        00941000
DCBGERR  EQU   IHADCS36                                                 00942000
DCBPERR  EQU   DCBGERR                                                  00943000
DCBCHECK EQU   DCBPERR                                                  00944000
DCBOPTCD EQU   DCBCHECK                                                 00945000
DCBOPTH  EQU   DCBOPTCD                                                 00946000
DCBOPTO  EQU   DCBOPTH                                                  00947000
DCBOPTZ  EQU   DCBOPTCD                                                 00948000
DCBGERRA EQU   DCBCHECK+1                                               00949000
DCBPERRA EQU   DCBGERRA                                                 00950000
DCBSYNAD EQU   IHADCS36+4                                               00951000
DCBIOBL  EQU   DCBSYNAD                                                 00952000
DCBCIND1 EQU   IHADCS36+8                                               00953000
DCBCIND2 EQU   IHADCS36+9                                               00954000
DCBBLKSI EQU   IHADCS36+10                                              00955000
DCBOFFSR EQU   IHADCS36+14                                              00956000
DCBIOBA  EQU   IHADCS36+16                                              00957000
DCBCICB  EQU   DCBIOBA                                                  00958000
IHADCS52 EQU   0                                                        00959000
DCBDIRCT EQU   IHADCS52                                                 00960000
DCBQSWS  EQU   DCBDIRCT                                                 00961000
DCBUSASI EQU   DCBQSWS                                                  00962000
DCBQADFS EQU   DCBUSASI                                                 00963000
DCBBUFOF EQU   DCBDIRCT+1                                               00964000
IHADCS37 EQU   0                                                        00965000
DCBFLAG1 EQU   IHADCS37                                                 00966000
IHADCS38 EQU   0                                                        00967000
DCBEOBR  EQU   IHADCS38                                                 00968000
DCBLRECL EQU   IHADCS38+10                                              00969000
DCBPOINT EQU   IHADCS38+12                                              00970000
DCBCNTRL EQU   DCBPOINT                                                 00971000
IHADCS40 EQU   0                                                        00972000
DCBEOBAD EQU   IHADCS40                                                 00973000
DCBCCCW  EQU   IHADCS40+4                                               00974000
DCBRECAD EQU   DCBCCCW                                                  00975000
DCBRECBT EQU   DCBRECAD                                                 00976000
DCBRCREL EQU   DCBRECBT                                                 00977000
@NM00095 EQU   IHADCS40+12                                              00978000
DCBEROPT EQU   @NM00095                                                 00979000
DCBEOB   EQU   IHADCS40+20                                              00980000
CVTMAP   EQU   0                                                        00981000
CVT      EQU   CVTMAP                                                   00982000
CVTDAR   EQU   CVTMAP+72                                                00983000
CVTFLGS1 EQU   CVTDAR                                                   00984000
CVTSVDCB EQU   CVTMAP+84                                                00985000
CVTDCB   EQU   CVTMAP+116                                               00986000
CVTIERLC EQU   CVTMAP+144                                               00987000
CVTOPTA  EQU   CVTMAP+182                                               00988000
CVTOPTB  EQU   CVTMAP+183                                               00989000
CVTGTF   EQU   CVTMAP+236                                               00990000
CVTGTFST EQU   CVTGTF                                                   00991000
CVTGTFS  EQU   CVTGTFST                                                 00992000
CVTSTATE EQU   CVTGTFST                                                 00993000
CVTTMODE EQU   CVTGTFST                                                 00994000
CVTFORM  EQU   CVTGTFST                                                 00995000
CVTAQAVT EQU   CVTMAP+240                                               00996000
CVTTCMFG EQU   CVTAQAVT                                                 00997000
CVTVOLM2 EQU   CVTMAP+244                                               00998000
CVTTATA  EQU   CVTVOLM2                                                 00999000
CVTTSKS  EQU   CVTTATA                                                  01000000
CVTVOLF2 EQU   CVTTSKS                                                  01001000
CVTTAT   EQU   CVTTATA+1                                                01002000
CVTATER  EQU   CVTMAP+248                                               01003000
CVTEXT1  EQU   CVTMAP+252                                               01004000
CVTPURG  EQU   CVTMAP+260                                               01005000
CVTQMSG  EQU   CVTMAP+268                                               01006000
CVTDMSR  EQU   CVTMAP+272                                               01007000
CVTERPV  EQU   CVTMAP+316                                               01008000
CVTINTLA EQU   CVTMAP+320                                               01009000
CVTAPF   EQU   CVTMAP+324                                               01010000
CVTEXT2  EQU   CVTMAP+328                                               01011000
CVTHJES  EQU   CVTMAP+332                                               01012000
CVTPGSIA EQU   CVTMAP+348                                               01013000
CVTA1F1  EQU   CVTMAP+356                                               01014000
CVTSYSK  EQU   CVTMAP+357                                               01015000
CVTVOLM1 EQU   CVTMAP+380                                               01016000
CVTVOLF1 EQU   CVTVOLM1                                                 01017000
CVTATMCT EQU   CVTMAP+388                                               01018000
CVTXTNT1 EQU   0                                                        01019000
CVTXTNT2 EQU   0                                                        01020000
CVTDSSV  EQU   CVTXTNT2                                                 01021000
CVTFLGBT EQU   CVTXTNT2+5                                               01022000
CVTQID   EQU   CVTXTNT2+24                                              01023000
CVTRV400 EQU   CVTXTNT2+52                                              01024000
CVTRV409 EQU   CVTXTNT2+53                                              01025000
CVTATCVT EQU   CVTXTNT2+64                                              01026000
CVTRV429 EQU   CVTXTNT2+84                                              01027000
CVTRV438 EQU   CVTXTNT2+85                                              01028000
CVTRV457 EQU   CVTXTNT2+112                                             01029000
CVTRV466 EQU   CVTXTNT2+113                                             01030000
CVTFIX   EQU   0                                                        01031000
CVTRELNO EQU   CVTFIX+252                                               01032000
CVTOFFST EQU   0                                                        01033000
DMDCB    EQU   0                                                        01034000
OPENWRKA EQU   0                                                        01035000
USERDCB  EQU   0                                                        01036000
WTGCON   EQU   WTGATTR                                                  01037000
DCBGRTN  EQU   DCBGET                                                   01038000
DCBGETM  EQU   DCBGRTN+1                                                01039000
PSARSVTE EQU   PSARSVT                                                  01040000
RBSECS03 EQU   RBEP                                                     01041000
RBCDE    EQU   RBSECS03                                                 01042000
RBCDFLGS EQU   RBCDE                                                    01043000
RBSECS05 EQU   RBPGMQ                                                   01044000
RBSQE    EQU   RBSECS05                                                 01045000
RBSECS06 EQU   RBPGMQ                                                   01046000
RBIQE    EQU   RBSECS06                                                 01047000
RBSECS07 EQU   RBPGMQ                                                   01048000
RBIQE2   EQU   RBSECS07                                                 01049000
RBSECS08 EQU   IRBEND                                                   01050000
RBSECS09 EQU   IRBEND                                                   01051000
DEBPTR   EQU   DXCCW8                                                   01052000
DEBBAS02 EQU   DEBBASND                                                 01053000
DEBDDS1  EQU   DEBBAS02                                                 01054000
DEBSUCBA EQU   DEBDDS1                                                  01055000
DEBDEVED EQU   DEBDDS1+4                                                01056000
DEBRDCB  EQU   DEBDDS1+4                                                01057000
DEBPDCB  EQU   DEBDDS1+8                                                01058000
DEBWDCB  EQU   DEBDDS1+12                                               01059000
DEBACS09 EQU   DEBDEVED                                                 01060000
DEBASC09 EQU   DEBACS09                                                 01061000
DEBEAMFG EQU   DEBASC09+3                                               01062000
DEBDSID  EQU   DEBASC09+4                                               01063000
DEBEOD   EQU   DEBASC09+12                                              01064000
DEBBOE   EQU   DEBEOD                                                   01065000
DEBEODRV EQU   DEBBOE                                                   01066000
DEBEODTT EQU   DEBBOE+1                                                 01067000
DEBEOD0  EQU   DEBBOE+2                                                 01068000
DEBEODSS EQU   DEBBOE+3                                                 01069000
DEBBAS01 EQU   DEBBASND                                                 01070000
DEBISAM  EQU   DEBBAS01                                                 01071000
DEBFIEAD EQU   DEBISAM                                                  01072000
DEBFPEAD EQU   DEBISAM+4                                                01073000
DEBFOEAD EQU   DEBISAM+8                                                01074000
DEBEXPT  EQU   DEBISAM+12                                               01075000
DEBRPSID EQU   DEBEXPT                                                  01076000
USERDCBA EQU   DXCCW8                                                   01077000
IOBORG01 EQU   IOBPREFX+8                                               01078000
IOBNIOBA EQU   IOBORG01                                                 01079000
IOBNFLG1 EQU   IOBNIOBA                                                 01080000
IOBFIRST EQU   IOBNFLG1                                                 01081000
IOBNECB  EQU   IOBORG01+4                                               01082000
IOB      EQU   IOBORG01                                                 01083000
PDLOADID EQU   PDLOAD                                                   01084000
CCW1A2   EQU   CCW                                                      01085000
IOBORG02 EQU   IOBPREFX+8                                               01086000
IOBDQADA EQU   IOBORG02                                                 01087000
IOBDEQIN EQU   IOBDQADA                                                 01088000
IOBORG03 EQU   IOBPREFX+12                                              01089000
IOBORG04 EQU   IOBINCAM                                                 01090000
IOBORG12 EQU   IOBINCAM                                                 01091000
IOBFL4   EQU   IOBORG12                                                 01092000
IOBEXTEN EQU   IOBSTDRD+32                                              01093000
IOBSEEK  EQU   IOBEXTEN                                                 01094000
IOBBB    EQU   IOBSEEK+1                                                01095000
IOBCC    EQU   IOBSEEK+3                                                01096000
IOBHH    EQU   IOBSEEK+5                                                01097000
IOBORG05 EQU   IOBEXTEN                                                 01098000
IOBORG06 EQU   IOBEXTEN                                                 01099000
IOBNXTPT EQU   IOBORG06+4                                               01100000
IOBSTATA EQU   IOBNXTPT                                                 01101000
IOBORG07 EQU   IOBEXTEN+8                                               01102000
W1IEXTEN EQU   IOBORG07                                                 01103000
IOBORG08 EQU   IOBEXTEN+8                                               01104000
IOBINDCT EQU   IOBORG08+4                                               01105000
IOBUNSQR EQU   IOBORG08+5                                               01106000
IOBFCHAD EQU   IOBORG08+8                                               01107000
IOBORG09 EQU   IOBEXTEN+8                                               01108000
IOBDPLAD EQU   IOBORG09+4                                               01109000
IOBDTYPE EQU   IOBORG09+8                                               01110000
IOBDTYP2 EQU   IOBORG09+9                                               01111000
IOBDSTAT EQU   IOBORG09+10                                              01112000
IOBSTAT1 EQU   IOBDSTAT                                                 01113000
IOBORG10 EQU   IOBEXTEN+8                                               01114000
IOBSEEK2 EQU   IOBORG10                                                 01115000
IOBORG11 EQU   IOBEXTEN                                                 01116000
IOBERCT  EQU   IOBORG11                                                 01117000
IOBUCBXV EQU   IOBERCT                                                  01118000
IOBNAME  EQU   IOBORG11+4                                               01119000
IOBORG13 EQU   IOBEXTEN                                                 01120000
IOBSKADR EQU   IOBORG13                                                 01121000
CVTS01   EQU   CVTPGSIA                                                 01122000
CVTLPDIA EQU   CVTS01+12                                                01123000
CVTDIRST EQU   CVTLPDIA                                                 01124000
CVTSLIDA EQU   CVTS01+24                                                01125000
CVTCTLFG EQU   CVTS01+50                                                01126000
CVTRV210 EQU   CVTS01+424                                               01127000
CVTRV219 EQU   CVTS01+425                                               01128000
CVTRV228 EQU   CVTS01+426                                               01129000
CVTRV237 EQU   CVTS01+427                                               01130000
CVTMFRTR EQU   CVTS01+452                                               01131000
CVTRV262 EQU   CVTS01+468                                               01132000
CVTRV271 EQU   CVTS01+469                                               01133000
CVTRV280 EQU   CVTS01+470                                               01134000
CVTRV289 EQU   CVTS01+471                                               01135000
CVTGSDA  EQU   CVTS01+600                                               01136000
FLC      EQU   PSA                                                      01137000
SVRBPTR  EQU   TCBRBP                                                   01138000
         AGO   .@UNREFD                START UNREFERENCED COMPONENTS    01139000
CVTRV628 EQU   CVTS01+728                                               01140000
CVTRV627 EQU   CVTS01+724                                               01141000
CVTRV626 EQU   CVTS01+720                                               01142000
CVTRV625 EQU   CVTS01+716                                               01143000
CVTRV624 EQU   CVTS01+712                                               01144000
CVTRV623 EQU   CVTS01+708                                               01145000
CVTRV622 EQU   CVTS01+704                                               01146000
CVTRV621 EQU   CVTS01+700                                               01147000
CVTRV620 EQU   CVTS01+696                                               01148000
CVTRV619 EQU   CVTS01+692                                               01149000
CVTRV618 EQU   CVTS01+688                                               01150000
CVTRV617 EQU   CVTS01+684                                               01151000
CVTRV616 EQU   CVTS01+680                                               01152000
CVTRV615 EQU   CVTS01+676                                               01153000
CVTRV614 EQU   CVTS01+672                                               01154000
CVTRV613 EQU   CVTS01+668                                               01155000
CVTRV612 EQU   CVTS01+664                                               01156000
CVTRV611 EQU   CVTS01+660                                               01157000
CVTRV610 EQU   CVTS01+656                                               01158000
CVTRV609 EQU   CVTS01+652                                               01159000
CVTRV608 EQU   CVTS01+648                                               01160000
CVTRV607 EQU   CVTS01+644                                               01161000
CVTRV606 EQU   CVTS01+640                                               01162000
CVTRV605 EQU   CVTS01+636                                               01163000
CVTRV604 EQU   CVTS01+632                                               01164000
CVTEFF02 EQU   CVTS01+628                                               01165000
CVTCBBR  EQU   CVTS01+624                                               01166000
CVTSSCR  EQU   CVTS01+620                                               01167000
CVTEVENT EQU   CVTS01+616                                               01168000
CVTCRCA  EQU   CVTS01+612                                               01169000
CVTTPIO  EQU   CVTS01+608                                               01170000
CVTADV   EQU   CVTS01+604                                               01171000
CVTGSDAB EQU   CVTGSDA                                                  01172000
CVTQV3   EQU   CVTS01+596                                               01173000
CVTQV2   EQU   CVTS01+592                                               01174000
CVTQV1   EQU   CVTS01+588                                               01175000
CVTRPT   EQU   CVTS01+584                                               01176000
CVTSSRB  EQU   CVTS01+580                                               01177000
CVTCSDRL EQU   CVTS01+576                                               01178000
CVTEXP1  EQU   CVTS01+572                                               01179000
CVTRMPMT EQU   CVTS01+568                                               01180000
CVTRMPTT EQU   CVTS01+564                                               01181000
CVTVPSA  EQU   CVTS01+560                                               01182000
CVTVSTOP EQU   CVTS01+556                                               01183000
CVTGTFR8 EQU   CVTS01+552                                               01184000
CVTQUIT  EQU   CVTS01+548                                               01185000
CVTVACR  EQU   CVTS01+544                                               01186000
CVTWTCB  EQU   CVTS01+540                                               01187000
CVTSTPRS EQU   CVTS01+536                                               01188000
CVT0PT02 EQU   CVTS01+532                                               01189000
CVTDARCM EQU   CVTS01+528                                               01190000
CVTIRECM EQU   CVTS01+524                                               01191000
CVTJRECM EQU   CVTS01+520                                               01192000
CVTVEMS0 EQU   CVTS01+516                                               01193000
CVTSPFRR EQU   CVTS01+512                                               01194000
CVTRLSTG EQU   CVTS01+508                                               01195000
CVT0TC0A EQU   CVTS01+504                                               01196000
CVTGMBR  EQU   CVTS01+500                                               01197000
CVTLFRM  EQU   CVTS01+496                                               01198000
CVTRMBR  EQU   CVTS01+492                                               01199000
CVTVIOP  EQU   CVTS01+488                                               01200000
CVTRV307 EQU   CVTS01+486                                               01201000
CVTRV306 EQU   CVTS01+484                                               01202000
CVTRV305 EQU   CVTS01+482                                               01203000
CVTRV304 EQU   CVTS01+480                                               01204000
CVTRV303 EQU   CVTS01+478                                               01205000
CVTRV302 EQU   CVTS01+476                                               01206000
CVTTRCA  EQU   CVTS01+472                                               01207000
CVTRV297 EQU   CVTRV289                                                 01208000
CVTRV296 EQU   CVTRV289                                                 01209000
CVTRV295 EQU   CVTRV289                                                 01210000
CVTRV294 EQU   CVTRV289                                                 01211000
CVTRV293 EQU   CVTRV289                                                 01212000
CVTRV292 EQU   CVTRV289                                                 01213000
CVTRV291 EQU   CVTRV289                                                 01214000
CVTRV290 EQU   CVTRV289                                                 01215000
CVTRV288 EQU   CVTRV280                                                 01216000
CVTRV287 EQU   CVTRV280                                                 01217000
CVTRV286 EQU   CVTRV280                                                 01218000
CVTRV285 EQU   CVTRV280                                                 01219000
CVTRV284 EQU   CVTRV280                                                 01220000
CVTRV283 EQU   CVTRV280                                                 01221000
CVTRV282 EQU   CVTRV280                                                 01222000
CVTRV281 EQU   CVTRV280                                                 01223000
CVTRV279 EQU   CVTRV271                                                 01224000
CVTRV278 EQU   CVTRV271                                                 01225000
CVTRV277 EQU   CVTRV271                                                 01226000
CVTRV276 EQU   CVTRV271                                                 01227000
CVTRV275 EQU   CVTRV271                                                 01228000
CVTRV274 EQU   CVTRV271                                                 01229000
CVTRV273 EQU   CVTRV271                                                 01230000
CVTRV272 EQU   CVTRV271                                                 01231000
CVTRV270 EQU   CVTRV262                                                 01232000
CVTRV269 EQU   CVTRV262                                                 01233000
CVTRV268 EQU   CVTRV262                                                 01234000
CVTRV267 EQU   CVTRV262                                                 01235000
CVTRV266 EQU   CVTRV262                                                 01236000
CVTRV265 EQU   CVTRV262                                                 01237000
CVTRV264 EQU   CVTRV262                                                 01238000
CVTRV263 EQU   CVTRV262                                                 01239000
CVTVFP   EQU   CVTS01+464                                               01240000
CVTVSI   EQU   CVTS01+460                                               01241000
CVTVPSIB EQU   CVTS01+456                                               01242000
CVTMFACT EQU   CVTMFRTR                                                 01243000
CVTMFCTL EQU   CVTS01+448                                               01244000
CVTPVBP  EQU   CVTS01+444                                               01245000
CVTPWI   EQU   CVTS01+440                                               01246000
CVTRV254 EQU   CVTS01+438                                               01247000
CVTRV253 EQU   CVTS01+436                                               01248000
CVTRV252 EQU   CVTS01+434                                               01249000
CVTRV251 EQU   CVTS01+433                                               01250000
CVTRV250 EQU   CVTS01+432                                               01251000
CVTRV249 EQU   CVTS01+431                                               01252000
CVTRV248 EQU   CVTS01+430                                               01253000
CVTRV247 EQU   CVTS01+429                                               01254000
CVTRV246 EQU   CVTS01+428                                               01255000
CVTRV245 EQU   CVTRV237                                                 01256000
CVTRV244 EQU   CVTRV237                                                 01257000
CVTRV243 EQU   CVTRV237                                                 01258000
CVTRV242 EQU   CVTRV237                                                 01259000
CVTRV241 EQU   CVTRV237                                                 01260000
CVTRV240 EQU   CVTRV237                                                 01261000
CVTRV239 EQU   CVTRV237                                                 01262000
CVTRV238 EQU   CVTRV237                                                 01263000
CVTRV236 EQU   CVTRV228                                                 01264000
CVTRV235 EQU   CVTRV228                                                 01265000
CVTRV234 EQU   CVTRV228                                                 01266000
CVTRV233 EQU   CVTRV228                                                 01267000
CVTRV232 EQU   CVTRV228                                                 01268000
CVTRV231 EQU   CVTRV228                                                 01269000
CVTRV230 EQU   CVTRV228                                                 01270000
CVTRV229 EQU   CVTRV228                                                 01271000
CVTRV227 EQU   CVTRV219                                                 01272000
CVTRV226 EQU   CVTRV219                                                 01273000
CVTRV225 EQU   CVTRV219                                                 01274000
CVTRV224 EQU   CVTRV219                                                 01275000
CVTRV223 EQU   CVTRV219                                                 01276000
CVTRV222 EQU   CVTRV219                                                 01277000
CVTRV221 EQU   CVTRV219                                                 01278000
CVTRV220 EQU   CVTRV219                                                 01279000
CVTRV218 EQU   CVTRV210                                                 01280000
CVTRV217 EQU   CVTRV210                                                 01281000
CVTRV216 EQU   CVTRV210                                                 01282000
CVTRV215 EQU   CVTRV210                                                 01283000
CVTRV214 EQU   CVTRV210                                                 01284000
CVTRV213 EQU   CVTRV210                                                 01285000
CVTRV212 EQU   CVTRV210                                                 01286000
CVTRV211 EQU   CVTRV210                                                 01287000
CVTLCCAT EQU   CVTS01+420                                               01288000
CVTPCCAT EQU   CVTS01+416                                               01289000
CVTIPCRP EQU   CVTS01+412                                               01290000
CVTIPCRI EQU   CVTS01+408                                               01291000
CVTIPCDS EQU   CVTS01+404                                               01292000
CVTAIDVT EQU   CVTS01+400                                               01293000
CVTSSAP  EQU   CVTS01+396                                               01294000
CVTEHCIR EQU   CVTS01+392                                               01295000
CVTEHDEF EQU   CVTS01+388                                               01296000
CVTDAIR  EQU   CVTS01+384                                               01297000
CVTPERFM EQU   CVTS01+380                                               01298000
CVT044R2 EQU   CVTS01+376                                               01299000
CVTFETCH EQU   CVTS01+372                                               01300000
CVTRSTWD EQU   CVTS01+368                                               01301000
CVTSPOST EQU   CVTS01+364                                               01302000
CVTIOBP  EQU   CVTS01+360                                               01303000
CVTASMVT EQU   CVTS01+356                                               01304000
CVTRECRQ EQU   CVTS01+352                                               01305000
CVTWSAC  EQU   CVTS01+348                                               01306000
CVTRV149 EQU   CVTS01+344                                               01307000
CVTWSAL  EQU   CVTS01+340                                               01308000
CVTSPSA  EQU   CVTS01+336                                               01309000
CVTGLMN  EQU   CVTS01+332                                               01310000
CVTVEAC0 EQU   CVTS01+328                                               01311000
CVT062R1 EQU   CVTS01+324                                               01312000
CVTRPOST EQU   CVTS01+320                                               01313000
CVTDQIQE EQU   CVTS01+316                                               01314000
CVTCSD   EQU   CVTS01+312                                               01315000
CVTLKRMA EQU   CVTS01+308                                               01316000
CVTRSPIE EQU   CVTS01+304                                               01317000
CVTRENQ  EQU   CVTS01+300                                               01318000
CVTLQCB  EQU   CVTS01+296                                               01319000
CVTFQCB  EQU   CVTS01+292                                               01320000
CVTQCS01 EQU   CVTS01+288                                               01321000
CVTAPFT  EQU   CVTS01+284                                               01322000
CVTPARRL EQU   CVTS01+280                                               01323000
CVTVWAIT EQU   CVTS01+276                                               01324000
CVTGSPL  EQU   CVTS01+272                                               01325000
CVTLSMQ  EQU   CVTS01+268                                               01326000
CVTGSMQ  EQU   CVTS01+264                                               01327000
CVTEXPRO EQU   CVTS01+260                                               01328000
CVTOPCTP EQU   CVTS01+256                                               01329000
CVTSIC   EQU   CVTS01+252                                               01330000
CVTTPIOS EQU   CVTS01+248                                               01331000
CVTRTMS  EQU   CVTS01+244                                               01332000
CVTSDBF  EQU   CVTS01+240                                               01333000
CVTSCBP  EQU   CVTS01+236                                               01334000
CVTSDMP  EQU   CVTS01+232                                               01335000
CVTSV60  EQU   CVTS01+228                                               01336000
CVTRTMCT EQU   CVTS01+224                                               01337000
CVTASCBL EQU   CVTS01+220                                               01338000
CVTASCBH EQU   CVTS01+216                                               01339000
CVTGDA   EQU   CVTS01+212                                               01340000
CVTASVT  EQU   CVTS01+208                                               01341000
CVTVVMDI EQU   CVTS01+204                                               01342000
CVTAQTOP EQU   CVTS01+200                                               01343000
CVTIOSCS EQU   CVTS01+196                                               01344000
CVTSDRM  EQU   CVTS01+192                                               01345000
CVTOPTE  EQU   CVTS01+188                                               01346000
CVTSTXU  EQU   CVTS01+184                                               01347000
CVTQUIS  EQU   CVTS01+180                                               01348000
CVTPARS  EQU   CVTS01+176                                               01349000
CVTS1EE  EQU   CVTS01+172                                               01350000
CVTFRAS  EQU   CVTS01+168                                               01351000
CVTQSAS  EQU   CVTS01+164                                               01352000
CVTCRAS  EQU   CVTS01+160                                               01353000
CVTCRMN  EQU   CVTS01+156                                               01354000
CVTDELCP EQU   CVTS01+152                                               01355000
CVTFRECL EQU   CVTS01+148                                               01356000
CVTGETCL EQU   CVTS01+144                                               01357000
CVTBLDCP EQU   CVTS01+140                                               01358000
CVTAUTHL EQU   CVTS01+136                                               01359000
CVTSCAN  EQU   CVTS01+132                                               01360000
CVTRV144 EQU   CVTS01+130                                               01361000
CVTMAXMP EQU   CVTS01+128                                               01362000
CVTSTCK  EQU   CVTS01+124                                               01363000
CVTRV139 EQU   CVTS01+123                                               01364000
CVTDSSAC EQU   CVTS01+122                                               01365000
CVTRV513 EQU   CVTS01+121                                               01366000
CVTIOSPL EQU   CVTS01+120                                               01367000
CVTPTGT  EQU   CVTS01+116                                               01368000
CVTCSPIE EQU   CVTS01+112                                               01369000
CVTSMFEX EQU   CVTS01+108                                               01370000
CVTOLT0A EQU   CVTS01+104                                               01371000
CVTSRBRT EQU   CVTS01+100                                               01372000
CVTPUTL  EQU   CVTS01+96                                                01373000
CVTRV519 EQU   CVTS01+92                                                01374000
CVTRV327 EQU   CVTS01+88                                                01375000
CVTRV326 EQU   CVTS01+84                                                01376000
CVTRV325 EQU   CVTS01+80                                                01377000
CVTRV324 EQU   CVTS01+76                                                01378000
CVT0VL01 EQU   CVTS01+72                                                01379000
CVTSHRVM EQU   CVTS01+68                                                01380000
CVTRV332 EQU   CVTS01+64                                                01381000
CVTTAS   EQU   CVTS01+60                                                01382000
CVTRSCN  EQU   CVTS01+56                                                01383000
CVTTRAC2 EQU   CVTS01+54                                                01384000
CVTTRACE EQU   CVTS01+52                                                01385000
CVTAPG   EQU   CVTS01+51                                                01386000
CVTSDTRC EQU   CVTCTLFG                                                 01387000
CVTGTRCE EQU   CVTCTLFG                                                 01388000
CVTNOMP  EQU   CVTCTLFG                                                 01389000
CVTRSV79 EQU   CVTCTLFG                                                 01390000
CVTDSTAT EQU   CVTCTLFG                                                 01391000
CVTRSV78 EQU   CVTCTLFG                                                 01392000
CVTRV333 EQU   CVTCTLFG                                                 01393000
CVTRV323 EQU   CVTCTLFG                                                 01394000
CVTSPVLK EQU   CVTS01+49                                                01395000
CVTRSV77 EQU   CVTS01+48                                                01396000
CVTRV331 EQU   CVTS01+44                                                01397000
CVTRV330 EQU   CVTS01+40                                                01398000
CVTRV329 EQU   CVTS01+36                                                01399000
CVTRV328 EQU   CVTS01+32                                                01400000
CVTRV322 EQU   CVTS01+28                                                01401000
CVTSLID  EQU   CVTSLIDA+1                                               01402000
CVTSYLK  EQU   CVTSLIDA                                                 01403000
CVTRV321 EQU   CVTS01+20                                                01404000
CVTRV320 EQU   CVTS01+16                                                01405000
CVTLPDIR EQU   CVTLPDIA+1                                               01406000
CVTRSV69 EQU   CVTDIRST                                                 01407000
CVTRSV68 EQU   CVTDIRST                                                 01408000
CVTRSV67 EQU   CVTDIRST                                                 01409000
CVTRSV66 EQU   CVTDIRST                                                 01410000
CVTRSV65 EQU   CVTDIRST                                                 01411000
CVTRSV64 EQU   CVTDIRST                                                 01412000
CVTRSV63 EQU   CVTDIRST                                                 01413000
CVTDICOM EQU   CVTDIRST                                                 01414000
CVTPVTP  EQU   CVTS01+8                                                 01415000
CVTLPDSR EQU   CVTS01+4                                                 01416000
CVTGETL  EQU   CVTS01                                                   01417000
IOBSKSS  EQU   IOBSKADR+3                                               01418000
IOBSK0   EQU   IOBSKADR+2                                               01419000
IOBSKTT  EQU   IOBSKADR+1                                               01420000
IOBSKRV  EQU   IOBSKADR                                                 01421000
IOBCSWSV EQU   IOBORG11+17                                              01422000
IOBSENSV EQU   IOBORG11+16                                              01423000
IOBRCD   EQU   IOBORG11+12                                              01424000
IOBMDREC EQU   IOBORG11+8                                               01425000
IOBNAMEA EQU   IOBNAME+1                                                01426000
IOBNAMSZ EQU   IOBNAME                                                  01427000
IOBERCTA EQU   IOBERCT+1                                                01428000
IOBRTYPE EQU   IOBUCBXV                                                 01429000
IOBRDCHP EQU   IOBORG10+20                                              01430000
IOBNEXTA EQU   IOBORG10+16                                              01431000
IOBREADA EQU   IOBORG10+12                                              01432000
IOBBUFC  EQU   IOBORG10+8                                               01433000
IOBSK2R  EQU   IOBSEEK2+7                                               01434000
IOBSK2HH EQU   IOBSEEK2+5                                               01435000
IOBSK2CC EQU   IOBSEEK2+3                                               01436000
IOBSK2BB EQU   IOBSEEK2+1                                               01437000
IOBSK2M  EQU   IOBSEEK2                                                 01438000
IOBCHNPR EQU   IOBORG09+40                                              01439000
IOBDNCRF EQU   IOBORG09+32                                              01440000
IOBRSV35 EQU   IOBORG09+24                                              01441000
IOBDQPTR EQU   IOBORG09+20                                              01442000
IOBRSV34 EQU   IOBORG09+18                                              01443000
IOBDBYTN EQU   IOBORG09+16                                              01444000
IOBDCPND EQU   IOBORG09+12                                              01445000
IOBSTAT2 EQU   IOBDSTAT+1                                               01446000
IOBSIORT EQU   IOBSTAT1                                                 01447000
IOBADDVU EQU   IOBSTAT1                                                 01448000
IOBBUFF  EQU   IOBSTAT1                                                 01449000
IOBENQUE EQU   IOBSTAT1                                                 01450000
IOBPASS2 EQU   IOBSTAT1                                                 01451000
IOBSYNCH EQU   IOBSTAT1                                                 01452000
IOBNEWVL EQU   IOBSTAT1                                                 01453000
IOBABNRM EQU   IOBSTAT1                                                 01454000
IOBRELEX EQU   IOBDTYP2                                                 01455000
IOBADDTY EQU   IOBDTYP2                                                 01456000
IOBTYPE  EQU   IOBDTYP2                                                 01457000
IOBRQUST EQU   IOBDTYP2                                                 01458000
IOBSUFFX EQU   IOBDTYP2                                                 01459000
IOBSBLKL EQU   IOBDTYP2                                                 01460000
IOBSKEY  EQU   IOBDTYP2                                                 01461000
IOBRELBL EQU   IOBDTYPE                                                 01462000
IOBRDEXC EQU   IOBDTYPE                                                 01463000
IOBDYNBF EQU   IOBDTYPE                                                 01464000
IOBACTAD EQU   IOBDTYPE                                                 01465000
IOBFDBCK EQU   IOBDTYPE                                                 01466000
IOBEXTSC EQU   IOBDTYPE                                                 01467000
IOBOVFLO EQU   IOBDTYPE                                                 01468000
IOBVERFY EQU   IOBDTYPE                                                 01469000
IOBDPLB  EQU   IOBDPLAD+1                                               01470000
IOBDAYLI EQU   IOBDPLAD                                                 01471000
IOBDIOBS EQU   IOBORG09+2                                               01472000
IOBDBYTR EQU   IOBORG09                                                 01473000
IOBBCHAD EQU   IOBORG08+12                                              01474000
IOBFCHNB EQU   IOBFCHAD+1                                               01475000
IOBCOUNT EQU   IOBFCHAD                                                 01476000
IOBASYN  EQU   IOBORG08+7                                               01477000
IOBAPP   EQU   IOBORG08+6                                               01478000
IOBRSV32 EQU   IOBUNSQR                                                 01479000
IOBRSV31 EQU   IOBUNSQR                                                 01480000
IOBRSV30 EQU   IOBUNSQR                                                 01481000
IOBKNRWR EQU   IOBUNSQR                                                 01482000
IOBKNWR  EQU   IOBUNSQR                                                 01483000
IOBNTAV2 EQU   IOBUNSQR                                                 01484000
IOBNTAV1 EQU   IOBUNSQR                                                 01485000
IOBCPBSY EQU   IOBUNSQR                                                 01486000
IOBCHNNL EQU   IOBINDCT                                                 01487000
IOBRSV29 EQU   IOBINDCT                                                 01488000
IOBRSV28 EQU   IOBINDCT                                                 01489000
IOBRSV27 EQU   IOBINDCT                                                 01490000
IOBKEYAD EQU   IOBINDCT                                                 01491000
IOBOVPTR EQU   IOBINDCT                                                 01492000
IOBUNSCH EQU   IOBINDCT                                                 01493000
IOBDEQCP EQU   IOBINDCT                                                 01494000
IOBCCWAD EQU   IOBORG08                                                 01495000
W1OEXTEN EQU   W1IEXTEN                                                 01496000
IOBCCW   EQU   IOBORG06+8                                               01497000
IOBNXTPB EQU   IOBNXTPT+1                                               01498000
IOBRSV26 EQU   IOBSTATA                                                 01499000
IOBRSV25 EQU   IOBSTATA                                                 01500000
IOBRSV24 EQU   IOBSTATA                                                 01501000
IOBRSV23 EQU   IOBSTATA                                                 01502000
IOBRSV22 EQU   IOBSTATA                                                 01503000
IOBRSV21 EQU   IOBSTATA                                                 01504000
IOBRSV20 EQU   IOBSTATA                                                 01505000
IOBAVLFL EQU   IOBSTATA                                                 01506000
IOBRSV37 EQU   IOBORG06+1                                               01507000
IOBUCBXG EQU   IOBORG06                                                 01508000
IOBCPA   EQU   IOBORG05+32                                              01509000
IOBERINF EQU   IOBORG05+16                                              01510000
IOBERCCW EQU   IOBORG05+8                                               01511000
IOBSNDPT EQU   IOBORG05+7                                               01512000
IOBRCVPT EQU   IOBORG05+6                                               01513000
IOBWORK  EQU   IOBORG05+1                                               01514000
IOBUCBX  EQU   IOBORG05                                                 01515000
IOBR     EQU   IOBSEEK+7                                                01516000
IOBHH2   EQU   IOBHH+1                                                  01517000
IOBHH1   EQU   IOBHH                                                    01518000
IOBCC2   EQU   IOBCC+1                                                  01519000
IOBCC1   EQU   IOBCC                                                    01520000
IOBBB2   EQU   IOBBB+1                                                  01521000
IOBBB1   EQU   IOBBB                                                    01522000
IOBM     EQU   IOBSEEK                                                  01523000
IOBRSV46 EQU   IOBFL4                                                   01524000
IOBRSV47 EQU   IOBFL4                                                   01525000
IOBENT   EQU   IOBFL4                                                   01526000
IOBEQP   EQU   IOBFL4                                                   01527000
IOBBUS   EQU   IOBFL4                                                   01528000
IOBDCK   EQU   IOBFL4                                                   01529000
IOBREJ   EQU   IOBFL4                                                   01530000
IOBOVR   EQU   IOBFL4                                                   01531000
IOBCRILC EQU   IOBORG04+1                                               01532000
IOBCRDCC EQU   IOBORG04                                                 01533000
IOBGQECB EQU   IOBORG03                                                 01534000
IOBSWAP  EQU   IOBORG02+4                                               01535000
IOBDQADB EQU   IOBDQADA+1                                               01536000
IOBRSV13 EQU   IOBDEQIN                                                 01537000
IOBRSV12 EQU   IOBDEQIN                                                 01538000
IOBRSV11 EQU   IOBDEQIN                                                 01539000
IOBRSV10 EQU   IOBDEQIN                                                 01540000
IOBRSV09 EQU   IOBDEQIN                                                 01541000
IOBRSV08 EQU   IOBDEQIN                                                 01542000
IOBRSV07 EQU   IOBDEQIN                                                 01543000
IOBDEQ   EQU   IOBDEQIN                                                 01544000
IOBNIOBB EQU   IOBNIOBA+1                                               01545000
IOBUPERR EQU   IOBNFLG1                                                 01546000
IOBSPAN  EQU   IOBNFLG1                                                 01547000
IOBBKSPC EQU   IOBNFLG1                                                 01548000
IOBUPDAT EQU   IOBNFLG1                                                 01549000
IOBREAD  EQU   IOBNFLG1                                                 01550000
IOBWRITE EQU   IOBNFLG1                                                 01551000
IOBPRTOV EQU   IOBNFLG1                                                 01552000
DEBEXPTA EQU   DEBEXPT+1                                                01553000
DEBRSV12 EQU   DEBRPSID                                                 01554000
DEBRSV11 EQU   DEBRPSID                                                 01555000
DEBRSV10 EQU   DEBRPSID                                                 01556000
DEBRSV09 EQU   DEBRPSID                                                 01557000
DEBRPSAP EQU   DEBRPSID                                                 01558000
DEBRPSO  EQU   DEBRPSID                                                 01559000
DEBRPSI  EQU   DEBRPSID                                                 01560000
DEBRPSP  EQU   DEBRPSID                                                 01561000
DEBFOEB  EQU   DEBFOEAD+1                                               01562000
DEBNOEE  EQU   DEBFOEAD                                                 01563000
DEBFPEB  EQU   DEBFPEAD+1                                               01564000
DEBNPEE  EQU   DEBFPEAD                                                 01565000
DEBFIEB  EQU   DEBFIEAD+1                                               01566000
DEBNIEE  EQU   DEBFIEAD                                                 01567000
DEBBOESS EQU   DEBEODSS                                                 01568000
DEBBOE0  EQU   DEBEOD0                                                  01569000
DEBBOETT EQU   DEBEODTT                                                 01570000
DEBBOERV EQU   DEBEODRV                                                 01571000
DEBRV008 EQU   DEBDSID+7                                                01572000
DEBWTPTI EQU   DEBDSID+6                                                01573000
DEBEXDTE EQU   DEBDSID                                                  01574000
DEBRV007 EQU   DEBEAMFG                                                 01575000
DEBRV006 EQU   DEBEAMFG                                                 01576000
DEBRV005 EQU   DEBEAMFG                                                 01577000
DEBRV004 EQU   DEBEAMFG                                                 01578000
DEBSECVL EQU   DEBEAMFG                                                 01579000
DEBVAMSG EQU   DEBEAMFG                                                 01580000
DEBDSOPN EQU   DEBEAMFG                                                 01581000
DEBMULTI EQU   DEBEAMFG                                                 01582000
DEBVSEQU EQU   DEBASC09+2                                               01583000
DEBDSSQL EQU   DEBASC09+1                                               01584000
DEBVOLAC EQU   DEBASC09                                                 01585000
DEBWDCBA EQU   DEBWDCB+1                                                01586000
DEBRSV08 EQU   DEBWDCB                                                  01587000
DEBPDCBA EQU   DEBPDCB+1                                                01588000
DEBRSV07 EQU   DEBPDCB                                                  01589000
DEBRDCBA EQU   DEBRDCB+1                                                01590000
DEBRSV06 EQU   DEBRDCB                                                  01591000
DEBSUCBB EQU   DEBSUCBA+1                                               01592000
DEBSDVM  EQU   DEBSUCBA                                                 01593000
RBRSV161 EQU   RBSECS09+64                                              01594000
RBSIRBWA EQU   RBSECS09                                                 01595000
RBIQEWRK EQU   RBSECS08+4                                               01596000
RBNEXAV  EQU   RBSECS08                                                 01597000
RBIQEA   EQU   RBIQE2                                                   01598000
RBIQE1   EQU   RBIQE+1                                                  01599000
RBUSE    EQU   RBIQE                                                    01600000
RBSQEA   EQU   RBSQE+1                                                  01601000
@NM00055 EQU   RBSQE                                                    01602000
RBCDE1   EQU   RBCDE+1                                                  01603000
RBCDLOAD EQU   RBCDFLGS                                                 01604000
RBCDXCTL EQU   RBCDFLGS                                                 01605000
RBCDSYNC EQU   RBCDFLGS                                                 01606000
RBCDNODE EQU   RBCDFLGS                                                 01607000
RBRSV010 EQU   RBCDFLGS                                                 01608000
RBCDATCH EQU   RBCDFLGS                                                 01609000
RBRSV009 EQU   RBCDFLGS                                                 01610000
RBNOCELL EQU   RBCDFLGS                                                 01611000
PSARSAV  EQU   PSARSVTE+60                                              01612000
PSARSTK  EQU   PSARSVTE+56                                              01613000
PSAESAV3 EQU   PSARSVTE+52                                              01614000
PSAESTK3 EQU   PSARSVTE+48                                              01615000
PSAESAV2 EQU   PSARSVTE+44                                              01616000
PSAESTK2 EQU   PSARSVTE+40                                              01617000
PSAESAV1 EQU   PSARSVTE+36                                              01618000
PSAESTK1 EQU   PSARSVTE+32                                              01619000
PSAPSAV  EQU   PSARSVTE+28                                              01620000
PSAPSTK  EQU   PSARSVTE+24                                              01621000
PSAMSAV  EQU   PSARSVTE+20                                              01622000
PSAMSTK  EQU   PSARSVTE+16                                              01623000
PSASSAV  EQU   PSARSVTE+12                                              01624000
PSASSTK  EQU   PSARSVTE+8                                               01625000
PSANSTK  EQU   PSARSVTE+4                                               01626000
PSACSTK  EQU   PSARSVTE                                                 01627000
@NM00006 EQU   DCBGRTN                                                  01628000
CVTLEVL  EQU   CVTRELNO+2                                               01629000
CVTNUMB  EQU   CVTRELNO                                                 01630000
CVTMDL   EQU   CVTFIX+250                                               01631000
@NM00100 EQU   CVTFIX+248                                               01632000
@NM00099 EQU   CVTFIX                                                   01633000
CVTRV482 EQU   CVTXTNT2+128                                             01634000
CVTRV481 EQU   CVTXTNT2+124                                             01635000
CVTRV480 EQU   CVTXTNT2+120                                             01636000
CVTRV479 EQU   CVTXTNT2+118                                             01637000
CVTRV478 EQU   CVTXTNT2+117                                             01638000
CVTRV477 EQU   CVTXTNT2+116                                             01639000
CVTRV476 EQU   CVTXTNT2+115                                             01640000
CVTRV475 EQU   CVTXTNT2+114                                             01641000
CVTRV474 EQU   CVTRV466                                                 01642000
CVTRV473 EQU   CVTRV466                                                 01643000
CVTRV472 EQU   CVTRV466                                                 01644000
CVTRV471 EQU   CVTRV466                                                 01645000
CVTRV470 EQU   CVTRV466                                                 01646000
CVTRV469 EQU   CVTRV466                                                 01647000
CVTRV468 EQU   CVTRV466                                                 01648000
CVTRV467 EQU   CVTRV466                                                 01649000
CVTRV465 EQU   CVTRV457                                                 01650000
CVTRV464 EQU   CVTRV457                                                 01651000
CVTRV463 EQU   CVTRV457                                                 01652000
CVTRV462 EQU   CVTRV457                                                 01653000
CVTRV461 EQU   CVTRV457                                                 01654000
CVTRV460 EQU   CVTRV457                                                 01655000
CVTRV459 EQU   CVTRV457                                                 01656000
CVTRV458 EQU   CVTRV457                                                 01657000
CVTRV456 EQU   CVTXTNT2+108                                             01658000
CVTRV455 EQU   CVTXTNT2+104                                             01659000
CVTRV454 EQU   CVTXTNT2+100                                             01660000
CVTRV453 EQU   CVTXTNT2+96                                              01661000
CVTRV452 EQU   CVTXTNT2+94                                              01662000
CVTRV451 EQU   CVTXTNT2+92                                              01663000
CVTRV450 EQU   CVTXTNT2+90                                              01664000
CVTRV449 EQU   CVTXTNT2+88                                              01665000
CVTRV448 EQU   CVTXTNT2+87                                              01666000
CVTRV447 EQU   CVTXTNT2+86                                              01667000
CVTRV446 EQU   CVTRV438                                                 01668000
CVTRV445 EQU   CVTRV438                                                 01669000
CVTRV444 EQU   CVTRV438                                                 01670000
CVTRV443 EQU   CVTRV438                                                 01671000
CVTRV442 EQU   CVTRV438                                                 01672000
CVTRV441 EQU   CVTRV438                                                 01673000
CVTRV440 EQU   CVTRV438                                                 01674000
CVTRV439 EQU   CVTRV438                                                 01675000
CVTRV437 EQU   CVTRV429                                                 01676000
CVTRV436 EQU   CVTRV429                                                 01677000
CVTRV435 EQU   CVTRV429                                                 01678000
CVTRV434 EQU   CVTRV429                                                 01679000
CVTRV433 EQU   CVTRV429                                                 01680000
CVTRV432 EQU   CVTRV429                                                 01681000
CVTRV431 EQU   CVTRV429                                                 01682000
CVTRV430 EQU   CVTRV429                                                 01683000
CVTRV428 EQU   CVTXTNT2+80                                              01684000
CVTRV427 EQU   CVTXTNT2+76                                              01685000
CVTRV426 EQU   CVTXTNT2+72                                              01686000
CVTRV425 EQU   CVTXTNT2+68                                              01687000
CVTATACT EQU   CVTATCVT                                                 01688000
CVTRV423 EQU   CVTXTNT2+62                                              01689000
CVTRV422 EQU   CVTXTNT2+60                                              01690000
CVTRV421 EQU   CVTXTNT2+58                                              01691000
CVTRV420 EQU   CVTXTNT2+56                                              01692000
CVTRV419 EQU   CVTXTNT2+55                                              01693000
CVTRV418 EQU   CVTXTNT2+54                                              01694000
CVTRV417 EQU   CVTRV409                                                 01695000
CVTRV416 EQU   CVTRV409                                                 01696000
CVTRV415 EQU   CVTRV409                                                 01697000
CVTRV414 EQU   CVTRV409                                                 01698000
CVTRV413 EQU   CVTRV409                                                 01699000
CVTRV412 EQU   CVTRV409                                                 01700000
CVTRV411 EQU   CVTRV409                                                 01701000
CVTRV410 EQU   CVTRV409                                                 01702000
CVTRV408 EQU   CVTRV400                                                 01703000
CVTRV407 EQU   CVTRV400                                                 01704000
CVTRV406 EQU   CVTRV400                                                 01705000
CVTRV405 EQU   CVTRV400                                                 01706000
CVTRV404 EQU   CVTRV400                                                 01707000
CVTRV403 EQU   CVTRV400                                                 01708000
CVTRV402 EQU   CVTRV400                                                 01709000
CVTRV401 EQU   CVTRV400                                                 01710000
CVTICB   EQU   CVTXTNT2+48                                              01711000
CVTSKTA  EQU   CVTXTNT2+44                                              01712000
CVTRSV99 EQU   CVTXTNT2+40                                              01713000
CVTRSV98 EQU   CVTXTNT2+36                                              01714000
CVTRSV97 EQU   CVTXTNT2+34                                              01715000
CVTRSV96 EQU   CVTXTNT2+32                                              01716000
CVTOLTEP EQU   CVTXTNT2+28                                              01717000
CVTQIDA  EQU   CVTQID+1                                                 01718000
CVTRSV95 EQU   CVTQID                                                   01719000
CVTRSV94 EQU   CVTXTNT2+20                                              01720000
CVTRSV93 EQU   CVTXTNT2+16                                              01721000
CVTRSV92 EQU   CVTXTNT2+12                                              01722000
CVTDEBVR EQU   CVTXTNT2+8                                               01723000
CVTRSV91 EQU   CVTXTNT2+6                                               01724000
CVTRSV9H EQU   CVTFLGBT                                                 01725000
CVTRSV9G EQU   CVTFLGBT                                                 01726000
CVTRSV9F EQU   CVTFLGBT                                                 01727000
CVTRSV9E EQU   CVTFLGBT                                                 01728000
CVTRSV9D EQU   CVTFLGBT                                                 01729000
CVTRSV9C EQU   CVTFLGBT                                                 01730000
CVTVME   EQU   CVTFLGBT                                                 01731000
CVTNPE   EQU   CVTFLGBT                                                 01732000
CVTNUCLS EQU   CVTXTNT2+4                                               01733000
CVTDSSVA EQU   CVTDSSV+1                                                01734000
CVTRSV89 EQU   CVTDSSV                                                  01735000
CVTRSV88 EQU   CVTXTNT1+8                                               01736000
CVTRSV87 EQU   CVTXTNT1+4                                               01737000
CVTFACHN EQU   CVTXTNT1                                                 01738000
CVTRV488 EQU   CVTMAP+412                                               01739000
CVTRV487 EQU   CVTMAP+408                                               01740000
CVTRV486 EQU   CVTMAP+404                                               01741000
CVTRV485 EQU   CVTMAP+400                                               01742000
CVTACTAP EQU   CVTMAP+396                                               01743000
CVTAUTH  EQU   CVTMAP+392                                               01744000
CVTATMCA EQU   CVTATMCT+1                                               01745000
CVTATMST EQU   CVTATMCT                                                 01746000
CVTRSV61 EQU   CVTMAP+384                                               01747000
CVTVOLT1 EQU   CVTVOLM1+1                                               01748000
CVTVOLI1 EQU   CVTVOLF1                                                 01749000
CVTSTOA  EQU   CVTMAP+376                                               01750000
CVTRSV58 EQU   CVTMAP+374                                               01751000
CVTRSV57 EQU   CVTMAP+372                                               01752000
CVTDDCE  EQU   CVTMAP+368                                               01753000
CVTPNWFR EQU   CVTMAP+364                                               01754000
CVTSMF   EQU   CVTMAP+360                                               01755000
CVTSULK  EQU   CVTMAP+358                                               01756000
CVTSLKO  EQU   CVTSYSK                                                  01757000
CVTSLKP  EQU   CVTSYSK                                                  01758000
CVTSLKQ  EQU   CVTSYSK                                                  01759000
CVTSLKR  EQU   CVTSYSK                                                  01760000
CVTRSV56 EQU   CVTSYSK                                                  01761000
CVTRSV55 EQU   CVTSYSK                                                  01762000
CVTRSV54 EQU   CVTSYSK                                                  01763000
CVTRSV53 EQU   CVTSYSK                                                  01764000
CVTRSV52 EQU   CVTA1F1                                                  01765000
CVTRSV51 EQU   CVTA1F1                                                  01766000
CVTRSV50 EQU   CVTA1F1                                                  01767000
CVTRSV49 EQU   CVTA1F1                                                  01768000
CVTRSV48 EQU   CVTA1F1                                                  01769000
CVTRSV47 EQU   CVTA1F1                                                  01770000
CVTSRSW  EQU   CVTA1F1                                                  01771000
CVTPFSW  EQU   CVTA1F1                                                  01772000
CVTPCVT  EQU   CVTMAP+352                                               01773000
CVTRSV46 EQU   CVTMAP+344                                               01774000
CVTRSV45 EQU   CVTMAP+340                                               01775000
CVTRSV44 EQU   CVTMAP+338                                               01776000
CVTRSV43 EQU   CVTMAP+336                                               01777000
CVTHJESA EQU   CVTHJES+1                                                01778000
CVTRSV42 EQU   CVTHJES                                                  01779000
CVTEXT2A EQU   CVTEXT2+1                                                01780000
CVTRSV41 EQU   CVTEXT2                                                  01781000
CVTAPFA  EQU   CVTAPF+1                                                 01782000
CVTRSV40 EQU   CVTAPF                                                   01783000
CVTRV518 EQU   CVTINTLA                                                 01784000
CVTRV517 EQU   CVTERPV                                                  01785000
CVTEORM  EQU   CVTMAP+312                                               01786000
CVTMCHPR EQU   CVTMAP+308                                               01787000
CVTTZ    EQU   CVTMAP+304                                               01788000
CVTJEPS  EQU   CVTMAP+300                                               01789000
CVTJESCT EQU   CVTMAP+296                                               01790000
CVTMODE  EQU   CVTMAP+292                                               01791000
CVTPTRV  EQU   CVTMAP+288                                               01792000
CVTREAL  EQU   CVTMAP+284                                               01793000
CVTRSV39 EQU   CVTMAP+280                                               01794000
CVTRSV38 EQU   CVTMAP+276                                               01795000
CVTDMSRA EQU   CVTDMSR+1                                                01796000
CVTRSV37 EQU   CVTDMSR                                                  01797000
CVTQMSGA EQU   CVTQMSG+1                                                01798000
CVTRSV36 EQU   CVTQMSG                                                  01799000
CVTAMFF  EQU   CVTMAP+264                                               01800000
CVTPURGA EQU   CVTPURG+1                                                01801000
CVTRSV35 EQU   CVTPURG                                                  01802000
CVTCBSP  EQU   CVTMAP+256                                               01803000
CVTATERA EQU   CVTATER+1                                                01804000
CVTSYST  EQU   CVTATER                                                  01805000
CVTVOLT2 EQU   CVTTAT                                                   01806000
CVTVOLI2 EQU   CVTVOLF2                                                 01807000
CVTAQAVB EQU   CVTAQAVT+1                                               01808000
CVTRSV34 EQU   CVTTCMFG                                                 01809000
CVTRSV33 EQU   CVTTCMFG                                                 01810000
CVTRSV32 EQU   CVTTCMFG                                                 01811000
CVTRSV31 EQU   CVTTCMFG                                                 01812000
CVTRSV30 EQU   CVTTCMFG                                                 01813000
CVTRSV29 EQU   CVTTCMFG                                                 01814000
CVTRSV28 EQU   CVTTCMFG                                                 01815000
CVTTCRDY EQU   CVTTCMFG                                                 01816000
CVTGTFA  EQU   CVTGTF+1                                                 01817000
CVTRSV27 EQU   CVTGTFST                                                 01818000
CVTRNIO  EQU   CVTGTFST                                                 01819000
CVTUSR   EQU   CVTGTFST                                                 01820000
CVTRV318 EQU   CVTFORM                                                  01821000
CVTRV317 EQU   CVTTMODE                                                 01822000
CVTRV316 EQU   CVTSTATE                                                 01823000
CVTRV315 EQU   CVTGTFS                                                  01824000
CVTGTFAV EQU   CVTGTFS                                                  01825000
CVT0SCR1 EQU   CVTMAP+232                                               01826000
CVTRV515 EQU   CVTMAP+228                                               01827000
CVTRMS   EQU   CVTMAP+224                                               01828000
CVTPATCH EQU   CVTMAP+220                                               01829000
CVTTSCE  EQU   CVTMAP+216                                               01830000
CVTLNKSC EQU   CVTMAP+214                                               01831000
CVTQABST EQU   CVTMAP+212                                               01832000
CVTMDLDS EQU   CVTMAP+208                                               01833000
CVTUSER  EQU   CVTMAP+204                                               01834000
CVTABEND EQU   CVTMAP+200                                               01835000
CVTSMCA  EQU   CVTMAP+196                                               01836000
CVTRSV18 EQU   CVTMAP+192                                               01837000
CVTQLPAQ EQU   CVTMAP+188                                               01838000
CVTQCDSR EQU   CVTMAP+184                                               01839000
CVTRSV17 EQU   CVTOPTB                                                  01840000
CVTRSV16 EQU   CVTOPTB                                                  01841000
CVTFP    EQU   CVTOPTB                                                  01842000
CVTAPTHR EQU   CVTOPTB                                                  01843000
CVTNLOG  EQU   CVTOPTB                                                  01844000
CVTTOD   EQU   CVTOPTB                                                  01845000
CVTCTIMS EQU   CVTOPTB                                                  01846000
CVTPROT  EQU   CVTOPTB                                                  01847000
CVTXPFP  EQU   CVTOPTA                                                  01848000
CVTASCII EQU   CVTOPTA                                                  01849000
CVTRSV13 EQU   CVTOPTA                                                  01850000
CVTRSV12 EQU   CVTOPTA                                                  01851000
CVTNIP   EQU   CVTOPTA                                                  01852000
CVTDDR   EQU   CVTOPTA                                                  01853000
CVTAPR   EQU   CVTOPTA                                                  01854000
CVTCCH   EQU   CVTOPTA                                                  01855000
CVTSNCTR EQU   CVTMAP+180                                               01856000
CVTQMWR  EQU   CVTMAP+176                                               01857000
CVTQOCR  EQU   CVTMAP+172                                               01858000
CVT1EF00 EQU   CVTMAP+168                                               01859000
CVTMZ00  EQU   CVTMAP+164                                               01860000
CVTHEAD  EQU   CVTMAP+160                                               01861000
CVTRSV11 EQU   CVTMAP+156                                               01862000
CVT0PT01 EQU   CVTMAP+152                                               01863000
CVTMSER  EQU   CVTMAP+148                                               01864000
CVTRV516 EQU   CVTIERLC                                                 01865000
CVTILCH  EQU   CVTMAP+140                                               01866000
CVT0DS   EQU   CVTMAP+136                                               01867000
CVTFBOSV EQU   CVTMAP+132                                               01868000
CVTNUCB  EQU   CVTMAP+128                                               01869000
CVTIXAVL EQU   CVTMAP+124                                               01870000
CVTIOQET EQU   CVTMAP+120                                               01871000
CVTDCBA  EQU   CVTMAP+117                                               01872000
CVTMVS2  EQU   CVTDCB                                                   01873000
CVT6DAT  EQU   CVTDCB                                                   01874000
CVT4MPS  EQU   CVTDCB                                                   01875000
CVTRSV09 EQU   CVTDCB                                                   01876000
CVT4MS1  EQU   CVTDCB                                                   01877000
CVT2SPS  EQU   CVTDCB                                                   01878000
CVT1SSS  EQU   CVTDCB                                                   01879000
CVTRSV08 EQU   CVTDCB                                                   01880000
CVTSTB   EQU   CVTMAP+112                                               01881000
CVTQTD00 EQU   CVTMAP+108                                               01882000
CVTQTE00 EQU   CVTMAP+104                                               01883000
CVTCUCB  EQU   CVTMAP+100                                               01884000
CVTSJQ   EQU   CVTMAP+96                                                01885000
CVTPBLDL EQU   CVTMAP+92                                                01886000
CVTTPC   EQU   CVTMAP+88                                                01887000
CVTBRET  EQU   CVTMAP+82                                                01888000
CVTEXIT  EQU   CVTMAP+80                                                01889000
CVT0FN00 EQU   CVTMAP+76                                                01890000
CVTDARA  EQU   CVTDAR+1                                                 01891000
CVTRSV07 EQU   CVTFLGS1                                                 01892000
CVTRSV06 EQU   CVTFLGS1                                                 01893000
CVTRSV05 EQU   CVTFLGS1                                                 01894000
CVTRSV04 EQU   CVTFLGS1                                                 01895000
CVTRSV03 EQU   CVTFLGS1                                                 01896000
CVTRSV02 EQU   CVTFLGS1                                                 01897000
CVTRSV01 EQU   CVTFLGS1                                                 01898000
CVTDMPLK EQU   CVTFLGS1                                                 01899000
CVTXITP  EQU   CVTMAP+68                                                01900000
CVTZDTAB EQU   CVTMAP+64                                                01901000
CVTMSLT  EQU   CVTMAP+60                                                01902000
CVTDATE  EQU   CVTMAP+56                                                01903000
CVTBTERM EQU   CVTMAP+52                                                01904000
CVTSYSAD EQU   CVTMAP+48                                                01905000
CVTXTLER EQU   CVTMAP+44                                                01906000
CVTILK2  EQU   CVTMAP+40                                                01907000
CVTILK1  EQU   CVTMAP+36                                                01908000
CVTPRLTV EQU   CVTMAP+32                                                01909000
CVTPCNVT EQU   CVTMAP+28                                                01910000
CVT0VL00 EQU   CVTMAP+24                                                01911000
CVTXAPG  EQU   CVTMAP+20                                                01912000
CVTBUF   EQU   CVTMAP+16                                                01913000
CVTJOB   EQU   CVTMAP+12                                                01914000
CVTLINK  EQU   CVTMAP+8                                                 01915000
CVT0EF00 EQU   CVTMAP+4                                                 01916000
CVTTCBP  EQU   CVTMAP                                                   01917000
DCBPRECL EQU   IHADCS40+18                                              01918000
@NM00098 EQU   IHADCS40+16                                              01919000
@NM00097 EQU   @NM00095+1                                               01920000
@NM00096 EQU   DCBEROPT                                                 01921000
DCBERABE EQU   DCBEROPT                                                 01922000
DCBERSKP EQU   DCBEROPT                                                 01923000
DCBERACC EQU   DCBEROPT                                                 01924000
@NM00094 EQU   IHADCS40+10                                              01925000
@NM00093 EQU   IHADCS40+9                                               01926000
@NM00092 EQU   IHADCS40+8                                               01927000
DCBRECA  EQU   DCBRECAD+1                                               01928000
@NM00091 EQU   DCBRECBT                                                 01929000
DCBRCFGT EQU   DCBRCREL                                                 01930000
DCBRCTRU EQU   DCBRCREL                                                 01931000
DCBLCCW  EQU   DCBEOBAD                                                 01932000
DCBNOTE  EQU   DCBCNTRL                                                 01933000
@NM00090 EQU   IHADCS38+8                                               01934000
DCBEOBW  EQU   IHADCS38+4                                               01935000
DCBEOBRA EQU   DCBEOBR+1                                                01936000
DCBNCP   EQU   DCBEOBR                                                  01937000
@NM00089 EQU   DCBFLAG1                                                 01938000
DCBSTFLS EQU   DCBFLAG1                                                 01939000
DCBSTQCK EQU   DCBFLAG1                                                 01940000
DCBDIRCQ EQU   DCBBUFOF                                                 01941000
DCBQSTRU EQU   DCBUSASI                                                 01942000
@NM00088 EQU   DCBUSASI                                                 01943000
DCBQADF3 EQU   DCBQADFS                                                 01944000
DCBQADF2 EQU   DCBQADFS                                                 01945000
DCBQADF1 EQU   DCBQADFS                                                 01946000
DCBBLBP  EQU   DCBUSASI                                                 01947000
@NM00087 EQU   DCBUSASI                                                 01948000
DCBCICBA EQU   DCBCICB+1                                                01949000
@NM00086 EQU   DCBCICB                                                  01950000
DCBOFFSW EQU   IHADCS36+15                                              01951000
DCBWCPL  EQU   IHADCS36+13                                              01952000
DCBWCPO  EQU   IHADCS36+12                                              01953000
DCBCNQSM EQU   DCBCIND2                                                 01954000
DCBCNFEO EQU   DCBCIND2                                                 01955000
DCBCNCHS EQU   DCBCIND2                                                 01956000
DCBCNBFP EQU   DCBCIND2                                                 01957000
DCBCNIOE EQU   DCBCIND2                                                 01958000
DCBCNCLO EQU   DCBCIND2                                                 01959000
DCBCNWRO EQU   DCBCIND2                                                 01960000
DCBCNSTO EQU   DCBCIND2                                                 01961000
DCBCNEXB EQU   DCBCIND1                                                 01962000
@NM00085 EQU   DCBCIND1                                                 01963000
DCBCNBRM EQU   DCBCIND1                                                 01964000
@NM00084 EQU   DCBCIND1                                                 01965000
DCBCNEVA EQU   DCBCIND1                                                 01966000
DCBCNEVB EQU   DCBCIND1                                                 01967000
DCBCNSRD EQU   DCBCIND1                                                 01968000
DCBCNTOV EQU   DCBCIND1                                                 01969000
DCBSYNA  EQU   DCBSYNAD+1                                               01970000
DCBCHCKA EQU   DCBPERRA                                                 01971000
@NM00083 EQU   DCBOPTCD                                                 01972000
DCBOPTT  EQU   DCBOPTCD                                                 01973000
DCBSRCHD EQU   DCBOPTZ                                                  01974000
DCBOPTQ  EQU   DCBOPTCD                                                 01975000
DCBBCKPT EQU   DCBOPTO                                                  01976000
DCBOPTC  EQU   DCBOPTCD                                                 01977000
DCBOPTU  EQU   DCBOPTCD                                                 01978000
DCBOPTW  EQU   DCBOPTCD                                                 01979000
DCBPUTA  EQU   DCBGETA                                                  01980000
@NM00082 EQU   DCBPUT                                                   01981000
DCBREADA EQU   DCBWRITA                                                 01982000
@NM00081 EQU   DCBREAD                                                  01983000
DCBDEBA  EQU   DCBDEBAD+1                                               01984000
@NM00080 EQU   DCBIFLGS                                                 01985000
DCBIFIOE EQU   DCBIFLGS                                                 01986000
DCBIFPCT EQU   DCBIFLGS                                                 01987000
DCBIFEC  EQU   DCBIFLGS                                                 01988000
DCBMFSTI EQU   DCBMFDMD                                                 01989000
DCBMFAWR EQU   DCBMFSTK                                                 01990000
DCBMFUIP EQU   DCBMFTMD                                                 01991000
DCBMFIDW EQU   DCBMFLCP                                                 01992000
DCBMFWRK EQU   DCBMFMVP                                                 01993000
DCBMFRDQ EQU   DCBMFWRT                                                 01994000
DCBMFGTQ EQU   DCBMFPUT                                                 01995000
DCBMFSTL EQU   DCBMACF2                                                 01996000
DCBMFCK  EQU   DCBMFDMG                                                 01997000
DCBMFRDX EQU   DCBMFCHK                                                 01998000
DCBMFDBF EQU   DCBMFSBG                                                 01999000
DCBMFRDI EQU   DCBMFLCG                                                 02000000
DCBMFRDK EQU   DCBMFMVG                                                 02001000
DCBMFWRQ EQU   DCBMFRD                                                  02002000
DCBMFPTQ EQU   DCBMFGET                                                 02003000
DCBMFECP EQU   DCBMACF1                                                 02004000
DCBTIOT  EQU   IHADCS25                                                 02005000
DCBMRSTI EQU   DCBMRDMD                                                 02006000
DCBMRAWR EQU   DCBMRSTK                                                 02007000
DCBMRUIP EQU   DCBMRTMD                                                 02008000
DCBMRIDW EQU   DCBMRLCP                                                 02009000
DCBMRWRK EQU   DCBMRMVP                                                 02010000
DCBMRRDQ EQU   DCBMRWRT                                                 02011000
DCBMRGTQ EQU   DCBMRPUT                                                 02012000
DCBMRSTL EQU   DCBMACR2                                                 02013000
DCBMRCK  EQU   DCBMRDMG                                                 02014000
DCBPGFXA EQU   DCBMRRDX                                                 02015000
DCBMRDBF EQU   DCBMRSBG                                                 02016000
DCBMRRDI EQU   DCBMRLCG                                                 02017000
DCBMRRDK EQU   DCBMRMVG                                                 02018000
DCBMRWRQ EQU   DCBMRRD                                                  02019000
DCBMRPTQ EQU   DCBMRGET                                                 02020000
DCBMRECP EQU   DCBMACR1                                                 02021000
@NM00079 EQU   DCBIFLG                                                  02022000
DCBIBIOE EQU   DCBIFLG                                                  02023000
DCBIBPCT EQU   DCBIFLG                                                  02024000
DCBIBEC  EQU   DCBIFLG                                                  02025000
DCBOFIOF EQU   DCBOFLGS                                                 02026000
DCBOFUEX EQU   DCBOFLGS                                                 02027000
DCBOFTM  EQU   DCBOFLGS                                                 02028000
DCBOFPPC EQU   DCBOFLGS                                                 02029000
DCBOFOPN EQU   DCBOFLGS                                                 02030000
DCBOFEOV EQU   DCBOFLGS                                                 02031000
DCBOFLRB EQU   DCBOFLGS                                                 02032000
DCBOFIOD EQU   DCBOFLWR                                                 02033000
DCBDDNAM EQU   IHADCS24                                                 02034000
DCBEXLSA EQU   DCBEXLST+1                                               02035000
DCBRECKL EQU   DCBRECFM                                                 02036000
DCBRECCC EQU   DCBRECFM                                                 02037000
DCBRECSB EQU   DCBRECFM                                                 02038000
DCBRECBR EQU   DCBRECFM                                                 02039000
DCBRECTO EQU   DCBRECLA                                                 02040000
DCBRECL  EQU   DCBRECLA                                                 02041000
DCBEODA  EQU   DCBEODAD+1                                               02042000
DCBBFA   EQU   DCBBFTEK                                                 02043000
DCBH0    EQU   DCBBFTEK                                                 02044000
DCBBFTKD EQU   DCBBFTEK                                                 02045000
DCBBFTE  EQU   DCBBFT                                                   02046000
DCBBFTKR EQU   DCBBFT                                                   02047000
DCBBFTS  EQU   DCBBFT                                                   02048000
DCBH1    EQU   DCBBFTEK                                                 02049000
DCBSVCXA EQU   DCBSVCXL+1                                               02050000
@NM00078 EQU   DCBSVCXL                                                 02051000
DCBODEBA EQU   DCBIOBAA                                                 02052000
@NM00077 EQU   DCBQSLM                                                  02053000
DCBUPDBT EQU   DCBQSLM                                                  02054000
DCBUPDCM EQU   DCBQSLM                                                  02055000
DCB1DVDS EQU   DCBQSLM                                                  02056000
@NM00076 EQU   DCBDSRG2                                                 02057000
DCBDSGTR EQU   DCBDSRG2                                                 02058000
DCBACBM  EQU   DCBDSRG2                                                 02059000
@NM00075 EQU   DCBDSRG2                                                 02060000
DCBDSGTQ EQU   DCBDSRG2                                                 02061000
DCBDSGTX EQU   DCBDSRG2                                                 02062000
DCBDSGGS EQU   DCBDSRG2                                                 02063000
DCBDSGU  EQU   DCBDSRG1                                                 02064000
DCBDSGPO EQU   DCBDSRG1                                                 02065000
DCBDSGMQ EQU   DCBDSRG1                                                 02066000
DCBDSGCQ EQU   DCBDSRG1                                                 02067000
DCBDSGCX EQU   DCBDSRG1                                                 02068000
DCBDSGDA EQU   DCBDSRG1                                                 02069000
DCBDSGIS EQU   DCBDSRG1                                                 02070000
DCBBUFL  EQU   IHADCS11+8                                               02071000
DCBBUFCA EQU   DCBBUFCB+1                                               02072000
DCBBUFNO EQU   DCBBUFCB                                                 02073000
DCBDEVT  EQU   DCBREL                                                   02074000
DCBKEYLE EQU   DCBRELB                                                  02075000
@NM00074 EQU   IHADCS10+19                                              02076000
DCBAPPIN EQU   IHADCS10+18                                              02077000
@NM00073 EQU   IHADCS10+17                                              02078000
DCBMRUE  EQU   DCBMRFLG                                                 02079000
DCBMRDWT EQU   DCBMRFLG                                                 02080000
DCBMRPCC EQU   DCBMRFLG                                                 02081000
DCBMRDR  EQU   DCBMRFLG                                                 02082000
DCBMRDRU EQU   DCBMRFLG                                                 02083000
DCBMRDBG EQU   DCBMRFLG                                                 02084000
DCBMRSCC EQU   DCBMRFLG                                                 02085000
DCBECBLA EQU   DCBHDR+1                                                 02086000
DCBMRERS EQU   DCBMRIND                                                 02087000
DCBMRERP EQU   DCBMRIND                                                 02088000
DCBMRPLS EQU   DCBMRIND                                                 02089000
DCBMRPLO EQU   DCBMRIND                                                 02090000
DCBMRSCU EQU   DCBMRIND                                                 02091000
DCBMRDCT EQU   DCBMRIND                                                 02092000
DCBIMAGA EQU   DCBIMAGE+1                                               02093000
@NM00072 EQU   DCBMRFG                                                  02094000
DCBMRBCT EQU   DCBMRFG                                                  02095000
DCBSSADA EQU   DCBIMG+1                                                 02096000
@NM00071 EQU   DCBIMG                                                   02097000
DCBQSMEX EQU   @NM00070                                                 02098000
DCBWTOIA EQU   DCBWTOID+1                                               02099000
@NM00069 EQU   DCBWTOID                                                 02100000
@NM00068 EQU   IHADCB                                                   02101000
IOBERRCT EQU   IOBSTDRD+30                                              02102000
IOBRSV19 EQU   IOBINCAM+1                                               02103000
IOBOLTST EQU   IOBBTAMF                                                 02104000
IOBRFTMG EQU   IOBBTAMF                                                 02105000
IOBRSV17 EQU   IOBBTAMF                                                 02106000
IOBRSV16 EQU   IOBBTAMF                                                 02107000
IOBRSV15 EQU   IOBBTAMF                                                 02108000
IOBRSV14 EQU   IOBBTAMF                                                 02109000
IOBINUSE EQU   IOBBTAMF                                                 02110000
IOBPRMER EQU   IOBBTAMF                                                 02111000
IOBRSTRB EQU   IOBRESTR+1                                               02112000
IOBREPOS EQU   IOBRESTR                                                 02113000
IOBDCBPB EQU   IOBDCBPT+1                                               02114000
IOBRSV44 EQU   IOBFLAG4                                                 02115000
IOBJES3I EQU   IOBFLAG4                                                 02116000
IOBRSV42 EQU   IOBFLAG4                                                 02117000
IOBRSV41 EQU   IOBFLAG4                                                 02118000
IOBRSV40 EQU   IOBFLAG4                                                 02119000
IOBPMERR EQU   IOBFLAG4                                                 02120000
IOBCC3WE EQU   IOBFLAG4                                                 02121000
IOBGDPOL EQU   IOBFLAG4                                                 02122000
IOBSTRTB EQU   IOBSTART+1                                               02123000
IOBSIOCC EQU   IOBSTART                                                 02124000
IOBSTBYT EQU   IOBIOCSW+3                                               02125000
IOBCMDA  EQU   IOBIOCSW                                                 02126000
IOBLOG   EQU   IOBFL3                                                   02127000
IOBICL   EQU   IOBFL3                                                   02128000
IOBMSG   EQU   IOBFL3                                                   02129000
IOBCNC   EQU   IOBFL3                                                   02130000
IOBACU   EQU   IOBFL3                                                   02131000
IOBCDC   EQU   IOBFL3                                                   02132000
IOBICC   EQU   IOBFL3                                                   02133000
IOBCCC   EQU   IOBFL3                                                   02134000
IOBECBPB EQU   IOBECBPT+1                                               02135000
IOBECBCC EQU   IOBECBPT                                                 02136000
IOBS1B7  EQU   IOBSENS1                                                 02137000
IOBS1B6  EQU   IOBSENS1                                                 02138000
IOBS1B5  EQU   IOBSENS1                                                 02139000
IOBS1B4  EQU   IOBSENS1                                                 02140000
IOBS1B3  EQU   IOBSENS1                                                 02141000
IOBS1B2  EQU   IOBSENS1                                                 02142000
IOBS1B1  EQU   IOBSENS1                                                 02143000
IOBS1B0  EQU   IOBSENS1                                                 02144000
IOBSNSC9 EQU   IOBS0B7                                                  02145000
IOBS0B6  EQU   IOBSENS0                                                 02146000
IOBS0B5  EQU   IOBSENS0                                                 02147000
IOBS0B4  EQU   IOBSENS0                                                 02148000
IOBS0B3  EQU   IOBSENS0                                                 02149000
IOBS0B2  EQU   IOBSENS0                                                 02150000
IOBS0B1  EQU   IOBSENS0                                                 02151000
IOBS0B0  EQU   IOBSENS0                                                 02152000
IOBPNCH  EQU   IOBFLAG2                                                 02153000
IOBSTATO EQU   IOBFLAG2                                                 02154000
IOBSKUPD EQU   IOBFLAG2                                                 02155000
IOBALTTR EQU   IOBFLAG2                                                 02156000
IOBRRT2  EQU   IOBRDHA0                                                 02157000
IOBRRT3  EQU   IOBPURGE                                                 02158000
IOBSENSE EQU   IOBFLAG2                                                 02159000
IOBHALT  EQU   IOBFLAG2                                                 02160000
IOBSPSVC EQU   IOBRSTRT                                                 02161000
IOBUNREL EQU   IOBFLAG1                                                 02162000
IOBIOERR EQU   IOBFLAG1                                                 02163000
IOBFCREX EQU   IOBCYCCK                                                 02164000
IOBRPSTN EQU   IOBFLAG1                                                 02165000
IOBERRTN EQU   IOBFLAG1                                                 02166000
IOBDATCH EQU   IOBFLAG1                                                 02167000
IOBCNOPA EQU   IOBPREFX+12                                              02168000
IOBCICB  EQU   IOBPREFX+8                                               02169000
IOBCECB  EQU   IOBPREFX+4                                               02170000
IOBCONOP EQU   IOBPREFX+3                                               02171000
IOBCINOP EQU   IOBPREFX+2                                               02172000
IOBRSV05 EQU   IOBPREFX+1                                               02173000
IOBPCI   EQU   IOBCFLG1                                                 02174000
IOBRSTCH EQU   IOBCFLG1                                                 02175000
IOBABAPP EQU   IOBCFLG1                                                 02176000
IOBPTST  EQU   IOBCFLG1                                                 02177000
IOBRSV04 EQU   IOBCFLG1                                                 02178000
IOBRSV03 EQU   IOBCFLG1                                                 02179000
IOBRSV02 EQU   IOBCFLG1                                                 02180000
IOBRSV01 EQU   IOBCFLG1                                                 02181000
@NM00067 EQU   CCWS+5                                                   02182000
@NM00066 EQU   CCWOPCDE                                                 02183000
@NM00065 EQU   CCW+4                                                    02184000
@NM00064 EQU   CCW                                                      02185000
@NM00063 EQU   TCBXTNT2+32                                              02186000
TCBRV181 EQU   TCBRV173                                                 02187000
TCBRV180 EQU   TCBRV173                                                 02188000
TCBRV179 EQU   TCBRV173                                                 02189000
TCBRV178 EQU   TCBRV173                                                 02190000
TCBRV177 EQU   TCBRV173                                                 02191000
TCBRV176 EQU   TCBRV173                                                 02192000
TCBRV175 EQU   TCBRV173                                                 02193000
TCBRV174 EQU   TCBRV173                                                 02194000
TCBRV172 EQU   TCBRV164                                                 02195000
TCBRV171 EQU   TCBRV164                                                 02196000
TCBRV170 EQU   TCBRV164                                                 02197000
TCBRV169 EQU   TCBRV164                                                 02198000
TCBRV168 EQU   TCBRV164                                                 02199000
TCBRV167 EQU   TCBRV164                                                 02200000
TCBRV166 EQU   TCBRV164                                                 02201000
TCBRV165 EQU   TCBRV164                                                 02202000
TCBRV163 EQU   TCBRV155                                                 02203000
TCBRV162 EQU   TCBRV155                                                 02204000
TCBRV161 EQU   TCBRV155                                                 02205000
TCBRV160 EQU   TCBRV155                                                 02206000
TCBRV159 EQU   TCBRV155                                                 02207000
TCBRV158 EQU   TCBRV155                                                 02208000
TCBRV157 EQU   TCBRV155                                                 02209000
TCBRV156 EQU   TCBRV155                                                 02210000
TCBRV154 EQU   TCBRV146                                                 02211000
TCBRV153 EQU   TCBRV146                                                 02212000
TCBRV152 EQU   TCBRV146                                                 02213000
TCBRV151 EQU   TCBRV146                                                 02214000
TCBRV150 EQU   TCBRV146                                                 02215000
TCBRV149 EQU   TCBRV146                                                 02216000
TCBRV148 EQU   TCBRV146                                                 02217000
TCBRV147 EQU   TCBRV146                                                 02218000
TCBRV145 EQU   TCBXTNT2+26                                              02219000
TCBRV144 EQU   TCBXTNT2+24                                              02220000
TCBRV143 EQU   TCBXTNT2+20                                              02221000
TCBRV142 EQU   TCBXTNT2+16                                              02222000
TCBRSV49 EQU   TCBXTNT2+12                                              02223000
TCBEVENT EQU   TCBXTNT2+8                                               02224000
TCBRCMP  EQU   TCBXTNT2+5                                               02225000
TCBRSVAB EQU   TCBXTNT2+4                                               02226000
TCBGTFA  EQU   TCBGTF+1                                                 02227000
TCBRSV47 EQU   TCBTFLG                                                  02228000
TCBRSV46 EQU   TCBTFLG                                                  02229000
TCBRSV45 EQU   TCBTFLG                                                  02230000
TCBRSV44 EQU   TCBTFLG                                                  02231000
TCBRSV43 EQU   TCBTFLG                                                  02232000
TCBDSPIT EQU   TCBTFLG                                                  02233000
TCBERRTN EQU   TCBTFLG                                                  02234000
TCBASYNC EQU   TCBTFLG                                                  02235000
@NM00062 EQU   TCB+296                                                  02236000
TCBRV185 EQU   TCB+292                                                  02237000
TCBSWASA EQU   TCB+288                                                  02238000
TCBDBTB  EQU   TCB+284                                                  02239000
TCBRPT   EQU   TCB+280                                                  02240000
TCBRV141 EQU   TCBRV133                                                 02241000
TCBRV140 EQU   TCBRV133                                                 02242000
TCBRV139 EQU   TCBRV133                                                 02243000
TCBRV138 EQU   TCBRV133                                                 02244000
TCBRV137 EQU   TCBRV133                                                 02245000
TCBRV136 EQU   TCBRV133                                                 02246000
TCBRV135 EQU   TCBRV133                                                 02247000
TCBRV134 EQU   TCBRV133                                                 02248000
TCBRV132 EQU   TCBRV124                                                 02249000
TCBRV131 EQU   TCBRV124                                                 02250000
TCBRV130 EQU   TCBRV124                                                 02251000
TCBRV129 EQU   TCBRV124                                                 02252000
TCBRV128 EQU   TCBRV124                                                 02253000
TCBRV127 EQU   TCBRV124                                                 02254000
TCBRV126 EQU   TCBRV124                                                 02255000
TCBRV125 EQU   TCBRV124                                                 02256000
TCBRV123 EQU   TCBFBYT2                                                 02257000
TCBRV122 EQU   TCBFBYT2                                                 02258000
TCBECBNV EQU   TCBFBYT2                                                 02259000
TCBSSSYN EQU   TCBFBYT2                                                 02260000
TCBFPRAP EQU   TCBFBYT2                                                 02261000
TCBFDW   EQU   TCBFBYT2                                                 02262000
TCBFMW   EQU   TCBFBYT2                                                 02263000
TCBCNCB  EQU   TCBFBYT2                                                 02264000
TCBLLH   EQU   TCBFBYT1                                                 02265000
TCBRV113 EQU   TCBFBYT1                                                 02266000
TCBEOT   EQU   TCBFBYT1                                                 02267000
TCBRTM2  EQU   TCBFBYT1                                                 02268000
TCBPGNLY EQU   TCBFBYT1                                                 02269000
TCBNDIOS EQU   TCBFBYT1                                                 02270000
TCBACTIV EQU   TCBFBYT1                                                 02271000
TCBEOTFM EQU   TCBFBYT1                                                 02272000
TCBAFFN  EQU   TCB+274                                                  02273000
TCBCCPVI EQU   TCB+272                                                  02274000
TCBUKYSP EQU   TCB+268                                                  02275000
TCBMODE  EQU   TCBESTAE+3                                               02276000
TCBERTYP EQU   TCBESTAE+2                                               02277000
TCBRV314 EQU   TCBESTRM                                                 02278000
TCBRV313 EQU   TCBESTRM                                                 02279000
TCBRV312 EQU   TCBESTRM                                                 02280000
TCBRV311 EQU   TCBESTRM                                                 02281000
TCBRV310 EQU   TCBESTRM                                                 02282000
TCBRV309 EQU   TCBESTRM                                                 02283000
TCBRV308 EQU   TCBESTRM                                                 02284000
TCBETERM EQU   TCBESTRM                                                 02285000
TCBSCBKY EQU   TCBESTAE                                                 02286000
TCBRTM12 EQU   TCB+260                                                  02287000
TCBTCBID EQU   TCB+256                                                  02288000
TCBRSV96 EQU   TCB+252                                                  02289000
TCBSWA   EQU   TCB+248                                                  02290000
TCBFOEA  EQU   TCBFOE+1                                                 02291000
TCBRSV42 EQU   TCBFOE                                                   02292000
TCBRV306 EQU   TCB+240                                                  02293000
TCBRSV41 EQU   TCB+239                                                  02294000
TCBTID   EQU   TCB+238                                                  02295000
TCBRSVAA EQU   TCB+237                                                  02296000
TCBABCUR EQU   TCB+236                                                  02297000
TCBTMSAV EQU   TCB+232                                                  02298000
TCBIOTIM EQU   TCB+228                                                  02299000
TCBRTWA  EQU   TCB+224                                                  02300000
TCBBACK  EQU   TCB+220                                                  02301000
TCBTIRB  EQU   TCB+216                                                  02302000
TCBAECB  EQU   TCB+212                                                  02303000
TCBEXT2A EQU   TCBEXT2+1                                                02304000
TCBRSV39 EQU   TCBEXT2                                                  02305000
TCBSTMCT EQU   TCB+207                                                  02306000
TCBSYSCT EQU   TCB+206                                                  02307000
TCBRSV37 EQU   TCB+205                                                  02308000
TCBEXSVC EQU   TCBDAR                                                   02309000
TCBDARMS EQU   TCBDAR                                                   02310000
TCBDARWT EQU   TCBDAR                                                   02311000
TCBDARO  EQU   TCBDAR                                                   02312000
TCBDARMC EQU   TCBDARC                                                  02313000
TCBDARD  EQU   TCBDAR                                                   02314000
TCBDARS  EQU   TCBDAR                                                   02315000
TCBDARP  EQU   TCBDAR                                                   02316000
TCBGTOFM EQU   TCBFLGS7                                                 02317000
TCBADMP  EQU   TCBFLGS7                                                 02318000
TCBRSTSK EQU   TCBFLGS7                                                 02319000
TCBRSV35 EQU   TCBFLGS7                                                 02320000
TCBSTACK EQU   TCBFLGS7                                                 02321000
TCBRSV34 EQU   TCBFLGS7                                                 02322000
TCBRSV33 EQU   TCBFLGS7                                                 02323000
TCBGPECB EQU   TCBFLGS7                                                 02324000
TCBNTJS  EQU   TCBFLGS6                                                 02325000
TCBAPG   EQU   TCBFLGS6                                                 02326000
TCBMIGR  EQU   TCBFLGS6                                                 02327000
TCBRV303 EQU   TCBFLGS6                                                 02328000
TCBSPVLK EQU   TCBFLGS6                                                 02329000
TCBCPU   EQU   TCBFLGS6                                                 02330000
TCBPIE17 EQU   TCBFLGS6                                                 02331000
TCBRV    EQU   TCBFLGS6                                                 02332000
TCBRSV79 EQU   TCBNDSP5                                                 02333000
TCBRSV78 EQU   TCBNDSP5                                                 02334000
TCBRSV77 EQU   TCBNDSP5                                                 02335000
TCBRSV76 EQU   TCBNDSP5                                                 02336000
TCBRSV75 EQU   TCBNDSP5                                                 02337000
TCBRSV74 EQU   TCBNDSP5                                                 02338000
TCBRSV95 EQU   TCBNDSP5                                                 02339000
TCBRSV94 EQU   TCBNDSP5                                                 02340000
TCBRSV93 EQU   TCBNDSP4                                                 02341000
TCBRSV92 EQU   TCBNDSP4                                                 02342000
TCBRSV91 EQU   TCBNDSP4                                                 02343000
TCBRSV90 EQU   TCBNDSP4                                                 02344000
TCBRSV89 EQU   TCBNDSP4                                                 02345000
TCBRSV88 EQU   TCBNDSP4                                                 02346000
TCBRSV87 EQU   TCBNDSP4                                                 02347000
TCBRSV86 EQU   TCBNDSP4                                                 02348000
TCBEXT1A EQU   TCBEXT1+1                                                02349000
TCBRSV32 EQU   TCBEXT1                                                  02350000
TCBEXCPD EQU   TCB+192                                                  02351000
TCBIOBRC EQU   TCB+188                                                  02352000
TCBDDWTC EQU   TCB+186                                                  02353000
TCBDDEXC EQU   TCB+184                                                  02354000
TCBJSCBB EQU   TCBJSCB+1                                                02355000
@NM00061 EQU   TCBRECDE                                                 02356000
TCBREC   EQU   TCBRECDE                                                 02357000
TCBMDIDS EQU   TCB+176                                                  02358000
TCBNDINT EQU   TCBNDSP3                                                 02359000
TCBRSV27 EQU   TCBNDSP3                                                 02360000
TCBRSV26 EQU   TCBNDSP3                                                 02361000
TCBRSV25 EQU   TCBNDSP3                                                 02362000
TCBRSV24 EQU   TCBNDSP3                                                 02363000
TCBSRBND EQU   TCBNDSP3                                                 02364000
TCBRV302 EQU   TCBNDSP3                                                 02365000
TCBLJSND EQU   TCBNDSP3                                                 02366000
TCBABE   EQU   TCBNDSP2                                                 02367000
TCBDSS   EQU   TCBNDSP2                                                 02368000
TCBOWAIT EQU   TCBNDSP2                                                 02369000
TCBIWAIT EQU   TCBNDSP2                                                 02370000
TCBNDTS  EQU   TCBNDSP2                                                 02371000
TCBNDSVC EQU   TCBNDSP2                                                 02372000
TCBSTPP  EQU   TCBNDSP2                                                 02373000
TCBABD   EQU   TCBNDSP2                                                 02374000
TCBRSV22 EQU   TCBNDSP1                                                 02375000
TCBPIEND EQU   TCBNDSP1                                                 02376000
TCBTPSP  EQU   TCBNDSP1                                                 02377000
TCBDDRND EQU   TCBNDSP1                                                 02378000
TCBRSPND EQU   TCBNDSP1                                                 02379000
TCBRSTND EQU   TCBNDSP1                                                 02380000
TCBDARPN EQU   TCBNDSP1                                                 02381000
TCBDARTN EQU   TCBNDSP1                                                 02382000
TCBNDSP0 EQU   TCBNDSP                                                  02383000
TCBUSER  EQU   TCB+168                                                  02384000
TCBTCTB  EQU   TCBTCT+1                                                 02385000
TCBRSV9C EQU   TCBTCTGF                                                 02386000
TCBRSV9B EQU   TCBTCTGF                                                 02387000
TCBRSV9A EQU   TCBTCTGF                                                 02388000
TCBRSV99 EQU   TCBTCTGF                                                 02389000
TCBRSV98 EQU   TCBTCTGF                                                 02390000
TCBRSV97 EQU   TCBTCTGF                                                 02391000
TCBRSV20 EQU   TCBTCTGF                                                 02392000
TCBSMFGF EQU   TCBTCTGF                                                 02393000
TCBSTABB EQU   TCBSTAB+1                                                02394000
TCBSTCUR EQU   TCBNSTAE                                                 02395000
TCBRV301 EQU   TCBNSTAE                                                 02396000
TCBSYNCH EQU   TCBNSTAE                                                 02397000
TCBHALT  EQU   TCBNSTAE                                                 02398000
TCBPPSUP EQU   TCBNSTAE                                                 02399000
TCB33E   EQU   TCBNSTAE                                                 02400000
TCBQUIES EQU   TCBNSTAE                                                 02401000
TCBSTABE EQU   TCBNSTAE                                                 02402000
TCBAQE   EQU   TCB+156                                                  02403000
TCBPQE   EQU   TCB+152                                                  02404000
TCBTSDP  EQU   TCB+151                                                  02405000
TCBTSLP  EQU   TCB+150                                                  02406000
TCBSTPCT EQU   TCB+149                                                  02407000
TCBCPUBN EQU   TCBTSFLG                                                 02408000
TCBDYDSP EQU   TCBTSFLG                                                 02409000
TCBRSV18 EQU   TCBTSFLG                                                 02410000
TCBRSV17 EQU   TCBTSFLG                                                 02411000
TCBTIOTG EQU   TCBTSFLG                                                 02412000
TCBATT   EQU   TCBTSFLG                                                 02413000
TCBSTPPR EQU   TCBTSFLG                                                 02414000
TCBRV300 EQU   TCBTSTSK                                                 02415000
TCBECB   EQU   TCB+144                                                  02416000
TCBIQE   EQU   TCB+140                                                  02417000
TCBLTC   EQU   TCB+136                                                  02418000
TCBOTC   EQU   TCB+132                                                  02419000
TCBNTC   EQU   TCB+128                                                  02420000
TCBJSTCA EQU   TCBJSTCB+1                                               02421000
TCBRSV16 EQU   TCBJSTCB                                                 02422000
TCBTQET  EQU   TCBTME                                                   02423000
TCBTCB   EQU   TCB+116                                                  02424000
TCBFSAB  EQU   TCBFSA+1                                                 02425000
TCBQEL   EQU   TCBFSA                                                   02426000
TCBGRS15 EQU   TCBGRS+60                                                02427000
TCBGRS14 EQU   TCBGRS+56                                                02428000
TCBGRS13 EQU   TCBGRS+52                                                02429000
TCBGRS12 EQU   TCBGRS+48                                                02430000
TCBGRS11 EQU   TCBGRS+44                                                02431000
TCBGRS10 EQU   TCBGRS+40                                                02432000
TCBGRS9  EQU   TCBGRS+36                                                02433000
TCBGRS8  EQU   TCBGRS+32                                                02434000
TCBGRS7  EQU   TCBGRS+28                                                02435000
TCBGRS6  EQU   TCBGRS+24                                                02436000
TCBGRS5  EQU   TCBGRS+20                                                02437000
TCBGRS4  EQU   TCBGRS+16                                                02438000
TCBGRS3  EQU   TCBGRS+12                                                02439000
TCBGRS2  EQU   TCBGRS+8                                                 02440000
TCBGRS1  EQU   TCBGRS+4                                                 02441000
TCBGRS0  EQU   TCBGRS                                                   02442000
TCBJPQB  EQU   TCBJPQ+1                                                 02443000
TCBRSV15 EQU   TCBPURGE                                                 02444000
TCBRSV14 EQU   TCBPURGE                                                 02445000
TCBRSV13 EQU   TCBPURGE                                                 02446000
TCBRSV12 EQU   TCBPURGE                                                 02447000
TCBRSV11 EQU   TCBPURGE                                                 02448000
TCBRSV10 EQU   TCBPURGE                                                 02449000
TCBRSV09 EQU   TCBPURGE                                                 02450000
TCBJPQF  EQU   TCBPURGE                                                 02451000
TCBJLB   EQU   TCB+40                                                   02452000
TCBLLS   EQU   TCB+36                                                   02453000
TCBDSP   EQU   TCB+35                                                   02454000
TCBLMP   EQU   TCB+34                                                   02455000
TCBPNDSP EQU   TCBFLGS5                                                 02456000
TCBFCD1  EQU   TCBFLGS5                                                 02457000
TCBSTP   EQU   TCBFLGS5                                                 02458000
TCBSYS   EQU   TCBFLGS5                                                 02459000
TCBANDSP EQU   TCBFLGS5                                                 02460000
TCBPAGE  EQU   TCBFLGS5                                                 02461000
TCBUXNDF EQU   TCBABWF                                                  02462000
TCBFC    EQU   TCBFLGS5                                                 02463000
TCBONDSP EQU   TCBFLGS4                                                 02464000
TCBMPCND EQU   TCBFLGS4                                                 02465000
TCBMPCVQ EQU   TCBFLGS4                                                 02466000
TCBUXNDV EQU   TCBFLGS4                                                 02467000
TCBHNDSP EQU   TCBFLGS4                                                 02468000
TCBRQENA EQU   TCBFLGS4                                                 02469000
TCBSER   EQU   TCBFLGS4                                                 02470000
TCBNDUMP EQU   TCBFLGS4                                                 02471000
TCBDWSTA EQU   TCBFLGS3                                                 02472000
TCBRSV08 EQU   TCBFLGS3                                                 02473000
TCBRSV07 EQU   TCBFLGS3                                                 02474000
TCBRSV06 EQU   TCBFLGS3                                                 02475000
TCBABGM  EQU   TCBFLGS3                                                 02476000
TCBABTRM EQU   TCBFLGS3                                                 02477000
TCBADINP EQU   TCBFLGS3                                                 02478000
TCBFSM   EQU   TCBFLGS3                                                 02479000
TCBFTS   EQU   TCBFLGS2                                                 02480000
TCBFETXR EQU   TCBFLGS2                                                 02481000
TCBFDSOP EQU   TCBFLGS2                                                 02482000
TCBFJMC  EQU   TCBFLGS2                                                 02483000
TCBFSMC  EQU   TCBFLGS2                                                 02484000
TCBFABOP EQU   TCBFLGS2                                                 02485000
TCBFSTI  EQU   TCBFLGS2                                                 02486000
TCBFOINP EQU   TCBFLGS2                                                 02487000
TCBFX    EQU   TCBFLGS1                                                 02488000
TCBFS    EQU   TCBFLGS1                                                 02489000
TCBFT    EQU   TCBFLGS1                                                 02490000
TCBPDUMP EQU   TCBFLGS1                                                 02491000
TCBRSV04 EQU   TCBFLGS1                                                 02492000
TCBFERA  EQU   TCBFLGS1                                                 02493000
TCBFE    EQU   TCBFLGS1                                                 02494000
TCBFA    EQU   TCBFLGS1                                                 02495000
TCBZERO  EQU   TCBPKF                                                   02496000
TCBFLAG  EQU   TCBPKF                                                   02497000
TCBMSSB  EQU   TCBMSS+1                                                 02498000
TCBRSV03 EQU   TCBMSS                                                   02499000
TCBTRNB  EQU   TCBTRN+1                                                 02500000
TCBRSV02 EQU   TCBABF                                                   02501000
TCBOLTEP EQU   TCBABF                                                   02502000
TCBTCP   EQU   TCBABF                                                   02503000
TCBTCPP  EQU   TCBABF                                                   02504000
TCBRSV01 EQU   TCBABF                                                   02505000
TCBGRPH  EQU   TCBABF                                                   02506000
TCBNOCHK EQU   TCBABF                                                   02507000
TCBMOD91 EQU   TCBABF                                                   02508000
TCBCMPC  EQU   TCBCMP+1                                                 02509000
TCBRV318 EQU   TCBCMSG                                                  02510000
TCBRV317 EQU   TCBCIND                                                  02511000
TCBRV316 EQU   TCBCWTO                                                  02512000
TCBCASID EQU   TCBCDBL                                                  02513000
TCBNOCC  EQU   TCBSTCC                                                  02514000
TCBDMPO  EQU   TCBCPP                                                   02515000
TCBCSTEP EQU   TCBCMPF                                                  02516000
TCBCREQ  EQU   TCBCMPF                                                  02517000
TCBTIO   EQU   TCB+12                                                   02518000
TCBDEB   EQU   TCB+8                                                    02519000
TCBPIEA  EQU   TCBPIE+1                                                 02520000
TCBPM    EQU   TCBPMASK                                                 02521000
@NM00060 EQU   TCBPMASK                                                 02522000
TCBFRS6  EQU   TCBFRS+24                                                02523000
TCBFRS4  EQU   TCBFRS+16                                                02524000
TCBFRS2  EQU   TCBFRS+8                                                 02525000
TCBFRS0  EQU   TCBFRS                                                   02526000
DEBXRV40 EQU   DEBXTN+28                                                02527000
DEBXRV39 EQU   DEBXTN+24                                                02528000
DEBXXARG EQU   DEBXTN+20                                                02529000
DEBXMCF2 EQU   DEBXTN+19                                                02530000
DEBXMCF1 EQU   DEBXTN+18                                                02531000
DEBXDSO2 EQU   DEBXTN+17                                                02532000
DEBXDSO1 EQU   DEBXTN+16                                                02533000
DEBXDBPR EQU   DEBXTN+12                                                02534000
DEBXDCBM EQU   DEBXTN+8                                                 02535000
DEBXDSAB EQU   DEBXTN+4                                                 02536000
DEBXRV48 EQU   DEBXTN+3                                                 02537000
DEBXRV47 EQU   DEBXFLG1                                                 02538000
DEBXRV46 EQU   DEBXFLG1                                                 02539000
DEBXRV45 EQU   DEBXFLG1                                                 02540000
DEBXRV44 EQU   DEBXFLG1                                                 02541000
DEBXRV43 EQU   DEBXFLG1                                                 02542000
DEBXRV42 EQU   DEBXFLG1                                                 02543000
DEBXTSKC EQU   DEBXFLG1                                                 02544000
DEBXCDCB EQU   DEBXFLG1                                                 02545000
DEBXLNGH EQU   DEBXTN                                                   02546000
DEBTBLOF EQU   DEBPREFX+14                                              02547000
DEBAMTYP EQU   DEBPREFX+13                                              02548000
DEBLNGTH EQU   DEBPREFX+12                                              02549000
DEBDCBMK EQU   DEBXTNP                                                  02550000
DEBDSCBA EQU   DEBPREFX+1                                               02551000
DEBWKARA EQU   DEBPREFX                                                 02552000
DEBXCEAD EQU   DEBXCEA+1                                                02553000
DEBXCENP EQU   DEBXCEAB                                                 02554000
DEBRSV35 EQU   DEBXCEAB                                                 02555000
DEBRSV34 EQU   DEBXCEAB                                                 02556000
DEBRSV33 EQU   DEBXCEAB                                                 02557000
DEBRSV32 EQU   DEBXCEAB                                                 02558000
DEBCEAD  EQU   DEBCEA+1                                                 02559000
DEBCENP  EQU   DEBCEAB                                                  02560000
DEBRSV31 EQU   DEBCEAB                                                  02561000
DEBRSV30 EQU   DEBCEAB                                                  02562000
DEBRSV29 EQU   DEBCEAB                                                  02563000
DEBRSV28 EQU   DEBCEAB                                                  02564000
DEBPCIAD EQU   DEBPCIA+1                                                02565000
DEBPCINP EQU   DEBPCIAB                                                 02566000
DEBRSV27 EQU   DEBPCIAB                                                 02567000
DEBRSV26 EQU   DEBPCIAB                                                 02568000
DEBRSV25 EQU   DEBPCIAB                                                 02569000
DEBRSV24 EQU   DEBPCIAB                                                 02570000
DEBSIOAD EQU   DEBSIOA+1                                                02571000
DEBSIONP EQU   DEBSIOAB                                                 02572000
DEBFIX   EQU   DEBSIOAB                                                 02573000
DEBIOVR  EQU   DEBSIOAB                                                 02574000
DEBSIOX  EQU   DEBSIOAB                                                 02575000
DEBPGFX  EQU   DEBSIOAB                                                 02576000
DEBEOEAD EQU   DEBEOEA+1                                                02577000
DEBEOENP EQU   DEBEOEAB                                                 02578000
DEBRSV22 EQU   DEBEOEAB                                                 02579000
DEBRSV21 EQU   DEBEOEAB                                                 02580000
DEBRSV20 EQU   DEBEOEAB                                                 02581000
DEBRSV19 EQU   DEBEOEAB                                                 02582000
DEBSUBID EQU   DEBSUBNM                                                 02583000
DEBSIOA2 EQU   DEBACS08+24                                              02584000
DEBRPSIO EQU   DEBACS08+20                                              02585000
DEBFREED EQU   DEBACS08+16                                              02586000
@NM00059 EQU   DEBACS08+12                                              02587000
@NM00058 EQU   DEBACS08+8                                               02588000
DEBDISAD EQU   DEBACS08+4                                               02589000
@NM00057 EQU   DEBACS08                                                 02590000
DEBRPSST EQU   DEBACS07+64                                              02591000
DEBARECK EQU   DEBACS07+60                                              02592000
DEBAREWT EQU   DEBACS07+56                                              02593000
DEBACHK  EQU   DEBACS07+52                                              02594000
DEBAWRIT EQU   DEBACS07+48                                              02595000
DEBASETL EQU   DEBACS07+44                                              02596000
DEBAREAD EQU   DEBACS07+40                                              02597000
DEBCRECK EQU   DEBACS07+36                                              02598000
DEBCREWT EQU   DEBACS07+32                                              02599000
DEBCCHK  EQU   DEBACS07+28                                              02600000
DEBCWRIT EQU   DEBACS07+24                                              02601000
DEBCSETL EQU   DEBACS07+20                                              02602000
DEBCREAD EQU   DEBACS07+16                                              02603000
DEBWKPT5 EQU   DEBACS07+12                                              02604000
DEBWKPT4 EQU   DEBACS07+8                                               02605000
DEBGET   EQU   DEBACS07+4                                               02606000
@NM00056 EQU   DEBACS07                                                 02607000
DEBPUT   EQU   DEBACS06+4                                               02608000
DEBDCBFA EQU   DEBACS06                                                 02609000
DEBLUCBB EQU   DEBLUCBA+1                                               02610000
DEBRSV18 EQU   DEBLUCBA                                                 02611000
DEBFUCBB EQU   DEBFUCBA+1                                               02612000
DEBRSV17 EQU   DEBFUCBA                                                 02613000
DEBTCCWB EQU   DEBTCCWA+1                                               02614000
DEBRSV16 EQU   DEBTCCWA                                                 02615000
DEBTBFRB EQU   DEBTBFRA+1                                               02616000
DEBRSV15 EQU   DEBTBFRA                                                 02617000
DEBDBPEF EQU   DEBACS03+8                                               02618000
DEBDBPP  EQU   DEBACS03+4                                               02619000
DEBDTPP  EQU   DEBACS03                                                 02620000
DEBDBPE  EQU   DEBDBLK+1                                                02621000
DEBDBPT  EQU   DEBDBLK                                                  02622000
DEBEXTNM EQU   DEBDSNAM                                                 02623000
DEBRSV14 EQU   DEBDSNM+4                                                02624000
DEBUTSAB EQU   DEBUTSAA+1                                               02625000
DEBRSV13 EQU   DEBUTSAA                                                 02626000
DEBVOLNM EQU   DEBACSMD+2                                               02627000
DEBVLSEQ EQU   DEBVOLSQ+1                                               02628000
DEBRSV42 EQU   DEBVOLBT                                                 02629000
DEBRSV41 EQU   DEBVOLBT                                                 02630000
DEBRSV40 EQU   DEBVOLBT                                                 02631000
DEBRSV39 EQU   DEBVOLBT                                                 02632000
DEBRSV38 EQU   DEBVOLBT                                                 02633000
DEBRSV37 EQU   DEBVOLBT                                                 02634000
DEBRSV36 EQU   DEBVOLBT                                                 02635000
DEBEXFUL EQU   DEBVOLBT                                                 02636000
DEBNMTRK EQU   DEBDASD+14                                               02637000
DEBENDHH EQU   DEBDASD+12                                               02638000
DEBENDCC EQU   DEBDASD+10                                               02639000
DEBSTRHH EQU   DEBDASD+8                                                02640000
DEBSTRCC EQU   DEBDASD+6                                                02641000
DEBBINUM EQU   DEBDASD+4                                                02642000
DEBUCBA  EQU   DEBUCBAD+1                                               02643000
DEBDVMOD EQU   DEBUCBAD                                                 02644000
DEBAPPB  EQU   DEBAPPAD+1                                               02645000
DEBEXSCL EQU   DEBAPPAD                                                 02646000
DEBDEBID EQU   DEBPROTG                                                 02647000
DEBECBB  EQU   DEBECBAD+1                                               02648000
DEBPRIOR EQU   DEBECBAD                                                 02649000
DEBUSRPB EQU   DEBUSRPG+1                                               02650000
DEBNMEXT EQU   DEBUSRPG                                                 02651000
DEBRSV05 EQU   DEBBASIC+15                                              02652000
DEBXTNIN EQU   DEBFLGS1                                                 02653000
DEBAPFIN EQU   DEBFLGS1                                                 02654000
DEBF1CEV EQU   DEBFLGS1                                                 02655000
DEBCINDI EQU   DEBFLGS1                                                 02656000
DEBRSV02 EQU   DEBFLGS1                                                 02657000
DEBRSIOA EQU   DEBFLGS1                                                 02658000
DEBEOFDF EQU   DEBFLGS1                                                 02659000
DEBPWCKD EQU   DEBFLGS1                                                 02660000
DEBQSCNT EQU   DEBBASIC+13                                              02661000
DEBACCS  EQU   DEBOPATB                                                 02662000
DEBPOSIT EQU   DEBOPATB                                                 02663000
DEBZERO  EQU   DEBOPATB                                                 02664000
DEBABEND EQU   DEBOPATB                                                 02665000
DEBIRBB  EQU   DEBIRBAD+1                                               02666000
DEBRERR  EQU   DEBOFLGS                                                 02667000
DEBLABEL EQU   DEBOFLGS                                                 02668000
DEBSPLIT EQU   DEBOFLGS                                                 02669000
DEBDCB   EQU   DEBOFLGS                                                 02670000
DEBRLSE  EQU   DEBOFLGS                                                 02671000
DEBEOF   EQU   DEBOFLGS                                                 02672000
DEBDISP  EQU   DEBOFLGS                                                 02673000
DEBDEBB  EQU   DEBDEBAD+1                                               02674000
DEBAMLNG EQU   DEBDEBAD                                                 02675000
DEBTCBB  EQU   DEBTCBAD+1                                               02676000
DEBNMSUB EQU   DEBTCBAD                                                 02677000
SIRBEND  EQU   RBSECT+168                                               02678000
SVRBEND  EQU   RBSECT+168                                               02679000
RBRSV158 EQU   RBRSV150                                                 02680000
RBRSV157 EQU   RBRSV150                                                 02681000
RBRSV156 EQU   RBRSV150                                                 02682000
RBRSV155 EQU   RBRSV150                                                 02683000
RBRSV154 EQU   RBRSV150                                                 02684000
RBRSV153 EQU   RBRSV150                                                 02685000
RBRSV152 EQU   RBRSV150                                                 02686000
RBRSV151 EQU   RBRSV150                                                 02687000
RBRSV149 EQU   RBSECT+166                                               02688000
RBRSV148 EQU   RBSECT+164                                               02689000
RBSCBB   EQU   RBSECT+144                                               02690000
TIRBEND  EQU   @NM00054+8                                               02691000
PRBEND   EQU   @NM00054+8                                               02692000
RBRSV146 EQU   RBRSV138                                                 02693000
RBRSV145 EQU   RBRSV138                                                 02694000
RBRSV144 EQU   RBRSV138                                                 02695000
RBRSV143 EQU   RBRSV138                                                 02696000
RBRSV142 EQU   RBRSV138                                                 02697000
RBRSV141 EQU   RBRSV138                                                 02698000
RBRSV140 EQU   RBRSV138                                                 02699000
RBRSV139 EQU   RBRSV138                                                 02700000
RBRSV137 EQU   @NM00054+6                                               02701000
RBRSV136 EQU   @NM00054+4                                               02702000
RBRSV135 EQU   @NM00054                                                 02703000
@NM00053 EQU   RBSECT+32                                                02704000
@NM00052 EQU   @NM00050+1                                               02705000
@NM00051 EQU   @NM00050                                                 02706000
RBPGMQ1  EQU   RBPGMQ+1                                                 02707000
@NM00049 EQU   RBPGMQ                                                   02708000
@NM00048 EQU   RBSECT+16                                                02709000
@NM00047 EQU   @NM00043                                                 02710000
@NM00046 EQU   @NM00043                                                 02711000
RBIQETP  EQU   @NM00043                                                 02712000
RBUSIQE  EQU   RBETXR                                                   02713000
RBATTN   EQU   @NM00043                                                 02714000
@NM00045 EQU   @NM00043                                                 02715000
@NM00044 EQU   @NM00043                                                 02716000
RBPMSVRB EQU   @NM00041                                                 02717000
RBATNXIT EQU   @NM00041                                                 02718000
@NM00042 EQU   @NM00041                                                 02719000
RBWAITP  EQU   @NM00041                                                 02720000
RBFNSVRB EQU   RBTRSVRB                                                 02721000
RBFTP    EQU   @NM00041                                                 02722000
RBSIZE   EQU   RBSECT+8                                                 02723000
RBABOPSW EQU   RBSECT+4                                                 02724000
RBPPSAV1 EQU   RBPPSAV+1                                                02725000
@NM00039 EQU   RBPPSAV                                                  02726000
RBPRFXND EQU   RBPREFIX+64                                              02727000
RBINTCOD EQU   RBINTCDA+1                                               02728000
RBINLNTH EQU   RBINTCDA                                                 02729000
RBWCSA   EQU   RBPREFIX+60                                              02730000
RBRSV004 EQU   RBPREFIX+57                                              02731000
RBSSSYN  EQU   RBFLAGS1                                                 02732000
RBSCB    EQU   RBFLAGS1                                                 02733000
RBLONGWT EQU   RBFLAGS1                                                 02734000
RBASIR   EQU   RBFLAGS1                                                 02735000
RBRSV159 EQU   RBFLAGS1                                                 02736000
RBABEND  EQU   RBFLAGS1                                                 02737000
RBXWAIT  EQU   RBFLAGS1                                                 02738000
RBSLOCK  EQU   RBFLAGS1                                                 02739000
RBRTRAN  EQU   RBRTPSW2+4                                               02740000
RBRTINCD EQU   RBRTICIL+2                                               02741000
RBRTILC  EQU   RBRTICIL+1                                               02742000
RBRSV160 EQU   RBRTICIL                                                 02743000
RBRTPSW1 EQU   RBRTOPSW                                                 02744000
RBRSV062 EQU   RBRSV054                                                 02745000
RBRSV061 EQU   RBRSV054                                                 02746000
RBRSV060 EQU   RBRSV054                                                 02747000
RBRSV059 EQU   RBRSV054                                                 02748000
RBRSV058 EQU   RBRSV054                                                 02749000
RBRSV057 EQU   RBRSV054                                                 02750000
RBRSV056 EQU   RBRSV054                                                 02751000
RBRSV055 EQU   RBRSV054                                                 02752000
RBRSV053 EQU   RBPREFIX+38                                              02753000
RBRSV052 EQU   RBPREFIX+36                                              02754000
RBRSV051 EQU   RBPREFIX+32                                              02755000
RBPRFXST EQU   RBPREFIX+32                                              02756000
RBRSV050 EQU   RBPREFIX+28                                              02757000
RBRSV049 EQU   RBRSV041                                                 02758000
RBRSV048 EQU   RBRSV041                                                 02759000
RBRSV047 EQU   RBRSV041                                                 02760000
RBRSV046 EQU   RBRSV041                                                 02761000
RBRSV045 EQU   RBRSV041                                                 02762000
RBRSV044 EQU   RBRSV041                                                 02763000
RBRSV043 EQU   RBRSV041                                                 02764000
RBRSV042 EQU   RBRSV041                                                 02765000
RBRSV040 EQU   RBPREFIX+26                                              02766000
RBRSV039 EQU   RBPREFIX+24                                              02767000
RBRSV038 EQU   RBPREFIX+20                                              02768000
RBRSV037 EQU   RBPREFIX+16                                              02769000
RBRSV036 EQU   RBRSV028                                                 02770000
RBRSV035 EQU   RBRSV028                                                 02771000
RBRSV034 EQU   RBRSV028                                                 02772000
RBRSV033 EQU   RBRSV028                                                 02773000
RBRSV032 EQU   RBRSV028                                                 02774000
RBRSV031 EQU   RBRSV028                                                 02775000
RBRSV030 EQU   RBRSV028                                                 02776000
RBRSV029 EQU   RBRSV028                                                 02777000
RBRSV027 EQU   RBRSV019                                                 02778000
RBRSV026 EQU   RBRSV019                                                 02779000
RBRSV025 EQU   RBRSV019                                                 02780000
RBRSV024 EQU   RBRSV019                                                 02781000
RBRSV023 EQU   RBRSV019                                                 02782000
RBRSV022 EQU   RBRSV019                                                 02783000
RBRSV021 EQU   RBRSV019                                                 02784000
RBRSV020 EQU   RBRSV019                                                 02785000
RBRSV018 EQU   RBPREFIX+13                                              02786000
RBRSV017 EQU   RBPREFIX+12                                              02787000
RBSRV016 EQU   RBPREFIX+11                                              02788000
RBRSV015 EQU   RBPREFIX+10                                              02789000
RBRSV014 EQU   RBPREFIX+8                                               02790000
RBRSV013 EQU   RBPREFIX+4                                               02791000
RBRSV012 EQU   RBPREFIX                                                 02792000
RBEXSAVE EQU   XRBESA                                                   02793000
XRBREG15 EQU   RBGRS15                                                  02794000
XRBREG14 EQU   RBGRS14                                                  02795000
XRBREG13 EQU   RBGRS13                                                  02796000
XRBREG12 EQU   RBGRS12                                                  02797000
XRBREG11 EQU   RBGRS11                                                  02798000
XRBREG10 EQU   RBGRS10                                                  02799000
XRBREG9  EQU   RBGRS9                                                   02800000
XRBREG8  EQU   RBGRS8                                                   02801000
XRBREG7  EQU   RBGRS7                                                   02802000
XRBREG6  EQU   RBGRS6                                                   02803000
XRBREG5  EQU   RBGRS5                                                   02804000
XRBREG4  EQU   RBGRS4                                                   02805000
XRBREG3  EQU   RBGRS3                                                   02806000
XRBREG2  EQU   RBGRS2                                                   02807000
XRBREG1  EQU   RBGRS1                                                   02808000
XRBREG0  EQU   RBGRS0                                                   02809000
XRBLNKA  EQU   RBLINKB                                                  02810000
XRBWT    EQU   RBWCF                                                    02811000
@NM00038 EQU   RBBASIC+24                                               02812000
XRBPSW   EQU   RBOPSW                                                   02813000
@NM00037 EQU   RBBASIC+12                                               02814000
XRBWAIT  EQU   RBECBWT                                                  02815000
XRBFRRB  EQU   RBFDYN                                                   02816000
@NM00036 EQU   XSTAB2                                                   02817000
XRBACTV  EQU   RBFACTV                                                  02818000
XRBTCBP  EQU   RBTCBNXT                                                 02819000
@NM00035 EQU   XSTAB1                                                   02820000
XRBCKPT  EQU   RBFTCKPT                                                 02821000
@NM00034 EQU   XSTAB1                                                   02822000
@NM00033 EQU   RBBASIC+8                                                02823000
@NM00032 EQU   RBEXRTNM+1                                               02824000
RBTMIND3 EQU   RBTMFLD                                                  02825000
RBTMIND2 EQU   RBTMFLD                                                  02826000
RBTMCMP  EQU   RBTMFLD                                                  02827000
RBWLIM   EQU   RBTMFLD                                                  02828000
RBRSV005 EQU   RBTMFLD                                                  02829000
RBTMTOD  EQU   RBTMFLD                                                  02830000
RBTMQUE  EQU   RBTMFLD                                                  02831000
@NM00031 EQU   RBPRFX                                                   02832000
@NM00005 EQU   DCBLIST                                                  02833000
@NM00004 EQU   WTGTAB01+29                                              02834000
@NM00003 EQU   WTGTAB01+17                                              02835000
@NM00002 EQU   WTGTAB01+8                                               02836000
@NM00001 EQU   WTGTAB01                                                 02837000
@NM00030 EQU   PSA+3668                                                 02838000
PSASTAK  EQU   PSA+3072                                                 02839000
@NM00029 EQU   PSA+1040                                                 02840000
PSAUSEND EQU   PSA+1040                                                 02841000
PSARV062 EQU   PSA+1036                                                 02842000
PSAATCVT EQU   PSA+1032                                                 02843000
PSAPCPSW EQU   PSA+1024                                                 02844000
PSAPIR2  EQU   PSA+1020                                                 02845000
PSARV059 EQU   PSA+1018                                                 02846000
PSASVC13 EQU   PSA+1016                                                 02847000
PSALSFCC EQU   PSA+1012                                                 02848000
PSASFACC EQU   PSA+1008                                                 02849000
PSASTOP  EQU   PSA+992                                                  02850000
PSASTART EQU   PSA+976                                                  02851000
PSARSPSW EQU   PSA+968                                                  02852000
PSASRPSW EQU   PSA+960                                                  02853000
PSARV045 EQU   PSA+892                                                  02854000
PSARV044 EQU   PSA+888                                                  02855000
PSARV043 EQU   PSA+884                                                  02856000
PSARV042 EQU   PSA+880                                                  02857000
PSARV041 EQU   PSA+876                                                  02858000
PSARV040 EQU   PSA+872                                                  02859000
PSARV025 EQU   PSA+868                                                  02860000
PSADSSED EQU   PSA+868                                                  02861000
PSADSSPR EQU   PSA+864                                                  02862000
PSADSSFW EQU   PSA+860                                                  02863000
PSADSS14 EQU   PSA+856                                                  02864000
PSADSSPP EQU   PSA+848                                                  02865000
PSADSSRP EQU   PSA+840                                                  02866000
PSADSS05 EQU   PSADSSF4                                                 02867000
PSADSS10 EQU   PSADSSF4                                                 02868000
PSADSSVE EQU   PSADSSF4                                                 02869000
PSADSSDE EQU   PSADSSF4                                                 02870000
PSADSSC0 EQU   PSADSSF4                                                 02871000
PSADSSIE EQU   PSADSSF4                                                 02872000
PSADSS12 EQU   PSADSSF4                                                 02873000
PSADSSRC EQU   PSADSSF4                                                 02874000
PSARV057 EQU   PSADSSF3                                                 02875000
PSARV056 EQU   PSADSSF3                                                 02876000
PSARV055 EQU   PSADSSF3                                                 02877000
PSADSSMC EQU   PSADSSF3                                                 02878000
PSADSSRW EQU   PSADSSF3                                                 02879000
PSADSSNM EQU   PSADSSF3                                                 02880000
PSADSSES EQU   PSADSSF3                                                 02881000
PSADSSGP EQU   PSADSSF3                                                 02882000
PSADSSF2 EQU   PSADSSFL+1                                               02883000
PSADSSPI EQU   PSADSSF1                                                 02884000
PSADSSOI EQU   PSADSSF1                                                 02885000
PSADSSSP EQU   PSADSSF1                                                 02886000
PSADSSTP EQU   PSADSSF1                                                 02887000
PSADSSDW EQU   PSADSSF1                                                 02888000
PSADSSDD EQU   PSADSSF1                                                 02889000
PSADSSDM EQU   PSADSSF1                                                 02890000
PSADSSMV EQU   PSADSSF1                                                 02891000
PSADSSTS EQU   PSA+816                                                  02892000
PSADSSWK EQU   PSA+812                                                  02893000
PSADSSR3 EQU   PSA+808                                                  02894000
PSADSSR2 EQU   PSA+804                                                  02895000
PSADSSRS EQU   PSA+800                                                  02896000
PSASTOR  EQU   PSA+796                                                  02897000
PSACPUSA EQU   PSA+794                                                  02898000
PSAVSTAP EQU   PSA+792                                                  02899000
PSAWKVAP EQU   PSA+788                                                  02900000
PSAWKRAP EQU   PSA+784                                                  02901000
PSAMCHIC EQU   PSA+783                                                  02902000
PSARV061 EQU   PSA+782                                                  02903000
PSASYMSK EQU   PSA+781                                                  02904000
PSAMCHFL EQU   PSA+780                                                  02905000
PSACR0   EQU   PSA+776                                                  02906000
PSAPSWSV EQU   PSA+768                                                  02907000
PSALITA  EQU   PSA+764                                                  02908000
PSACLHS  EQU   PSAHLHI                                                  02909000
PSALKR15 EQU   PSALKSA+60                                               02910000
PSALKR14 EQU   PSALKSA+56                                               02911000
PSALKR13 EQU   PSALKSA+52                                               02912000
PSALKR12 EQU   PSALKSA+48                                               02913000
PSALKR11 EQU   PSALKSA+44                                               02914000
PSALKR10 EQU   PSALKSA+40                                               02915000
PSALKR9  EQU   PSALKSA+36                                               02916000
PSALKR8  EQU   PSALKSA+32                                               02917000
PSALKR7  EQU   PSALKSA+28                                               02918000
PSALKR6  EQU   PSALKSA+24                                               02919000
PSALKR5  EQU   PSALKSA+20                                               02920000
PSALKR4  EQU   PSALKSA+16                                               02921000
PSALKR3  EQU   PSALKSA+12                                               02922000
PSALKR2  EQU   PSALKSA+8                                                02923000
PSALKR1  EQU   PSALKSA+4                                                02924000
PSALKR0  EQU   PSALKSA                                                  02925000
PSARV023 EQU   PSACLHT+52                                               02926000
PSALOCAL EQU   PSACLHT+48                                               02927000
PSACMSL  EQU   PSACLHT+44                                               02928000
PSAOPTL  EQU   PSACLHT+40                                               02929000
PSATPACL EQU   PSACLHT+36                                               02930000
PSATPDNL EQU   PSACLHT+32                                               02931000
PSATPNCL EQU   PSACLHT+28                                               02932000
PSAIOSLL EQU   PSACLHT+24                                               02933000
PSAIOSUL EQU   PSACLHT+20                                               02934000
PSAIOSCL EQU   PSACLHT+16                                               02935000
PSAIOSSL EQU   PSACLHT+12                                               02936000
PSASALCL EQU   PSACLHT+8                                                02937000
PSAASML  EQU   PSACLHT+4                                                02938000
PSADISPL EQU   PSACLHT                                                  02939000
PSASRSA  EQU   PSA+636                                                  02940000
PSARV050 EQU   PSA+634                                                  02941000
PSADSSGO EQU   PSA+633                                                  02942000
PSARECUR EQU   PSA+632                                                  02943000
PSAHLHIS EQU   PSA+628                                                  02944000
PSAIPCSA EQU   PSA+624                                                  02945000
@NM00028 EQU   PSA+621                                                  02946000
PSAIPCDM EQU   PSA+620                                                  02947000
PSAIPCD  EQU   PSA+616                                                  02948000
@NM00027 EQU   PSA+613                                                  02949000
PSAIPCRM EQU   PSA+612                                                  02950000
PSAIPCR  EQU   PSA+608                                                  02951000
PSAMCHEX EQU   PSA+600                                                  02952000
PSAMPSW  EQU   PSA+592                                                  02953000
PSAEXPS2 EQU   PSA+584                                                  02954000
PSAEXPS1 EQU   PSA+576                                                  02955000
PSAPIREG EQU   PSA+572                                                  02956000
PSARSREG EQU   PSA+568                                                  02957000
PSAGPREG EQU   PSA+556                                                  02958000
PSARV022 EQU   PSASUP4                                                  02959000
PSARV021 EQU   PSASUP4                                                  02960000
PSARV020 EQU   PSASUP4                                                  02961000
PSARV019 EQU   PSASUP4                                                  02962000
PSARV018 EQU   PSASUP4                                                  02963000
PSARV017 EQU   PSASUP4                                                  02964000
PSARV016 EQU   PSASUP4                                                  02965000
PSARV015 EQU   PSASUP4                                                  02966000
PSARV014 EQU   PSASUP3                                                  02967000
PSARV013 EQU   PSASUP3                                                  02968000
PSARV012 EQU   PSASUP3                                                  02969000
PSARV011 EQU   PSASUP3                                                  02970000
PSARV010 EQU   PSASUP3                                                  02971000
PSAPSREG EQU   PSASUP3                                                  02972000
PSAPI2   EQU   PSASUP3                                                  02973000
PSAIOSUP EQU   PSASUP3                                                  02974000
PSALCR   EQU   PSASUP2                                                  02975000
PSARTM   EQU   PSASUP2                                                  02976000
PSAACR   EQU   PSASUP2                                                  02977000
PSAIPCE2 EQU   PSASUP2                                                  02978000
PSAIPCES EQU   PSASUP2                                                  02979000
PSAIPCEC EQU   PSASUP2                                                  02980000
PSAGTF   EQU   PSASUP2                                                  02981000
PSAIPCRI EQU   PSASUP2                                                  02982000
PSAIPCRP EQU   PSASUP1                                                  02983000
PSAIPCDR EQU   PSASUP1                                                  02984000
PSADISP  EQU   PSASUP1                                                  02985000
PSALOCK  EQU   PSASUP1                                                  02986000
PSAPI    EQU   PSASUP1                                                  02987000
PSAEXT   EQU   PSASUP1                                                  02988000
PSASVC   EQU   PSASUP1                                                  02989000
PSAIO    EQU   PSASUP1                                                  02990000
PSAAOLD  EQU   PSA+548                                                  02991000
PSAANEW  EQU   PSA+544                                                  02992000
PSATOLD  EQU   PSA+540                                                  02993000
PSATNEW  EQU   PSA+536                                                  02994000
PSALCCAR EQU   PSA+532                                                  02995000
PSALCCAV EQU   PSA+528                                                  02996000
PSAPCCAR EQU   PSA+524                                                  02997000
PSAPCCAV EQU   PSA+520                                                  02998000
PSACPULA EQU   PSA+518                                                  02999000
PSACPUPA EQU   PSA+516                                                  03000000
PSAPSA   EQU   PSA+512                                                  03001000
FLCHDEND EQU   PSA+512                                                  03002000
FLCCRSAV EQU   FLCMCLA+280                                              03003000
FLCGRSAV EQU   FLCMCLA+216                                              03004000
FLCFPSAV EQU   FLCMCLA+184                                              03005000
FLCFLA   EQU   FLCMCLA+88                                               03006000
FLCRGNCD EQU   FLCMCLA+84                                               03007000
FLCFSAA  EQU   FLCFSA+1                                                 03008000
@NM00026 EQU   FLCFSA                                                   03009000
@NM00025 EQU   FLCMCLA+72                                               03010000
FLCMCIC  EQU   FLCMCLA+64                                               03011000
@NM00024 EQU   FLCMCLA+20                                               03012000
FLCIOAA  EQU   FLCIOA+1                                                 03013000
@NM00023 EQU   FLCIOA                                                   03014000
@NM00022 EQU   FLCMCLA+15                                               03015000
@NM00021 EQU   FLCMCLA+14                                               03016000
@NM00020 EQU   FLCMCLA+12                                               03017000
FLCLCL   EQU   FLCMCLA+8                                                03018000
FLCIOELA EQU   FLCIOEL+1                                                03019000
@NM00019 EQU   FLCIOEL                                                  03020000
FLCCHNID EQU   FLCMCLA                                                  03021000
@NM00018 EQU   PSA+160                                                  03022000
FLCMTRCD EQU   PSA+157                                                  03023000
@NM00017 EQU   PSA+156                                                  03024000
FLCPERA  EQU   FLCPER+1                                                 03025000
@NM00016 EQU   FLCPER                                                   03026000
@NM00015 EQU   PSA+151                                                  03027000
FLCPERCD EQU   PSA+150                                                  03028000
FLCMCNUM EQU   PSA+149                                                  03029000
@NM00014 EQU   PSA+148                                                  03030000
FLCTEAA  EQU   FLCTEA+1                                                 03031000
@NM00013 EQU   FLCTEA                                                   03032000
PSAPIPC  EQU   PSAPICOD                                                 03033000
PSAPIMC  EQU   PSAPICOD                                                 03034000
PSAPIPER EQU   PSAPICOD                                                 03035000
PSARV049 EQU   FLCPICOD                                                 03036000
FLCPILCB EQU   FLCPIILC                                                 03037000
@NM00012 EQU   FLCPIILC                                                 03038000
@NM00011 EQU   PSAEPPSW                                                 03039000
FLCSVCN  EQU   PSAESPSW+2                                               03040000
FLCSILCB EQU   FLCSVILC                                                 03041000
@NM00010 EQU   FLCSVILC                                                 03042000
@NM00009 EQU   PSAESPSW                                                 03043000
FLCEICOD EQU   PSAEEPSW+2                                               03044000
PSASPAD  EQU   PSAEEPSW                                                 03045000
@NM00008 EQU   PSA+128                                                  03046000
FLCINPSW EQU   PSA+120                                                  03047000
FLCMNPSW EQU   PSA+112                                                  03048000
FLCPNPSW EQU   PSA+104                                                  03049000
FLCSNPSW EQU   PSA+96                                                   03050000
FLCENPSW EQU   PSA+88                                                   03051000
FLCTRACE EQU   PSA+84                                                   03052000
FLCTIMER EQU   PSA+80                                                   03053000
FLCCVT2  EQU   PSA+76                                                   03054000
FLCCAW   EQU   PSA+72                                                   03055000
FLCCSW   EQU   PSA+64                                                   03056000
FLCIOPSW EQU   PSA+56                                                   03057000
FLCMOPSW EQU   PSA+48                                                   03058000
FLCPOPSW EQU   PSA+40                                                   03059000
FLCSOPSW EQU   PSA+32                                                   03060000
FLCEOPSW EQU   PSA+24                                                   03061000
@NM00007 EQU   FLCICCW2+4                                               03062000
FLCCVT   EQU   FLCICCW2                                                 03063000
FLCICCW1 EQU   FLCROPSW                                                 03064000
FLCIPPSW EQU   FLCRNPSW                                                 03065000
.@UNREFD ANOP                          END UNREFERENCED COMPONENTS      03066000
@RC00110 EQU   @RC00109                                                 03067000
@RF00184 EQU   @EL00002                                                 03068000
@RF00203 EQU   @PB00003                                                 03069000
@RF00123 EQU   @RC00103                                                 03070000
@RC00111 EQU   @RC00110                                                 03071000
@ENDDATA EQU   *                                                        03072000
         END   IGG0197V,(C'PLS1457',0701,76155)                         03073000
