./  ADD  SSI=62220298,NAME=IEBIBLKS
*%GOTO IEBIB00;                                                         00050041
*/* START OF SPECIFICATIONS ******************************************* 00150041
*                                                                     * 00250041
*   MODULE-NAME = IEBIBLKS                                            * 00350041
*                                                                     * 00450041
*   COPYRIGHT = NONE                                                  * 00550041
*                                                                     * 00650041
*   STATUS = VS1 RELEASE 5 LEVEL 1                                    * 00750041
*                                                                     * 00850041
*   DESCRIPTIVE-NAME = IEBIMAGE WORKAREA                              * 00950041
*                                                                     * 01050041
*   FUNCTION = USED BY IEBIMAGE MODULES TO MAP THE COMMON WORKAREA.   * 01150041
*                                                                     * 01250041
*   MODULE-TYPE = MACRO                                               * 01350041
*                                                                     * 01450041
*     MACRO-SIZE = N/A FOR MAPPING MACRO.                             * 01550041
*                                                                     * 01650041
*     PARAMETER-RECEIVED = NONE                                       * 01750041
*                                                                     * 01850041
*   TABLES = NONE                                                     * 01950041
*                                                                     * 02050041
*   INNER-MACROS = NONE                                               * 02150041
*                                                                     * 02250041
*   SYSTEM-MACROS = NONE                                              * 02350041
*                                                                     * 02450041
*   CHANGE-ACTIVITY = NONE                                            * 02550041
*                                                                     * 02650041
*** END OF SPECIFICATIONS ********************************************/ 02750041
*%IEBIB00:;                                                             02850041
*/********************************************************************* 02950041
*                                                                     * 03050041
*  THE FOLLOWING DEFINES THE WORKAREA OF GOTTEN STORAGE OF IEBIBLKS.  * 03150041
*                                                                     * 03250041
*********************************************************************** 03350041
*                                                                     * 03450041
*         __________________________________________________          * 03550041
*         | 0(0)                                           |          * 03650041
*         | DWORK                                          |          * 03750041
*         |                                                |          * 03850041
*         |________________________________________________|          * 03950041
*         | 8(8)                                           |          * 04050041
*         | FWORK                                          |          * 04150041
*         |________________________________________________|          * 04250041
*         | 12(C)      | 13(D)     | 14(E)     | 15(F)     |          * 04350041
*         | STATUS1    | STATUS2   | STATUS3   | STATUS4   |          * 04450041
*         |____________|___________|___________|___________|          * 04550041
*         | 16(10)     | 17(11)    | 18(12)    | 19(13)    |          * 04650041
*         | KWDUSED    | ACTIVOP   | NEXTOP    | ACTIVKEY  |          * 04750041
*         |____________|___________|___________|___________|          * 04850041
*         | 20(14)     | 21(15)                            |          * 04950041
*         | OPTABLN    | OPTABAD                           |          * 05050041
*         |____________|___________________________________|          * 05150041
*         | 24(18)                                         |          * 05250041
*         | DNAME                                          |          * 05350041
*         |                                                |          * 05450041
*         |________________________________________________|          * 05550041
*         | 32(20)                             | 35(23)    |          * 05650041
*         | DTTRP                              | DINDCT    |          * 05750041
*         |____________________________________|___________|          * 05850041
*         | 36(24)                             | 39(27)    |          * 05950041
*         | DTTRT                              | (ZERO)    |          * 06050041
*         |____________________________________|           |          * 06150041
*         |                                                |          * 06250041
*         |________________________________________________|          * 06350041
*         | 44(2C)                 | 46(2E)                |          * 06450041
*         | DATTRI                 | DSTOR                 |          * 06550041
*         |________________________|_______________________|          * 06650041
*         |            | 49(31)                | 51(33)    |          * 06750041
*         |   (CONT)   | DLEN                  | (ZERO)    |          * 06850041
*         |____________|_______________________|           |          * 06950041
*         |                                                |          * 07050041
*         |________________________________________________|          * 07150041
*         | 60(3C)                 | 62(3E)                |          * 07250041
*         | LIBBLKSZ               | BFFLL                 |          * 07350041
*         |________________________|_______________________|          * 07450041
*         |                        | 66(42)                |          * 07550041
*         |   (CONT)               | BNAME                 |          * 07650041
*         |________________________|                       |          * 07750041
*         |                                                |          * 07850041
*         |                        ________________________|          * 07950041
*         |                        | 74(4A)                |          * 08050041
*         |                        | BTTRP                 |          * 08150041
*         |________________________|_______________________|         */ 08250041
*@EJECT;                                                                08350041
*/*       __________________________________________________          * 08450041
*         |            | 77(4D)    | 78(4E)    | 79(4F)    |          * 08550041
*         |   (CONT)   | CONCATNO  | LIBTYPE   | BINDCT    |          * 08650041
*         |____________|___________|___________|___________|          * 08750041
*         | 80(50)                             | 83(53)    |          * 08850041
*         | BTTRT                              | (ZERO)    |          * 08950041
*         |____________________________________|           |          * 09050041
*         |                                                |          * 09150041
*         |________________________________________________|          * 09250041
*         | 88(58)                 | 90(5A)                |          * 09350041
*         | BATTRI                 | BSTOR                 |          * 09450041
*         |________________________|_______________________|          * 09550041
*         |            | 93(5D)                | 94(5F)    |          * 09650041
*         |   (CONT)   | BLEN                  | (ZERO)    |          * 09750041
*         |____________|_______________________|           |          * 09850041
*         |                                                |          * 09950041
*         |________________________________________________|          * 10050041
*         |  104(68)   |  105(69)  | 106(6A)               |          * 10150041
*         |  LIBEXT    |  PRECOL   | NEXT                  |          * 10250041
*         |____________|___________|_______________________|          * 10350041
*         | 108(6C)    |  109(6D)                          |          * 10450041
*         | RETSAVE    |  CC                               |          * 10550041
*         |____________|___________________________________|          * 10650041
*         | 112(70)                                        |          * 10750041
*         | CARDEND                                        |          * 10850041
*         |________________________________________________|          * 10950041
*         | 116(74)                                        |          * 11050041
*         | SYSINAD                                        |          * 11150041
*         |________________________________________________|          * 11250041
*         | 120(78)                                        |          * 11350041
*         | SYSPRTAD                                       |          * 11450041
*         |________________________________________________|          * 11550041
*         | 124(7C)                                        |          * 11650041
*         | UTINAD                                         |          * 11750041
*         |________________________________________________|          * 11850041
*         | 128(80)                                        |          * 11950041
*         | UTOUTAD                                        |          * 12050041
*         |________________________________________________|          * 12150041
*         | 132(84)                                        |          * 12250041
*         / MSGEDIT                                        /          * 12350041
*         /                                                /          * 12450041
*         |________________________________________________|          * 12550041
*         | 148(94)                | 150(96)               |          * 12650041
*         | PRNCNT                 | PAGE                  |          * 12750041
*         |________________________|_______________________|          * 12850041
*         | 152(98)    | 153(99)                           |          * 12950041
*         | ARGMT      | TODAY                             |          * 13050041
*         |____________|___________________________________|         */ 13150041
*@EJECT;                                                                13250041
*/*       __________________________________________________          * 13350041
*         | 154(9A)    | 155(9B)                           |          * 13450041
*         | LOADFLAG   | LOADMOD                           |          * 13550041
*         |____________|___________________________________|          * 13650041
*         | 160(A0)                                        |          * 13750041
*         | LOADNAME                                       |          * 13850041
*         |                                                |          * 13950041
*         |________________________________________________|          * 14050041
*         | 168(A8)                | 170(AA)               |          * 14150041
*         | SEGCNT                 | TESTP                 |          * 14250041
*         |________________________|_______________________|          * 14350041
*         | 172(AC)                                        |          * 14450041
*         / SAVE1                                          /          * 14550041
*         /                                                /          * 14650041
*         |________________________________________________|          * 14750041
*         | 244(F4)                                        |          * 14850041
*         / SAVE2                                          /          * 14950041
*         /                                                /          * 15050041
*         |________________________________________________|          * 15150041
*         | 316(13C)                                       |          * 15250041
*         / SAVE3                                          /          * 15350041
*         /                                                /          * 15450041
*         |________________________________________________|          * 15550041
*         | 388(184)                                       |          * 15650041
*         / SAVE4                                          /          * 15750041
*         /                                                /          * 15850041
*         |________________________________________________|          * 15950041
*         | 460(1CC)                                       |          * 16050041
*         / PRIMCARD                                       /          * 16150041
*         /                                                /          * 16250041
*         |________________________________________________|          * 16350041
*         | 540(21C)                                       |          * 16450041
*         / SDRYCARD                                       /          * 16550041
*         /                                                /          * 16650041
*         |________________________________________________|          * 16750041
*         | 620(26C)   | 621(26D)                          |          * 16850041
*         | MSGN       | MSG                               |          * 16950041
*         |____________|                                   |          * 17050041
*         /                                                /          * 17150041
*         |                        ________________________|          * 17250041
*         |                        | 742(2E6)              |          * 17350041
*         |                        | FCBSIZE               |          * 17450041
*         |________________________|_______________________|          * 17550041
*         | 744(2E8)   | 745(2E9)  | 746(2EA)  | 747(2EB)  |          * 17650048
*         | LPI8       | LPI6      | LPI12     | MARGN     |          * 17750048
*         |____________|___________|___________|___________|          * 17850048
*         | 748(2DC)               | 750(2DE)              |          * 17950048
*         | BOTTOM                 | LOOP                  |          * 18050048
*         |________________________|_______________________|          * 18150048
*         | 752(2F0)                                       |          * 18250041
*         / DDNAMES                                        /          * 18350041
*         /                                                /          * 18450041
*         |________________________________________________|         */ 18550041
*@EJECT;                                                                18650041
*/*       __________________________________________________          * 18750041
*         | 784(310)                                       |          * 18850041
*         | LASTKEY                                        |          * 18950041
*         |                                                |          * 19050041
*         |________________________________________________|          * 19150041
*         | 792(318)               | 794(31A)  | 795(31B)  |          * 19250048
*         | PARMSIZE               | PARMNUM   | (RSVD)    |          * 19330048
*         |________________________|___________|___________|          * 19410048
*         | 796(31C)                                       |          * 19490048
*         / SCANWORK                                       /          * 19570048
*         /                                                /          * 19650048
*         |________________________________________________|          * 19730048
*         | 2236(8BC)                                      |          * 19810048
*         | MODHEAD                                        |          * 19890048
*         |                                                |          * 19970048
*         |________________________________________________|          * 20050048
*         | 2244(8C4)                                      |          * 20130048
*         / MODBOD                                         /          * 20210048
*         /                                                /          * 20290048
*         |________________________________________________|          * 20370048
*         | 10436(28C4)                                    |          * 20450048
*         / OVERFLO                                        /          * 20530048
*         /                                                /          * 20610048
*         |________________________________________________|          * 20690048
*         | 10648(2998)                                    |          * 20770048
*         / MSGSAVE                                        /          * 20950041
*         /                                                /          * 21050041
*         |________________________________________________|          * 21150041
*                                                                     * 21250041
**********************************************************************/ 21350041
*@EJECT;                                                                21450041
*/********************************************************************* 21550041
**                                                                    * 21650041
**  DEFINED BELOW ARE MISCELLANEOUS WORK AREAS.                       * 21750041
**                                                                    * 21850041
**********************************************************************/ 21950041
*                                                                       22050041
*    DECLARE                           /* GOTTEN STORAGE             */ 22150041
*      1 WORKAREA     BASED(BUFAD),    /* WORK AREA AND BUFFER SPACE */ 22250041
*        2 WORK     CHAR(172)BDY(WORD),/* TOTAL WORK AREA.           */ 22350041
*          3 WSTOR   CHAR(12)BDY(WORD),/* CHARACTER WORK AREA.       */ 22450041
*            4 DWORK  CHAR(8)BDY(WORD),/* DOUBLE WORD WORK AREA.     */ 22550041
*              5 DWORK1  CHAR(4),      /* CHARACTER WORK AREA.       */ 22650041
*                6 *      BIT(8),      /* TEMP AREA.                 */ 22750041
*                6 DWORKB BIT(24),     /* TEMP AREA.                 */ 22850041
*              5 DWORK2  FIXED(32),    /* ARITHMATIC WORK AREA.      */ 22950041
*                6 XWORK CHAR(2),      /*                            */ 23050041
*                6 PWORK CHAR(2),      /* PACKED CHARACTERS.         */ 23150041
*                  7 PWORK1 CHAR(1),   /* PACK CHARACTER     @Z48MSTT*/ 23200048
*            4 FWORK     FIXED(31),    /* FULL WORD WORK AREA.       */ 23250041
 @EJECT;                                                                23350041
*/********************************************************************* 23450041
**                                                                    * 23550041
**  DEFINED BELOW ARE THE STATUS INDICATORS FOR THE UTILITY.          * 23650041
**                                                                    * 23750041
**********************************************************************/ 23850041
*                                                                       23950041
*          3 STATUS1     BIT(8),       /* CURRENT STATUS OF UTILITY. */ 24050041
*            4 ABNDFLG   BIT(1),       /* ABNORMAL END PENDING.      */ 24150041
*            4 EOFFLG    BIT(1),       /* END OF FILE PENDING.       */ 24250041
*            4 CARDIN    BIT(1),       /* CARD IN BUFFER INDICATION. */ 24350041
*            4 INHIBLIB  BIT(1),       /* INHIBIT LIBRARY ACCESS.    */ 24450041
*            4 CONTINUE  BIT(1),       /* CONTINUATION CARD INDICATOR*/ 24550041
*            4 NOWRITE   BIT(1),       /* NEVER WRITE ON LIBRARY.    */ 24650041
*            4 NOTED     BIT(1),       /* NOTE MACRO ISSUED.         */ 24750041
*          3 STATUS2     BIT(8),       /* CURRENT STATUS OF OPERATION*/ 24850041
*            4 REPUSE    BIT(1),       /* REPLACE OPTION INDICATOR.  */ 24950041
*            4 INHIBIT   BIT(2),       /* INHIBIT WRITING/READING.   */ 25050041
*              5 INHIBITW  BIT(1),     /* INHIBIT WRITING PDS.       */ 25150041
*              5 INHIBITR  BIT(1),     /* INHIBIT READING PDS.       */ 25250041
*            4 INHIBITP  BIT(1),       /* INHIBIT PRINTING.          */ 25350041
*            4 FMTERR    BIT(1),       /* INDICATE FORMAT ERROR.     */ 25450041
*            4 FMTERR1   BIT(1),       /* INDICATE FORMAT ERROR.     */ 25550041
*            4 PRTYERR   BIT(1),       /* PARITY ERROR INDICATOR.    */ 25650041
*              5 SETRAS  BIT(1),       /* ONE RASTER SCAN SET.       */ 25750041
*            4 READMOD   BIT(1),       /* READ AND PRINT ONLY.       */ 25850041
*          3 STATUS3     BIT(8),       /* CURRENT STATUS OF SCAN.    */ 25950041
*            4 INVDLM    BIT(1),       /* INVALID DELIMITER.         */ 26050041
*            4 FOUND     BIT(1),       /* OPERATION OR KEYWORD FOUND.*/ 26150041
*            4 INVKWD    BIT(1),       /* INVALID KEYWORD INDICATOR. */ 26250041
*            4 EXCLKWD   BIT(1),       /* EXCLUSIVE KEYWORD INDICATOR*/ 26350041
*            4 INVPARM   BIT(1),       /* INVALID PARAMETER.         */ 26450041
*            4 INVCHAR   BIT(1),       /* INVALID CHARACTER.         */ 26550041
*            4 UNBAL     BIT(1),       /* UNBALANCED PARENTHESIS.    */ 26650041
*            4 KWDCOMP   BIT(1),       /* KEYWORD SCAN COMPLETE.     */ 26750041
*          3 STATUS4     BIT(8),       /* CURRENT STATUS (MISC).     */ 26850041
*            4 KEYIN     BIT(1),       /* KEYWORD READY.             */ 26950041
*            4 SCANINP   BIT(1),       /* SCAN IN PROGRESS.          */ 27050041
*            4 INCLSW    BIT(1),       /* INDICATE INCLUDE KEYWORD.  */ 27150041
*            4 HEXERR    BIT(1),       /* HEX ERROR DURING CONVERT.  */ 27250041
*            4 FLDSW     BIT(1),       /* WITHIN PARM GROUP SWITCH.  */ 27350041
*            4 PARMGRP   BIT(1),       /* PARAMETER GROUP SWITCH.    */ 27450041
*            4 OPINPRG   BIT(1),       /* OPERATION IN PROGRESS.     */ 27550041
*            4 LASTQ     BIT(1),       /* LAST QUOTE OR CARD.        */ 27650041
*          3 KWDUSED     BIT(8),       /* KEYWORDS USED IN OPERATION.*/ 27750041
*          3 ACTIVOP     FIXED(8),     /* ACTIVE OPERATION NUMBER.   */ 27850041
*          3 NEXTOP      FIXED(8),     /* NEXT OPERATION NUMBER.     */ 27950041
*          3 ACTIVKEY    FIXED(8),     /* ACTIVE KEYWORD.            */ 28050041
*          3 OPTABLN     FIXED(8),     /* LENGTH OF OPERATION TABLE. */ 28150041
*          3 OPTABAD     PTR(24),      /* ADDR OF OPERATION TABLE.   */ 28250041
 @EJECT;                                                                28350041
*/********************************************************************* 28450041
**                                                                    * 28550041
**  DEFINED BELOW ARE THE PDS DIRECTORY ENTRIES FOR STOW AND BLDL.    * 28650041
**                                                                    * 28750041
**********************************************************************/ 28850041
*                                                                       28950041
*          3 DIRECTRY,                 /* DIRECTORY ENTRY FOR STOW.  */ 29050041
*            4 DNAME     CHAR(8),      /* MEMBER NAME.               */ 29150041
*              5 DPREFX  CHAR(4),      /* STANDARD PREFIX.           */ 29250041
*              5 DSUFIX  CHAR(4),      /* APPENDED SUFFIX.           */ 29350041
*            4 DTTRP     CHAR(3),      /* RELATIVE ADDR OF 1ST BLOCK.*/ 29450041
*            4 DINDCT    BIT(8),       /* NO. TTRS, USER FLD LENGTH. */ 29550041
*            4 DTTRT     CHAR(4),      /* RELATIVE ADDR OF TEXT REC. */ 29650041
*            4   *       CHAR(4),      /* ZEROS.                     */ 29750041
*            4 DATTRI    BIT(16),      /* ATTRIBUTES.                */ 29850041
*              5 *       BIT(7),       /* FIXED ATTRIBUTES.          */ 29950041
*              5 UNIREC  BIT(1),       /* BIT ON INDICATES ONE TEXT. */ 30050041
*            4 DSTOR     PTR(24)BDY(WORD,3),/* MAIN STORAGE REQUIRED.*/ 30150041
*            4 DLEN      PTR(16)BDY(WORD,2),/* LENGTH OF TEXT RECORD.*/ 30250041
*            4   *       CHAR(9),      /* ZEROS.                     */ 30350041
*/********************************************************************/ 30450041
*          3 LIBBLKSZ    FIXED(16),    /* LIBRARY BLOCKING FACTOR.   */ 30550041
*/********************************************************************/ 30650041
*                                                                       30750041
*          3 BLDLNTRY  BDY(WORD,3),    /* BLDL DIRECTORY ENTRY.      */ 30850041
*            4 BFFLL     BIT(32),      /* ONE ENTRY, LENGTH 36.      */ 30950041
*            4 BNAME     CHAR(8),      /* MEMBER NAME.               */ 31050041
*              5 BPREFX  CHAR(4),      /* STANDARD PREFIX.           */ 31150041
*              5 BSUFIX  CHAR(4),      /* MEMBER NAME SUFFIX.        */ 31250041
*            4 BTTRP     CHAR(3),      /* RELATIVE ADDR OF 1ST BLOCK.*/ 31350041
*            4   *       BIT(16),      /* CONCAT NO. AND LIBRARY TYPE*/ 31450041
*            4 BINDCT    BIT(8),       /* NO. TTRS, USER FLD LENGTH. */ 31550041
*            4 BTTRTA    CHAR(8),      /* RELATIVE ADDR OF TEXT REC. */ 31650041
*              5 BTTRT   CHAR(3),      /* REAL TTR.                  */ 31750041
*            4 BATTRI    BIT(16),      /* ATTRIBUTES.                */ 31850041
*              5 *       BIT(7),       /* FIXED ATTRIBUTES.          */ 31950041
*              5 BUNIREC BIT(1),       /* BIT ON INDICATES ONE TEXT. */ 32050041
*            4 BSTOR     PTR(24)BDY(WORD,3),/* MAIN STORAGE REQUIRED.*/ 32150041
*            4 BLEN      PTR(16)BDY(WORD,2),/* LENGTH OF TEXT RECORD.*/ 32250041
*            4   *       CHAR(9),      /* ZEROS                      */ 32350041
 @EJECT;                                                                32450041
*/********************************************************************* 32550041
**                                                                    * 32650041
**  DEFINED BELOW ARE MISCELLANEOUS COUNTERS AND ADDRESSES.           * 32750041
**                                                                    * 32850041
**********************************************************************/ 32950041
*                                                                       33050041
*          3 LIBEXT     BIT(8),        /* LAST LIBRARY EXTENT KNOWN. */ 33150041
*          3 PRECOL      CHAR(1),      /* PREVIOUS COLUMN INFO.      */ 33250041
*          3 NEXT        FIXED(16),    /* CURRENT MSG BUFFER COUNT.  */ 33350041
*          3 RETSAVE     FIXED(8),     /* RETURN CODE SAVE AREA.     */ 33450041
*          3 CC          PTR(24),      /* CURRENT CARD COLUMN PTR.   */ 33550041
*          3 CARDEND     FIXED(31),    /* LAST COLUMN POINTER.       */ 33650041
*          3 DCBADS,                   /* DCB ADDRESS LIST.          */ 33750041
*            4 SYSPRTAD  PTR(31),      /* ADDR OF SYSPRINT DCB.      */ 33850041
*            4 SYSINAD   PTR(31),      /* ADDR OF SYSIN DCB.         */ 33950041
*            4 UTINAD    PTR(31),      /* ADDR OF SYSUT1 INPUT DCB.  */ 34050041
*            4 UTOUTAD   PTR(31),      /* ADDR OF SYSUT1 OUTPUT DCB. */ 34150041
*          3 MSGEDIT(4)  FIXED(32),    /* MESSAGE EDIT LIST.         */ 34250041
*            4 EDITLEN   FIXED(8),     /* EDIT DATA LENGTH.          */ 34350041
*            4 EDITDATA  PTR(24),      /* EDIT DATA ADDRESS.         */ 34450041
*          3 PRNCNT      FIXED(15),    /* PARENTHESIS COUNTER.       */ 34550041
*          3 PAGE        FIXED(15),    /* RESERVED BYTES.            */ 34650041
*          3 ARGMT       FIXED(8),     /* SCAN ARGUMENT HOLDER.      */ 34750041
*          3 TODAY       BIT(24),      /* TODAYS DATE.               */ 34850041
*          3 LOADFLAG    BIT(8),       /* FLAG INDICATES MOD LOADED. */ 34950041
*          3 LOADMOD     PTR(24),      /* POINTER TO LOADED MODULE.  */ 35050041
*          3 LOADNAME CHAR(8)BDY(WORD),/* NAME OF MODULE TO LOAD.    */ 35150041
*            4 *         CHAR(4),      /*                            */ 35250041
*            4 INCLNAME  CHAR(4),      /* NAME OF MODULE TO LOAD.    */ 35350041
*          3 SEGCNT      FIXED(15),    /* MODULE SEGMENT COUNT.      */ 35450041
*          3 TESTP       FIXED(16),    /* TEST AREA, PITCH AND PARITY*/ 35550041
*            4 TPITCH    BIT(8),       /* PITCH WORK AREA.           */ 35650041
*              5 TPP     BIT(2),       /* PITCH BIT AREA.            */ 35750041
*                6 TP1   BIT(1),       /* FIRST PITCH BIT.           */ 35850041
*                6 TP2   BIT(1),       /* SECOND PITCH BIT.          */ 35950041
*            4 TPARTY    BIT(8),       /* PARITY WORK AREA.          */ 36050041
*              5 TPS     BIT(2),       /* PARITY BIT AREA.           */ 36150041
*                6 PR1   BIT(1),       /* FIRST PARITY BIT.          */ 36250041
*                6 PR2   BIT(1),       /* SECOND PARITY BIT.         */ 36350041
 @EJECT;                                                                36450041
*/********************************************************************* 36550041
**                                                                    * 36650041
**  DEFINED BELOW ARE THE SAVE AREAS AND SYSIN AND SYSPRINT AREAS.    * 36750041
**                                                                    * 36850041
**********************************************************************/ 36950041
*                                                                       37050041
*        2 SAVE1         CHAR(72),     /* SAVE AREA LEVEL 1.         */ 37150041
*        2 SAVE2         CHAR(72),     /* SAVE AREA LEVEL 2.         */ 37250041
*        2 SAVE3         CHAR(72),     /* SAVE AREA LEVEL 3.         */ 37350041
*        2 SAVE4         CHAR(72),     /* SAVE AREA LEVEL 4.         */ 37450041
*                                                                       37550041
*/************************  SYSIN BUFFERS  ***************************/ 37650041
*                                                                       37750041
*        2 PRIMCARD      CHAR(80),     /* PRIMARY CARD BUFFER.       */ 37850041
*        2 SDRYCARD      CHAR(80),     /* SECONDARY CARD BUFFER.     */ 37950041
*          3 RASDATA(18) CHAR(1),      /* CARD RASTER SCAN PATTERN.  */ 38050041
*          3 *           CHAR(6),      /* NOT REFERENCED.            */ 38150041
*          3 IDENT       CHAR(4),      /* IDENTIFIER (SEQ=).         */ 38250041
*          3 SEQNO       CHAR(2),      /* SEQUENCE NUMBER.           */ 38350041
*                                                                       38450041
*/************************  SYSPRINT BUFFERS  ************************/ 38550041
*                                                                       38650041
*        2 MSGN          FIXED(8),     /* INDICATES MESSAGE NUMBER.  */ 38750041
*        2 MSG           CHAR(121),    /* MESSAGE AREA.              */ 38850041
*          3 SPACE       CHAR(1),      /* FORMS CONTROL BYTE.        */ 38950041
*          3 MSGTXT      CHAR(120),    /* TEXT OF MESSAGE.           */ 39050041
*            4 PREFX     CHAR(4),      /* IEBA IS PREFIX TO ALL MSGS.*/ 39150041
*            4 MSGR      CHAR(116),    /* REAL MSG MOVES TO HERE.    */ 39250041
*              5 *       CHAR(1),      /*                            */ 39350041
*              5 MSGOF   CHAR(115),    /* MSG DISP COUNT FROM HERE   */ 39450041
*                6 *     CHAR(100),    /* UNREFERENCED.              */ 39550041
*                6 PAGENO CHAR(4),     /* PAGE NUMBER GOES HERE.     */ 39650041
 @EJECT;                                                                39750041
*/********************************************************************* 39850041
**                                                                    * 39950041
**  DEFINED BELOW ARE MISCELLANEOUS COUNTERS AND ADDRESSES.           * 40050041
**                                                                    * 40150041
**********************************************************************/ 40250041
*                                                                       40350041
*        2 FCBSIZE       FIXED(15),    /* FCB SIZE PARAMETER.        */ 40450041
*        2 LPICNT        FIXED(32),    /* LINE PER INCH COUNTERS.    */ 40550048
*          3 LPI8        FIXED(8),     /* EIGHT LINE PER INCH CNTR.  */ 40620048
*          3 LPI6        FIXED(8),     /* SIX LINE PER INCH CNTR.    */ 40690048
*          3 LPI12       FIXED(8),     /* 12 LPI COUNTER     @Z48MSTT*/ 40760048
*          3 MARGN       FIXED(8),     /* MARGIN LINE COUNT. @Z48MSTT*/ 40810048
*        2 BOTTOM        FIXED(15),    /* BOTTOM MARGIN.     @Z48MSTT*/ 40860048
*        2 LOOP          FIXED(15),    /* LOOP COUNTER.      @Z48MSTT*/ 40910048
*        2 DDNAMES(4)    CHAR(8),      /* DDNAME LIST.               */ 40970048
*        2 LASTKEY       CHAR(8),      /* SAVE AREA FOR LAST KEYWORD.*/ 41040048
*        2 PARMSIZE      FIXED(16),    /* CURRENT PARAMETER SIZE.    */ 41110048
*        2 PARMNUM       FIXED(8),     /* CURRENT PARAMETER NUMBER.  */ 41180048
*        2 RESRV1        FIXED(8),     /* RESERVED.          @Z48MSTT*/ 41250048
*        2 SCANWORK,                   /* AREA USED BY SCAN ROUTINES.*/ 41350041
*          3 SCANARY(256,4)FIXED(8),   /* ARRAY FILLED BY IEBISCAN.  */ 41450041
*          3 SCNT        FIXED(16),    /* ARRAY TRACKER.             */ 41550041
*          3 CARDDATA    CHAR(414),    /* CARD DATA SCANNED TO HERE. */ 41650041
*            4 COPSV     CHAR(3),      /* PRINTABLE COPY NUMBER.     */ 41750041
*            4 LINSV     CHAR(3),      /* PRINTABLE LINE NUMBER.     */ 41850048
 @EJECT;                                                                41950041
*/********************************************************************* 42050041
**                                                                    * 42150041
**  DEFINED BELOW IS THE INPUT/OUTPUT BUFFER FOR THE LIBRARY DATA SET.* 42250041
**                                                                    * 42350041
**********************************************************************/ 42450041
*                                                                       42550041
*        2 LIBBUF,                     /* LIBRARY BUFFER AREA.       */ 42650041
*          3 MODHEAD,                  /* MODULE HEADING.            */ 42750041
*            4 MODNAME   CHAR(4),      /* MODULE SUFFIX.             */ 42850041
*            4 MODRSVD   FIXED(16),    /* RESERVED.                  */ 42950041
*            4 MODCNT    FIXED(16),    /* LENGTH OF MODULE BODY.     */ 43050041
*              5 CMODCNT FIXED(15),    /* LENGTH OF MODULE BODY.     */ 43150041
*          3 MODBOD      CHAR(8192),   /* MODULE BODY.               */ 43250041
*            4 BEGMARG   CHAR(3),      /* FCB MARGIN.                */ 43350041
*            4 FCBBOD(141)BIT(8),      /* FCB BODY.                  */ 43450048
*            4 FCBCLR    CHAR(144),    /* CLEAR FCB COMPARAND.       */ 43550048
*          3 OVERFLO     CHAR(212),    /* OVERFLOW FOR COPYMOD.      */ 43750041
*                                                                       43850041
*/********************************************************************* 43950041
**                                                                    * 44050041
**  THE AREAS BELOW HAVE MISCELLANEOUS USES, SEE EACH REDEFINITION    * 44150041
**  FOR ITS APPROPRIATE MEANING.                                      * 44250041
**                                                                    * 44350041
**********************************************************************/ 44450041
*                                                                       44550041
*        2 MSGSAVE(60)   CHAR(121),    /* MESSAGE BUFFER AREA.       */ 44650041
*        2 LASTBYTE      CHAR(1);      /* LAST BYTE OF GOTTEN CORE.  */ 44750041
*    DECLARE                                                            44850041
*        ASGNMENT        BIT(8)DEF(LPI8),/* FOR EBCDIC ASSIGNMENT.   */ 44950041
*        PITCH           BIT(8)DEF(LPI6),/* FOR CHARACTER PITCH.     */ 45050041
*        1 GRAFARY(64)   BDY(WORD)BASED(ADDR(SCANWORK)),                45150041
*          2 ASNARRAY     BIT(8),      /* FOR EBCDIC ASSIGNMENT.     */ 45250041
*          2 ASNENTRY     BIT(8),      /* ALL BITS IF ASSIGNED.      */ 45350041
*          2 REFARRAY     FIXED(16);   /* FOR GCM REFERENCE.         */ 45450041
*     DECLARE                          /* DELETED SEGMENT ARRAY.     */ 45550041
*        ASGNSAVE     CHAR(256)BASED(ADDR(DEL)),/* FOR ASSIGN VALUES.*/ 45650041
*        DEL(1024)    BIT(8)BASED(ADDR(SCANARY));/* DELETE VALUES.   */ 45750041
*@EJECT;                                                                45850041
*/********************************************************************* 45950041
**                                                                    * 46050041
**  THE FOLLOWING DEFINES THE KEYWORD USED SWITCHES FOR EACH          * 46150041
**  OPERATION.                                                        * 46250041
**                                                                    * 46350041
**********************************************************************/ 46450041
*    DECLARE                                                            46550041
*        1 ALLKEY        BIT(8)DEF(KWDUSED),                            46650041
*          2 NAMESET     BIT(1),       /* NAME FOUND.                */ 46750041
*          2 NOKEY       BIT(1),       /* NO KEYWORD FOUND           */ 46850041
*          2 DELSET      BIT(1),       /* DELSEG FOUND.              */ 46950041
*        1 FCBKEY        BIT(8)DEF(KWDUSED),                            47050041
*          2 *           BIT(3),       /* PREDEFINED.                */ 47150041
*          2 LPISET      BIT(1),       /* LPI FOUND.                 */ 47250041
*          2 SIZESET     BIT(1),       /* SIZE FOUND.                */ 47350041
*          2 CHSET       BIT(1),       /* CHX FOUND.                 */ 47450041
*        1 TBLKEY        BIT(8)DEF(KWDUSED),                            47550041
*          2 *           BIT(3),       /* PREDEFINED.                */ 47650041
*          2 LOCSET      BIT(1),       /* LOC FOUND.                 */ 47750041
*          2 CGMIDSET    BIT(1),       /* CGMID FOUND.               */ 47850041
*          2 GCMLSET     BIT(1),       /* GCMLIST FOUND.             */ 47950041
*        1 COPYKEY       BIT(8)DEF(KWDUSED),                            48050041
*          2 *           BIT(3),       /* PREDEFINED.                */ 48150041
*          2 COPYSET     BIT(1),       /* COPIES FOUND.              */ 48250041
*          2 LINESET     BIT(1),       /* LINES FOUND.               */ 48350041
*          2 POSSET      BIT(1),       /* POS FOUND.                 */ 48450041
*          2 TEXTSET     BIT(1),       /* TEXT FOUND.                */ 48550041
*        1 GRAPHKEY      BIT(8)DEF(KWDUSED),                            48650041
*          2 *           BIT(3),       /* PREDEFINED.                */ 48750041
*          2 REFSET      BIT(1),       /* REF FOUND.                 */ 48850041
*          2 GCMSET      BIT(1),       /* GCM FOUND.                 */ 48950041
*          2 ASGNSET     BIT(1);       /* ASSIGN FOUND.              */ 49050041
*@EJECT;                                                                49150041
*    DECLARE                                                            49250041
*        TEXTDATA        CHAR(204)BASED(BUFFPTR),                       49350041
*        1 COPYLINE      BDY(WORD)BASED(ADDR(SCANWORK)),                49450041
*          2 COPYLABL,                 /* COPY SEGMENT HEADER.       */ 49550041
*            3 ICOPY     FIXED(8),     /* INITIAL COPY NUMBER.       */ 49650041
*            3 COPYX     FIXED(8),     /* NUMBER OF COPIES.          */ 49750041
*            3 ILINE     FIXED(8),     /* INITIAL LINE NUMBER.       */ 49850041
*            3 LINEX     FIXED(8),     /* NUMBER OF LINES.           */ 49950041
*            3 IPOS      FIXED(8),     /* INITIAL PRINT POSITION.    */ 50050041
*            3 TEXTN     FIXED(8),     /* NUMBER OF TEXT BYTES.      */ 50150041
*          2 TEXTD       CHAR(204);    /* TEXT DATA.                 */ 50250041
*    DECLARE                           /* BUFFER DEFINITION FOR      */ 50350041
*        1 XLATTABL DEF(MODBOD),       /* CHAR ARRANGEMENT TABLE.    */ 50450041
*          2 XPOS(16,16) BIT(8),       /* 256 ENTRIES IN TABLE.      */ 50550041
*            3 XWCGM     BIT(2),       /* TWO HI BITS INDICATE WCGM. */ 50650041
*            3 XREF      BIT(6),       /* SIX LOW BITS ARE WCGM REF. */ 50750041
*          2  CGMIDALL CHAR(8)BDY(WORD),/* CGMID AREA.               */ 50850041
*            3 CGMIDX(4) FIXED(16),    /* FOUR POSSIBLE              */ 50950041
*              4 CGMIDN  FIXED(8),     /* CHAR GEN MOD IDENTS AND    */ 51050041
*              4 CGMIDNO FIXED(8),     /*  IDENT ORDERS.             */ 51150041
*          2 GRFMODS     CHAR(16),     /* GCM NAME AREA.             */ 51250041
*            3 GRAFMODN(4)CHAR(4);     /* FOUR POSSIBLE GCM NAMES.   */ 51350041
*     DECLARE                                                           51450041
*        1 FCBMOD CHAR(152)DEF(LIBBUF),/* DEFINE FCB MODULE.         */ 51550048
*          2 FCBHEAD,                  /* FCB MODULE HEADING.        */ 51650041
*            3 FCBNAME     CHAR(4),    /* NAME SUFFIX.               */ 51750041
*            3 FCBRSVD     FIXED(16),  /* RESERVED.                  */ 51850041
*            3 FCBCNT      FIXED(16),  /* COUNT OF BYTES REMAINING.  */ 51950041
*          2 FCBYTE(*)      BIT(8),    /* ACTUAL FCB                 */ 52050041
*            3 FCBNA        BIT(2),    /* TWO BITS NOT USED  @Z48MSTT*/ 52150048
*            3 FLPI12       BIT(2),    /* 12 LPI BITS.       @Z48MSTT*/ 52200048
*              4 *          BIT(1),    /* UNDEFINED.         @Z48MSTT*/ 52250048
*              4 FLPI       BIT(1),    /* ON = 8 LPI, OFF = 6 LPI    */ 52300048
*            3 FCHN         BIT(4);    /* CHANNEL CODE.              */ 52350041
*    DECLARE                                                            52450041
*        DCBTAB(4)PTR(31)DEF(DCBADS),  /* TABLE OF DCB ADDRESSES.    */ 52550041
*        1 CWORK CHAR(4) DEF(FWORK),   /* NEED CHAR DEFINITION ALSO  */ 52650041
*          2 UWORK   CHAR(2),          /* UNPACK AREA.               */ 52750041
*            3 *     CHAR(1),                                           52850041
*            3 UNITS CHAR(1),          /* UNITS POSITION RETURN CODE */ 52950041
*        1 CWORKX CHAR(4) DEF(FWORK),  /*                            */ 53050041
*          2 *         CHAR(1),        /* UNREFERENCED.              */ 53150041
*          2 CWORK3    CHAR(3),        /* THREE LOW ORDER BYTES.     */ 53250041
*            3 *       CHAR(1),        /* UNREFERENCED.              */ 53350041
*            3 CWORK2  CHAR(2),        /* TWO LOW ORDER BYTES.       */ 53450041
*              4 *     CHAR(1),        /* UNREFERENCED.              */ 53550041
*              4 CWORK1 CHAR(1);       /* LOW ORDER BYTE.            */ 53650041
*    DECLARE                                                            53750041
*        COL      CHAR(8)  BASED(CC),  /* CARD COLUMN DEFINITION.    */ 53850041
*        COL72    CHAR(1) DEF(PRIMCARD)POSITION(72); /* DEFINE COL 72*/ 53950041
*    DECLARE                           /* PRINT QUEUE AREA.          */ 54050041
*        1 PRTQELEM  CHAR(121)BASED(ADDR(MSGSAVE(NEXT))),               54150041
*          2 CONTROL     CHAR(1),      /* ROOM FOR CONTROL CHARACTER.*/ 54250041
*          2 PRTQUEUE    CHAR(120),    /* PRINT LINE INFORMATION.    */ 54350041
*            3 *     CHAR(54),         /* UNDEFINED AREA.            */ 54450041
*            3 TBN   CHAR(8);          /* AREA FOR MODULE NAME.      */ 54550041
*@EJECT;                                                                54650041
*/********************************************************************* 54750041
**                                                                    * 54850041
**  LISTED BELOW ARE THE MESSAGE NUMBERS THAT MAY BE SELECTED.        * 54950041
**                                                                    * 55050041
**********************************************************************/ 55150041
*                                                                       55250041
*    DECLARE                                                            55350041
*        IEBA01I FIXED(8) CONSTANT(1), /* SELECTS MESSAGE 1.         */ 55450041
*        IEBA02I FIXED(8) CONSTANT(2), /* SELECTS MESSAGE 2.         */ 55550041
*        IEBA03I FIXED(8) CONSTANT(3), /* SELECTS MESSAGE 3.         */ 55650041
*        IEBA04I FIXED(8) CONSTANT(4), /* SELECTS MESSAGE 4.         */ 55750041
*        IEBA05I FIXED(8) CONSTANT(5), /* SELECTS MESSAGE 5.         */ 55850041
*        IEBA06I FIXED(8) CONSTANT(6), /* SELECTS MESSAGE 6.         */ 55950041
*        IEBA07I FIXED(8) CONSTANT(7), /* SELECTS MESSAGE 7.         */ 56050041
*        IEBA08I FIXED(8) CONSTANT(8), /* SELECTS MESSAGE 8.         */ 56150041
*        IEBA09I FIXED(8) CONSTANT(9), /* SELECTS MESSAGE 9.         */ 56250041
*        IEBA10I FIXED(8) CONSTANT(10),/* SELECTS MESSAGE 10.        */ 56350041
*        IEBA11I FIXED(8) CONSTANT(11),/* SELECTS MESSAGE 11.        */ 56450041
*        IEBA12I FIXED(8) CONSTANT(12),/* SELECTS MESSAGE 12.        */ 56550041
*        IEBA13I FIXED(8) CONSTANT(13),/* SELECTS MESSAGE 13.        */ 56650041
*        IEBA14I FIXED(8) CONSTANT(14),/* SELECTS MESSAGE 14.        */ 56750041
*        IEBA15I FIXED(8) CONSTANT(15),/* SELECTS MESSAGE 15.        */ 56850041
*        IEBA16I FIXED(8) CONSTANT(16),/* SELECTS MESSAGE 16.        */ 56950041
*        IEBA17I FIXED(8) CONSTANT(17),/* SELECTS MESSAGE 17.        */ 57050041
*        IEBA18I FIXED(8) CONSTANT(18),/* SELECTS MESSAGE 18.        */ 57150041
*        IEBA19I FIXED(8) CONSTANT(19),/* SELECTS MESSAGE 19.        */ 57250041
*        IEBA20I FIXED(8) CONSTANT(20),/* SELECTS MESSAGE 20.        */ 57350041
*        IEBA21I FIXED(8) CONSTANT(21),/* SELECTS MESSAGE 21.        */ 57450041
*        IEBA22I FIXED(8) CONSTANT(22),/* SELECTS MESSAGE 22.        */ 57550041
*        IEBA23I FIXED(8) CONSTANT(23),/* SELECTS MESSAGE 23.        */ 57650041
*        IEBA24I FIXED(8) CONSTANT(24),/* SELECTS MESSAGE 24.        */ 57750041
*        IEBA25I FIXED(8) CONSTANT(25),/* SELECTS MESSAGE 25.        */ 57850041
*        IEBA26I FIXED(8) CONSTANT(26),/* SELECTS MESSAGE 26.        */ 57950041
*        IEBA27I FIXED(8) CONSTANT(27),/* SELECTS MESSAGE 27.        */ 58050041
*        IEBA28I FIXED(8) CONSTANT(28),/* SELECTS MESSAGE 28.        */ 58150041
*        IEBA29I FIXED(8) CONSTANT(29),/* SELECTS MESSAGE 29.        */ 58250041
*        IEBA30I FIXED(8) CONSTANT(30),/* SELECTS MESSAGE 30.        */ 58350041
*        IEBA31I FIXED(8) CONSTANT(31),/* SELECTS MESSAGE 31.        */ 58450041
*        IEBA32I FIXED(8) CONSTANT(32),/* SELECTS MESSAGE 32.        */ 58550041
*        IEBA33I FIXED(8) CONSTANT(33),/* SELECTS MESSAGE 33.        */ 58650041
*        IEBA34I FIXED(8) CONSTANT(34),/* SELECTS MESSAGE 34.        */ 58750041
*        IEBA35I FIXED(8) CONSTANT(35),/* SELECTS MESSAGE 35.        */ 58850041
*        IEBA36I FIXED(8) CONSTANT(36),/* SELECTS MESSAGE 36.        */ 58950041
*        IEBA37I FIXED(8) CONSTANT(37),/* SELECTS MESSAGE 37.        */ 59050041
*        IEBA38I FIXED(8) CONSTANT(38),/* SELECTS MESSAGE 38.        */ 59150041
*        IEBA39I FIXED(8) CONSTANT(39),/* SELECTS MESSAGE 39.        */ 59250041
*        IEBA40I FIXED(8) CONSTANT(40),/* SELECTS MESSAGE 40.        */ 59350041
*        IEBA41I FIXED(8) CONSTANT(41),/* SELECTS MESSAGE 41.        */ 59450041
*        IEBA42I FIXED(8) CONSTANT(42),/* SELECTS MESSAGE 42.        */ 59550041
*        IEBA43I FIXED(8) CONSTANT(43),/* SELECTS MESSAGE 43.        */ 59650041
*        IEBA44I FIXED(8) CONSTANT(44),/* SELECTS MESSAGE 44.        */ 59750041
*        IEBA45I FIXED(8) CONSTANT(45),/* SELECTS MESSAGE 45.        */ 59850041
*        IEBA46I FIXED(8) CONSTANT(46),/* SELECTS MESSAGE 46.        */ 59950041
*        IEBA47I FIXED(8) CONSTANT(47),/* SELECTS MESSAGE 47.        */ 60050041
*        IEBA48I FIXED(8) CONSTANT(48),/* SELECTS MESSAGE 48.        */ 60150048
*        IEBA49I FIXED(8) CONSTANT(49);/* SELECTS MESSAGE 49.        */ 60200048
* @EJECT;                                                               60250041
*/********************************************************************* 60350041
**                                                                    * 60450041
**  BELOW  ARE ALL THE REGISTER DEFINITIONS USED IN THE PROGRAM.      * 60550041
**  THEY ARE RESTRICTED AND UNRESTRICTED AS THE NEED FOR THIER        * 60650041
**  USE ARISES.                                                       * 60750041
**                                                                    * 60850041
**********************************************************************/ 60950041
*                                                                       61050041
*    DECLARE                           /* REGISTER ASSIGNMENTS.      */ 61150041
*        R0        REG(0)  PTR(31)UNRSTD, /* HOLDS PARAMETER.        */ 61250041
*        R1        REG(1)  PTR(31)UNRSTD, /* HOLDS PARAMETER POINTER */ 61350041
*        PARAM     REG(3)  PTR(31)UNRSTD, /* SAVES PARAMETER POINTER */ 61450041
*        REMSIZE   REG(3)FIXED(31)UNRSTD, /* REMAINDER OF MOD BLOCK. */ 61550041
*        SHIFT     REG(4)FIXED(31)UNRSTD, /* SHIFT REG.              */ 61650041
*        SHIFT2    REG(5)FIXED(31)UNRSTD, /* SHIFT REGISTER.         */ 61750041
*        RECAREA   REG(4)FIXED(31)UNRSTD, /* RECEIVING AREA FOR MVCL.*/ 61850041
*        RECSIZE   REG(5)FIXED(31)UNRSTD, /* RECEIVING SIZE FOR MVCL.*/ 61950041
*        BUFFPTR   REG(6)  PTR(31)UNRSTD, /* INTERNAL BUFFER POINTER.*/ 62050041
*        TRANSIZE  REG(7)FIXED(31)UNRSTD, /* RECEIVING SIZE FOR MVCL.*/ 62150041
*        DB        REG(7)  PTR(32)UNRSTD, /* DATA PTR FOR ASSEM CODE */ 62250041
*        BUFAD     PTR REG(8) RESTRICTED, /* REG OF GOTTEN STORAGE.  */ 62350041
*        R14       REG(14) PTR(32)UNRSTD, /* HOLDS CALLED ROUTINE ADR*/ 62450041
*        RETCODE   REG(15) FIXED(32)UNRSTD;/* HOLDS RETURN CODE.     */ 62550041
*@EJECT;                                                                62650041
*/********************************************************************* 62750041
**                                                                    * 62850041
**  THE FOLLOWING REDEFINES THE OPERATION TABLE AS AN ARRAY OF        * 62950041
**  TWENTY FOUR BYTE ELEMENTS.                                        * 63050041
**                                                                    * 63150041
**********************************************************************/ 63250041
*    DECLARE                                                            63350041
*        1 TABLDEF(*) BASED(OPTABAD),  /* OPERATION TABLE STRUCTURE. */ 63450041
*          2 OPNUM      FIXED(8),      /* OPERATION NUMBER.          */ 63550041
*          2 OPFLAGS    BIT(24),       /* OPERATIONAL/KEYWORD FLAGS. */ 63650041
*            3 MLTFLAG  BIT(1),        /* MULTI CONTROL CARDS ALLOWED*/ 63750041
*            3 LPIFLAG  BIT(1),        /* ALLOW LPI                  */ 63850041
*            3 CHFLAG   BIT(1),        /*       CH1 THRU CH12        */ 63950041
*            3 SIZEFLAG BIT(1),        /*       SIZE                 */ 64050041
*            3 COPYFLAG BIT(1),        /*       COPY                 */ 64150041
*            3 LINEFLAG BIT(1),        /*       LINE                 */ 64250041
*            3 POSFLAG  BIT(1),        /*       POS                  */ 64350041
*            3 TEXTFLAG BIT(1),        /*       TEXT                 */ 64450041
*            3 NAMEFLAG BIT(1),        /*       MEMBER NAME          */ 64550041
*            3 ASGNFLAG BIT(1),        /*       ASSIGN               */ 64650041
*            3 DELFLAG  BIT(1),        /*       DELSEG               */ 64750041
*            3 REFFLAG  BIT(1),        /*       REF                  */ 64850041
*            3 GCMFLAG  BIT(1),        /*       GCM                  */ 64950041
*            3 GCMLFLAG BIT(1),        /*       GCMLIST              */ 65050041
*            3 LOCFLAG  BIT(1),        /*       LOC                  */ 65150041
*            3 CGMIDFLG BIT(1),        /*       CGMID                */ 65250041
*            3 NOFLAG   BIT(1),        /*       NO KEYWORDS          */ 65350041
*            3 ASTRFLAG BIT(1),        /*       ASTERISK             */ 65450041
*            3 REPFLAG  BIT(1),        /*       REPLACE OPTION       */ 65550041
*          2 NOB        FIXED(8),      /* NUMBER OF BYTES IN KEYWORD.*/ 65650041
*          2 BLDPTR     PTR(24),       /* POINTER TO BUILD ROUTINE.  */ 65750041
*          2  *         FIXED(8),      /* RESERVED BYTE              */ 65850041
*          2 CHKPTR     PTR(24),       /* POINTER TO CHECK ROUTINE.  */ 65950041
*          2  *         FIXED(8),      /* RESERVED BYTE              */ 66050041
*          2 PRTPTR     PTR(24),       /* POINTER TO PRINT ROUTINE.  */ 66150041
*          2 RTNAME     CHAR(8);       /* KEYWORD NAME.              */ 66250041
*@EJECT;                                                                66350041
./  ADD  SSI=40170033,NAME=IEBMCA
         MACRO                                                          00090000
&NAME    IEBMCA                                                         00180000
*A 976365                                                      @YM06438 00182002
*C 976364                                                      @YM06438 00184002
*A 976364                                                      @YM06433 00186002
*C 976200-976480,976899                                        @YM06433 00188002
*D 976484-976799,976999-977360                                 @YM06433 00188402
*A976420-977360                                                @YM04848 00190002
*D655200,A654900-655500                                         OY01182 00200002
*A966100-976400                                                 YL026VD 00210002
*A664200,928800                                                  A36049 00220021
*A711900-712100                                                  A44345 00230021
* 155700,179100,229500,236700,324900,839700,859500               X010XX 00230100
*C229500-230900,236700-238500                                    A45170 00240022
* 472500,475200,481500                                           X010XX 00240100
*A756500-756840                                                  A48742 00250022
*A236700                                                        YA01689 00260002
*                                                                       00270000
**********       C O M M U N I C A T I O N    A R E A        ********** 00360000
**********                  I E B D S C P Y                  ********** 00450000
*                                                                       00540000
         SPACE 2                                                        00630000
* ABBREVIATIONS USED FREQUENTLY -                                       00720000
*        ODE = OUTPUT DIRECTORY ENTRY                                   00810000
*        IDE = INPUT DIRECTORY ENTRY                                    00900000
         SPACE 2                                                        00990000
*                                                                       01080000
* SETAB = SELECT/EXCLUDE TABLE                                          01170000
*        THE SETAB CONSISTS OF 10-BYTE ENTRIES.  ENTRIES ARE MADE TO    01260000
*        THIS TABLE WHEN -                                              01350000
*              1) A SELECTIVE COPY HAS BEEN SPECIFIED.  EACH ENTRY IS   01440000
*              FOR THE NAME OF A MEMBER TO BE SELECTED.  IF A MEMBER IS 01530000
*              TO BE RENAMED, TWO 10-BYTE ENTRIES ARE MADE IN THE SETAB 01620000
*              2) AN EXCLUSIVE COPY HAS BEEN SPECIFIED.  EACH ENTRY IS  01710000
*              FOR THE NAME OF A MEMBER TO BE EXCLUDED.                 01800000
*        NOTE- IN THE CASE OF A SELECTIVE COPY (AND ONLY IN THIS CASE), 01890000
*              THE SETAB WILL ALSO BE USED AS THE CTLTAB.  IN ALL OTHER 01980000
*              CASES, A SEPARATE CTLTAB WILL BE CONSTRUCTED.            02070000
*        BYTE 0 OF AN ENTRY IS DESIGNATED AS SEFLAG1.  WITHIN THIS BYTE 02160000
*        THE FOLLOWING BITS HAVE MEANING -                              02250000
SEBIT1   EQU   X'80' ON=THIS IS A NEWNAME ENTRY                         02340000
SEBIT2   EQU   X'40' ON=THIS IS A RENAMED ENTRY                         02430000
SEBIT3   EQU   X'20' ON=REPLACE OPTION WAS SPECIFIED FOR THIS MEMBER    02520000
SEBIT4   EQU   X'10' ON=DONTCOPY FLAG...DO NOT PROCESS THIS ENTRY       02610000
SEBIT5   EQU   X'08' ON= THIS MEMBER HAS BEEN ''FOUND'' ON INPUT D.S.   02700000
SEBIT6   EQU   X'04' ON= THIS IS LAST ENTRY IN SETAB/CTLTAB             02790000
*        LO ORDER 2 BITS NOT USED                                       02880000
*        NOTE THE DEFINITION OF SEBIT3.  IF, IN THE INDD TABLE, BYTE 0  02970000
*              BIT 2 IS ON, THIS MEANS THAT THE REPLACE OPTION WAS SPE- 03060000
*              CIFIED FOR ALL MEMBERS COPIED FROM THIS INDD.  IT IS     03150000
*              VALID FOR BOTH OF THESE BITS TO BE ON AT THE SAME TIME,  03240000
*              ALTHOUGH IF THE BIT IS ON IN THE INDD TABLE, IT IS UN-   03330000
*              NECESSARY FOR SEBIT3 TO ALSO BE ON IN THE SETAB.         03420000
         EJECT                                                          03510000
* FOLLOWING IS A DESCRIPTION OF THE CONTROL TABLE -CTLTAB-              03600000
* (REMEMBER THAT THIS TABLE IS PHYSICALLY THE SAME TABLE AS SETAB WHEN  03690000
* A SELECTIVE COPY OPERATION IS SPECIFIED, BUT IS PHYSICALLY INDEPEN-   03780000
* DENT AND DISTINCT FROM THE SETAB FOR AN EXCLUSIVE COPY OPERATION.     03870000
* THERE IS NO SETAB FOR A FULL COPY OPERATION, AND THE CTLTAB IN THIS   03960000
* CASE IS CONSTRUCTED SIMILARLY TO WHEN AN EXCLUSIVE COPY IS SPECIFIED. 04050000
* SINCE THE SETAB AND CTLTAB ARE ONE AND THE SAME FOR A SEL. COPY, THIS 04140000
*  DESCRIPTION WILL ASSUME THAT A SELECTIVE COPY IS BEING DONE, FOR THE 04230000
*  PURPOSE OF SETTING UP THE TABLE INITIALLY.)....                      04320000
         SPACE 2                                                        04410000
*        INITIAL TABLE, FOLLOWING CCSCAN PROCESSING OF ''SELECT'' -     04500000
*********************************************************************** 04590000
*SEFLAG1 *SEFLAG2 * NAME OF MEMBER TO BE SELECTED, OR, IF SPECIFIED,  * 04680000
*(DESCR. *(UNUSED)* NEWNAME.  IF NEWNAME WAS SPECIFIED, THE TABLE WILL* 04770000
* ABOVE) *        * CONTAIN 1 ENTRY FOR OLDNAME AND ANOTHER FOR NEW.  * 04860000
*********************************************************************** 04950000
* 1 BYTE * 1 BYTE *----------------------8 BYTES----------------------* 05040000
         SPACE 2                                                        05130000
* OLDNAME/NEWNAME PAIRS ARE NOW EXTRACTED FROM THE SETAB.  THEN THE     05220000
* CTLTAB IS SORTED ALPH. BY MBRNAME, AND A NEWNAME PTRTABLE SET UP.     05310000
* WHEN THIS HAS BEEN DONE, THE INPUT DATA SET'S DIRECTORY IS SEARCHED   05400000
* FOR MATCHING NAMES (THE NEWNAME ENTRIES IN THE TABLE ARE NOT USED FOR 05490000
* THIS COMPARISON).  WHEN A MATCHING MEMBERNAME IS FOUND, THE DIRECTORY 05580000
* ENTRY IS RETAINED IN CORE (IF SPACE PERMITS), OR IT IS SPILLED ONTO   05670000
* SYSUT3.  IN EITHER CASE, THE CORE ADDRESS OR THE TTR+INDICATOR ARE    05760000
* PUT INTO THE CTLTAB, OVERLAYING THE HIGH-ORDER 4 BYTES OF 'OLDNAME'.  05850000
* THE MEMBER-TTR IS EXTRACTED FROM THE DIRECTORY ENTRY, AND OVERLAYS    05940000
* THE LOW-ORDER 4 BYTES OF 'OLDNAME' IN THE CTLTAB.  SEBIT5 IS TURNED   06030000
* ON.  IF THIS IS AN ALIAS ENTRY, SEFLAG2 IS SET AS FOLLOWS -           06120000
ALIAS    EQU   X'80'         TO TEST FOR AND SET ALIAS DIRECTORY ENTRY  06210000
         SPACE 2                                                        06300000
*        CTLTAB ENTRY FOR A ''FOUND'' MEMBER -                          06390000
         SPACE 2                                                        06480000
*********************************************************************** 06570000
*SEFLAG1 *SEFLAG2 * INDIC. * ADDR OF THE IN-* ZEROES *   MEMBER TTR   * 06660000
*        *        *  BYTE  * PUT DIR. ENTRY *        *                * 06750000
*********************************************************************** 06840000
*-1 BYTE-*-1 BYTE-*-1 BYTE-*-----3 BYTES----*-1 BYTE-*-----3 BYTES----* 06930000
         SPACE 2                                                        07020000
* THE INDICATOR BYTE IS ZEROES IF THE DIRECTORY ENTRY IS IN CORE, OR IT 07110000
* IS HEX '01' IF THE DIRECTORY ENTRY WAS SPILLED TO SYSUT3.             07200000
* NOTE THAT CTLTAB ENTRIES FOR A ''NEWNAME'' ARE NOT OVERLAYED OR AL-   07290000
* TERED AT ANY TIME.  ONCE THE ENTIRE INPUT DIRECTORY HAS BEEN SCANNED, 07380000
* (OR AT LEAST ALL ENTRIES FOR MEMBERS TO BE COPIED FROM THIS INPUT     07470000
* DATA SET HAVE BEEN BUILT), THE OUTPUT DATA SET DIRECTORY IS READ.     07560000
* MEMBERNAMES OF MEMBERS CURRENTLY IN THE OUTPUT DATA SET ARE COMPARED  07650000
* AGAINST MEMBERNAMES OF MEMBERS REFERENCED IN THE CTLTAB FOR THE CUR-  07740000
* RENT INPUT DATA SET, UNLESS THE LATTER WERE RENAMED.  IF THE INPUT    07830000
* MEMBER IS RENAMED, THEN THE NEWNAME IS COMPARED AGAINST THE OUTPUT.   07920000
* IF DUPLICATE NAMES ARE ENCOUNTERED, AND IF THE REPLACE OPTION WAS NOT 08010000
* SPECIFIED ON EITHER THE INDD LEVEL OR THE MEMBERNAME LEVEL, THEN THE  08100000
* DONT-COPY BIT (SEBIT4) IS SET IN THE FLAG BYTE OF THE APPROPRIATE     08190000
* CTLTAB ENTRY, AND THE INDIC. BYTE (BYTE 3) OF THIS ENTRY IS SET TO    08280000
* HEX 'FF'.                                                             08370000
* THINK OF THE LOW-ORDER 8-BYTES OF EACH ''FOUND'' CTLTAB ENTRY AS BE-  08460000
* ING DIVIDED INTO A LEFT HALF (INDIC. + DIR. ENTRY ADDR.) AND A RIGHT  08550000
* HALF (ZEROES + MBR. TTR).  THE LEFT HALF NOW REPRESENTS DIRECTORY     08640000
* ENTRIES FOUND IN THE CURRENT INPUT DATA SET, AND IS IN ALPHAMERIC     08730000
* SEQUENCE.                                                             08820000
         EJECT                                                          08910000
* THE NEXT STEP IN CTLTAB PROCESSING CAUSES THE ''FOUND'' ENTRIES TO BE 09000000
* MANIPULATED, WITH THE RESULT BEING THAT THE LEFT HALF CONTAINS (IN-   09090000
* DIC + ADDR OF DIR. ENTRY) IN SEQUENCE BY MEMBER TTR, AND THE RIGHT    09180000
* HALF CONTAINS THIS SAME INFORMATION (INDIC. + ADDR OF DIR. ENTRY) IN  09270000
* ALPHAMERIC SEQUENCE, OVERLAYING THE ACTUAL MEMBER TTR.  ANOTHER RE-   09360000
* SULT OF THIS MANIPULATION OF THE CTLTAB IS THAT MAIN-MEMBER ENTRIES   09450000
* PRECEDE THE CORRESPONDING ALIAS ENTRIES.  NOTE THAT THE BITS SET IN   09540000
* SEFLAG1 ARE NOW ONLY USEFUL FOR THE ''RIGHT HALF'' OF THE CTLTAB,     09630000
* SINCE THEY ARE NOT MANIPULATED AND THUS REMAIN IN THE ORIGINAL (AL-   09720000
* PHABETIC) SEQUENCE.                                                   09810000
         SPACE 2                                                        09900000
*        CTLTAB ENTRY FOR A FOUND MEMBER FOLLOWING TTR SORT -           09990000
         SPACE 2                                                        10080000
*********************************************************************** 10170000
*SEFLAG1 *SEFLAG2 * INDIC. * ADDR OF IN. DE * INDIC. * ADDR OF IN. DE * 10260000
*        *        *  BYTE  *                *  BYTE  *                * 10350000
*        *        *IN SEQ BY MEMBER TTR     *IN SEQ ALPHAMERICALLY    * 10440000
*********************************************************************** 10530000
* 1 BYTE-*-1 BYTE-*-1 BYTE-*-----3 BYTES----*-1 BYTE-*-----3 BYTES----* 10620000
         SPACE 2                                                        10710000
* AT THIS POINT, THERE IS NO LOGICAL RELATIONSHIP BETWEEN THE LEFT AND  10800000
* RIGHT HALVES OF THE RELEVANT CTLTAB ENTRIES.  BOTH HALVES CONTAIN THE 10890000
* SAME INFORMATION, BUT IT IS IN TWO DIFFERENT SEQUENCES.  NOTE THAT,   10980000
* IF A MEMBER BEING LOOKED FOR IS NOT ''FOUND'', ITS CTLTAB ENTRY RE-   11070000
* MAINS UNALTERED - THE NAME IS STILL UN-OVERLAYED.                     11160000
* FROM THIS POINT ON, THOSE MEMBERS OF THE INPUT DATA SET WHOSE DIREC-  11250000
* TORY ENTRIES ARE REFERENCED IN THE CTLTAB WILL BE COPIED, PROVIDED    11340000
* THAT THEY ARE ''FOUND'' AND NOT FLAGGED AS ''DONT-COPY''.  THEN THE   11430000
* DIRECTORY ENTRIES WILL BE MERGED.  AS THE MERGE IS PERFORMED, WHEN AN 11520000
* INPUT DE IS MERGED, IF THIS IS A SELECTIVE COPY, THE DONT-COPY BIT    11610000
* (SEBIT4) IS TURNED ON, THUS ALLOWING FOR THESE ENTRIES IN THE CTLTAB  11700000
* TO BE IGNORED IN SUBSEQUENT PASSES THROUGH THE SAME TABLE FOR THE EN- 11790000
* SUING INPUT DATA SETS.                                                11880000
JSTCPD   EQU   X'10'              IF ON IN THE 2ND BYTE OF A CTLTAB EN- 11970000
*                                 TRY (SEFLAG2), THERE IS A NAME (CON-  12060000
*                                 TAINED IN THE 3RD THROUGH 10TH BYTES  12150000
*                                 OF THIS ENTRY) OF AN INPUT MEMBER     12240000
*                                 WHICH HAS BEEN SUCCESSFULLY COPIED.   12330000
*                                 THIS MEMBERNAME WILL BE PRINTED BY    12420000
*                                 THE TERMINATION MODULE (IEBVTM) UNDER 12510000
*                                 APPROPRIATE CONDITIONS, AT WHICH TIME 12600000
*                                 THIS BIT WILL BE TURNED OFF.          12690000
*********************************************************************** 12780000
         EJECT                                                          12870000
*XXXXXXXXXX    EVERY CONSTANT BETW. HERE AND NXT X'S MUST BE CONTIGUOUS 12960000
* ALL CONSTANTS BETWEEN X'S ARE SET TO ZERO FOR EVERY INPUT DATA SET.   13050000
* THE NAMES OF THE CONSTANTS WHICH ARE INCLUDED IN THIS CONTIG. AREA -  13140000
* CDCT, FCT, NNTCT, OLDTTR, FLG5                                        13230000
* ICPT,SVLSTO,SVFSTO,FLG2,FLG6,SWITCH1,UTTRFLAG,OBCT                    13320000
         SPACE 2                                                        13410000
         DS    0F                 ALIGNMENT                             13500000
ICPT     DC    F'0'          ADDR OF LAST CTLTAB ENTRY WHICH REFERENCED 13590000
*                            AN IN-CORE INPUT D.E.                      13680000
SVFSTO   DC    AL4(0)        ADDR OF 1ST OUT DIR BLOCK SAVED IN CORE    13770000
SVLSTO   DC    AL4(0)        ADDR OF LAST OUT DIR BLOCK SAVED IN CORE   13860000
*                                                                       13950000
CDCT     DC    HL2'0'        COUNT OF NBR OF ENTRIES IN CTLTAB WHICH    14040000
*                            REFERENCE INPUT D-E'S WHICH WERE RETAINED  14130000
*                            IN CORE (IE, NOT ''SPILLED'')              14220000
FCT      DC    HL2'0'        COUNT OF THE NUMBER OF 'FOUND' MEMBERS     14310000
*                            WHICH ARE TO BE COPIED FROM THE CURRENT    14400000
*                            INPUT DATA SET                             14490000
NNTCT    DC    HL2'0'        COUNTER USED FOR INDEXING THROUGH NEWNAME  14580000
*                            POINTER TABLE (NNPTRTAB)                   14670000
OLDTTR   DS    XL3           IN TTR OF MOST RECENT MBR ACTUALLY COPIED  14760000
*                                                                       14850000
FLG2     DC    X'00'              FLAGS/SWITCHES                        14940000
TRKS2    EQU   X'80'              ON = 2 TRACK-LENGTH BFRS ALLOCATED    15030000
MBUSED   EQU   X'40'              ON = MINIMUM I/O BFR-SIZE NOW ALLOC   15120000
RDEOF    EQU   X'20'              ON = EOF OCCURRED ON DS BEING READ    15210000
FSTWRT   EQU   X'10'              ON = 1ST BFR-FULL OF DATA FOR CURRENT 15300000
*                                 MEMBER HAS BEEN COPIED BY IEBMNM RTNE 15390000
FMTSPL   EQU   X'08'         ON = NEED TO WRT CT-KEY-DATA IF TO UT3     15480000
NBRK     EQU   X'04'              ON=SIZE PARM GIVEN IN K        X010XX 15570000
*              LOW ORDER 2 BITS NOT USED - RESERVED              X010XX 15620000
         SPACE 1                                                        15660000
FLG5     DC    XL1'0'        SWITCHES / FLAGS                           15750000
DEFSW    EQU   X'80'         ON = IEBMGD SUBRTNE INITIALIZATION SWITCH  15840000
OSCAN    EQU   X'40'         ON = SCAN OF OUT. D.E'S HAS BEEN INITIAL-  15930000
*                                 IZED FOR CURRENT INPUT D.S.           16020000
NSP      EQU   X'20'         ON = NO (MORE) SPACE TO KEEP ANY OUT. D.E. 16110000
OSW1     EQU   X'10'         ON = PRE-SCAN OF OUT. DIR. IS BEING DONE   16200000
*              LO ORDER 4 BITS NOT USED - RESERVED                      16290000
*                                                                       16380000
         SPACE 1                                                        16470000
FLG6     DC    X'0'          SWITCH                                     16560000
OIC      EQU   X'80'         ON = ALL ODE BLOCKS ARE RETAINED IN CORE   16650000
ODIC     EQU   X'40'         ON = SOME, BUT NOT ALL, ODE'S RETAINED     16740000
CPYSW    EQU   X'20'         ON = IEBMGI CALLED DURING CTLTAB TTR PROC. 16830000
SPL      EQU   X'10'         ON = SPILL OF INPUT D.E'S TO UT3 OCCURRED  16920000
*              LO ORDER 4 BITS NOT USED - RESERVED                      17010000
*                                                                       17100000
SWITCH1  DC    X'00'         SWITCHES                                   17190000
TIME1    EQU   X'80'         ON = IEBMGI HAS INITIALIZED ITSELF FOR THE 17280000
*                                 CURRENT PHASE OF PROCESSING           17370000
ENTERNN  EQU   X'40'         ON = NEED TO PUT NEWNAME INTO DIR ENTRY    17460000
MGINODE  EQU   X'20'         ON = AN I/O ERROR READING FROM SYSUT3 HAS  17550000
*                                 CAUSED THE REQUESTED IDE NOT TO BE    17640000
*                                 READ INTO CORE CORRECTLY - IEBMGI HAS 17730000
*                                 NO IDE TO PASS BACK TO THE CALLER     17820000
UNLDTM   EQU   X'10'         FIRST TIME THROUGH IEBDSU           X010XX 17910000
*              LOW ORDER 4 BITS NOT USED-RESERVED                X010XX 17960000
*                                                                       18000000
UTTRFLAG DC    XL1'00'                 FLAG FIELD FOR USER AND NOTE-    18090000
*                                 LIST PROCESSING BY IEBVWS             18180000
* HIGH ORDER THREE BITS ARE USED INTERNALLY BY IEBVWS FOR NOTE-LIST AND 18270000
*        USER TTR PROCESSING                                            18360000
NOTELIST EQU   X'10'         ON = NOTELIST FOUND BY IEBVWS              18450000
*              LO ORDER 4 BITS NOT USED - RESERVED                      18540000
*                                                                       18630000
*                                                                       18720000
OBCT     DC    HL2'0'        ACTUAL NO OUTPUT BLOCKS SAVED IN CORE      18810000
*                                                                       18900000
*XXXXXXXXXX ALL CONSTANTS BETW. HERE AND PREV X'S MUST BE CONTIGUOUS    18990000
         EJECT                                                          19080000
*********************************************************************** 19170000
BCB      DS    4F                 BUFFER CONTROL BLOCK                  19260000
* THERE WILL ALWAYS BE AT LEAST 1 PR OF BUFFERS ALLOCATED - IF CORE     19350000
* SPACE EQUAL TO OR GREATER THAN THE SIZE OF THE 1ST PR OF BFRS IS      19440000
* AVAILABLE FOR THE COPY PHASE, THE 2ND BFR SPACE WILL BE ALLOCATED TO  19530000
* USE ALL OF THIS EXTRA CORE                                            19620000
* THE BCB IS RE-SET WHENEVER ANOTHER INPUT DATASET IS TO BE PROCESSED.  19710000
         ORG   BCB                                                      19800000
FLG1     DC    X'0'          FLAG BYTE FOR BCB                          19890000
P2FLG1   EQU   X'80'         ON = 2 DISCONTIGUOUS BUFFERS ARE ALLOCATED 19980000
IN2ND    EQU   X'40'         ON = PROCESSING BEING DONE WITHIN THE 2ND  20070000
*                                 BUFFER                                20160000
STOPEND1 EQU   X'20'         ON = READ (IEBDRD) OR PREPARE TO WRITE     20250000
*                                 (IEBVWS) ONLY ONE BUFFER              20340000
*              LO ORDER 5 BITS NOT USED - RESERVED                      20430000
BEGFST1  DC    AL3(0)        ADDR OF BEGINNING OF 1ST BUFFER AREA       20520000
ENDFST1  DC    AL4(0)        ADDR OF END OF 1ST BUFFER AREA             20610000
BEGFST2  DC    AL4(0)        ADDR OF BEGINNING OF 2ND BUFFER AREA       20700000
END2ND2  DC    AL4(0)        ADDR OF END OF 2ND BUFFER AREA             20790000
* END OF BUFFER CONTROL BLOCK (BCB)                                     20880000
*********************************************************************** 20970000
*             3 FLAGS BELOW ARE IN FLAG FIELD BUILT AHEAD OF RECORDS IN 21060000
*         I/O BUFFER.  READ PCI SETS 'ENDPROC' AND 'LASTREC' AND WRITE  21150000
*         SETUP SETS 'WRTOVR'- FLAGS USED BY WRITE AND WRITE/PCI.       21240000
*                                                                     * 21330000
ENDPROC  EQU   X'80'         IN I/O BFR, THIS BIT ON IN FLGS =          21420000
*                            THIS IS THE LAST RECORD IN ANY BUFFER      21510000
LASTREC  EQU   X'40'         IN I/O BFR, THIS BIT ON IN FLGS =          21600000
*                            THIS IS THE LAST RECORD IN CURRENT BUFFER  21690000
WRTOVR   EQU   X'20'         IN I/O BFR, THIS BIT ON IN FLGS =          21780000
*                            THIS RECORD IS A SEGMENT (NOT THE LAST     21870000
*                            SEGMENT) OF AN OVERFLOW RECORD             21960000
         SPACE 2                                                        22050000
MAXBUF   DC    F'0'          MAX BUFFER LENGTH SPECIFIED         X010XX 22100000
BUFSIZ   DC    F'0'          SIZE IN BYTES OF 1 IO BFR(BEG2ND1-BEGFST1) 22140000
MINSIZ   DC    F'0'               LENGTH OF MINIMUM SIZE OF I/O BFR-PR  22230000
MAXBLK   DC    F'0'               LENGTH OF 1/2 OF MINSIZ               22320000
READNEXT DC    AL4(0)        SET WHEN READ CALLED - TELLS WHERE TO READ 22410000
WRTNEXT  DC    AL4(0)             POINTER TO WHERE START WRITING FROM   22500000
LASTMREC DS    F POINTER TO LAST EOF IN A BUFFER NOT YET WRITTEN        22590000
EOREAD   DC    A(0)  POINTER TO END OF LAST RECORD READ-COMPRESS        22680000
         EJECT                                                          22770000
         DS    0F                                                       22860000
ADWANT   DC    X'00002000'   LENGTH OF MINIMUM USABLE AMT OF COREX010XX 22950000
*                            CORE FOR VARIABLE                   A45170 23040022
*                            CONDITIONAL GETMAIN                 A45170 23090022
ADWANTHI DC    X'00100000'   LENGTH OF MAXIMUM USABLE AMOUNT OF CORE    23130000
*                            (THIS IS AN ARBITRARY LIMIT)               23220000
ADGOT    DC    F'0'          GETMAIN PUTS ADDR OF CORE HERE             23310000
LENGOT   DC    F'0'          GETMAIN PUTS LENGTH OF CORE HERE           23400000
*                            ADGOT AND LENGOT ARE USED TO FREE CORE AT  23490000
*                            TERMINATION OF PROGRAM                     23580000
FREEAMT  DC    X'00002000'   LENGTH OF CORE RELEASED FOR USE BY YA01689 23670002
*               USE BY SYSTEM (OPEN, CLOSE, EOV, SYNADAF, ETC)   A45170 23760022
*                   (THIS MUST BE A MULTIPLE OF 8)               A45170 23850022
FREEAMT2 DC    X'00000C00'   CORE FREED FOR TAPE WORKAREA        X010XX 23900000
* NOTE - VALUE OF 'FREEAMT' MAY BE CHANGED IF IT IS EITHER NOT ENOUGH   23940000
*        OR TOO MUCH CORE TO RELINQUISH FOR SYSTEM UTILIZATION.  IN ANY 24030000
*        CASE, THE VALUE OF THIS CONSTANT SHOULD BE CONSIDERED WITH RE- 24120000
*        LATION TO THE MINIMUM AMOUNT OF CORE SPECIFIED IN THE CONSTANT 24210000
*        NAMED 'ADWANT'.                                                24300000
ACOPYR1  DC    A(0)          ADDRESS OF COPYR1 HEADER            X010XX 24350000
*                            RECORD BUFFER                       X010XX 24360000
ACOPYR2  DC    A(0)          ADDRESS OF COPYR2 HEADER            X010XX 24370000
*                            RECORD BUFFER                       X010XX 24380000
ADNL     DC    F'0'          ADDR OF NOTE-LIST AREA                     24390000
ADWK     DC    F'0'          ADDR OF WORK-AREA                          24480000
WKLEN    EQU   128           LENGTH OF WKAREA - ALSO USED FOR SYSUT3 IO 24570000
HDRLEN   DC    H'344'        LENGTH OF HEADER RECORDS            X010XX 24620000
INBEGIN  DC    F'0'          ADDRESS OF START OF INDD TABLE             24660000
NXTINDS  DS    F             ADDR OF INDD TABLE ENTRY FOR THE CURRENT   24750000
*                            INPUT DATA SET'S DDNAME (IN THE CURRENT    24840000
*                            INDD GROUP)                                24930000
REPLACOP EQU   SEBIT3        IF ON IN HI-ORDER BYTE OF AN INDD-TABLE    25020000
*                            ENTRY, THE REPLACE OPTION WAS SPECIFIED    25110000
*                            FOR THIS INPUT DATA SET.                   25200000
SEBEGIN  DC    AL4(0)        ADDR OF BEGINNING OF SETAB                 25290000
SESTOP   DC    F'0'          IF SELECTIVE OR EXCLUSIVE COPY, THIS IS    25380000
*                            THE ADDRESS (+1) OF THE END OF THE SETAB.  25470000
*                            IF FULL COPY, ADDR (+1) OF END OF INDDTAB. 25560000
ADNNPTRT DS    AL4           ADDR OF NEWNAME POINTER TABLE              25650000
NNTABAD  DC    F'0'               ADDR OF CURRENT NNPTRTAB ENTRY + 4    25740000
LOCOR    DC    F'0'          ADDR OF LOWEST CURRENTLY AVAILABLE         25830000
*                            ''FREE'' CORE BYTE                         25920000
SVLO     DC    F'0'               AREA FOR RE-INITIALIZING 'LOCOR'      26010000
HICOR    DC    F'0'          ADDR OF HIGHEST CURRENTLY AVAILABLE        26100000
*                            ''FREE'' CORE BYTE (+1)                    26190000
SVHI     DC    F'0'               ADDR OF HIGHEST ACQUIRED CORE (+1)    26280000
BUMP     DS    AL4           ADDR WHERE 'NEXT' ENTRY IN CTLTAB SHOULD   26370000
*                            BE PLACED                                  26460000
CTAD     DS    AL4           ADDR OF CONTROL TABLE - IF SELECTIVE COPY, 26550000
*                            THIS WILL BE SAME AS SEBEGIN.              26640000
TABAD    DS    AL4           SET TO ADDR OF NEXT CTLTAB ENTRY BY IEBMGI 26730000
ENCT     DC    HL2'0'        COUNT OF NBR OF ENTRIES IN CTLTAB (TOTAL)  26820000
*              IF THIS IS A SELECTIVE COPY, THIS COUNT WILL BE INI-     26910000
*              TIALIZED TO THE NUMBER OF ENTRIES IN SETAB.              27000000
COUNT    DC    HL2'0'        COUNT OF NBR OF ENTRIES IN SETAB IF SEL OR 27090000
*                            EXCL COPY, OR ZERO IF FULL COPY.           27180000
INDDCT   DC    AL2(0)        COUNT OF NO. INDD'S IN CURRENT STEP        27270000
NNCT1    DC    AL2(0)        NBR OF NEWNAMES SPECIFIED IN CURRENT SE-   27360000
*                            LECTIVE COPY STEP (IF NOT SEL CPY, = 0)    27450000
UFCT     DC    HL2'0'        COUNT OF NBR OF SELECTED MEMBERS YET TO BE 27540000
*                            FOUND ON ANY INPUT D.S. IN CURR INDD GROUP 27630000
DIRBCNT  DC    HL2'0'        MAX NBR BLOCKS WHICH OUT DIR CAN CONTAIN   27720000
NDBTR    DC    X'00'    COUNT OF MAX NUMBER OF DIR BLOCKS        A36049 27750000
*                      PER TRACK ALLOCATED ON THE OUTPUT DS      A36049 27780000
DBCNT    DC    H'0'          COUNT OF ACTUAL NUMBER OF BLOCKS MERGED    27810000
*                            TO THE OUTPUT DATA SET DIRECTORY           27900000
TRBALBUF DC    H'0'          AREA FOR USE IN CALCULATING TRACK BALANCE  27990000
         EJECT                                                          28080000
ZROS     DC    F'0'          CONSTANT OF ZEROES                         28170000
         DS    0D                                                       28260000
DBKEY    DC    DL8'0'        KEY FROM CURR DIR. BLOCK IN BFR            28350000
OUTDAD1  DC    DL8'0'        DASD ADDR WHERE TO GET 1ST UN-RETAINED     28440000
*                            OUTPUT DIRECTORY BLOCK.  THIS ADDR IS ONLY 28530000
*                            VALID WHEN 'ODIC' BIT IS ON IN FLG6        28620000
OUTNAME  DC    CL8' '        NAME OF CURRENT OUTPUT DD                  28710000
         SPACE 2                                                        28800000
CCIMAGE  DS    10D                     SCAN CONTROL CARD BUFFER         28890000
         SPACE 2                                                        28980000
WKA1     DC    10F'0'        VOLATILE WORK AREA FOR GENERAL USE         29070000
*                                                                       29160000
*****   PLEASE NOTE---    IEBSCN IS NOT THE ONLY MODULE WHICH USES      29250000
**                WKA1 FOR TEMPORARY WORK SPACE.                        29340000
*                 HOWEVER, THE FOLLOWING 4 EQUATES ARE USED ONLY BY     29430000
*                 IEBSCN -                                              29520000
*                                                                       29610000
SARG     EQU   WKA1          TEMPORARY WORK AREA USED BY IEBSCN (SCAN)  29700000
*                            TO HOLD SEARCH ARGUMENT 8 BYTES LONG       29790000
SAVEPAPR EQU   WKA1+8        TEMPORARY WORK AREA USED BY IEBSCN (SCAN)  29880000
*                            TO HOLD PARTIAL PARAMETERS IF CONTROL CARD 29970000
*                            IS CONTINUED, 8 BYTES LONG.                30060000
LEFTPCNT EQU   WKA1+16       TEMPORARY WORK AREA USED BY IEBSCN (SCAN)  30150000
*                            TO HOLD COUNT OF LEFT PARENTHESIS SCANNED. 30240000
RGHTPCNT EQU   WKA1+18       TEMPORARY WORK AREA USED BY IEBSCN (SCAN)  30330000
*                            TO HOLD COUNT OF RIGHT PARENTHESIS SCANNED 30420000
*                            BOTH LEFTPCNT AND RGHTPCNT 2 BYTES EACH    30510000
*                            AND MUST BE CONTIGUOUS STORAGE.            30600000
         SPACE 1                                                        30690000
ALO      DC    F'0'               WORKAREA FOR IEBMKO SUBROUTINE        30780000
NMAD     DC    F'0'          ADDRESS OF NAME IN THE SETAB TO BE COM-    30870000
*                            PARED AGAINST AN INPUT DIRECTORY ENTRY     30960000
DEPTR    DS    AL4           ADDR OF ''NEXT'' DIR. ENTRY IN BUFFER      31050000
*                            (SET BY IEBMGD SUBROUTINE)                 31140000
BLKAD    DS    AL4           ADDR OF CURRENT DIRECTORY BLOCK IN BFR     31230000
IDEAD    DS    AL4           AREA INTO WHICH IEBMGI SUBR. PLACES THE    31320000
*                            CORE ADDRESS OF THE ''NEXT'' INPUT D.E.    31410000
CSTOREG  DC    3F'0'         SAVE AREA USED BY IEBSCN                   31500000
RESET1   DS    4F                 AREA FROM WHICH R11-R14 ARE RESTORED  31590000
*                            BY IEBVTM WHEN IT IS TO EXIT TO IEBSCN     31680000
         SPACE 2                                                        31770000
*        REGISTER SAVE AREAS                                            31860000
SV1      DC    18F'0'        REGISTER SAVE AREA FOR MAINFLOW            31950000
SV2      DC    18F'0'        REGISTER SAVE AREA FOR NON-RESIDENT RTNES  32040000
SV3      DC    18F'0'        REGISTER SAVE AREA FOR RESIDENT SUBRTNES   32130000
SV4      DC    18F'0'        REGISTER SAVE AREA FOR RESIDENT SUBRTNES   32220000
SV5      DC    18F'0'        SAVE AREA FOR IEBDV1                       32310000
SV6      DC    18F'0'             SAVE AREA USED BY IEBVDM              32400000
SIOSAVE  DC    6F'0'         SAVEAREA FOR SIO APPENDAGE          X010XX 32490000
PCISAVE  DC    9F'0'         SAVEAREA FOR PCI APPENDAGE          X010XX 32540000
MCAMOD   DC    10F'0'             IEBMCA CHANGE AREA                    32580000
* MCAMOD IS A PATCH-AREA FOR USE IN MAINTENANCE OF THIS PROGRAM         32670000
         EJECT                                                          32760000
VIEBDV0  DC    V(IEBDV0)     ADDR OF ENTRY POINT (IN IEBDV1) TO OPEN    32850000
*                            AND VALIDATE SYSIN AND SYSPRINT DCB'S      32940000
VIEBDV1  DC    V(IEBDV1) ADDR VALIDATION ROUTINE OUTDCB AND FIRST INDD  33030000
VIEBDV2  DC    V(IEBDV2) ADDR VALIDATION ROUTINE OPEN/VALIDATE INDD     33120000
VIEBDV3  DC    V(IEBDV3) ADDR VALIDATION ROUTINE OPEN/VALIDATE SYSUT3   33210000
VIEBDV4  DC    V(IEBDV4) ADDR VALIDATION ROUTINE OPEN/VALIDATE SYSUT4   33300000
VIEBSCN  DC    V(IEBSCN)           ADDR OF CONTROL CARD SCAN ROUTINE    33390000
VIEBSEF  DC    V(IEBSCF) ENTRY POINT IN SCAN FOR ENTRY FROM SYSIN EODAD 33480000
*  HANDLER IN MAINFLOW IEBEOF                                           33570000
VIEBEOF  DC    V(IEBDSCEF)   EODAD HANDLER FOR SYSIN EOF                33660000
VIEBCER  DC    V(IEBDSCCE)   SYNAD ROUTINE FOR READER ERROR             33750000
VIEBVMS  DC    V(IEBVMS)           ADDR OF MESSAGE WRITING ROUTINE      33840000
VIEBPER  DC    V(IEBDSCPE)   SYNAD ROUTINE FOR PRINTER ERROR            33930000
VIEBMNI  DC    V(IEBDSCNI)   ADDR OF ENTRY POINT IN MAIN PGM - TO START 34020000
*                            PROCESSING THE 'NEXT' INPUT DATA SET IN    34110000
*                            THE CURRENT 'INDD-GROUP'                   34200000
VIEBSCX  DC    V(IEBDSCSX)   E.P. IN ROOT SEGMENT TO GO FROM IEBVTM TO  34290000
*                                 IEBSCN                                34380000
VIEBGME  DC    V(IEBDSCME)   ADDR OF E.P. IN ROOT SEGMENT - FOR USE     34470000
*                                 WHEN IT IS NECESSARY TO RE-ISSUE THE  34560000
*                                 GETMAIN AND RE-ALLOCATE CORE          34650000
VIEBM04  DC    V(IEBDSCM4)   E.P. IN ROOT SEGMENT TO GO FROM IEBVDM TO  34740000
*                                 IEBDV4                                34830000
VIEBRTM  DC    V(IEBVDRTM)   E.P. IN IEBVDM TO RETURN FROM IEBDV4       34920000
VIEBVCT  DC    V(IEBVCT)     ADDR OF SETAB/CTLTAB/NNTAB ALPH SORT RTNE  35010000
VIEBVTT  DC    V(IEBVTT)     ADDR OF TTR SORT RTNE FOR CTLTAB           35100000
VIEBMGD  DC    V(IEBDSCGD)   ROUTINE TO FIND NEXT DIR ENTRY IN BUFFER   35190000
VIEBMBT  DC    V(IEBDSCBT)   ROUTINE TO BUILD CTLTAB AND SPILL TO UT3   35280000
VIEBMGI  DC    V(IEBDSCGI)   ROUTINE TO LOCATE A DIR ENTRY VIA CTLTAB   35370000
VIEBMKO  DC    V(IEBDSCKO)   ROUTINE TO RETAIN OUTPUT DIR BLOCKS        35460000
VIEBDRD  DC    V(IEBDRD)           ADDR OF READ ROUTINE                 35550000
VIEBVWS  DC    V(IEBWSU)     ADDR. OF RTN TO PREPARE RECORDS            35640000
*                            TO BE WRITTEN - PREVIOUSLY NAMED IEBVWS    35730000
VTTOCC   DC    V(IEBDSTOC)   ROUTINE TO CONVERT TTR TO MBBCCHHR         35820000
VCCOTT   DC    V(IEBDSCOT)   ROUTINE TO CONVERT MBBCCHHR TO TTR         35910000
VIEBDWR  DC    V(IEBDWR)           ADDR OF WRITE ROUTINE                36000000
VIEBIOE  DC    V(IEBIOE)          ADDR OF RTNE TO SET UP MSG FOR I/O    36090000
*                                 ERROR, VIA SYNADAF                    36180000
VIEBMNM  DC    V(IEBDSCNM)   ROUTINE TO CONTROL MBR COPYING WHEN NOT    36270000
*                            COMPRESSING, DEBLOCKING, OR REBLOCKING     36360000
VIEBDRB  DC    V(IEBDRB)           ADDR OF REBLOCK/DEBLOCK RTNE         36450000
VIEBMCM  DC    V(IEBMCM)          ADDR OF COMPRESS-IN-PLACE ROUTINE     36540000
VIEBVDM  DC    V(IEBVDM)           ADDR OF DIRECTORY MERGE RTNE         36630000
VIEBVTM  DC    V(IEBVTM)          ADDR OF TERMINATION ROUTINE           36720000
VIEBDSRE DC    V(IEBDSRE)    ROUTINE TO TRANSFER CONTROL TO      A33288 36810000
*                              IEBIOE FROM IEBDRD                A33288 36900000
VIEBDSWE DC    V(IEBDSWE)    ROUTINE TO TRANSFER CONTROL TO      A33288 36990000
*                              IEBIOE FROM IEBDWR                A33288 37080000
VIEBDRDR DC    V(IEBDRDR)    RETURN POINT IN IEBDRD FROM IEBIOE  A33288 37170000
VIEBDWRR DC    V(IEBDWRR)    RETURN POINT IN IEBDWR FROM IEBIOE  A33288 37260000
VIEBBAM  DC    V(IEBBAM)          BUFFER ALLOCATION ROUTINE      S20201 37300020
VLDUL1   DC    V(IEBLDUL1)   LOAD INITIALIZATION ROUTINE         X010XX 37310000
VLDUL2   DC    V(IEBLDUL2)   UNLOAD INITIALIZATION ROUTINE       X010XX 37320000
VIEBIOE2 DC    V(IEBIOE2)    LOAD DCB EODAD ROUTINE              X010XX 37330000
VIEBIOE3 DC    V(IEBIOE3)    LOAD DCB SYNAD ROUTINE              X010XX 37340000
VIEBIOE4 DC    V(IEBIOE4)    UNLOAD DCB SYNAD ROUTINE            X010XX 37342000
VDSFRC   DC    V(IEBDSFRC)   ENTRYPOINT IN IEBDSCPY TO ISSUE     X010XX 37344000
*                            FREEMAIN FOR LOAD/UNLOAD DATAMANAG. X010XX 37346000
*                            MODULES                             X010XX 37348000
VDSIOE2  DC    V(IEBDSOE2)   EODAD ENTRY POINT IN MAINFLOW       X010XX 37348400
VRSAM    DC    V(IEBRSAM)    LOAD DIRECTORY ROUTINE              X010XX 37348800
VRSAM1   DC    V(IEBRSAM1)   LOAD MEMBER DATA  READ ROUTINE      X010XX 37349200
VWSAM    DC    V(IEBWSAM)    WRITE MEMBER AND NOTELIST           X010XX 37349600
VWSAM1   DC    V(IEBWSAM1)   WRITE HEADER RECORD                 X010XX 37349700
VIEBDSU  DC    V(IEBDSU)     UNLOAD DIRECTORY BUILD ROUTINE      X010XX 37349800
VIEBDSU1 DC    V(IEBDSU1)    UNLOAD CTLTAB MODIFY ROUTINE        X010XX 37349900
VIEBCNVT DC    V(IEBCNVT)    IEBCOPY TTR-TO-MBBCCHHR             X010XX 37379900
*                              CONVERT ROUTINE                   X010XX 37389900
VIEBCNV1 DC    V(IEBCNVT1)    IEBCOPY CONVERT BACK ROUTINE       X010XX 37399900
         EJECT                                                          37410000
         DS    0F                                                       37440000
LIST1    DC    VL4(IEBDVJCB)  JFCB EXIT                                 37530000
JFCBECON EQU   X'87'  JFCB EXIT+LAST ENTRY CODE                         37620000
LIST2    DC    AL4(0) ADDRESS OF EXLST HANDLER FILLED IN BY IEBDV0      37710000
LIST2SET EQU   X'85' DCB EXIT LIST FOR SYSIN/SYSPRINT CODE, LAST ENTRY  37800000
LIST4    DC    AL4(0)                  DCB EXIT ADDRESS FILLED IN BY    37890000
*                                 IEBDV1 ROUTINE                        37980000
         DC    VL4(IEBDVJCB)  JFCB EXIT                                 38070000
LIST5    DC    X'85'         THIS IS THE DCB EXIT LIST FOR       X010XX 38120000
         DC    AL3(0)           THE LOAD DCB                     X010XX 38130000
LIST6    DC    X'85'         THIS IS THE DCB EXIT LIST FOR       X010XX 38140000
         DC    AL3(0)           THE UNLOAD DCB                   X010XX 38150000
         SPACE 2                                                        38160000
WRPCICNT DS    F COUNT OF PCI'S TAKEN- USED BY READ BACK CHECK          38250000
         SPACE 2                                                        38340000
WRPTR1   DC    A(WRCW11)  CURRENT WRITE CCW ADDRESS                     38430000
WRPTR2   DC    A(WRCW21) NEXT WRITE CCW ADDRESS                         38520000
RDPTR1   DC    A(RDCW11)  CURRENT READ CCW ADDRESS                      38610000
RDPTR2   DC    A(RDCW21)  NEXT READ CCW ADDRESS                         38700000
RDCKPTR1 DC    A(RDCKCW11)  CURRENT READ BACK CHECK CCW ADDRESS         38790000
RDCKPTR2 DC    A(RDCKCW21)  NEXT READ BACK CHECK CCW ADDRESS            38880000
         SPACE 2                                                        38970000
* FOLLOWING FIELDS ARE USED FOR RESETTING APPROPRIATE DCB'S, ETC.,      39060000
* UPON THE OCCURRENCE OF AN ERROR CONDITION (INCLUDING I/O ERRORS).     39150000
OUTPTTR  DS    2F TTRNTB OF LAST VALID EOF ON OUTPUT DATA SET           39240000
SYS4TTR  DS    2F TTRNTB OF LAST VALID EOF ON SYSUT4 DATA SET ORIGINAL  39330000
SYS3TTR  DS    2F TTRNTB OF LAST VALID EOF ON SYSUT3 DATA SET ORIGINAL  39420000
         SPACE 1                                                        39510000
OUTDS1   DS    2F TTRNTB - TTRN NEXT RECORD TO BE WRITTEN AND CURRENT   39600000
*   TRACK BALANCE OF OUTPUT DATA SET. ORIGINALLY FROM DS1STAR FIELD     39690000
*   OF DSCB.                                                            39780000
UT3DS1   DS    2F TTRNTB- TTRN NEXT RECORD TO BE WRITTEN TO SYSUT3 AND  39870000
*  TRACK BALANCE FOR CURRENT TRACK.ORIGINALLY FROM DS1STAR FIELD DSCB   39960000
         SPACE 1                                                        40050000
UT4DS1   DS    2F TTRNTB- TTRN NEXT RECORD TO BE WRITTEN TO SYSUT4 AND  40140000
*  TRACK BALANCE FOR CURRENT TRACK.ORIGINALLY FROM DS1STAR FIELD DSCB   40230000
*   OUTPUT DATA SET.                                                    40320000
OUTFDAD  DC    2F'0'              MBBCCHHR FOR RE-INITIALIZING OUTDCB   40410000
UT3FDAD  DC    2F'0'              MBBCCHHR FOR RE-INITIALIZING UT3DCB   40500000
UT4FDAD  DC    2F'0'              MBBCCHHR FOR RE-INITIALIZING UT4DCB   40590000
*********************************************************************** 40680000
***** NOTE - THE FOLLOWING SIX FIELDS MUST BE KEPT CONTIGUOUS WITHIN    40770000
*            THE COMMUNICATION AREA                                     40860000
ERPLMFD  DC    2F'0'              AREA USED BY IEBVTM PROCESSING (ER-   40950000
*                                 ROR CONDITIONS).  CONTAINS MBBCCHHR   41040000
*                                 OF THE LAST SUCCESSFULLY WRITTEN DATA 41130000
*                                 RECORD, WHEN THE OUTPUT DIRECTORY WAS 41220000
*                                 WRITTEN TO THE OUTPUT DATA SET.  THIS 41310000
*                                 AREA IS INITIALLY SET UP BY IEBDV1,   41400000
*                                 AND SUBSEQUENTLY UPDATED WHENEVER THE 41490000
*                                 MERGED DIRECTORY IS WRITTEN TO THE    41580000
*                                 OUTPUT DATA SET BY IEBVDM.  THIS      41670000
*                                 FIELD IS NOT UPDATED WHEN THE DIREC-  41760000
*                                 TORY IS WRITTEN TO SYSUT4.            41850000
ERPLMFD4 DC    2F'0'              AREA USED BY IEBVTM PROCESSING (ER-   41940000
*                                 ROR CONDITIONS).  CONTAINS MBBCCHHR   42030000
*                                 OF THE LAST SUCCESSFULLY WRITTEN DATA 42120000
*                                 RECORD, WHEN THE OUTPUT DIRECTORY WAS 42210000
*                                 WRITTEN TO THE SYSUT4 DATA SET.  THIS 42300000
*                                 AREA IS SET BY IEBVDM WHENEVER THE    42390000
*                                 MERGED DIRECTORY IS WRITTEN TO THE    42480000
*                                 SYSUT4 DATA SET BY IEBVDM.  THIS      42570000
*                                 FIELD IS NOT UPDATED WHEN THE DIREC-  42660000
*                                 TORY IS WRITTEN TO THE OUTPUT DATASET 42750000
ERPTTR   DC    F'0'               CONTAINS TTRN OF LAST VALID DATA REC  42840000
*                                 ALL OTHER COMMENTS APPLYING TO 'ERP-  42930000
*                                 LMFD' ALSO APPLY HERE AND TO THE NEXT 43020000
*                                 AREA, NAMED 'ERPTB'.                  43110000
ERPTTR4  DC    F'0'               CONTAINS TTRN OF LAST VALID DATA REC  43200000
*                                 ALL OTHER COMMENTS APPLYING TO 'ERPL- 43290000
*                                 MFD4' ALSO APPLY HERE AND TO THE      43380000
*                                 AREA NAMED 'ERPTB4'.                  43470000
ERPTB    DS    CL2                TRACK BALANCE FOR LAST VALID DATA REC 43560000
*                                 SEE COMMENTS ABOVE.                   43650000
ERPTB4   DS    CL2                TRACK BALANCE FOR LAST VALID DATA REC 43740000
*                                 SEE COMMENTS ABOVE.                   43830000
         DS    0F                                                       43920000
*********************************************************************** 44010000
         SPACE 2                                                        44100000
*********************************************************************** 44190000
* THE CONSTANTS IN THIS GROUP ARE ALL SET UP BY THE I/O VALIDATION RTNE 44280000
OBLKSIZE DC    H'0'          OUTPUT BLOCKSIZE                           44370000
IBLKSIZE DC    H'0'           INPUT BLOCKSIZE                           44460000
OBLKFAC  DC    H'0'          OUTPUT BLOCKING FACTOR                     44550000
IBLKFAC  DC    H'0'           INPUT BLOCKING FACTOR                     44640000
OUTLRECL DC    H'0'          OUTPUT LOGICAL RECORD LENGTH               44730000
INLRECL  DC    H'0'           INPUT LOGICAL RECORD LENGTH               44820000
NOTRKS   DC    H'0'          NO. OF TRACKS ALLOCATED TO OUTPUT DS       44910000
OKEYLEN  DC    XL1'0'        OUTPUT KEYLENGTH                           45000000
*********************************************************************** 45090000
         SPACE 2                                                        45180000
NXTTTR   DS    XL3           SET TO TTR OF EOF+1 OF OUT DIR BY IEBDRD,  45270000
*                            WHENEVER CTOUT BIT WAS ON.                 45360000
CTTR     DS    XL3           AREA TO PUT MODIFIABLE NXTTTR FOR COMPRESS 45450000
INIDDCTS DC    H'0'               AREA TO SAVE INITIAL INDD COUNT       45540000
DDLIST   DC    CL8'SYSIN   '      LIST OF DDNAMES TO BE USED FOR INI-   45630000
         DC    CL8'SYSPRINT'      TIALIZING DCB DDNAMES (DEFAULTS)      45720000
         DC    CL8'SYSUT1  '                                            45810000
         DC    CL8'SYSUT2  '                                            45900000
         DC    CL8'SYSUT3  '                                            45990000
         DC    CL8'SYSUT4  '                                            46080000
OUTVOL   DS    CL6                     VOLID OF OUTPUT                  46170000
OTDSNAME DS    CL44               AREA TO PRESERVE OUTPUT DSNAME        46260000
         EJECT                                                          46350000
CARDCB   DCB   DDNAME=SYSIN,RECFM=FB,LRECL=80,DSORG=PS,EXLST=LIST2,    X46440000
               MACRF=(GM)                                               46530000
*  SYNAD ADDRESS FILLED IN AT OPEN TIME BY VALIDATE- IEBDV0 ROUTINE     46620000
         EJECT                                                          46710000
PRTDCB   DCB   DDNAME=SYSPRINT,DSORG=PS,MACRF=(PM),RECFM=FBA,          X46800000
               LRECL=121,EXLST=LIST2                                    46890000
* SYNAD ADDRESS FILLED IN AT OPEN TIME BY VALIDATE- IEBDV0 ROUTINE      46980000
         EJECT                                                          47070000
INDCB    DCB   DDNAME=SYSUT1,MACRF=(E),IOBAD=INIOB,DSORG=PO,           X47160000
               EXLST=LIST1,PCIA=C8,DEVD=DA,SIOA=FT,PGFX=YES      X010XX 47250000
         EJECT                                                          47340000
OUTDCB   DCB   DDNAME=SYSUT2,MACRF=(E),IOBAD=OUTIOB,DSORG=PO,          X47430000
               EXLST=LIST1,PCIA=C8,DEVD=DA,SIOA=FT,PGFX=YES      X010XX 47520000
         EJECT                                                          47570000
LOADDCB  DCB   DSORG=PS,DDNAME=SYSUT1,EXLST=LIST5,MACRF=(R),     X010XX*47580000
               RECFM=VS,NCP=1                                    X010XX 47590000
         EJECT                                                          47600000
ULOADDCB DCB   DSORG=PS,DDNAME=SYSUT2,EXLST=LIST6,MACRF=(W),     X010XX*47602000
               RECFM=VS,NCP=1                                    X010XX 47604000
         EJECT                                                          47610000
UT3DCB   DCB   DDNAME=SYSUT3,DSORG=PS,MACRF=(E),IOBAD=UT3IOB,          X47700000
               DEVD=DA,EXLST=LIST1                                      47790000
UT3LRECL DC    H'80'                   80 BYTE LRECL SYSUT3             47880000
         EJECT                                                          47970000
UT4DCB   DCB   DDNAME=SYSUT4,DSORG=PS,MACRF=(E),IOBAD=UT4IOB,          X48060000
               EXLST=LIST1,PCIA=C8,DEVD=DA,KEYLEN=8,SIOA=FT,     X010XXX48150000
               PGFX=YES                                          X010XX 48200000
UT4LRECL DC    H'264'             264-BYTE LRECL FOR SYSUT4             48240000
         EJECT                                                          48330000
BPAMOUT  DCB   DDNAME=SYSUT2,DSORG=PO,MACRF=(W)                         48420000
         EJECT                                                          48510000
*    IEBDSCPY IOB AREA      IF IOB FORMAT IS EVER CHANGED THIS AREA   * 48600000
*  MUST CHANGE.  THE ADCON FOR IEBMCA IS APPENDED TO THE END OF EACH  * 48690000
*  IOB FOR THE USE OF THE PCI APPENDAGE SO THAT IT CAN FIND THE START * 48780000
*  OF THE COMMON AREA TO CHANGE POINTERS AND CCWS.                    * 48870000
         SPACE 1                                                        48960000
INIOB    DC    F'0'                                                     49050000
         DC    A(EVENTCB)              POINTER TO EVENT CONTROL BLOCK   49140000
         DC    3F'0'                                                    49230000
         DC    A(INDCB)                DCB POINTER                      49320000
         DC    4F'0'                                                    49410000
COMMONPT DC    A(IEBMCA) POINTER TO COMMON AREA IN IOB FOR PCI          49500000
INCHAR   DC    5F'0'                   DEVTYPE INFO              S20201 49590020
INSCTOR  DC    X'00'                   CURRENT SECTOR VALUE      S20201 49680000
*                                        FOR INPUT - ONLY        S20201 49770000
*                                        VALID IF RPS DEVICE     S20201 49860000
DEVOFF   EQU   INCHAR-INIOB            OFFSET TO DEVTYPE         S20201 49950000
*                                        INFO FROM ALL IOB'S     S20201 50040000
SCTOFF   EQU   INSCTOR-INIOB           OFFSET TO CURRENT         S20201 50130000
*                                        SECTOR VALUE FROM       S20201 50220000
*                                        ALL IOB'S               S20201 50310000
IEBMCAPT EQU   COMMONPT-INIOB POINTER TO IEBMCA IN THE IOB- ASSUMES     50400000
*   ALL IOB'S NEED THIS AND ALL IOB'S ARE THE SAME SIZE                 50490000
         SPACE 1                                                        50580000
OUTIOB   DC    F'0'                                                     50670000
         DC    A(EVENTCB)              POINTER TO EVENT CONTROL BLOCK   50760000
         DC    3F'0'                                                    50850000
         DC    A(OUTDCB)               DCB POINTER                      50940000
         DC    4F'0'                                                    51030000
         DC    A(IEBMCA) POINTER TO COMMON AREA IN IOB FOR PCI          51120000
OUTCHAR  DC    5F'0'                   DEVTYPE INFO              S20201 51210020
OUTSCTOR DC    X'00'                   CURRENT SECTOR VALUE      S20201 51300000
*                                        FOR OUTPUT - ONLY       S20201 51390000
*                                        VALID IF RPS DEVICE     S20201 51480000
         SPACE 1                                                        51570000
UT3IOB   DC    F'0'                                                     51660000
         DC    A(EVENTCB)              POINTER TO EVENT CONTROL BLOCK   51750000
         DC    3F'0'                                                    51840000
         DC    A(UT3DCB)               DCB POINTER                      51930000
         DC    4F'0'                                                    52020000
         DC    A(IEBMCA) POINTER TO COMMON AREA IN IOB FOR PCI          52110000
UT3CHAR  DC    5F'0'                   DEVTYPE INFO              S20201 52200020
UT3SCTOR DC    X'00'                   CURRENT SECTOR VALUE      S20201 52290000
*                                        FOR SYSUT3 - ONLY       S20201 52380000
*                                        VALID IF RPS DEVICE     S20201 52470000
         SPACE 1                                                        52560000
UT4IOB   DC    F'0'                                                     52650000
         DC    A(EVENTCB)              POINTER TO EVENT CONTROL BLOCK   52740000
         DC    3F'0'                                                    52830000
         DC    A(UT4DCB)               DCB POINTER                      52920000
         DC    4F'0'                                                    53010000
         DC    A(IEBMCA) POINTER TO COMMON AREA IN IOB FOR PCI          53100000
UT4CHAR  DC    5F'0'                   DEVTYPE INFO              S20201 53190020
UT4SCTOR DC    X'00'                   CURRENT SECTOR VALUE      S20201 53280000
*                                        FOR SYSUT4 - ONLY       S20201 53370000
*                                        VALID IF RPS            S20201 53460000
         SPACE 1                                                        53550000
EVENTCB  DC    F'0'                    EVENT CONTROL BLOCK FOR EXCP     53640000
         EJECT                                                          53730000
*                                                                S20201 53780000
*  THE FOLLOWING CCW IS USED WHEN THE DEVICE TO BE USED          S20201 53790000
*     SUPPORTS THE RPS FEATURE                                   S20201 53800000
*                                                                S20201 53810000
         SPACE 1                                                 S20201 53812000
SSECTOR  CCW   X'23',SECTOR,X'60',1    SET SECTOR WITH CC/SLI    S20201 53814000
*                                        FLAGS                   S20201 53816000
*                                                                     * 53820000
*     GENERAL SEARCH ID EQUAL CCW TO START A READ OR WRITE CHAIN      * 53910000
*                                                                     * 54000000
         SPACE 1                                                        54090000
CCW1     CCW   X'31',0,X'60',5 SEARCH ID EQUAL, CC,SLI FLAGS ON         54180000
CCW2     CCW   X'08',CCW1,X'00',1 TIC TO CCW1 TILL ID EQUAL FOUND       54270000
CCW3     CCW   X'08',0,X'00',1 TIC TO FIRST READ OR WRITE               54360000
*           TIC TO RDCW11/21 OR WRCW11/21 OR RDCKCW11/21                54450000
         SPACE 1                                                        54540000
*                                                                     * 54630000
*     READ CCWS WITH PCI- READ DIRECTORIES AND INPUT MEMBERS          * 54720000
*                                                                     * 54810000
         SPACE 1                                                        54900000
RDCW11   CCW   X'92',0,X'40',8 READ COUNT M/T, COMMAND CHAIN FLAG ON    54990000
RDCW12   CCW   X'0E',0,X'68',0 READ KEY/DATA CC,SLI,PCI FLAGS ON        55080000
RDCW13   CCW   X'03',RDCW21,X'20',1 NOP/RS/TIC TO BE SET BY      S20201 55170000
*                                        PCI APPENDAGE           S20201 55260000
RDCW21   CCW   X'92',0,X'40',8 READ COUNT M/T, COMMAND CHAIN FLAG ON    55350000
RDCW22   CCW   X'0E',0,X'68',0 READ KEY/DATA CC,SLI,PCI FLAGS ON        55440000
RDCW23   CCW   X'03',RDCW11,X'20',1 NOP/RS/TIC TO BE SET BY      S20201 55530000
*                                        PCI APPENDAGE           S20201 55620000
         SPACE 1                                                        55710000
*                                                                     * 55800000
*     RESTART WRITE SEARCH ID EQUAL M/T ON LAST SUCCESSFUL RECORD     * 55890000
*              USED FOR ERROR RETRY AND HEAD SWITCHING                * 55980000
*                                                                     * 56070000
         SPACE 1                                                        56160000
WSCH     CCW   X'B1',LASTADDR+3,X'60',5 SEARCH ID EQUAL M/T RESTART     56250000
WSCH1    CCW   X'08',WSCH,X'00',1 TIC TO WSCH TILL EQUAL ID FOUND       56340000
WSCH2    CCW   X'08',0,X'00',1 TIC TO CORRECT WRITE COMMAND             56430000
         SPACE 1                                                        56520000
WRCW11   CCW   X'1D',0,X'68',0 WRITE COUNT/KEY/DATA CC,SLI,PCI FLAGS ON 56610000
WRCW12   CCW   X'08',WRCW13,X'20',1 TIC TO NOP/RS/WCKD/WKD/SID   S20201 56660020
*                                    CCW - SET BY PCI ROUTINE    S20201 56710020
WRCW13   CCW   X'03',0,X'20',1 NOP/RS CCW TO STOP CHAIN IF PCI   S20201 56760020
*                               MISSED - SET BY IEBDWR           S20201 56810020
*   MAY TIC TO NEXT WRITE COMMAND OR SEARCH TO NEXT TRACK             * 56880000
         SPACE 1                                                        56970000
WRCW21   CCW   X'1D',0,X'68',0 WRITE COUNT/KEY/DATA CC,SLI,PCI FLAGS ON 57060000
WRCW22   CCW   X'08',WRCW23,X'20',1 TIC TO NOP/RS/WCKD/WKD/SID   S20201 57110020
*                                    CCW - SET BY PCI ROUTINE    S20201 57160020
WRCW23   CCW   X'03',0,X'20',1 NOP/RS CCW TO STOP CHAIN IF PCI   S20201 57210020
*                               MISSED - SET BY IEBDWR           S20201 57260020
*   MAY TIC TO NEXT WRITE COMMAND OR SEARCH TO NEXT TRACK             * 57330000
         SPACE 1                                                        57420000
*                                                                     * 57510000
*     READ BACK CHECK CCW LIST WITH PCI                               * 57600000
*                                                                     * 57690000
         SPACE 1                                                        57780000
RDCKCW11 CCW   X'92',LASTADDR,X'60',8 READ COUNT M/T CC, SLI FLAGS ON   57870000
RDCKCW12 CCW   X'0E',LASTADDR,X'78',1 READ KEY/DATA CC,SLI,PCI,SKIP     57960000
RDCKCW13 CCW   X'03',RDCKCW21,X'20',1 NOP/RS/TIC TO BE SET BY    S20201 58050000
*                                        PCI APPENDAGE           S20201 58140000
RDCKCW21 CCW   X'92',LASTADDR,X'60',8 READ COUNT M/T CC, SLI FLAGS ON   58230000
RDCKCW22 CCW   X'0E',LASTADDR,X'78',1 READ KEY/DATA CC,SLI,PCI,SKIP     58320000
RDCKCW23 CCW   X'03',RDCKCW11,X'20',1 NOP/RS/TIC TO BE SET BY    S20201 58410000
*                                        PCI APPENDAGE           S20201 58500000
         SPACE 1                                                        58590000
*                                                                       58680000
*  THE FOLLOWING CCW IS USED TO ERASE ONE TRACK AT A TIME               58770000
*                                                                       58860000
         SPACE 1                                                        58950000
ERSCCW   CCW   X'11',ERSCCW,X'20',1   ERASE  -SLI-                      59040000
         SPACE 1                                                        59130000
*                                                                S20201 59220000
*  THE FOLLOWING CCW IS USED WHEN THE DEVICE TO BE USED          S20201 59310000
*     SUPPORTS THE RPS FEATURE                                   S20201 59400000
*                                                                S20201 59490000
         SPACE 1                                                 S20201 59580000
RSECTOR  CCW   X'22',SECTOR,X'20',1  READ SECTOR CCW - SLI FLAG  S20201 59940000
         SPACE 1                                                 S20201 60030000
*  THE FOLLOWING BYTE IS USED TO STORE SECTOR VALUES FOR         S20201 60120000
*      DEVICES WHICH SUPPORT RPS                                 S20201 60210000
         SPACE 1                                                 S20201 60300000
SECTOR   DC    X'00'                                             S20201 60390000
RDBKSAVE DC    X'00'              AREA TO SAVE CURRENT SECTOR    S20201 60480000
*                                   VALUE WHEN REQUIRED (SUCH    S20201 60570000
*                                   AS READ BACK CHECK)          S20201 60660000
LASTADDR DS    D RESTART ADDRESS FOR WRITE OR BUFFER FOR READBACK CHECK 60750000
LASTGBSV DS    D  USED TO SAVE VALUE IN LASTADDR AT ENTRY TO IGG019C8   60840000
LASTGB   DS    D USED BY IEBIOE FOR ERROR ANALYSIS                      60930000
FIRSTERS DS    F TTR OF FIRST TRACK TO BE ERASED                        61020000
LASTERS  DS    F TTR OF LAST TRACK TO BE ERASED                         61110000
SVTTR    DS    F USED BY IEBWSU TO PASS THE MEMBER TTR OF ALL    A34431 61140020
*                 COPIED MEMBERS TO IEBDSCPY                     A34431 61170020
         EJECT                                                          61200000
*   THE FOLLOWING LIST IS PASSED AT SIO TIME TO IOSUPERVISOR     X010XX 61210000
RDLENGTH DC    F'7'          EXTENDED TRANSLATION LIST LENGTH    X010XX 61250000
READLIST DC    X'03'         EXTENDED TRANSLATION LIST           X010XX 61260000
         DC    AL3(CCW1)     *THE FIRST ENTRY IS REPLACED FOR    X010XX 61270000
         DC    X'03'         *RPS DEVICES BY X'05'AL3(SSECTOR)   X010XX 61280000
         DC    AL3(RDCW11)   *AND RESET FOR NOT RPS FOR ALL      X010XX 61282000
         DC    X'03'         *THREE LISTS WHEN THEY ARE USED.    X010XX 61284000
         DC    AL3(RDCW21)   *EACH CCW ADDRESS IS PRECEDED       X010XX 61286000
         DC    X'80'         *BY AN OPTION BYTE                  X010XX 61288800
         DC    AL3(RDCW11)   *IF ITS HIORDER BIT IS OFF          X010XX 61289200
RDL1     DC    X'80'         MAX RECORD LENGTH FOR READING       X010XX 61289600
         DC    AL3(RDCW12)   *THE BYTE GIVES THE LENGTH OF       X010XX 61289700
         DC    X'80'         *A CHAIN THAT CAN BE APPENDED       X010XX 61319900
         DC    AL3(RDCW21)   *TO THE CURRENT CCWCHAIN AND        X010XX 61329900
RDL2     DC    X'80'         MAX RECORD LENGTH FOR READING       X010XX 61339900
         DC    AL3(RDCW22)   *STARTS AT THE LIST ENTRY ADDRESS   X010XX 61349900
WRLENGTH DC    F'6'          EXTENDED TRANSLATION LIST LENGTH    X010XX 61373200
WRITLIST DC    X'03'         EXTENDED TRANSLATION LIST           X010XX 61375200
         DC    AL3(CCW1)     *IF THE HIGH ORDER BIT OF THE       X010XX 61375600
         DC    X'03'         *OPTION BYTE IS ON, THE ADDRESS     X010XX 61375700
         DC    AL3(WSCH)     *IN THE NEXT CCW CAN BE             X010XX 61375800
         DC    X'03'         *MODIFIED.                          X010XX 61376000
         DC    AL3(WRCW11)   *THE OPTION BYTE THEN GIVES         X010XX 61376400
         DC    X'03'         *THE BIGGEST POSSIBLE LENGTH        X010XX 61376500
         DC    AL3(WRCW21)   *FIELD IN NEXT CCW,DIVIDED BY       X010XX 61376600
WRL1     DC    X'80'         MAX RECORD LENGTH FOR WRITING       X010XX 61422300
         DC    AL3(WRCW11)   *2K.THIS IS ZERO EXCEPT FOR         X010XX 61422700
WRL2     DC    X'80'         MAX RECORD LENGTH FOR WRITING       X010XX 61433100
         DC    AL3(WRCW21)   *THE ENTRIES RDL1,RDL2,WRL1,        X010XX 61435100
RBLENGTH DC    F'3'          EXTENDED TRANSLATION LIST LENGTH    X010XX 61448700
RBLIST   DC    X'03'         EXTENDED TRANSLATION LIST           X010XX 61450700
         DC    AL3(CCW1)     *AND WRL2.THEY ARE FILLED OUT       X010XX 61452700
         DC    X'03'         *AT START IO TIME.                  X010XX 61453100
         DC    AL3(RDCKCW11) *FOR USE OF THIS LIST SEE MODULE    X010XX 61453500
         DC    X'03'         *IGG019FT(SIO APPENDAGE) AND        X010XX 61453900
         DC    AL3(RDCKCW21) *IO SUPERVISOR MANUALS (OS VE)      X010XX 61454300
*   FOLLOWING AREA IS USED BY PCI APPENDAGE TO PASS A LIST OF    X010XX 61464300
*   CCW'S IT CHANGES TO THE IO SUPERVISOR  (OS VE)               X010XX 61466300
XLIST    DS    10F           PCI PARAMETER LIST FOR AOS          X010XX 61503600
* NOTE - THE FOLLOWING AREAS AND SWITCH ARE USED ONLY BY IEBVDM -       61510800
* BLOCK, ENDWRT, READDCB, WRTDCB, ODEPTR, OLDKEY, ADLAST, BC, AND DMSW  61517800
* THEY APPEAR IN THE COMMUNICATION AREA BECAUSE, IF THIS PROGRAM IS IN  61538900
* OVERLAY, AND IF IT IS NECESSARY TO OPEN SYSUT4, THESE AREAS WOULD BE  61560000
* OVERLAYED BY IEBDV1 WHEN IT WAS CALLED BY IEBVDM.                     61650000
BLOCK    DC    F'0'                A PTR  TO THE FLAG FIELD OF THE      61740000
*                                  OUTPUT DIRECTORY BLOCK WHICH IS      61830000
*                                  BEING BUILT                          61920000
ENDWRT   DC    F'0'                A PTR TO THE END OF A BUFFER AREA    62010000
*                                  WHICH IS USED FOR WRITING            62100000
READDCB  DC    F'0'                A POINTER TO THE DCB FROM WHICH      62190000
*                                  THE OUTPUT DIRECTORY IS BEING READ   62280000
WRTDCB   DC    F'0'                A POINTER TO THE DCB TO WHICH THE    62370000
*                                  OUTPUT DIRECTORY IS TO BE WRITTEN    62460000
ODEPTR   DC    F'0'                PTR TO AN ODE IN CORE                62550000
OLDKEY   DC    2F'0'               NAME OF CAST ENTRY WHICH WAS ADDED   62640000
*                                  TO BLOCK                             62730000
ADLAST   DC    F'0'               FOR USE IF NEED TO OVERLAY NAME OF    62820000
*                                 LAST DE MERGED WITH FF'S              62910000
BC       DC    H'0'                COUNT OF THE NUMBER OF BYTES IN AN   63000000
*                                  OUTPUT DIRECTORY BLOCK WHICH IS      63090000
*                                  BEING BUILT                          63180000
DMSW     DC    X'00'              BYTE USED FOR INTERNAL DIRECTORY      63270000
*                                 MERGE SWITCHES                        63360000
R        EQU   X'80'          ON = THERE ARE NO MORE OUTPUT DIRECTORY   63450000
*                                  ENTRIES TO BE MERGED                 63540000
E        EQU   X'40'          ON = THERE ARE NO MORE INPUT DIRECTORY    63630000
*                                  ENTRIES TO BE MERGED                 63720000
I        EQU   X'20'          ON = AN INPUT DIRECTORY ENTRY IS BEING    63810000
*                                  MERGED                               63900000
RETEOD   EQU   X'10'         ON = NO SPACE IN THE I/O BUFFER TO SET UP  63990000
*                            AN EOF RECORD TO BE WRITTEN TO SYSUT4 BY   64080000
*                            IEBVDM ROUTINE                             64170000
DIRWRT   EQU   X'08'         ON = DURING MERGE PHASE, AT LEAST ONE CALL 64260000
*                                 TO IEBWSU WAS MADE, SO THERE HAS BEEN 64350000
*                                 SOME OR ALL OF THE MERGED OUTPUT      64440000
*                                 DIRECTORY WRITTEN                     64530000
*              LO ORDER 3 BITS NOT USED - RESERVED                      64620000
*                                                                       64710000
         SPACE 1                                                        64800000
FLG3     DC    XL1'0'        SWITCHES/FLAGS                             64890000
OUTPUTEP EQU   X'80'         ON = ENTRY WAS MADE TO IEBDV1 TO OPEN BOTH 64980000
*                            AN OUTPUT AND AN INPUT DCB                 65070000
SORTDONE EQU   X'40'         ON = SETAB HAS BEEN SORTED FOR INDD GRP    65160000
FTINGP   EQU   X'20'         ON = THE CURRENT INDD GROUP HAS BEEN INI-  65250000
*                            TIALIZED FOR THE FIRST TIME THRU           65340000
REBLK    EQU   X'10'         ON = REBLOCKING / DEBLOCKING SPECIFIED     65430000
ENTOBT   EQU   X'08'         ON=OBTAIN WAS ENTERED BEFORE       OY01182 65520002
*              LO ORDER THREE BITS NOT USED - RESERVED          OY01182 65560002
*                                                                       65610000
         SPACE 2                                                        65700000
FLG4     DC    XL1'0'        SWITCHES / FLAGS                           65790000
NEWODS   EQU   X'80'         ON = 'CURRENT' OUTPUT DATA SET HAS NOT     65880000
*                            HAD IT'S DIRECTORY UPDATED                 65970000
LE       EQU   X'40'         ON = LAST CTLTAB ENTRY WAS CHECKED BY      66060000
*                                 IEBMGI SUBR.                          66150000
ODALT    EQU   X'20'         ON = OUT. DIRECTORY IS TO BE READ FRM UT4  66240000
NEWCOPOP EQU   X'10'         SET BY SCAN FOR EACH NEW COPY OPERATION    66330000
REDASD   EQU   X'08'   'OUTPUT' DS HAS TOO MANY DIR BL PER TR    A36049 66390000
*              LO ORDER 3 BITS NOT USED-RESERVED                 A36049 66450000
*                                                                       66510000
         SPACE 2                                                        66600000
FLG7     DC    X'00'              SWITCHES/FLAGS                        66690000
COP      EQU   X'80'         ON = IEBMGI BEING CALLED DURING COPY PHASE 66780000
FRSTMBR  EQU   X'40'         ON = FIRST MEMBER OF CURRENT INPUT DATA    66870000
*                            SET IS NOW BEING PROCESSED                 66960000
DM       EQU   X'20'         ON = DIRECTORY MERGE BEING DONE NOW        67050000
NOPRNBDB EQU   X'10'         ON = IEBVTM WILL NOT PRINT MESSAGE CON-    67140000
*                                 CERNING NBR OF UNUSED DIR BLKS        67230000
SUPPRMSG EQU   X'08'         ON = IEBVTM USES THIS BIT, IN COMBINATION  67320000
*                                 WITH OTHER BITS, TO DETERMINE WHETHER 67410000
*                                 OR NOT TO PRINT CERTAIN TERMINATION   67500000
*                                 MESSAGES                              67590000
*              LO ORDER 3 BITS NOT USED - RESERVED                      67680000
AOS      DC    X'00'         AOS SWITCH                          X010XX 67730000
PCI      EQU   X'80'         A PCI READ OR WRITE IS  DONE        X010XX 67740000
*              LOW ORDER 7 BITS NOT USED-RESERVED                X010XX 67750000
ULLDST   DC    X'00'         UNLOAD/LOAD STATUS SWITCH           X010XX 67760000
LOAD     EQU   X'80'         IF ONE INPUT DCB IS SEQUENTIAL      X010XX 67762000
UNLOAD   EQU   X'40'         IF ONE OUTPUT DCB IS SEQUENTIAL     X010XX 67764000
*                              THE ABOVE SWITCHES ARE NOT        X010XX 67766000
*                              MUTUALLY EXCLUSIVE                X010XX 67768000
CFREED   EQU   X'20'         IF 1 A FREEMAIN HAS BEEN DONE       X010XX 67768400
*                              FOR LOAD OR UNLOAD AND            X010XX 67768800
*                              ADDRESS OF HEADER BUFFERS IS VALIDX010XX 67769200
*              LOW ORDER 5 BITS NOT USED-RESERVED                X010XX 67769600
*                                                                       67770000
         SPACE 2                                                        67860000
FORM     DC    XL1'0'    SET BY VALIDATE AND USED BY REBLOCK ROUTINE    67950000
*                                                                       68040000
FORM1    EQU   X'80'     ON= INPUT DATA SET VARIABLE FORMAT             68130000
*                        OFF = INPUT DATA SET FIXED FORMAT              68220000
FORM2    EQU   X'40'    ON= INPUT DATA SET BLOCKED FORMAT               68310000
FORM3    EQU   X'20'    ON= OUTPUT DATA SET IS BLOCKED                  68400000
FORM4    EQU   X'10'  INPUT OR OUTPUT DATASET MAY HAVE OVERFLOW RECORDS 68490000
ERASE    EQU   X'08' ON=IEBDWR CALLED TO ERASE A TRACK(S)               68580000
*              LOW ORDER 3 BITS NOT USED - RESERVED                     68670000
*                                                                       68760000
         SPACE 2                                                        68850000
TAG      DC    XL1'0'        SWITCHES / FLAGS - MUST BE SET BY CALLER   68940000
*                            PRIOR TO REQUESTING WRITE EXCP             69030000
TAG1     EQU   X'80'         ON = WRITING OUTPUT DIRECTORY TO OUTPUT DS 69120000
TAG2     EQU   X'40'         ON = WRITING (COPYING) MEMBER TO OUTPUT DS 69210000
TAG3     EQU   X'20'         ON = WRITING OUTPUT DIRECTORY TO SYSUT4 DS 69300000
TAG4     EQU   X'10'         ON = WRITING SPILLED INPUT DE'S TO UT3     69390000
TAG5     EQU   X'08'         USED BY WRITE RTNE FOR READBACK CHECK      69480000
TAG6     EQU   X'04'         USED BY WRITE RTNE FOR READBACK CHECK      69570000
CTOUT    EQU   X'02'         ON = NEED TO CT NBR BLKS IN OUTPUT DIR     69660000
TAG8     EQU   X'01'         ON=FIRST TIME IEBWSU IS ENTERED AFTER      69750000
*                            FINDING 'HOLE' - COMPRESS                  69840000
*                                                                       69930000
         SPACE 2                                                        70020000
WSFLAG   DC    X'00'         SWITCHES FOR IEBWSU INTERFACE/CONTROL      70110000
USERTTR  EQU   X'80'         ON = NOTE LIST AND/OR USER TTRN(S) PRESENT 70200000
*                                 IN THE MEMBER NOW BEING COPIED        70290000
RETRNOVR EQU   X'40'         ON = PROCESSING A SEGMENT OF A TRACK-      70380000
*                                 OVERFLOW RECORD                       70470000
NOWRT    EQU   X'20'         ON = RECORDS ARE PROCESSED FOR WRITING,BUT 70560000
*                            BECAUSE THERE IS ROOM IN BFR TO READ MORE, 70650000
*                            THE RECORDS HAVENT BEEN WRITTEN YET.       70740000
FORCEWRT EQU   X'10'         ON = IEBWSU MUST CALL IEBDWR TO WRITE THE  70830000
*                            RECORD(S) CURRENTLY IN THE I/O BFR         70920000
RDGSW    EQU   X'08'         ON = READ ROUTINE WAS CALLED -             71010000
*                            OFF = WRITE ROUTINE WAS CALLED             71100000
FRSTMREC EQU   X'04'              ON = IEBWSU IS TO PROCESS THE  A34431 71140020
*                                  FIRST RECORD OF A MEMBER      A34431 71180020
NTELSTRC EQU   X'02'              ON = IEBWSU IS PROCESSING A    A44345 71190021
*                        RECORD AND TRIES TO FIND OUT IF THIS IS A44345 71200021
*                        NOTELIST RECORD (TRACK OVERFLOW ONLY)   A44345 71210021
*              LOW ORDER BIT NOT USED - RESERVED                 A44345 71220021
*                                                                       71280000
         SPACE 2                                                        71370000
* THE FOLLOWING SWITCHES (PARMSWCH, CCSWITCH, COMDCDSW, CPARAMSW, CCDE- 71460000
* LIM, CCDELIM2) ARE PRIMARILY BUT NOT SOLELY USED BY IEBSCN -          71550000
*                                                                       71640000
         SPACE 1                                                        71730000
PARMSWCH DC    XL1'0'    SCAN INTERNAL INDD AND MEMBER SWITCHES         71820000
SCANNAME EQU   X'80'         SCANNING NAME                              71910000
SET4REPL EQU   X'40'         MULTIPLE ( EXPECT REPLACE                  72000000
ONELEFT  EQU   X'20'         FIRST LEFT PARENTHESIS                     72090000
COPYNOW  EQU   X'10'         NOW SCANNING COPY CARD                     72180000
STOPSCAN EQU   X'08'         BLANK ENCOUNTERED                          72270000
FLUSHSW  EQU   X'04'                   FLUSH TO NEXT COPY RE/SET ALONE  72360000
HASNEWNM EQU   X'02'         HAVE A NEW NAME WITH MEMBER                72450000
COMDPART EQU   X'01'         PARTIAL COMMAND- CONTINUED ON NEXT CARD    72540000
*                                                                       72630000
         SPACE 1                                                        72720000
CCSWITCH DC    XL1'0'                  CONTROL CARD SWITCHES- EXTERNAL  72810000
CARDPRTD EQU   X'80'         ON = CONTROL STATEMENT HAS BEEN PRINTED    72900000
SYSINEOF EQU   X'40'         END OF FILE ON SYSIN                       72990000
UNECPARN EQU   X'20'         INDD/MEMBER NAMES IMBEDDED IN PARENTHESIS  73080000
IEBCOPYC EQU   X'10'         IEBCOPY CONTROL CARDS                      73170000
COMDNOW  EQU   X'08'         COMMAND WORD                               73260000
LASTPARM EQU   X'04'         LAST PARAMETER- BYPASS SWITCH              73350000
MULTSE   EQU   X'02' MULTIPLE SELECT/EXCLUDE STATEMENTS                 73440000
FIRSTSCN EQU   X'01' ON=IEBSCN HAS BEEN CALLED FOR THE FIRST TIME       73530000
*                                                                       73620000
         SPACE 2                                                        73710000
COMDCDSW DC    XL1'0'           SOME EXTERNAL SWITCHES                  73800000
COPYDONE EQU   X'80'         COPY COMMAND SCANNED ALL OK                73890000
SELECTSC EQU   X'40'         SELECT COMMAND SCANNED                     73980000
EXCLUDES EQU   X'20'         EXCLUDE COMMAND SCANNED                    74070000
NEWOUT   EQU   X'10'         OUTDD KEYWORD PRESENT                      74160000
NEWINDD  EQU   X'08'         INDD KEYWORD PRESENT                       74250000
LISTSW   EQU   X'04'         DO NOT LIST MEMBERS COPIED (LIST=NO)       74340000
COMPRESS EQU   X'02'                   COMPRESS COPY DATA SET           74430000
MEMBRCD1 EQU   X'01'         MEMBER STATEMENT                           74520000
*                                                                       74610000
         SPACE 2                                                        74700000
CPARAMSW DC    XL1'0'       INTERNAL SCAN SWITCHES                      74790000
DELIMEND EQU   X'80'         DELIMITER IN COLUMN 71                     74880000
CONTINY  EQU   X'40'         CONTINUATION                               74970000
PARMCOME EQU   X'20'         PARAMETER FOLLOWS                          75060000
PARTPARM EQU   X'10'         PARTIAL PARAMETER                          75150000
READ1    EQU   X'08'         READ ANOTHER CONTROL STATEMENT             75240000
COMDPARM EQU   X'04'         COMMAND FOLLOWED BY PARAMETER              75330000
COL72BLK EQU   X'02'         COLUMN 72 NOT BLANK                        75420000
PARMZERO EQU   X'01'         PARAMETER LENGTH ZERO                      75510000
*                                                                       75600000
         SPACE 2                                                 A48742 75650022
SCANSWCH DC    XL1'0'        INTERNAL SCAN SWITCHES              A48742 75660022
NOCMMEXP EQU   X'80'         DON'T SCAN COMMAND ON CONTIN CARDS  A48742 75670022
*              LOW ORDER 7 BITS NOT USED - RESERVED              A48742 75682022
*                                                                       75684022
         SPACE 2                                                        75690000
CCDELIM  DC    XL1'0'        INTERNAL SCAN SWITCHES                     75780000
EQUALSGN EQU   X'80'         EQUAL SIGN                                 75870000
COMMASGN EQU   X'40'         COMMA                                      75960000
LEFTPRSG EQU   X'20'         LEFT PARENTHESIS                           76050000
RIGHTPRS EQU   X'10'         RIGHT PARENTHESIS                          76140000
BLANKSGN EQU   X'08'         BLANK                                      76230000
LASTCOMA EQU   X'04'         LAST DELIMITER A COMMA- READ A CARD        76320000
BADBLOCK EQU   X'02' VALIDATE-IEBDV0 SETS IF SYSIN/SYSPRINT BLOCKSIZE   76410000
*          IS BAD.                                                      76500000
*              LO ORDER BIT NOT USED                                    76590000
*                                                                       76680000
         SPACE 2                                                        76770000
CCDELIM2 DC    XL1'0'  USED TO SAVE SETTINGS OF CCDELIM ON CONTINUATION 76860000
*                                                                       76950000
         SPACE 2                                                        77040000
STATUS   DC    XL1'0'        SWITCHES / FLAGS - MUST BE SET BY CALLER   77130000
*                            PRIOR TO REQUESTING READ EXCP              77220000
STAT1    EQU   X'80'         ON = READING INPUT DIR.                    77310000
STAT2    EQU   X'40'         ON = READING OUTPUT DIR FROM OUTPUT D.S.   77400000
STAT3    EQU   X'20'         ON = READING OUTPUT DIR FROM SYSUT4 D.S.   77490000
STAT4    EQU   X'10'         ON = READING INPUT MEMBER                  77580000
STAT5    EQU   X'08'         ON = OUTPUT DIRECTORY HAS NO ENTRIES IN IT 77670000
STAT6    EQU   X'04'         ON = OUTPUT DIRECTORY IS BEING MERGED      77760000
STAT7    EQU   X'02'    SET BY WRITE- TELLS PCI AM READ BACK CHECKING   77850000
STAT8    EQU   X'01'         USED FOR TRACK-OVERFLOW READING            77940000
*                                                                       78030000
         SPACE 2                                                        78120000
SENSE    DC    XL1'0'        USED BY READ ROUTINE                       78210000
SENSE1   EQU   X'80'         ON = READING FROM SYSUT3                   78300000
SENSE2   EQU   X'40'         ON = READING NOTE LIST                     78390000
SENSE3   EQU   X'20'         ON = READING ONLY ONE RECORD FROM A FILE   78480000
SENSE4   EQU   X'10'         ON = READING OUTPUT DATA SET TO FIND THE   78570000
*                            FIRST GAP FOR COMPRESS INPLACE, ALSO WILL  78660000
*                            CALCULATE TRACK BALANCE WHEN ON.           78750000
SENSE5   EQU   X'08'         ON=SHORT LENGTH RECORD READ-RECFM=FBS      78840000
SENSE6   EQU   X'04'                   ON = ERROR ON READING FROM UT4   78930000
*                            AND MUST CONSTRUCT DUMMY RECORD IF LAST    79020000
SENSE7   EQU   X'02'         SWITCH USED FOR TRACK OVERFLOW INPUTS20201 79110000
*                              PROCESSING - IF ON, THE FIRST     S20201 79200000
*                              RECORD OF A MEMBER IS BEING       S20201 79290000
*                              READ                              S20201 79380000
SENSE8   EQU   X'01'         ON= AN I/O REQUEST ON SYSUT3 WAS    A33287 79470000
*                              ISSUED FOR ALPH SORTED CTLTAB     A33287 79560000
*                              INFORMATION                       A33287 79650000
*                                                                       79740000
         SPACE 2                                                        79830000
VTMFLG1  DC    X'00'              FLAGS/SWITCHES SET FOR USE BY IEBVTM  79920000
IOERROR  EQU   X'80'         ON = AN I/O ERROR HAS OCCURRED             80010000
*                                 BYTES NAMED 'IOEF1' AND 'IOEF2' DES-  80100000
*                                 CRIBE THE TYPE OF ERROR AND CONTROL   80190000
*                                 ACTIONS TO BE TAKEN BY IEBVTM         80280000
UNUSEND  EQU   X'40'         ON = A NON-I/O ERROR HAS OCCURRED          80370000
NOMAIN   EQU   X'20'         ON = MINIMUM CORE WAS NOT ACQUIRED FROM    80460000
*                                 GETMAIN - DO NOT TRY TO FREEMAIN      80550000
*              LO ORDER 5 BITS NOT USED - RESERVED                      80640000
*                                                                       80730000
         SPACE 2                                                        80820000
IOEF1    DC    X'00'              FLAGS DESCRIBING NATURE/TYPE OF I/O   80910000
*                                 ERROR                                 81000000
*              HI ORDER BIT NOT USED - RESERVED                         81090000
ERF2     EQU   X'40'         ON = ERROR WHILE READING INPUT DIRECTORY   81180000
*                                 FROM INPUT DATA SET                   81270000
ERF3     EQU   X'20'         ON = 'HARD' ERROR READING MEMBER DATA -    81360000
ERF4     EQU   X'10'         ON = ERROR READING OUTPUT DIRECTORY -      81450000
*                                 IF 'ERF10' ALSO ON, WAS READING FROM  81540000
*                                 SYSUT4 DATA SET DURING OUTPUT DIREC-  81630000
*                                 TORY PRE-SCAN PHASE OF PROGRAM.  IF   81720000
*                                 ''ERF10'' WAS OFF, ERROR OCCURRED     81810000
*                                 ON OUTPUT DATA SET DIRECTORY.         81900000
ERF5     EQU   X'08'         ON = ERROR WRITING MERGED DIRECTORY TO     81990000
*                                 OUTPUT DATA SET                       82080000
ERF6     EQU   X'04'         ON = 'HARD' ERROR WRITING MEMBER DATA      82170000
ERF7     EQU   X'02'         ON = 'HARD' ERROR WRITING TO SYSUT3 (SPIL- 82260000
*                                 LING AN INPUT DIRECTORY ENTRY)        82350000
ERF8     EQU   X'01'         ON = 'HARD' ERROR READING FROM SYSUT3      82440000
*                                                                       82530000
         SPACE 2                                                        82620000
IOEF2    DC    X'00'              FLAGS DESCRIBING NATURE/TYPE OF I/O   82710000
*                                 ERROR                                 82800000
ERF9     EQU   X'80'         ON = 'HARD' ERROR WRITING MERGED OUTPUT    82890000
*                                 DIRECTORY TO SYSUT4                   82980000
ERF10    EQU   X'40'         ON = ERROR READING FROM SYSUT4.  IF 'ERF4' 83070000
*                                 OFF, ERROR OCCURRED DURING MERGE      83160000
*                                 PHASE OF PROGRAM - IF 'ERF4' ON, SEE  83250000
*                                 DESCRIPTION OF 'ERF4'.                83340000
NOSYSIN  EQU   X'20'         ON = SYSIN COULD NOT BE OPENED OR WAS IN-  83430000
*                                 VALID, OR BECAME UNUSABLE DUE TO AN   83520000
*                                 I/O ERROR                             83610000
SPRNOPN  EQU   X'10'         SYSPRINT COULD NOT BE OPENED, WAS INVALID- 83700000
*                                 LY SPECIFIED, OR AN I/O ERROR OCCUR-  83790000
*                                 RED MAKING SYSPRINT UNAVAILABLE       83880000
SNDFUSED EQU   X'08'         ON=SYNADAF MACRO USED               X010XX 83970000
IOEFENT  EQU   X'04'         ON=IOE WAS ENTERED BEFORE           X010XX 84020000
VERPEST  EQU   X'02'         ON=RECORD LONGER THEN DCBBLKSI      X010XX 84030000
ENTIOE3  EQU   X'01'         ON=IOE ENTERED THROUGH IEBIOE3      X010XX 84040000
*                                                                       84060000
         EJECT                                                          84150000
         DS    0H                                                       84240000
MSGLIST  DC    4H'0'              AREA FOR PARAMETRIC INPUT TO IEBVMS   84330000
MSG1     EQU   MSGLIST                                                  84420000
MSG2     EQU   MSG1+2                                                   84510000
MSG3     EQU   MSG2+2                                                   84600000
MSG4     EQU   MSG3+2                                                   84690000
* THE FOLLOWING BITS WILL BE SET ON BY THE CALLER OF IEBVMS (MESSAGE    84780000
* WRITING ROUTINE) IN THE HIGH ORDER BYTE OF EACH APPROPRIATE HALFWORD  84870000
* IN THE MSGLIST PARAMETER(S) BEING USED -                              84960000
LASTMSG  EQU   X'80'         ON = LAST PARAMETER IN MSGLIST             85050000
CTLCD    EQU   X'40'         ON = A CONTROL CARD IS TO BE PRINTED       85140000
IOERF    EQU   X'20'         ON = A MESSAGE IS IN THE MESSAGE BUFFER -  85230000
*                                 AND IS TO BE PRINTED.  NO MSG CODE IS 85320000
*                                 ASSOCIATED WITH THIS MESSAGE, AND IT  85410000
*                            USUALLY WILL BE A SYNADAF MESSAGE.         85500000
RCODE    EQU   X'10'         ON = PUT RETURN CODE INTO THIS MSG TEXT    85590000
PBIT     EQU   X'08'         ON = USE PARAM LIST WITH THIS MSG TEXT     85680000
*              LO ORDER 3 BITS NOT USED - RESERVED                      85770000
         SPACE 2                                                        85860000
MSGPARAM DS    10H           THIS FIELD IS TO CONTAIN PARAMETERS X010XX 85950000
*                                 TO BE PLACED IN MESSAGES              86040000
         ORG   MSGPARAM                                                 86130000
NAMEDISP DC    X'00'              THE DISPLACEMENT OF A NAME            86220000
*                                 PARAMETER FROM THE BEGINNING OF       86310000
*                                 THE MESSAGE IT IS TO BE PLACED IN     86400000
*                                 THIS BYTE                             86490000
NODISP   DC    X'00'              THE DISPLACEMENT OF A NUMBER          86580000
*                                 PARAMETER FROM THE BEGINNING OF       86670000
*                                 THE MESSAGE IT IS TO BE PLACED IN     86760000
*                                 THIS BYTE                             86850000
NAMEFLD  DC    CL8' '        AREA CONTAINING NAME TO BE PUT INTO MSG    86940000
DDVALNM  EQU   NAMEFLD       USED BY VALIDATE TO SAVE DD NAME           87030000
COPDISP  DC    X'00'         DISPLACEMENT OF THE WORD COPY       X010XX 87080000
*                              THAT HAS TO BE REPLACED           X010XX 87090000
PARAMS   DC    X'00'                                                    87120000
NAME     EQU   X'80'         ON = THERE IS A NAME PARAMETER             87210000
NBR      EQU   X'40'         ON = THERE IS A NUMBER PARAMETER           87300000
MSGULLD  EQU   X'20'         ON = COPY MUST BE REPLACED BY       X010XX 87350000
*                              LOAD/UNLOAD                       X010XX 87360000
NOFLD    DC    CL7'0'        AREA CONTAINING NUMBER TO BE PUT INTO MSG  87390000
         SPACE 2                                                        87480000
* THE FOLLOWING MESSAGE CODES ARE USED BY VARIOUS MODULES OF THE PGM -  87570000
INALCNTR EQU     01                INVALID COMMAND OR KEYWORD           87660000
INVALSPR EQU     02                INVALID PARAMETER                    87750000
ONEQPARN EQU     03                UNEQUAL PARENTHESIS                  87840000
INVALCON EQU     04                INVALID CONTINUATION                 87930000
MEMNOSE  EQU     05                MEMBER WITHOUT SELECT/EXCLUDE        88020000
MULTSSEE EQU     06                ONLY ONE SELECT/EXCLUDE PER INDD     88110000
INVALREP EQU     07                INVALID REPLACE SPECIFIED            88200000
NULLPARM EQU     08                NULL PARAMETERS                      88290000
NORREN   EQU     09                CANNOT RENAME/REPLACE ON EXCLUDE     88380000
NOINDD   EQU     10                OUTDD OR INDD NOT SPECIFIED          88470000
INVALIST EQU   11                  OUTDD/LIST NOT ON COPY STATEMENT     88560000
ENDMESS  EQU   12                  END OF CONTROL CARDS                 88650000
MODEERR  EQU   13                  MIXING IEBCOPYAND IEBDSCPY MODE      88740000
COREGONE EQU   14                  TABLES EXCEED CORE                   88830000
SCANMSG  EQU   15                  CONTROL STATEMENT ERROR              88920000
SEQERROR EQU   16                  STATEMENT SEQUENCE ERROR             89010000
GENERUAL EQU   17                  GENERAL VALIDATION MESSAGE           89100000
OPENERRX EQU   18                  OPEN ERROR MESSAGE                   89190000
OBTAINER EQU   19                  OBTAIN ERROR                         89280000
NOTPDSER EQU   20                  OBTAIN NOT PDS                       89370000
INVALREC EQU   21                  INVALID LRECL                        89460000
INVALBLK EQU   22                  INVALID BLOCKSIZE                    89550000
UNMOVEDS EQU   23                  DATA SET UNMOVABLE                   89640000
RECFMINC EQU   24                  RECFM INCOMPATIBLE                   89730000
NORBOVRF EQU   25                  CANNOT REBLOCK OVERFLOW DATA SET     89820000
NORBKEYS EQU   26                  CANNOT REBLOCK KEYED DATA SET        89910000
UNEQKEYS EQU   27                  UNEQUAL KEY LENGTHS                  90000000
INVALRFM EQU   28                  CANNOT COMPRESS KEYED PDS            90090000
INVALRBC EQU   29                  INVALID REBLOCK ROUTINE MSG          90180000
M38      EQU   30                  MINIMUM REQUESTED CORE NOT AVAILABLE 90270000
M39      EQU   31                  CANNOT COMPRESS WITH SELECT OR       90360000
*                                  EXLCUDE                              90450000
M40      EQU   32                  MINIMUM I/O BUFFER NOT ALLOCATABLE   90540000
M41      EQU   33                  CANNOT ALLOCATE TWO TRACKS OF I/O    90630000
*                                  BUFFERS FOR COMPRESS                 90720000
M42      EQU   34 CANNOT SPECIFY DUPLICATE NAME FOR SEL/EXCL/RENAME     90810000
M43      EQU   35                  CANNOT PROCESS ALL OLD/NEW NAMES     90900000
*                                  SPECIFIED                            90990000
M45      EQU   36                  (DATA SET NAME) REFERENCES A NULL    91080000
*                                  INPUT DATA SET                       91170000
M46      EQU   37                  CANNOT RE/DE BLOCK WITH              91260000
*                                  NOTE-LIST/USER TTRN IN MEMBER        91350000
*                                  (MEMBER NAME)                        91440000
M47      EQU   38                  CANNOT CONTINUE TO BUILD CTLTAB      91530000
M48      EQU   39                 ALL SELECTED MEMBERS COPIED - DID NOT 91620000
*                                 USE ALL SPECIFIED INDD'S              91710000
M49      EQU   40                  (NUMBER) UNUSED TRKS IN OUTPUT DATA  91800000
*                                  SET REFERENCED BY (DDNAME)           91890000
M50      EQU   41                  CANNOT COMPRESS TRACK OVERFLOW DATA  91980000
*                                  SET                                  92070000
M51      EQU   42                  CANNOT COMPRESS WITH RE/DE BLOCKING  92160000
M53      EQU   43                  END OF JOB (0,4,8) WAS HIGHEST       92250000
*                                  SEVERITY CODE                        92340000
NORMOD   EQU   44                  NO SPACE IN OUTPUT DIRECTORY FOR     92430000
*                                  DIRECTORY ENTRIES FROM DATA SET      92520000
*                                  (DATA SET NAME)                      92610000
UNUSDDB  EQU   45                  THERE ARE (NUMBER) UNUSED DIRECTORY  92700000
*                                  BLOCKS IN THE OUTPUT DIRECTORY       92790000
TMDBTR   EQU   46     **WARNING** THE OUTPUT DS REF BY@YM04848X  A36049 92830002
*                     CONTAINS TOO MANY DIRECTORY BLOCKS PER     A36049 92870000
*                     TRACK                                      A36049 92910000
M58      EQU   47                  ERROR FORCES JOB TO TERMINATE        92970000
M59      EQU   48                  (MEMBER NAME) COMPRESSED- WAS        93060000
*                                  ALREADY IN PLACE                     93150000
M60      EQU   49                  ALL MEMBERS COMPRESSED-              93240000
*                                  ALL WERE ORIGINALLY COMPRESSED       93330000
MEMCOP   EQU   50                  (MEMBERNAME) HAS BEEN SUCCESSFULLY   93420000
*                                  COPIED                               93510000
RNMEMCOP EQU   51                  (MEMBER NAME) HAS BEEN RENAMED AND   93600000
*                                  SUCCESSFULLY COPIED                  93690000
NOTDA    EQU   52                 DATA SET NOT DIRECT ACCESS            93780000
NODDCARD EQU   53                 DD CARD NOT FOUND                     93870000
PARMEXEC EQU   54                 PARM EQUAL COMPRESS NOT VALID         93960000
NOMBCPDM EQU   55                 NO MBRS COPIED FROM INPUT DATASET RE- 94050000
*                                 FERENCED BY (XXXXXXXX)                94140000
CONCATBD EQU   56                 CONCATENATED DATA SETS                94230000
IMPCOMPR EQU   57                 IMPLIED COMPRESS                      94320000
NOCMPOSS EQU   58                 CANNOT COMPRESS                       94410000
NOCOPY   EQU   59                 NO MEMBERS FOR PARTIAL COPY,          94500000
*                                 WILL NOT COPY                         94590000
DOFULLCP  EQU  60                 TOTAL COPY ASSUMED                    94680000
MFBNC    EQU   61 MEMBER FOUND BUT NOT COPIED - I/O ERROR READING       94770000
*                 INPUT DIRECTORY                                       94860000
NONECOPY EQU   62 NO MEMBERS COPIED                                     94950000
FOLLMCPD EQU   63 FOLLOWING MBRS COPIED FROM INPUT DS REF BY XXXXXXXX   95040002
PLAMPID  EQU   64 POSSIBLE LOSS OF ACCESS TO MEMBER AND/OR INCOMPLETE   95130000
*                 DIRECTORY                                             95220000
WODINC   EQU   65 SYSUT4 I/O ERROR - OUTPUT DIRECTORY MAY BE INCOMPLETE 95310000
WONTCOM  EQU   66 I/O ERROR ON SYSUT3 - COMPRESS IN PLACE NOT DONE      95400000
BADPRINT EQU   67 SYSPRINT COULD NOT BE OPENED                          95490000
SMNF    EQU   68                  (MBRNAME) WAS SELECTED BUT NOT FOUND  95580000
BADID    EQU   69                 INVALID ID FIELD IN COPYR1     X010XX 95630000
BADCMPRS EQU   70                 COMPR IS INVALID ON LOAD/UNLOADX010XX 95640000
MTOINDS  EQU   71                 MORE THAN ONE INPUTDS ON UNLOADX010XX 95650000
M72      EQU   72                 NO CORE FOR LOAD/UNLOAD        X010XX 95660000
NLDBL    EQU   73                 NON LOADABLE INPUT DATA SET    X010XX 95662000
M74      EQU   74                 INPUT AND OUTPUT DATA SETS ON  X010XX 95664000
*                                   SAME TAPE VOLUME             X010XX 95664400
M75      EQU   75                 NOT A DIRECT ACCESS OR TAPE    X010XX 95666000
*                                   DATA SET                     X010XX 95668000
         SPACE 2                                                        95670000
RCBUF    DC    C'0'               COMPLETION-CODE AREA...CONTAINS CHAR- 95760000
*                                 ACTER REPRESENTATION OF HIGHEST       95850000
*                                 COMPLETION CODE SET BY UTILITY PGM    95940000
LINECT   DC   X'0'                COUNT OF NBR LINES WRITTEN ON ONE PG  96030000
PGLIMIT  EQU   56                 MAX NBR OF LINES TO BE PUT ON ONE PG  96120000
         SPACE 2                                                        96210000
MSGBUF   DC    121C' '            MESSAGE BUFFER                        96300000
PGNO     DC    C'0001'            STARTING PAGE NUMBER FOR MSG OUTPUT   96390000
* THE FOLLOWING WORK AREA IS USED BY IEBWSU                      A33288 96480000
         SPACE 1                                                 A33288 96570000
SAVERGS  DS    18F           REGISTER SAVE AREA                  A33288 96660000
RETSAVE  DS    3F            SAVE AREA FOR NOTELIST PROCESSING   A33288 96750000
SAVETTR0 DC    F'0'          HOLDS USER TTR                      A33288 96840000
READPROC DC    F'0'          PTR TO NEXT DATA TO PROCESS T/O     A33288 96930000
WRTPROC  DC    F'0'          PTR TO NEXT BUFFER SEGMENT T/O      A33288 97020000
LASTSEG  DC    F'0'          PTR TO LAST SEGMENT PROCESSED       A33288 97110000
SEGTTRN  DC    F'0'          TTRN OF 1ST SEGMENT T/O             A33288 97200000
SEGKLDL  DC    F'0'          ORIGINAL KEY + DATA LENGTH T/O      A33288 97290000
WARNTTRN DC    F'0'          SAVE AREA FOR PREVIOUS TTRN-FBS     A33288 97380000
*** END OF IEBWSU WORK AREA ****                                 A33288 97470000
*************              END OF COMMUNICATION AREA   **************** 97560000
IOBVRPTR DS    F           PTR TO IOB FOR PAGE FIX              YL026VD 97610002
WRTICPTR DS    F           PTR TO PROPER TIC IN WRITE CHAIN    @YL06433 97620002
IALPTR1  DS    F           PTR TO FIRST INDIRECT ADDR LIST     @YL06433 97630002
IALPTR2  DS    F           PTR TO SECOND INDIRECT ADDR LIST    @YL06433 97640002
CURRCCW1 DS    F           FIRST READ OR WRITE CCW - VIRTUAL   @YM04848 97642002
CURRCCW2 DS    F           SECOND READ OR WRITE CCW - VIRTUAL  @YM04848 97644002
SIOWKA   DS    F           WORK AREA FOR SIO AND PCI APPENDAGES@YM04848 97646002
COPYIAL1 DS    20F         EXTEND LIST RDPTR1.WTPTR1           @YM06433 97648002
COPYIAL2 DS    20F         EXTEND LIST FOR RDPTR2, WTPTR2      @YM06433 97689902
FIXLIST  DS    F           AREA FOR PAGE FIX POINTER           @YM06438 97736402
ADDLPTCH DS    11F         ADDITIONAL PATCH AREA               @YM06438 97736502
***   KEEP CARD  'MCAEND' LAST IN COMMUNICATION AREA JUST BEFORE THE ** 97736702
****  EQUATE THAT DETERMINES THE COMMUNICATIONS AREA SIZE 'MCASIZE'  ** 97740000
         SPACE 1                                                        97830000
MCAEND   DS    0D        END OF COMMUNICATION AREA                      97920000
MCASIZE  EQU   MCAEND-IEBMCA      SIZE OF COMMUNICATIONS AREA FOR SNAPS 98010000
         MEND                                                           98100000
./  ADD  SSI=43540504,NAME=IEBUPCON
         MACRO                                                          00020000
         IEBUPCON                                                       00040000
*1101                                                              MA0H 00045017
*1101                                                              4929 00050017
*1101                                                              5324 00055017
*1101004000,004200,022200-022800                                   UL0H 00057017
*A4584,24700,27100-27120,39300                                  YM07522 00059002
*A020100,020120                                                @ZA01682 00059102
*C020000                                                       @ZA01682 00059202
IEBUPCON DSECT                                                          00060000
*  ******************************************************************** 00080000
*  **      SWITCHES TO BE RE-INITIALIZED. THESE SWITCHES ARE RESET **** 00100000
*  **    UPON RE-ENTRY TO THIS PROGRAM, THIS IS DONE BY AT THE START ** 00120000
*  **    OF THE PROGRAM BY AN XC INSTRUCTION. THE SIZE OF THE TABLE  ** 00140000
*  **    IS OBTAINED BY SUBTRACTING THE BEGINNING FROM THE END IN    ** 00160000
*  **    THE EQUATE AT SIZETAB.  SWITCHES MAY BE ADDED TO THE TABLE  ** 00180000
*  **    ANYWHERE BETWEEN 'STARTAB' AND 'ENDTAB' AND THEY WILL BE    ** 00200000
*  **    RESET BY THE INITIAL CODE UP TO A MAXIMUM OF 256 BYTES OF   ** 00220000
*  **    SWITCHES. IF MORE THAN 256 BYTES OF SWITCHES, CHANGE CODE   ** 00240000
*  **    AT START OF PROGRAM.                                        ** 00260000
*  **            GROUP OF SWITCHES FROM COMDCD TO ENDTAB MUST REFER  ** 00280000
*  **    ONLY TO CONTROL CARD SWITCHES.                              ** 00300000
*  ******************************************************************** 00320000
         SPACE 1                                                        00340000
STARTAB  DS    0F   START OF SWITCH TABLE. COMMENTS STATE SWITCH USE    00360000
         SPACE 1                                                        00380000
HICONCDE DC    H'0'                    RETURN CODE FOR IEBUPDAT         00440000
FIRSTCON DC    X'00'                   SET TO '0F' ON CONT. CARD   UL0H 00440517
LABELSW  DC    X'00'                    USER LABELS IN INPUT STREAMUL0H 00441017
LABEL2SW DC    X'00'                    PROCESSING USER LABELS     UL0H 00442017
EOVSWTCH DC    X'00'                    EOV ON OLD MASTER FOR LABELUL0H 00443017
IOBADSW  DC    X'00'                    I/O ERROR DURING LABEL PROCUL0H 00444017
LBLRETCD DC    X'00'                    RETURN CODE FROM LABEL RTNSUL0H 00445017
FRSTCOMD DC    X'00'                    INDICATES HEADERS INPUT    UL0H 00446017
LABLSYSN DC    X'00'                    LABELS HAVE BEEN SAVED SWT UL0H 00447017
LABELCNT DC    X'00'                    NO. OF HDR/TRL LABELS INPUTUL0H 00448017
USERCONT DC    X'00'                    NO. OF LABELS TO BE PRINTEDUL0H 00449017
ULBLCNT  DC    X'00'                    DECREMENTATION COUNT       UL0H 00450017
USYSNCNT DC    X'00'                    DECREMENTATION COUNT       UL0H 00451017
OMLBLCNT DC    X'00'                    NO. LABELS ON  OLD MASTER  UL0H 00452017
OMOPENSW DC    X'00'                    OLD MASTER IS OPEN  X'0F'  UL0H 00453017
NMOPNSWT DC    X'00'                    NEW MASTER IS OPEN  X'0F'  UL0H 00454017
NMCLSESW DC    X'00'                    NEW MASTER IS CLOSED X'0F' UL0H 00455017
OMSYSNLB DC    X'00'                    HDRS TAKEN FROM OM/INPUT   UL0H 00456017
NMSYSNLB DC    X'00'                    TRLRS TAKEN FROM OM/INPUT  UL0H 00457017
TOTALSW  DC    X'00'                    TOTAL EXIT TO BE TAKEN X'FFUL0H 00458017
SQFSW    DC    X'00'                    SEQFLD SPECIFIED        YM07522 00458402
FIRSENTR DC    X'00'                   FIRST CONTROL CARD SWITCH        00460000
ASISMSW  DC    X'00'                   WRITE RECORD AS IS NOT A MESSAGE 00480000
PRIMESW  DC    X'00'                   OPEN DCBLOGR SWITCH              00500000
QUITALL  DC    X'00'                   CLOSE DCBLOG IF '0F'             00520000
LOGBADSW DC    X'00'                   IF '0F'  DCBLOGR NOT OPENED      00540000
EODCTSW  DC    X'00'                   END OF DATA ON SYSIN             00560000
ERRNAMSW DC    X'00'                   ERROR FOUND IN EXIT NAME         00580000
CTONLYSW DC    X'00'                   PARM=NEW CT ONLY- NO OLD MASTER  00600000
CTHDRSW  DC    X'00'                   SET TO '0F' IF SYSIN TRAILERUL0H 00606017
CTTRLRSW DC    X'00'                   SET TO '0F' IF SYSIN HEADER UL0H 00612017
OMHDRSW  DC    X'00'                   SET TO '0F' IF OM USER HEADER    00620000
OMTRLRSW DC    X'00'                   SET TO '0F' IF OM USER TRAILER   00640000
NMHDRSW  DC    X'00'                   SET TO '0F' IF NM USER HEADER    00660000
NMTRLRSW DC    X'00'                   SET TO '0F' IF NM USER TRAILER   00680000
TEMPCON  DC    X'00'                   TEMPORARY RETURN CODE IEBUPDAT   00700000
NMBLKERR DC    X'00'                   INCORRECT NEW MASTER BLOCKSIZE   00720000
OMBLKERR DC    X'00'                   INCORRECT OLD MASTER BLOCKSIZE   00740000
OPENSW   DC    X'00'                   DCB NOT OPENED IF '0F'           00760000
LEVELXX  DC    X'F000'                 SAVES LEVEL, 'F0' NOT STORED     00780000
FLUSHSW  DC    X'00'                   SCANNING FOR NEXT COMD SWITCH    00800000
PRINTED  DC    X'00'                   IEBASCAN--IEBBSCAN COM. SWTCUL0H 00810017
PSSWOM   DC    X'00'                   OLD MASTER PHYSICAL SEQUENTIAL   00820000
PSSWNM   DC    X'00'                   NEW MASTER PHYSICAL SEQUENTIAL   00840000
CCSCANSW DC    X'00'                   SET TO 01 IF CARD SCAN READ      00860000
FINICCS  DC    X'00'                   CONTROL CARDS DEPLETED           00880000
REPLUPDT DC    X'00'                   REPLACEMENT MADE SWITCH          00900000
INPLCSW  DC    X'00'                   UPDATE INPLACE SWITCH            00920000
ENDONLY  DC    X'00'                   FLUSHIG TO ENDUP CARD       4929 00930017
FSTINSRT DC    X'00'    SET TO '0F' WHEN FIRST DATA CARD AFTER A A25432 00932019
*                 ./ NUMBER STMT (WITH INSERT=YES) IS SEQUENCED  A25432 00934019
SYNADSW  DC    X'00'  TURNED TO '0F' WHEN SYNAD EXIT TAKEN       A27716 00936019
*                                                                       00940000
****             WARNING--  PLEASE NOTE                             *** 00960000
*   ONLY CONTROL CARD SWITCHES GO BETWEEN HERE AND 'ENDTAB' OR THE    * 00980000
*       SCAN FOR NEXT COMMAND CARD IN 'FLUSH' ROUTINE WILL BE RUINED. * 01000000
*                                                                       01020000
COMDCD   DC    X'00'                   SET ON ADD,REPL,CHNGE,REPRO CARD 01040000
COMDCD2  DC    X'00'                   NEXT COMMAND CARD ENCOUNTERED    01060000
ALIASW   DC    X'00'                   FLAGS ALIAS PRESENT              01080000
ALIASW2  DC    X'00'                   ALIAS PENDING SWITCH        MA0H 01090017
REPROSW  DC    X'00'                   SWITCH SET FOR REPRO COMMAND     01100000
ADDSW    DC    X'00'                   SET TO INDICATE ADD COMMAND      01120000
REPLSW   DC    X'00'                   SET TO INDICATE REPL COMMAND     01140000
CHNGESW  DC    X'00'                   INDICATES CHANGE COMD            01160000
DELETSW  DC    X'00'                   SET FOR DELET STATEMENT NUMBER 1 01180000
DELET2SW DC    X'00'                   DELET PENDING- HOLD CARD READ    01200000
NUMBRSW  DC    X'00'                   NUMBR SWITCH                     01220000
NUMBR2SW DC    X'00'                   NUMBER PENDING- HOLD CARD READ   01240000
RENUMALL DC    X'00'                   RENUMBER COMPLETE DATA IF '0F'   01260000
INSERTSW DC    X'00'                   BLOCK INSERT IF SET TO '0F'      01280000
INSRTRD  DC    X'00'                   FLAG AS INSERT, PROTECTS GR9     01300000
NEWNAME  DC    X'00'                   FLAG NEW MASTER PO MEMBER NAME   01320000
COLUMNSW DC    X'00'                   SELECTIVE COLUMN UPDATE          01340000
IGNORESW DC    X'00'                   PUT FIRST /* ON NM IF SWITCH 0F  01360000
IGNORE1  DC    X'00'                   SET TO '01' ON FIRST EOF         01380000
PRINTWRT DC    X'00'                   LIST RECORD, WRITE IT SWITCH     01400000
RIDIT2SW DC    X'00'                   FLUSH BY DELETE/NUMBER CARDS     01420000
NMBUFFR  DC    X'00'                   '0F' IF NM NOT WRITTEN '01' LAST 01440000
SSISW    DC    X'00'                   TOTAL SSI GIVEN                  01460000
FLLISTSW DC    X'00'                   SET TO '01' LIST NM/CT FULL LIST 01480000
PARMSW   DC    X'00'                   SET TO INDICATE PARAMETERS FOUND 01500000
OMEND    DC    X'00'                   END OF MEMBER OR DATA SET SYSUT1 01520000
DONOTRDC DC    X'00'                   DO NOT READ SYSIN IF '0F'        01540000
SEQ1SW   DC    X'00'                   SEQUENCE 1 SATISFIED             01560000
READNOOM DC    X'00'                   DO NOT READ OLD MASTER IF '0F'   01580000
SHORTBLK DC    X'00'                   SET TO '0F' LAST BLOCK NOT FULL  01600000
EQUALREC DC    X'00'                   REPLACEMENT RECORD UPDATE INPLAC 01620000
STARTMEM DC    X'00'                   SET TO '0F' WHEN UPDATING MEMBER 01640000
UPDATCOL DC    H'0'                    PARTIAL UPDATE USUALLY 0         01660000
*   END OF CONTROL CARD SWITCHES IS ENDTAB                            * 01680000
ENDTAB   DS    0F                      END OF SWITCH TABLE              01700000
         SPACE 1                                                        01720000
*   **  WARNING--   KEEP DELTSEQ1,DELTSEQ2,NUMRSEQ1,NUMRSEQ2 TOGETHER * 01740000
*  AS THEY ARE CLEARED BY A 32 BYTE XC IN FLUSH ROUTINE.              * 01760000
*                                                                       01780000
DELTSEQ1 DC    D'0'                    SEQUENCE START DELET CARD        01800000
DELTSEQ2 DC    D'0'                    SEQUENCE END DELET CARD          01820000
NUMRSEQ1 DC    D'0'                    SEQUENCE START NUMBR CARD        01840000
NUMRSEQ2 DC    D'0'                    SEQUENCE END NUMBR CARD          01860000
         SPACE 1                                                        01880000
INCRNUMB DC    D'0'                    INCREMENTATION FACTOR            01900000
INCREMWA DC    D'0'                    INCREMENT FOR NUMBER             01920000
NEW1NUMB DC    D'0'                    STARTING NEW SEQUENCE NUMBER     01940000
MEMBNEW  DC    D'0'                    BUFFER FOR NEW PO MEMBER NAME    01960000
SSIBUF   DC    D'0'                    SSI INFORMATION BUFFER           01980000
ALIASNM  DC    CL128' '                BUFFER FOR ALIAS NAME   @ZA01682 02000002
ALIASNM1 DS    A                       ALIAS SAVE POINTER      @ZA01682 02010002
ALIASNM2 DS    A                       ALIAS SAVE POINTER      @ZA01682 02012002
TEMPINCR DC    D'0'                    TEMPORARY INCR FOR 2ND BLOCK INS 02020000
***   WARNING--  KEEP THE 4 NAMES BELOW IN THIS ORDER-              *** 02040000
**               SYSIN, SYSPRINT, SYSUT1, SYSUT2                     ** 02060000
*                                                                     * 02080000
SYSINNM  DC    CL8' '                  NAME OF INPUT DD CARD            02100000
SYSPRNTN DC    CL8' '                  NAME OF PRINTER DD CARD          02120000
SYSUT1NM DC    CL8' '                  NAME OF OLD MASTER DD CARD       02140000
SYSUT2NM DC    CL8' '                  NAME OF NEW MASTER DD CARD       02160000
         SPACE 1                                                        02180000
MEMNAME  DC    CL8' '                  MEMBER NAME FOR PODS             02200000
 SPACE 2                                                                02202017
*********************************************************************** 02204017
*        THE FOLLOWING THREE WORD FIELDS CONTAIN THE USER'S LABEL     * 02206017
*        EXIT ROUTINE NAME,A ONE BYTE PRINT CONSTANT FOLLOWED BY A    * 02212017
*        THREE BYTE ADDRESS OF THE LOADED USER ROUTINE.               * 02218017
*                                                                     * 02224017
* FIELD  ************************                                     * 02230017
*        * USER ROUTINE  *C*ADDR*                                     * 02236017
*        ************************                                     * 02242017
*********************************************************************** 02245017
   SPACE 1                                                              02248017
USERRTN  DS    3F             CURRENT USER LABEL ROUTINE INFO      UL0H 02254017
CTHDR    DS    3F             USER LABEL HEADER ROUTINE ON SYSIN   UL0H 02260017
CTTRLR   DS    3F             USER LABEL TRALER ROUTINE ON SYSIN   UL0H 02266017
OMHDR    DS    3F             USER LABEL HEADER ROUTINE ON SYSUT1  UL0H 02272017
OMTRLR   DS    3F             USER LABEL TRALER ROUTINE ON SYSUT1  UL0H 02278017
NMHDR    DS    3F             USER LABEL HEADER ROUTINE ON SYSUT2  UL0H 02284017
NMTRLR   DS    3F             USER LABEL TRALER ROUTINE ON SYSUT2  UL0H 02290017
STOWAREA DS    CL80'        '          BUFFER USED BY STOW              02300000
LISTAREA DS    CL80'        '          BUFFER USED BY BLDL              02320000
OMINAREA DS    CL80'        '          BUFFER USED FOR OLD MASTER IMAGE 02340000
TEMP     DC    D'0'                    WORK BUFFER CSECT2               02360000
LASTCTRC DC    D'0'                    LAST CT SEQUENCE NUMBER          02380000
LASTSEQN DC    D'0'                    LAST SEQUENCE ASSIGNED BY NUMBER 02400000
TEMPSEQ  DC    D'0'                    LAST SEQUENCE NUMBER NEW SYSIN   02420000
FDADSET  DC    D'0'                    START OF MEMBER FDAD MBBCCHHR    02440000
TEMPWA   DC    2D'0'                   SAVE AREA FOR SEQUENCE NUMBERS   02460000
NEW1TEMP DS    D'0'                    TEMPORARY SEQ NO BUFFER  YM07522 02470002
TEXTCTL  DS    CL121                   LOGOUT PRINT BUFFER + CONTROL    02480000
TRKBAL   DC    X'0000'       SAVE AREA FOR TRACK BALANCE           5666 02490016
SWITCHRD DS    27F                     SCAN BUFFER AND SWITCHES         02500000
INPUT    DS    20F                      SYSIN INPUT AREA           BS0H 02506017
EXTNTSW  DC    X'00'         OLD AND NEW SAME DATA SET             5324 02512017
STOREG   DS    3F                      SAVES SCAN REGISTERS             02520000
JFCBAREA DS    CL176               AREA INTO WHICH JFCB IS READ    3341 02523016
         DS    0D                  ALIGN DSCBAREA ON DOUBLE WORD   3341 02526016
DSCBAREA DS    CL350               WORK AREA FOR OBTAIN MACRO      3341 02529016
DSCBLIST DS    4F                  LIST OF INFORMATION FOR OBTAIN  3341 02532016
ADEVTYPE DS    2F                  AREA FOR DEVTYPE MACRO INFO     3341 02535016
BLOKSW   DC    X'00'                   SET IF BLOCKSIZE NOT 80     UL0H 02536017
BLOKFCTP DC    F'00'                                               UL0H 02537017
OMBLOCKP DC    F'0'                    OM BLOCK FACTOR/LENGTH RECORD    02540000
OMREADP  DC    F'0'                    ADDRESS OF OLD MASTER BUFFER     02560000
OMREADT  DC    F'0'                    ADDRESS OF OLD MASTER RECORD     02580000
NMWRITEP DC    F'0'                    ADDRESS OF NEW MASTER BUFFER     02600000
NMWRITET DC    F'0'                    ADDRESS OF NEW MASTER RECORD     02620000
READINAP DC    F'0'                    ADDRESS OF SYSIN BUFFER          02640000
LASTRECB DC    F'0'                    ADDRESS OF LAST RECORD PROCESSED 02660000
NEXTINSR DC    F'0'                    ADDRESS OF NEXT INSERT RECORD    02680000
OMLBLPTR DC    F'00'                    ADDR OF OMLABELS           UL0H 02681017
LABELBUF DC    F'00'                    ADDR OF GOTTEN CORE SAVE ARUL0H 02682017
USYSNBUF DC    F'00'                                               UL0H 02683017
UPDATBUF DC    F'00'                    ADDR OF SPECIAL UPDATE AREAUL0H 02684017
TOTALSIZ DC    F'00'                    SIZE SPECIFIED BY USER     UL0H 02685017
TOTALRTN DC    D'00'                    USER ROUTINE FOR TOTALING  UL0H 02686017
TOTALADR DC    F'00'                    ADDRESS OF TOTAL ROUTINE   UL0H 02687017
TOTLPARM DC    4F'0'                    USER TOTALING PARM LIST    000I 02688018
TOTRTNCD DC    H'00'                    RETURN CODE FROM TOTAL RTN UL0H 02689017
OMLABELS DS    160F                     EIGHT 80 BYTE LABEL SAVE ARUL0H 02690017
IDENTXX  DC    X'00480008'             SEQUENCE COLUMN-1,AND SIZE 73-8  02700000
IDENTNN  DS    F                        NUMERIC SEQ NO DDL      YM07522 02710002
NUMOFFST DS    H                        NUMERIC OFFSET FROM END YM07522 02712002
*   POINTER TO DCB'S CONTAINED IN CSECT1  (IEBUPDAT)                    02720000
DCBLOG   DS    F                       POINTER TO LOG (SYSPRINT) DCB    02740000
DCBCT    DS    F                       POINTER TO SYSIN DCB             02760000
DCBOM    DS    F                       POINTER TO OLD MASTER (SYSUT1)   02780000
DCBNM    DS    F                       POINTER TO NEW MASTER (SYSUT2)   02800000
*   CONSTANTS FOR INITIALIZATION ROUTINE                                02820000
USRHDPTR DC    F'0'                    POINTER TO USER HEADER LABEL     02840000
USRTRPTR DC    F'0'                    POINTER TO USER TRAILER LABEL    02860000
PAGENO   DC    F'0'                    NUMBER FIELD OF PAGE REFERENCE   02880000
NMBLOCKP DC    F'0'                    NM BLOCK FACTOR/LOGICAL RECORD   02900000
SAVE13   DS    F                       POINTER TO SUPERVISOR REGISTERS  02920000
SEQWA    DC    F'0'                    STARTING SEQUENCE NUMBER         02940000
TEMPSEQA DC    F'0'                    TEMPORARY BUFFER 2ND (EW1 BLOCK  02960000
MAXSIZEL DC    H'80'                   ASSUMED LRECL                    02980000
LRECL    DC    H'0'                    LOGICAL RECORD LENGTH SYSUT1/2   03000000
SOURCECD DC    X'FF'                   C'1'=IBM,C'0'=USER,'FF'=LEAVE IT 03020000
FLBLK    DC    H'00'                   ORIGINAL BLOCKSIZE          3628 03026015
SHRTBLK  DC    H'00'                   COMPUTED SHORT BLOCK ON READ3628 03032015
DSECTEND DS    0D                      END OF DSECT                     03040000
         SPACE 1                                                        03060000
*   THE FOLLOWING ARE THE CODES FOR MESSAGES. MESSAGES ARE CONTAINED  * 03080000
*  IN CSECT 'IEBUPLOG', THE MESSAGE CSECT. IN ALL CSECTS GR11 IS      * 03100000
*  LOADED WITH THE MESSAGE CODE NUMBER TO ENABLE THE MESSAGE WRITER   * 03120000
*  TO SELECT THE DESIRED MESSAGE. MESSAGES ARE OF VARIABLE LENGTHS    * 03140000
*  DETERMINED BY THE EQUATES IN THE 'IEBUPLOG' CSECT.                 * 03160000
         SPACE 1                                                        03180000
BLOKSMSG EQU   X'01'                   NUMBER OF BLOCKSIZE ASSUMED 80   03200000
IOERR    EQU   X'02'           NUMBR OF I/O ERROR MESSAGE        A27716 03220019
FINDMSG  EQU   X'03'       NUMBER FOR FIND I/O ERROR MSG         A27716 03240019
BLDLMSG  EQU   X'04'       NUMBER FOR BLDL I/O ERROR MSG         A27716 03260019
SCANMSG  EQU   X'05'                   NUMBER OF CONTROL STATEMENT MSG  03280000
SEQMSG   EQU   X'06'                   NUMBER OF STATEMENT SEQUENCE MSG 03300000
ERROP    EQU   X'07'                   NUMBER OF INVALID OPERATION MSG  03320000
FLUSHING EQU   X'08'                   NUMBER OF FLUSH TO NEXT MEMBER   03340000
CARDSKIP EQU   X'09'                   NUMBER OF IGNORE CARD IN FLUSH   03360000
DELMSG   EQU   X'10'                   NUMBER OF DELETE RANGE ERROR MSG 03380000
NUMMSG   EQU   X'11'                   NUMBER OF NUMBER RANGE ERROR MSG 03400000
ERRDRIO  EQU   X'12'                   NUMBER OF DIRECTORY WRITE ERROR  03420000
ERRDIRF  EQU   X'13'                   NUMBER OF OUTPUT DIRECTORY FULL  03440000
NTOPMSG  EQU   X'14'                   NUMBER OF DS NOT OPENED MESSAGE  03460000
ERRMSGC  EQU   X'15'                   NUMBER OF ONLY 1 PS PROCESSED    03480000
STOWMSGN EQU   X'16'                   NUMBER OF NAME FOUND AND ALTERED 03500000
STOWMSGT EQU   X'17'                   NUMBER OF NAME NOT FOUND MSG     03520000
CONCDMSG EQU   X'18'                   NUMBER OF CONDITION CODE MESSAGE 03540000
EOJMESSG EQU   X'19'                   END OF JOB MESSAGE               03560000
UPDATMSG EQU   X'20'                   NUMBER OF CANNOT UPDATE INPLACE  03580000
PLUS8MSG EQU   X'21'                   NUMBER OF INVALID EXIT MESSAGE   03600000
USRTRMSG EQU   X'22'                   NUMBER OF EXIT RETURN ERROR MSG  03620000
ERRMSGN  EQU   X'23'                   NUMBER OF NULL DATA SET MESSAGE  03640000
PSALIAS  EQU   X'25'                   NUMBER OF IGNORE ALIAS IN PS     03680000
ALTTRUE  EQU   X'26'                   NUMBER OF ALIAS TO TRUE MESSAGE  03700000
BADPARMG EQU   X'27'                   NUMBER OF INVALID INPUT PARM MSG 03720000
PAGEMSG  EQU   X'28'                   NUMBER OF INVALID PAGE PARM MSG  03740000
DDNAMEMG EQU   X'29'                   NUMBER OF INVALID DD NAME MSG    03760000
SIZEBAD  EQU   X'30'                   OLD MASTER /NEW MASTER LRECL     03780000
DSORGBAD EQU   X'31'               OM AND NM DSORGS INCOMPATIBLE   3341 03790016
USRLBLMS EQU   X'32'                    ROUTINE IS PROCESSING LABELUL0H 03790617
LBLENTMS EQU   X'33'                    NO. OF ENTRANCES MSG       UL0H 03791217
LSTRCMSG EQU   X'34'                    LAST RETURN CODE FROM  USERUL0H 03791817
SEQDSMSG EQU   X'35'                    SUPPORTED ON SEQUENTIAL DS UL0H 03792417
INPLBLMS EQU   X'36'                    TRAILERS NOT ON UPDATE     UL0H 03793017
LBLERMSG EQU   X'37'                    I/O ERROR DURING LABEL PROCUL0H 03793617
NOLBLMSG EQU   X'38'                    NO. LABELS CREATED FROM IN UL0H 03794217
TOTENTMS EQU   X'39'                    ROUTINE IS TAKING TOTAL XITUL0H 03794817
TOTTERM  EQU   X'40'                    ROUTINE TERM. TOTAL EXITS  UL0H 03795417
TOTBDRCD EQU   X'41'                    INVALID RETURN CODE -TOTAL UL0H 03796017
TOTNTSPT EQU   X'42'                    TOTALING NOT SUPPORT- UPDATUL0H 03796617
BDCORESZ EQU   X'43'                    INVALID CORE SIZE--TOTALINGUL0H 03797217
NOULXSTM EQU   X'44'                    NO USER LABELS EXIST       UL0H 03797817
NOULCRTM EQU   X'45'                    NO USER LABELS CREATED     UL0H 03798417
UPALIAS  EQU   X'46'                                               UL0H 03798817
         SPACE 1                                                        03800000
DSECTSIZ EQU   DSECTEND-IEBUPCON       SIZE OF DSECT                    03820000
SIZETAB  EQU   ENDTAB-STARTAB-1        SIZE OF SWITCHES                 03840000
CONTCLER EQU   ENDTAB-COMDCD-1         EXTENT OF CONTROL CARD SWITCHES  03860000
         SPACE 1                                                        03880000
LOGOUTAR EQU   TEXTCTL+1               DATA PORTION OF PRINT BUFFER     03900000
IDENTY   EQU   IDENTXX+2               EXTENT OF SEQUENCE NUMBER        03920000
IDENTN   EQU   IDENTNN+2                EXTENT OF NUMERIC       YM07522 03930002
LASTCOLM EQU   SWITCHRD+72        LAST COLUMN                      3185 03940015
PARAMSW  EQU   SWITCHRD+81             PARAMETER FOLLOWS, CONTINUATION  03960000
SAVEPAPR EQU   SWITCHRD+83             SAVE AREA FOR PARTIAL PARAMETERS 03980000
COL72LG  EQU   SWITCHRD+103            COLUMN 72 SWITCH AND LENGTH SW   04000000
DELIMIN  EQU   SWITCHRD+106            DELIMITER INDICATORS             04020000
DELIMIN2 EQU   SWITCHRD+107            DELIMITER INDICATORS             04040000
NMBLOCKT EQU   NMBLOCKP+2              LOGICAL RECORD USED              04060000
OMBLOCKT EQU   OMBLOCKP+2              LOGICAL RECORD USED COUNT        04080000
         MEND                                                           04100000
./  ADD  SSI=31020795,NAME=IEHDCBXL
         MACRO                                                          00050000
         IEHDCBXL                                                       00100000
*                                                                  UL0H 00150000
*                   USER LABEL DCB EXIT LIST AND CORE ADDRESSES    UL0H 00200000
*                                                                  UL0H 00250000
UDCBIHLE DS    0BL1                USER INPUT HEADER LABEL EXIT    UL0H 00300000
         DS    A                                                   UL0H 00350000
UDCBOHLE DS    0BL1                USER OUTPUT HEADER LABEL EXIT   UL0H 00400000
         DS    A                                                   UL0H 00450000
UDCBITLE DS    0BL1                USER INPUT TRAILER LABEL EXIT   UL0H 00500000
         DS    A                                                   UL0H 00550000
UDCBOTLE DS    0BL1                USER OUTPUT TRAILER LABEL EXIT  UL0H 00600000
         DS    A                                                   UL0H 00650000
UDCBDCBE DS    0BL1                DCB EXIT                        UL0H 00700000
         DS    A                                                   UL0H 00750000
UDCBCKPT DS    0BL1                CHECK POINT                     UL0H 00800000
         DS    A                                                   UL0H 00850000
UDCBJFCB DS    0BL1                OPENJ JFCB EXIT                 UL0H 00900000
         DS    A                                                   UL0H 00950000
         MEND                                                           01000000
./  ADD  SSI=63090517,NAME=IEHMVV
         MACRO                                                          00020000
         IEHMVV                                                         00040000
         EJECT                                                          00060000
IEHMVV   DSECT                                                          00065002
*C026991-026995                                                @ZA03372 00067003
*A026991-026995                                                @ZA00101 00070002
*D026991                                                       @ZA00101 00075002
*C026970-026977                                                 YA01193 00080116
*A026984-026991                                                 YA01193 00080216
.*A003724,012300                                                 A44334 00080321
.*C012200                                                        A44334 00080721
.*A012120                                                        A43752 00081121
.*A026950                                                        A41754 00081421
.*A012140                                                        A37919 00081721
.*A003000,003600,012000,026900                                   I276   00082021
.*                                                             @G32DSFS 00087032
.*C012280,A012300,C012340                                      @Z40CSJH 00092004
*                                                                       00100000
*              SEPTEMBER 15, 1976                              @G32DSFS 00120032
*                                                                       00140000
*              THIS DSECT DEFINES THE COMMUNICATION AREA TO BE          00160000
*              USED WITH THE MOVE/COPY PROGRAM                          00180000
*              REGISTER 12 WILL POINT TO THIS AREA AT EVERY CALL        00200000
*              OF A SEGMENT OR SUBROUTINE                               00220000
*                                                                       00240000
*                    UNCONTROLLED VOLATILE WORK AREA                    00260000
*                                                                       00280000
IEHMVV00 DS    64D            VOLATILE WORK AREA                        00300000
*IEHMVV00+400  X'00'          INDICATOR BYTE FOR VOLMOUNT          I276 00310019
*                                                                       00320000
*                    PERMANENT WORK AREA CONTROL                        00340000
*                                                                       00360000
*IEHMVV10-5    '00'           MESSAGE NUMBER INDICATOR             I276 00362019
*IEHMVV10-4    '80'           INDICATES 'FROM' DCB IS OPEN         I276 00364019
*              '40'           INDICATES 'TO' DCB IS OPEN           I276 00366019
*              '20'           INDICATES FIXED BLOCK REBLOCKING     I276 00368019
*              '10'           INDICATES VARIABLE BLOCK REBLOCKING  I276 00370019
*              '08'           INDICATES DATA SET IS UNMOVABLE      I276 00372019
*              '04'           INDICATES DEFAULT SPACE RELEASE    A44334 00372421
*IEHMVV10-2    H              LOGICAL RECORD LENGTH                I276 00374019
IEHMVV10 DS    F              ADDRESS OF PERMANENT WORK AREA            00380000
         DS    F              ADDRESS OF END OF PERMANENT WORK AREA     00400000
*                                                                       00420000
*                    CONTROL CARD INFORMATION CONTROL                   00440000
*                                                                       00460000
IEHMVV20 DS    0F             CONTROL CARD SWITCH DEFINITIONS           00480000
         DC    0X'80'         MOVE                                      00500000
         DC    0X'40'         COPY                                      00520000
         DC    0X'20'         DSNAME                                    00540000
         DC    0X'10'         DSGROUP                                   00560000
         DC    0X'08'         PDS                                       00580000
         DC    0X'04'         CATALOG                                   00600000
         DC    0X'02'         VOLUME                                    00620000
         DC    1X'01'         FROM                                      00640000
         DC    0X'80'         TO                                        00660000
         DC    0X'40'         CVOL                                      00680000
         DC    0X'20'         UNCATLG                                   00700000
         DC    0X'10'         CATLG                                     00720000
         DC    0X'08'         SECURITY                                  00740000
         DC    0X'04'         EXPAND                                    00760000
         DC    0X'02'         LOAD                                      00780000
         DC    1X'01'         UNLOAD                                    00800000
         DC    0X'80'         ANY ALIAS                                 00820000
         DC    0X'40'         MID-ABORT                                 00840000
         DC    0X'20'         END OF INPUT                              00860000
         DC    0X'10'         PHONY 'TO' NAME                           00880000
         DC    0X'08'         ANY INC-REP                               00900000
         DC    0X'04'         ANY EXC-REP                               00920000
         DC    0X'02'         ANY SELECT                                00940000
         DC    1X'01'         PERM ABORT                                00960000
         DC    0X'80'         FIRST TIME VOLUME                         00980000
         DC    0X'40'         TODD                                      01000000
         DC    0X'20'         CARD PRINT                                01020000
         DC    0X'10'         CARD PRINT                                01040000
         DC    0X'08'         PREALLOCATED DATASET                      01060000
         DC    0X'04'         RENAME                                    01080000
         DC    0X'02'         FROMDD                                    01100000
         DC    1X'01'         ****DUMP****                              01120000
         DS    0X'80'         FIRST TIME SWITCH FOR SZ                  01140000
         DS    0X'40'         COPY POD MODULE - 00 = TJ                 01160000
         DS    0X'20'         40 = SL  20 = SM                          01180000
         DS    0X'10'         SYSCATLG ON VOLUME                        01200000
         DS    0X'08'         MODEL DSCB                           I276 01206019
         DS    0X'04'         RECORD READY DEVICE                  I276 01212019
         DS    0X'02'         MULTIVOLUMESWITCH                  A43752 01214021
         DS    1X'01' SYSCTLG ON VOLUME                          A37919 01216021
         DS    0X'80' RLSE-KEYWORD SPECIFIED                     A44334 01222021
         DS    0X'40' SWITCH FOR UNLOAD REQUEST                @Z40CSJH 01228004
         DS    0X'20' SWITCH FOR NAME GIVEN WITH DSGROUP       @Z40CSJH 01228432
         DS    0X'10' COPYAUTH-KEYWORD SPECIFIED               @G32DSFS 01229432
         DS    0X'08' AS YET UNUSED                            @G32DSFS 01230432
         DS    0X'04' AS YET UNUSED                            @G32DSFS 01231432
         DS    1X'00' AS YET UNUSED                            @Z40CSJH 01234004
IEHMVV21 DS    F              ADDRESS OF 'FROM' DATASET NAME            01240000
         DS    F              ADDRESS OF 'TO' DATASET NAME              01260000
IEHMVV22 DS    0F             'FROM VOL' LIST                           01280000
         DS    FL1            NUMBER OF ENTRIES IN FROM VOL LIST        01300000
         DS    FL3            ADDRESS OF FROM VOL LIST                  01320000
         DS    F              ADDRESS OF ACTIVE 'FROM VOL'              01340000
IEHMVV23 DS    0F             'TO VOL' LIST                             01360000
         DS    FL1            NUMBER OF ENTRIES IN TO VOL LIST          01380000
         DS    FL3            ADDRESS OF TO VOL LIST                    01400000
         DS    F              ADDRESS OF ACTIVE 'TO VOL'                01420000
IEHMVV24 DS    0F             'CVOL' LIST                               01440000
         DS    FL1            NUMBER OF ENTRIES IN CVOL LIST            01460000
         DS    FL3            ADDRESS OF CVOL LIST                      01480000
IEHMVV25 DS    H              DIRECTORY COUNT                           01500000
         DS    H              EXPAND VALUE                              01520000
IEHMVV26 DS    0F             'INC-EXC-REP' LIST                        01540000
         DS    FL1            NUMBER OF ENTRIES IN INC-EXC-REP LIST     01560000
         DS    FL3            ADDRESS OF INC-EXC-REP LIST               01580000
IEHMVV28 DS    F              ADDRESS OF FROMDD                         01600000
         DS    F              ADDRESS OF TODD                           01620000
IEHMVV27 DS    10F            WORK SPACE FOR CONTROL CARD ANALYZER      01640000
*                                                                       01660000
*                    DATA SET CONTROL                                   01680000
*                                                                       01700000
IEHMVV30 DS    F              ADDRESS OF 'FROM' DCB                     01720000
         DS    F              ADDRESS OF 'FROM' DECB                    01740000
         DS    F              ADDRESS OF 'FROM' DSCB                    01760000
         DS    F              ADDRESS OF 'FROM' DDNAME                  01780000
IEHMVV31 DS    F              ADDRESS OF 'TO' DCB                       01800000
         DS    F              ADDRESS OF 'TO' DECB                      01820000
         DS    F              ADDRESS OF 'TO' DDNAME                    01840000
IEHMVV32 DS    F              ADDRESS OF 'SYSIN' DCB                    01860000
         DS    F              ADDRESS OF 'SYSIN' DECB                   01880000
IEHMVV33 DS    F              ADDRESS OF 'SYSPRINT' DCB                 01900000
         DS    F              ADDRESS OF 'SYSPRINT' DECB                01920000
*                                                                       01940000
*                    WORK FILE CONTROL                                  01960000
*                                                                       01980000
IEHMVV39 DS    FL5                 CCHHR OF END OF SYSUT1               02000000
         DS    FL1            * COUNTER FOR SYSUT1                      02020000
         DS    FL1            * COUNTER FOR SYSUT2                      02040000
         DS    FL1            * COUNTER FOR SYSUT3                      02060000
         DS    F              TTR OF BEGINNING OF CATALOG ON SYSUT1     02080000
IEHMVV40 DS    F              ADDRESS OF 'SYSUT1' DCB                   02100000
         DS    F              ADDRESS OF 'SYSUT1' DECB                  02120000
IEHMVV41 DS    F              ADDRESS OF 'SYSUT2' DCB                   02140000
         DS    F              ADDRESS OF 'SYSUT2' DECB                  02160000
         DS    FL5                 CCHHR OF END OF SYSUT2               02180000
         DS    FL1            RETURN CODE BYTE                          02200000
IEHMVV42 DS    F              ADDRESS OF 'SYSUT3' DCB                   02220000
         DS    F              ADDRESS OF 'SYSUT3' DECB                  02240000
         DS    FL5                 CCHHR OF END OF SYSUT3               02260000
IEHMVV43 DS    2F             2 WORDS REQUIRED BY GET MEMBER            02280000
*                                                                       02300000
*                    STEM SUBROUTINE CONTROL                            02320000
*                                                                       02340000
IEHMVV50 DS    F              ADDRESS OF VOLUME MOUNT ROUTINE           02360000
         DS    F               USED BY VOLUME MOUNT                     02380000
IEHMVV51 DS    F              ADDRESS OF MESSAGE WRITER                 02400000
         DS    F               USED BY MESSAGE WRITER                   02420000
         DS    H              LINES PER PAGE                            02440000
         DS    H              LINES TO GO ON CURRENT PAGE               02460000
         DS    H              CURRENT PAGE NUMBER                       02480000
*                                                                       02500000
*                   MULTIPLE USE AREA                                   02520000
*                                                                       02540000
IEHMVV60 DS    2F             LOAD/UNLOAD AREA                          02560000
IEHMVV61 DS    1F      FOR THE EXCLUSIVE USE OF INC/REP RTN             02580000
IEHMVV62 DS    1F         POINTER TO PDS COPY RTN PERM WKAREA           02600000
*                                                                       02620000
*                   USER LABEL DCB EXIT LIST AND CORE ADDRESSES    UL0H 02625017
IEHMVV70 DS    F   01    INPUT HEADER LABEL EXIT                   UL0H 02630017
         DS    F   02    OUTPUT HEADER LABEL EXIT                  UL0H 02635017
         DS    F   03    INPUT TRAILER LABEL EXIT                  UL0H 02640017
         DS    F   04    OUTPUT TRAILER LABEL EXIT                 UL0H 02645017
         DS    F   05    DCB EXIT                                  UL0H 02650017
         DS    F   06    CHECK/POINT                               UL0H 02655017
         DS    F   07    JFCB EXIT                                 UL0H 02660017
         DS    3F                                                  UL0H 02665017
IEHMVV72 DS    F   ADDRESS OF GOTTEN CORE                          UL0H 02670017
         DS    F   ADDRESS OF CURRENT LABEL SAVE AREA              UL0H 02675017
         DS    F   1ST LABEL SW - - DA/NLT FLAG**NO LABEL TRACK    UL0H 02680017
         DS    F   LABEL COUNT                                     UL0H 02685017
         DS    F   FLAG FOR NO M/C MESSAGE                         UL0H 02690017
IEHMVV74 DS    4F ULOH                                             I276 02691019
*IEHMVV74+4    'FF'           I/O ERROR IN USERS LABELS            I276 02692019
*IEHMVV74+12   'FF'           OUTPUT TO NL TAPES                   I276 02693019
IEHMVV80 DS    F              ADDRESS OF DEVICE NAME TABLE         I276 02694019
IEHMVV82 DS    4F DSCBTTR SAVE AREA FOR CATALOG MANAGEMENT       S21042 02696021
IEHMVV84 DS    2F            ADDRESS AND LENGTH OF BDAM-WORKAREYA011934 02697016
*                              USED IN IEHMVSTL - FREED IEHMVESNYA01193 02697716
IEHMVV85 DS    F             PTR TO INFO ABOUT SIZE OF DATA SET YA01193 02698416
IEHMVV86 DS    1F                                              @ZA03372 02699103
IEHMVV87 DS    2F            SAVE AREA FOR TIME                @ZA03372 02699503
*                                                                       02700000
*                    PERMANENT WORK AREA                                02720000
*                                                                       02740000
IEHMVV90 DS    0F             PERMANENT WORK AREA                       02760000
IEHMVV99 DS    0C                                                       02780000
         EJECT                                                          02800000
         MEXIT                                                          02820000
         MEND                                                           02840000
./  ADD  SSI=31020797,NAME=IEHPOST
         MACRO                                                          00050000
&LABEL   IEHPOST &REG,&OPTION,&USED                                     00100000
         LCLA  &SAVE,&DIFF,&WORK                                        00150000
         AIF   ('&OPTION' EQ '').SEQ0A                                  00200000
&WORK    SETA  0                                                        00250000
.SEQ0    ANOP                                                           00300000
&WORK    SETA  &WORK+1                                                  00350000
         AIF   (&WORK GT K'&OPTION).SEQ0A                               00400000
         AIF   ('&OPTION'(&WORK,1) NE 'C').SEQ0                         00450000
*                                                                       00500000
*              THIS MACRO IS USED WITH THE IEHPRE MACRO IN THE          00550000
*              MOVE/COPY PROGRAM TO RESTORE THE SAVE AREAS              00600000
*              AFTER CALLING A SUBROUTINE                               00650000
*                                                                       00700000
.SEQ0A   ANOP                                                           00750000
&SAVE    SETA  72                                                       00800000
         AIF   ('&USED' EQ '').SEQ1                                     00850000
         AIF   ((T'&USED NE 'N') OR ('&USED'(1,1) LT '0') OR ('&USED'(1X00900000
               ,1) GT '9')).ERR3                                        00950000
&DIFF    SETA  (&USED/4)*4                                              01000000
         AIF   (&DIFF NE &USED).ERR3                                    01050000
&SAVE    SETA  &USED                                                    01100000
.SEQ1    ANOP                                                           01150000
&LABEL   L     13,4(0,13)                                               01200000
         AIF   ('&REG(1)' EQ '').SEQ3                                   01250000
         AIF   (('&REG(1)' NE '14') AND ('&REG(1)' NE '15') AND ('&REG(X01300000
               1)' NE '0') AND ('&REG(1)' NE '1')).ERR1                 01350000
         AIF   (N'&REG NE 1).SEQ2                                       01400000
         L     &REG(1),&SAVE.(0,13)                                     01450000
         AGO   .SEQ3                                                    01500000
.SEQ2    AIF   (('&REG(2)' NE '14') AND ('&REG(2)' NE '15') AND ('&REG(X01550000
               2)' NE '0') AND ('&REG(2)' NE '1')).ERR1                 01600000
&DIFF    SETA  &REG(2)-&REG(1)                                          01650000
         AIF   ((&DIFF NE 1) AND (&DIFF NE 0-13) AND (&DIFF NE 0-14) ANX01700000
               D (&DIFF NE 0-15)).ERR1                                  01750000
         LM    &REG(1),&REG(2),&SAVE.(13)                               01800000
.SEQ3    AIF   ('&OPTION' EQ '').EXIT                                   01850000
&WORK    SETA  0                                                        01900000
.SEQ4    ANOP                                                           01950000
&WORK    SETA  &WORK+1                                                  02000000
         AIF   (&WORK GT K'&OPTION).EXIT                                02050000
         AIF   ('&OPTION'(&WORK,1) NE 'T').SEQ4                         02100000
         MVI   12(13),X'FF'                                             02150000
.EXIT    MEXIT                                                          02200000
.ERR1    MNOTE 1,'** REGISTER OPERAND IN ERROR'                         02250000
         MEXIT                                                          02300000
.ERR3    MNOTE 1,'** USED OPERAND IN ERROR'                             02350000
         MEXIT                                                          02400000
         MEND                                                           02450000
./  ADD  SSI=31020798,NAME=IEHPRE
         MACRO                                                          00050000
&LABEL   IEHPRE &REG,&OPTION,&USED                                      00100000
         LCLA  &NEW,&SAVE,&ADDRS,&DIFF,&WORK                            00150000
         AIF   ('&OPTION' EQ '').SEQ0A                                  00200000
&WORK    SETA  0                                                        00250000
.SEQ0    ANOP                                                           00300000
&WORK    SETA  &WORK+1                                                  00350000
         AIF   (&WORK GT K'&OPTION).SEQ0A                               00400000
         AIF   ('&OPTION'(&WORK,1) NE 'C').SEQ0                         00450000
*                                                                       00500000
*              THIS MACRO IS USED IN THE MOVE/COPY PRPGRAM TO LINK      00550000
*              SAVE AREAS TOGETHER PRIOR TO CALLING A SUBROUTINE        00600000
*              IN ADDITION, ANY OF THE REGISTERS NORMALLY DESTROYED     00650000
*              DURING A CALL (14-1) MAY BE SAVED, CERTAIN TRACE-BACK    00700000
*              FLAGS MAY BE SET, AND A PRIVATE STORAGE AREA MAY BE      00750000
*              MAINTAINED                                               00800000
*                                                                       00850000
.SEQ0A   ANOP                                                           00900000
&WORK    SETA  0                                                        00950000
&SAVE    SETA  72                                                       01000000
         AIF   ('&USED' EQ '').SEQ1                                     01050000
         AIF   ((T'&USED NE 'N') OR ('&USED'(1,1) LT '0') OR ('&USED'(1X01100000
               ,1) GT '9')).ERR3                                        01150000
&DIFF    SETA  (&USED/4)*4                                              01200000
         AIF   (&DIFF NE &USED).ERR3                                    01250000
&SAVE    SETA  &USED                                                    01300000
.SEQ1    AIF   ('&REG(1)' NE '').SEQ2                                   01350000
&ADDRS   SETA  1                                                        01400000
&NEW     SETA  &SAVE                                                    01450000
&LABEL   ST    1,&SAVE.(0,13)                                           01500000
         AGO   .LA                                                      01550000
.SEQ2    AIF   (('&REG(1)' NE '14') AND ('&REG(1)' NE '15') AND ('&REG(X01600000
               1)' NE '0') AND ('&REG(1)' NE '1')).ERR1                 01650000
         AIF   (N'&REG NE 1).SEQ4                                       01700000
         AIF   ('&REG(1)' NE '15').SEQ3                                 01750000
&ADDRS   SETA  1                                                        01800000
&NEW     SETA  &SAVE+4                                                  01850000
&WORK    SETA  4                                                        01900000
&LABEL   STM   15,1,&SAVE.(13)                                          01950000
         AGO   .LA                                                      02000000
.SEQ3    ANOP                                                           02050000
&ADDRS   SETA  &REG(1)+1                                                02100000
&NEW     SETA  &SAVE+4                                                  02150000
&LABEL   STM   &REG(1),&ADDRS,&SAVE.(13)                                02200000
         AGO   .LA                                                      02250000
.SEQ4    AIF   (('&REG(2)' NE '14') AND ('&REG(2)' NE '15') AND ('&REG(X02300000
               2)' NE '0') AND ('&REG(2)' NE '1')).ERR1                 02350000
&DIFF    SETA  &REG(2)-&REG(1)                                          02400000
         AIF   ((&DIFF NE 1) AND (&DIFF NE 0-13) AND (&DIFF NE 0-14) ANX02450000
               D (&DIFF NE 0-15)).ERR1                                  02500000
         AIF   (&DIFF GE 0).SEQ5                                        02550000
&DIFF    SETA  &DIFF+16                                                 02600000
.SEQ5    ANOP                                                           02650000
&NEW     SETA  &SAVE+&DIFF*4+4                                          02700000
         AIF   ('&REG(2)' NE '15').SEQ6                                 02750000
&ADDRS   SETA  1                                                        02800000
&WORK    SETA  4                                                        02850000
&LABEL   STM   14,1,&SAVE.(13)                                          02900000
         AGO   .LA                                                      02950000
.SEQ6    ANOP                                                           03000000
&ADDRS   SETA  &REG(2)+1                                                03050000
&LABEL   STM   &REG(1),&ADDRS,&SAVE.(13)                                03100000
.LA      LA    &ADDRS,&NEW.(0,13)                                       03150000
         ST    13,4(0,&ADDRS.)                                          03200000
         ST    &ADDRS,8(0,13)                                           03250000
         LR    13,&ADDRS                                                03300000
         L     &ADDRS,&WORK.(0,13)                                      03350000
         AIF   ('&OPTION' EQ '').EXIT                                   03400000
&WORK    SETA  0                                                        03450000
.SEQ7    ANOP                                                           03500000
&WORK    SETA  &WORK+1                                                  03550000
         AIF   (&WORK GT K'&OPTION).SEQ8                                03600000
         AIF   ('&OPTION'(&WORK,1) NE 'T').SEQ7                         03650000
         MVI   12(13),X'00'                                             03700000
.SEQ8    ANOP                                                           03750000
&WORK    SETA  0                                                        03800000
.SEQ9    ANOP                                                           03850000
&WORK    SETA  &WORK+1                                                  03900000
         AIF   (&WORK GT K'&OPTION).EXIT                                03950000
         AIF   ('&OPTION'(&WORK,1) NE 'F').SEQ9                         04000000
         MVI   8(13),X'FF'                                              04050000
.EXIT    MEXIT                                                          04100000
.ERR1    MNOTE 1,'** REGISTER OPERAND IN ERROR'                         04150000
         MEXIT                                                          04200000
.ERR3    MNOTE 1,'** USED OPERAND IN ERROR'                             04250000
         MEXIT                                                          04300000
         MEND                                                           04350000
./  ADD  SSI=30940310,NAME=LABEL
         MACRO                                                          00600020
&NAME    LABEL &UNIT,&DDNAME,&LABEL,&NO,&LNGTH,&CNTRL,&LABELA,         X01200020
               &UNLOAD,&MF=I                                            01800020
         LCLA  &A                                                       02400020
         LCLB  &BB,&B(8)                                                03000020
         LCLC  &C                                                       03600020
&BB      SETB  ('&UNLOAD' EQ 'UNLOAD')                                  04200020
         AIF   ('&MF(1)' EQ 'E').EROUT                                  04800020
         AIF   ('&MF' NE 'L').CNOP                                      05400020
&NAME    DS    0F                      BUILD LIST ON FULL WORD BDY      06000020
         AGO   .UNL                                                     06600020
.CNOP    CNOP  0,4                                                      07200020
&NAME    BAL   1,*+24                  BRANCH AROUND PARM LIST          07800020
.UNL     DC    AL1(192)                CONSTANT OF X'C0'                08400020
         DC    BL2'1&BB.0'             REWIND OR UNLOAD OPTION          09000020
         AIF   ('&UNIT' EQ '' AND '&MF' EQ 'L').ZERUN                   09600020
         AIF   ('&UNIT' EQ '').E1                                       10200020
         AIF   ('&UNIT'(1,1) EQ '(').ZERUN                              10800020
         DC    AL1(&UNIT)              UNIT NUMBER                      11400020
         AGO   .DD                                                      12000020
.ZERUN   DC    AL1(0)                  UNIT NUMBER                      12600020
.DD      AIF   ('&DDNAME' EQ '' AND '&MF' EQ 'L').ZERDD                 13200020
         AIF   ('&DDNAME' EQ '').E2                                     13800020
         AIF   ('&DDNAME'(1,1) EQ '(').ZERDD                            14400020
         DC    A(&DDNAME)              DDNAME ADDRESS                   15000020
         AGO   .LAB                                                     15600020
.ZERDD   DC    A(0)                    DDNAME ADDRESS                   16200020
.LAB     AIF   ('&LABEL' EQ '' AND '&MF' EQ 'L').ZERLB                  16800020
         AIF   ('&LABEL' EQ '').E3                                      17400020
         AIF   ('&LABEL'(1,1) EQ '(').ZERLB                             18000020
         DC    A(&LABEL)               LABEL ADDRESS                    18600020
         AGO   .LEN                                                     19200020
.ZERLB   DC    A(0)                    LABEL ADDRESS                    19800020
.LEN     AIF   ('&LNGTH' EQ '' AND '&MF' EQ 'L').ZERLN                  20400020
         AIF   ('&LNGTH' EQ '').E5                                      21000020
         AIF   ('&LNGTH'(1,1) EQ '(').ZERLN                             21600020
         DC    AL2(&LNGTH)             LABEL LENGTH                     22200020
         AGO   .NUM                                                     22800020
.ZERLN   DC    AL2(0)                  LABEL LENGTH                     23400020
.NUM     AIF   ('&NO' EQ '' AND '&MF' EQ 'L').ZERNO                     24000020
         AIF   ('&NO' EQ '').E4                                         24600020
         AIF   ('&NO'(1,1) EQ '(').ZERNO                                25200020
         DC    AL1(&NO)                NUMBER OF LABELS                 25800020
         AGO   .CODE                                                    26400020
.ZERNO   DC    AL1(0)                  NUMBER OF LABELS                 27000020
.CODE    AIF   ('&CNTRL' EQ '').E6                                      27300020
&A       SETA  K'&CNTRL                                                 28200020
&C       SETC  '&CNTRL'(&A,1)                                           28800020
&A       SETA  &C                                                       29400020
         AIF   ('&CNTRL'(1,1) EQ '9').NINE                              30000020
         AIF   (&A GE 3).E7                                             30600020
&B(1)    SETB  (&A EQ 2)                                                31200020
&B(2)    SETB  (&A EQ 1)                                                31800020
         AIF   ('&CNTRL'(1,1) NE '7').E7                                32400020
         AIF   ('&CNTRL'(2,1) NE 'C' AND '&CNTRL'(2,1) NE 'E' AND '&CNTX33000020
               RL'(2,1) NE 'T').E7                                      33600020
         AIF   ('&CNTRL'(2,1) EQ 'C').CONV                              34200020
&B(3)    SETB  1                                                        34800020
&B(5)    SETB  ('&CNTRL'(2,1) EQ 'T')                                   35400020
         AIF   (NOT &B(5)).PUT                                          36000020
         AIF   (K'&CNTRL NE 3).PUT                                      36100020
&B(4)    SETB  1                                                        37200020
.PUT     AIF   ('&MF(1)' NE 'E').DCCD                                   37800020
&A       SETA  128*&B(1)+64*&B(2)+32*&B(3)+16*&B(4)+8*&B(5)+3           38400020
         MVI   15(1),&A                MOVE MODE TO PARM LIST           39000020
         AGO   .SVC                                                     39600020
.DCCD    DC    BL1'&B(1)&B(2)&B(3)&B(4)&B(5).011'          MODE         40200020
         AIF   ('&LABELA' NE '').VAL                             PM0051 40250020
         AIF   ('&LABEL' EQ '' AND '&MF' EQ 'L').ZERVAL          PM0051 40300020
         AIF   ('&LABEL' EQ '').E3                               PM0051 40350020
         AIF   ('&LABEL'(1,1) EQ '(').ZERVAL                     PM0051 40400020
         DC    A(&LABEL)               ADDRESS OF EBCDIC LABEL   PM0051 40450020
         AGO   .PASSA                                            PM0051 40500020
.VAL     AIF   ('&LABELA'(1,1) EQ '(').ZERVAL                    PM0051 40550020
         DC    A(&LABELA)              ADDRESS OF EBCDIC LABEL   PM0051 40600020
         AGO   .PASSA                                            PM0051 40650020
.ZERVAL  DC    A(0)                    ADDRESS OF EBCDIC LABEL   PM0051 40700020
.PASSA   ANOP                                                    PM0051 40750020
         AIF   ('&MF' EQ 'L').MEXIT                                     40800020
         AIF   ('&UNIT' EQ '').NORUN                                    41400020
         AIF   ('&UNIT'(1,1) NE '(').NORUN                              42000020
         STC   &UNIT(1),3(0,1)         UNIT NUMBER MOVED TO LIST        42600020
.NORUN   AIF   ('&DDNAME' EQ '').NORDD                                  43200020
         AIF   ('&DDNAME'(1,1) NE '(').NORDD                            43800020
         ST    &DDNAME(1),4(0,1)       STORE DDNAME ADDRESS             44400020
.NORDD   AIF   ('&LABEL' EQ '').NORLB                                   45000020
         AIF   ('&LABEL'(1,1) NE '(').NORLB                             45600020
         ST    &LABEL(1),8(0,1)        STORE VOLUME SET LABEL ADDR      46200020
.NORLB   AIF   ('&LNGTH' EQ '').NORLN                                   46800020
         AIF   ('&LNGTH'(1,1) NE '(').NORLN                             47400020
         STH   &LNGTH(1),12(0,1)       STORE LABEL LENGTH               48000020
.NORLN   AIF   ('&NO' EQ '').NORNO                               PM0051 48050020
         AIF   ('&NO'(1,1) NE '(').NORNO                         PM0051 48100020
         STC   &NO(1),14(0,1)          STORE NUMBER OF LABELS    PM0051 48150020
.NORNO   AIF   ('&LABELA' NE '').CKLAB                           PM0051 48200020
         AIF   ('&LABEL' EQ '').SVC                              PM0051 48250020
         AIF   ('&LABEL'(1,1) NE '(').SVC                        PM0051 48300020
         ST    &LABEL(1),16(0,1)       STORE VOL PRINT LABEL     PM0051 48350020
         AGO   .SVC                                              PM0051 48400020
.CKLAB   AIF   ('&LABELA'(1,1) NE '(').SVC                       PM0051 48450020
         ST    &LABELA(1),16(0,1)      STORE VOL PRINT LABEL     PM0051 48500020
.SVC     SVC   39                      LABEL SVC                        48600020
.MEXIT   MEXIT                                                          49200020
.NINE    ANOP                                                           49800020
         AIF   (K'&CNTRL EQ 1).BNINE                                    50400020
         AIF   ('&CNTRL'(2,1) NE 'D').E7                                51000020
         AIF   (&A LT 2 OR &A GT 3).E7                                  51600020
&B(1)    SETB  1                                                        52200020
&B(2)    SETB  1                                                        52800020
&B(5)    SETB  (&A EQ 2)                                                53400020
         AGO   .PUT                                                     54000020
.BNINE   ANOP                                                           54600020
&B(5)    SETB  1                                                        55200020
.CONV    ANOP                                                           55800020
&B(4)    SETB  1                                                        56400020
         AGO   .PUT                                                     57000020
.BOTH    AIF   ('&LNGTH'(1,1) EQ '(' OR '&NO'(1,1) EQ '(').ELN          57600020
         B     *+8                     BRANCH AROUND CONSTANTS          58200020
         DC    AL2(&LNGTH)             LABEL LENGTH                     58800020
         DC    AL1(&NO)                NUMBER OF LABELS                 59400020
         MVC   12(3,1),*-4             MOVE CONSTANTS TO LIST           60000020
         AGO   .EUNLR                                            PM0051 60300020
.EROUT   ANOP                                                           61200020
         AIF   (N'&MF NE 2).E                                           61800020
&NAME    IHBINNRA  &MF(2)                                               62400020
         AIF   ('&UNIT' EQ '').EDD                                      63000020
         AIF   ('&UNIT'(1,1) EQ '(').EUREG                              63600020
         LA    14,&UNIT.(0,0)          GET UNIT NUMBER                  64200020
         STC   14,3(0,1)               STORE UNIT NUMBER                64800020
         AGO   .EDD                                                     65400020
.EUREG   ST    &UNIT(1),3(0,1)         STORE UNIT NUMBER                66000020
.EDD     AIF   ('&DDNAME' EQ '').ELAB                                   66600020
         AIF   ('&DDNAME'(1,1) EQ '(').EDDREG                           67200020
         LA    14,&DDNAME              GET DDNAME ADDRESS               67800020
         ST    14,4(0,1)               STORE ADDRESS IN LIST            68400020
         AGO   .ELAB                                                    69000020
.EDDREG  ST    &DDNAME(1),4(0,1)       STORE DDNAME ADDRESS             69600020
.ELAB    AIF   ('&LABEL' EQ '').ELNO                                    70200020
         AIF   ('&LABEL'(1,1) EQ '(').ELBREG                            70800020
         LA    14,&LABEL               LOAD LABEL ADDRESS               71400020
         ST    14,8(0,1)               STORE ADDRESS IN LIST            72000020
         AGO   .ELNO                                                    72600020
.ELBREG  ST    &LABEL(1),8(0,1)        STORE VOLUME LABEL ADDRESS       73200020
.ELNO    AIF   ('&LNGTH' NE '' AND '&NO' NE '').BOTH                    73800020
.ELN     AIF   ('&LNGTH' EQ '').ENO                                     74400020
         AIF   ('&LNGTH'(1,1) EQ '(').ELNREG                            75000020
         B     *+6                     BRANCH AROUND CONSTANTS          75600020
         DC    AL2(&LNGTH)             LABEL LENGTH                     76200020
         MVC   12(2,1),*-2             MOVE LENGTH TO LIST              76800020
         AGO   .ENO                                                     77400020
.ELNREG  STH   &LNGTH(1),12(0,1)       STORE LABEL LENGTH               78000020
.ENO     AIF   ('&NO' EQ '').EUNL                                       78600020
         AIF   ('&NO'(1,1) EQ '(').ENOREG                               79200020
         B     *+6                     BRANCH AROUND CONSTANTS          79800020
         DC    AL1(&NO)                NUMBER OF LABELS                 80400020
         MVC   14(1,1),*-2             MOVE NUMBER OF LABELS TO LIST    81000020
         AGO   .EUNL                                                    81600020
.ENOREG  STC   &NO(1),14(0,1)          STORE NUMBER OF LABELS           82200020
.EUNL    AIF   ('&LABELA' EQ '').EUNLR                           PM0051 82270020
         AIF   ('&LABELA'(1,1) EQ '(').EUNLOD                    PM0051 82340020
         LA    14,&LABELA              LOAD LABEL ADDRESS        PM0051 82410020
         ST    14,16(0,1)              STORE LABEL ADDRESS       PM0051 82480020
         AGO   .EUNLR                                            PM0051 82550020
.EUNLOD  ST    &LABELA(1),16(0,1)      STORE LABEL ADDRESS       PM0051 82620020
.EUNLR   AIF   ('&UNLOAD' EQ '').ECODE                           PM0051 82690020
         AIF   (&BB).EOK                                                82800020
         AIF   ('&UNLOAD' EQ 'REWIND').EREW                             83400020
         IHBERMAC 157,UNLOAD,&UNLOAD                                    84000020
         AGO   .ECODE                                                   84600020
.EREW    MVI   2(1),4                  INDICATE REWIND                  85200020
         AGO   .ECODE                                                   85800020
.EOK     OI    2(1),2                  INDICATE UNLOAD                  86400020
.ECODE   AIF   ('&CNTRL' EQ '').SVC                                     87000020
         AGO   .CODE                                                    87600020
.E1      IHBERMAC 2                    FIRST OPERAND MISSING            88200020
         MEXIT                                                          88800020
.E2      IHBERMAC 3                    FIRST OPERAND MISSING            89400020
         MEXIT                                                          90000020
.E3      IHBERMAC 4                    FIRST OPERAND MISSING            90600020
         MEXIT                                                          91200020
.E4      IHBERMAC 5                    FIRST OPERAND MISSING            91800020
         MEXIT                                                          92400020
.E5      IHBERMAC 14                   FIRST OPERAND MISSING            93000020
         MEXIT                                                          93600020
.E6      IHBERMAC 17                   MODE OPERAND MISSING             94200020
         MEXIT                                                          94800020
.E7      IHBERMAC 45,,&CNTRL                                            95400020
         MEXIT                                                          96000020
.E       IHBERMAC 35,,&MF                                               96600020
         MEND                                                           97200020
