./  ADD  SSI=60230646,NAME=AQCTL
         MACRO                                                          10000020
         AQCTL                                                          20000020
         SVC   102 .                    TCAM CROSS-PARTITION            30000020
*                                       COMMUNICATIONS ROUTINE          40000020
         MEND                                                           50000020
./  ADD  SSI=71310499,NAME=EWTCMAP
*@LIST PUSH;                                                            00600006
*@LIST OFF ;                                                            01200006
* /*                                                                    01800006
         MACRO                                                          02400006
         EWTCMAP                                                        03000006
         SPACE 1                                                        03600006
****************************************************************        04200006
*                                                              *        04800006
*    THIS DSECT DESCRIBES THE TELECOMMUNICATIONS ACCESS METHOD *        05400006
*    DEVICE DEPENDENT SECTION OF THE ERP WORKAREA. IT IS       *        06000006
*    INVOKED BY IECDERWA IF EWTC IS SPECIFIED AS AN OPTION ON  *        06600006
*    THE MACRO CALL.                                           *        07200006
*                                                              *        07800006
*   OS/VS2 RELEASE 2,4/1/73,LEVEL=01                           *        08400006
*                                                              *        09000006
****************************************************************        09600006
         SPACE 1                                                        10200006
EWTCADDR EQU *                                                          10800006
EWTCSNS  DS    AL2                      SENSE INFORMATION               12000006
EWTCTID  DS    AL2                      TERMINAL IDENTIFICATION         12600006
*                                       CHARACTERS                      13200006
*********************************************************************** 13800006
*        START OF DEVICE DEPENDENT INFORMATION FOR OBR/SDR            * 14400006
*********************************************************************** 15000006
EWTCSIO  DS    AL2                      COUNT OF START I/O COMMANDS FOR 15600006
*                                       LINE OR STATION                 16200006
EWTCTMP  DS    AL1                      COUNT OF TEMPORARY ERRORS FOR   16800006
*                                       LINE OR STATION                 17400006
EWTCMSK  DS    AL1                      LINE OR STATION RECORDING ERROR 18000006
*                                       MASK                            18600006
EWTCTPL  DS    AL1                      TP OP-CODE OF LAST INTERRUPTED  19200006
*                                       I/O OPERATION                   19800006
EWTCTPF  DS    AL1                      TP OP-CODE OF FIRST INTERRUPTED 20400006
*                                       I/O OPERATION                   21000006
EWTCFLG  DS    AL1                      OBR/SDR FLAG BYTE               21600006
*                  BIT DEFINITIONS                                      22200006
EWTCTEM  EQU   X'80'                    TEMPORARY ERROR                 22800006
EWTCOVF  EQU   X'40'                    COUNTER OVERFLOW                23400006
EWTCEOD  EQU   X'20'                    END-OF-DAY RECORDING            24000006
EWTCSEL  EQU   X'10'                    INITIAL SELECTION ERROR         24600006
EWTCGRA  DS    AL1                      GRAPHIC RESPONSE CHARACTER      25200006
EWTCTRM  DS    CL8                      TERMINAL OR UCB NAME            25800006
EWTCSNL  DS    AL1                      SENSE OF LAST INTERRUPTED I/O   26400006
*                                       OPERATION.                      27000006
EWTCSNF  DS    AL1                      SENSE OF FIRST INTERRUPTED I/O  27600006
*                                       OPERATION.                      28200006
*********************************************************************** 28800006
*        END OF DEVICE DEPENDENT INFORMATION FOR OBR/SDR              * 29400006
*********************************************************************** 30000006
EWTCRSV1 DS    AL2                      RESERVED                        30600006
EWTCRSV2 DS    AL1                      RESERVED                        31200006
EWTCCSW  DS    XL7                      INTERRUPTED CSW                 31800006
EWTCCCW  DS    2A                       INTERRUPTED CCW.                32400006
EWTCBUFF DS    A                        ADDRESS OF TPER BUFFER FOR MDR  32600006
EWTCEND  EQU   *                                                        32800006
*                                                                       33000006
*********************************************************************** 33600006
*   0  *   EWTCSNS                     *   EWTCTID                    * 34200006
*********************************************************************** 34800006
*   4  *   EWTCSIO                     *   EWTCTMP     *   EWTCMSK    * 35400006
*********************************************************************** 36000006
*   8  *   EWTCTPL     *   EWTCTPF     *   EWTCFLG     *   EWTCGRA    * 36600006
*********************************************************************** 37200006
*  12  *                               EWTCTRM                        * 37800006
*********************************************************************** 38400006
*  16  *                                                              * 39000006
*********************************************************************** 39600006
*  20  *   EWTCSNL     *   EWTCSNF     *   EWTCRSV1                   * 40200006
*********************************************************************** 40800006
*  24  *   EWTCRSV2    *               EWTCCSW                        * 41400006
*********************************************************************** 42000006
*  28  *                                                              * 42600006
*********************************************************************** 43200006
*  32  *                               EWTCCCW                        * 43800006
*********************************************************************** 44400006
*  36  *                                                              * 45000006
*********************************************************************** 45600006
*  40  *                               EWTCBUFF                       * 45800006
*********************************************************************** 46000006
         MEND                                                           46200006
* */                                                                    46800006
*@LIST POP;                                                             47400006
*                                                                       48000006
* /************************************************************/        48600006
* /*                                                          */        49200006
* /*   THIS STRUCTURE DESCRIBES THE TELECOMMUNICATIONS ACCESS */        49800006
* /*   METHOD DEVICE DEPENDENT SECTION OF THE ERP WORKAREA. IT*/        50400006
* /*   IS INVOKED BY IECDERWA IF EWTC IS SPECIFIED AS AN      */        51000006
* /*   OPTION ON THE MACRO CALL.                              */        51600006
* /*                                                          */        52200006
* /*   OS/VS2 RELEASE2,4/1/73,LEVEL=01                        */        52800006
* /*                                                          */        53400006
* /************************************************************/        54000006
*                                                                       54600006
         DCL 1 EWTCADDR CHAR(44) BASED(ADDR(EWAIERP)) BDY(DWORD),       55200006
*            2 EWTCSNS FIXED (16),     /* SENSE INFORMATION          */ 55800006
*            2 EWTCTID FIXED (16),     /* TERMINAL IDENTIFICATION    */ 56400006
*                                      /* CHARACTERS.                */ 57000006
* /*******************************************************************/ 57600006
* /*         START OF DEVICE DEPENDENT INFORMATION FOR OBR/SDR       */ 58200006
* /*******************************************************************/ 58800006
*            2 EWTCSIO FIXED (16),     /* COUNT OF START I/O COMMANDS*/ 59400006
*                                      /* FOR LINE OR STATION        */ 60000006
*            2 EWTCTMP FIXED  (8),     /* COUNT OF TEMPORARY ERRORS  */ 60600006
*                                      /* FOR LINE OR STATION        */ 61200006
*            2 EWTCMSK FIXED  (8),     /* LINE OR STATION RECORDING  */ 61800006
*                                      /* ERROR MASK                 */ 62400006
*            2 EWTCTPL FIXED  (8),     /* TP OP-CODE OF LAST         */ 63000006
*                                      /* INTERRUPTED I/O OPERATION  */ 63600006
*            2 EWTCTPF FIXED  (8),     /* TP OP-CODE OF FIRST        */ 64200006
*                                      /* INTERRUPTED I/O OPERATION  */ 64800006
*            2 EWTCFLG FIXED  (8),     /* OBR/SDR FLAG BYTE          */ 65400006
*              3 EWTCTEM BIT(1),       /* TEMPORARY ERROR            */ 66000006
*              3 EWTCOVF BIT(1),       /* COUNTER OVERFLOW           */ 66600006
*              3 EWTCEOD BIT(1),       /* END-OF-DAY RECORDING       */ 67200006
*              3 EWTCSEL BIT(1),       /* INITIAL SELECTION ERROR    */ 67800006
*            2 EWTCGRA FIXED  (8),     /* GRAPHIC RESPONSE           */ 68400006
*                                      /* CHARACTER.                 */ 69000006
*            2 EWTCTRM CHAR   (8),     /* TERMINAL OR UCB NAME       */ 69600006
*            2 EWTCSNL FIXED  (8),     /* SENSE OF LAST INTERRUPTED  */ 70200006
*                                      /* I/O OPERATION              */ 70800006
*            2 EWTCSNF FIXED  (8),     /* SENSE OF FIRST INTERRUPTED */ 71400006
*                                      /* I/O OPERATION              */ 72000006
*            2 EWTCRSV1 FIXED (16),    /* RESERVED                   */ 72600006
* /*******************************************************************/ 73200006
* /*         END OF DEVICE DEPENDENT INFORMATION FOR OBR/SDR         */ 73800006
* /*******************************************************************/ 74400006
*            2 EWTCRSV2 FIXED  (8),    /* RESERVED                   */ 75000006
*            2 EWTCCSW  CHAR (7),      /* INTERRUPTED CSW.           */ 75600006
*            2 EWTCCCW CHAR(8),        /* INTERRUPTED CCW.           */ 76200006
             2 EWTCBUFF CHAR(4),       /* ADDRESS OF TPER BUFFER     */ 76400006
*                                      /*  FOR MDR                   */ 76600006
* /*******************************************************************/ 76800006
* /*  0  *   EWTCSNS                   *   EWTCTID                   */ 77400006
* /*******************************************************************/ 78000006
* /*  4  *   EWTCSIO                   *   EWTCTMP    *  EWTCMSK     */ 78600006
* /*******************************************************************/ 79200006
* /*  8  *   EWTCTPL    *   EWTCTPF    *   EWTCFLG    *  EWTCGRA     */ 79800006
* /*******************************************************************/ 80400006
* /* 12  *                         EWTCTRM                           */ 81000006
* /*******************************************************************/ 81600006
* /* 16  *                                                           */ 82200006
* /*******************************************************************/ 82800006
* /* 20  *   EWTCSNL    *   EWTCSNF    *   EWTCRSV1                  */ 83400006
* /*******************************************************************/ 84000006
* /* 24  *   EWTCRSV2   *          EWTCCSW                           */ 84600006
* /*******************************************************************/ 85200006
* /* 28  *                                                           */ 85800006
* /*******************************************************************/ 86400006
* /* 32  *                         EWTCCCW                           */ 87000006
* /*******************************************************************/ 87600006
* /* 36  *                                                           */ 88200006
* /*******************************************************************/ 88800006
* /* 40  *                         EWTCBUFF                          */ 89000006
* /*******************************************************************/ 89200006
*            2 EWTCEND CHAR(0);        /* END OF EWTC                */ 89400006
./  ADD  SSI=60240063,NAME=IEDCBDA
         MACRO                                                          03000010
         IEDCBDA                                                        06000010
* IEDCBDA MACRO UPDATED 4/27/72                                         09000010
*                                                                       12000010
*        THIS IS A DSECT OF THE COMMON BUFFER DATA AREA                 15000010
*                                                                       18000010
IEDCBDA  DSECT                                                          21000010
CBDAINDX DS    XL1 .                    INDEX BYTE                      24000010
CBDAADDR DS    AL3 .                    POINTER TO DATA IN THIS AREA    27000010
CBDALEN  DS    H .                      LENGTH OF DATA IN THIS AREA     30000010
CBDAUSCT DS    H .                      NO OF LCBS USING THIS AREA      33000010
CBDAFLG1 DS    XL1 .                    FLAG BYTE 1                     36000010
CBDAINUS EQU   X'01'                    DATA IN USE                     39000010
CBDAFLG2 DS    XL1 .                    FLAG BYTE 2                     42000010
         DC    H'0' .                   RESERVED                        45000010
CBDASIZE EQU   *                                                        48000010
CBDPRFSZ EQU   CBDASIZE-CBDAINDX                                        51000010
         MEND                                                           54000010
./  ADD  SSI=91240390,NAME=IEDCMB
         MACRO                                                          02000022
         IEDCMB                                                         04000022
* IEDCMB MACRO UPDATED 5/15/72                                          06000022
IEDCMB   DSECT                                                          08000022
*                                                                       10000022
*        THIS IS A DSECT OF THE MASTER QCB FOR COMMON BUFFER            12000022
*        TRANSMISSION.                                                  14000022
*                                                                       16000022
CMBFLAG1 DS    XL1 .                    FLAG BYTE                       18000022
CMBSTCB  DS    AL3 .                    ADDRESS OF FIRST STCB           20000022
CMBPRI   DS    XL1 .                    PRIORITY                        22000022
CMBLINK  DS    AL3 .                    POINTER TO NEXT STCB IN CHAIN   24000022
CMBSTVTO DS    XL1 .                    INDEX TO ENTRY IN THE SUBTASK   26000022
*                                         VECTOR TABLE                  28000022
CMBRETRN DS    AL3 .                    RESERVED                        30000022
CMBDAREA DS    H .                      NUMBER OF DATA AREAS            32000022
CMBASTCB DS    H .                      NUMBER OF AVAILABLE STCB'S      34000022
CMBFINDX DS    XL1 .                    INDEX TO FIRST DATA AREA        36000022
*                                         PREFIX                        37000022
CMBFIRST DS    AL3 .                    ADDRESS OF FIRST DATA AREA      38000022
*                                         PREFIX                        39000022
CMBLINDX DS    XL1 .                    INDEX TO LAST DATA AREA         40000022
*                                         PREFIX                        41000022
CMBLAST  DS    AL3 .                    ADDRESS OF LAST DATA AREA       42000022
*                                         PREFIX                        43000022
CMBNINDX DS    XL1 .                    INDEX TO NEXT DATA AREA         44000022
*                                         PREFIX                        45000022
CMBNEXT  DS    AL3 .                    ADDRESS OF NEXT DATA AREA       46000022
*                                         PREFIX                        47000022
         DS    H .                      RESERVED                        48000022
CMBSIZE  DS    H .                      DATA AREA SIZE                  50000022
*                                                                       52000022
*    DEC                                                                54000022
*         *******************************************************       56000022
*     0   *  FLAG1   **                  STCB                   *       58000022
*         *******************************************************       60000022
*     4   *  PRI     **                  LINK                   *       62000022
*         *******************************************************       64000022
*     8   *  STVTO   **                  RETRN                  *       66000022
*         *******************************************************       68000022
*    12   *          DAREA          **          ASTCB           *       70000022
*         *******************************************************       72000022
*    16   *  FINDX   **                  FIRST                  *       74000022
*         *******************************************************       76000022
*    20   *  LINDX   **                  LAST                   *       78000022
*         *******************************************************       80000022
*    24   *  NINDX   **                  NEXT                   *       82000022
*         *******************************************************       84000022
*    28   *                         **          SIZE            *       86000022
*         *******************************************************       88000022
         MEND                                                           90000022
./  ADD  SSI=62230006,NAME=IEDQMSG
         MACRO                                                          00800010
&NAME    IEDQMSG   &MSGID=,&FUNCT=,&INBUF=,&LINK=,&INCNT=,&MSG=,&RET=, X01600010
               &RETREG=R14,&PREG1=PARMREG1,&PREG0=PARMREG0,            X02400010
               &OTBUF=,&OTCNT=                                          03200010
         LCLB      &ID,&FN,&OCT,&IBF,&OBF,&MG,&LN,&RT,&ICT              04000010
         LCLC      &FLAGS,&FLAGS1,&REPCNT,&RETURN                       04800010
*                                                                       05600010
*        TOTE MESSAGE CALL MACRO                                        06400010
*                                                                       07200010
*        STATUS = VERSION 10.0                                 @Y17XAUU 08000010
*                                                                       08800010
&ID      SETB      (T'&MSGID NE 'O')                                    09600010
&FN      SETB      (T'&FUNCT NE 'O')                                    10400010
&ICT     SETB      (T'&INCNT NE 'O')                                    11200010
&IBF     SETB      (T'&INBUF NE 'O')                                    12000010
&OBF     SETB      (T'&OTBUF NE 'O')                                    12800010
&MG      SETB      (T'&MSG NE 'O')                                      13600010
&RT      SETB      (T'&RET NE 'O')                                      14400010
&LN      SETB      (T'&LINK NE 'O')                                     15200010
&OCT     SETB      (T'&OTCNT NE 'O')                                    16000010
         AIF       (&ID+&MG+&OBF GT 1).MGER010                          16800010
         AIF       (&OCT+&OBF EQ 1).MGER030                             17600010
         AIF       (&ID+&MG+&OBF EQ 0).BYP010                           18400010
         AIF       (&FN NE 1).MGER040                                   19200010
.BYP010  ANOP                                                           20000010
         AIF       (&ID+&MG+&OBF+&LN EQ 0).MGER050                      20800010
         AIF       (&RT EQ 0).BYP020                                    21600010
         AIF       (&ID+&MG+&OBF EQ 0).MGER060                          22400010
.BYP020  ANOP                                                           23200010
         AGO       .CONT010                                             24000010
.MGER010 ANOP                                                           24800010
         MNOTE 12,'ONLY ONE PARM FROM MSGID, MSG AND OTBUF ALLOWED'     25600010
         MEXIT                                                          26400010
.MGER030 ANOP                                                           27200010
         MNOTE 12,'OTBUF AND OTCNT MUST ALWAYS APPEAR TOGETHER'         28000010
         MEXIT                                                          28800010
.MGER040 ANOP                                                           29600010
         MNOTE 12,'FUNCT MUST BE SPECIFIED WITH MSGID,MSG OR OTBUF'     30400010
         MEXIT                                                          31200010
.MGER050 ANOP                                                           32000010
         MNOTE 12,'MSGID,MSG,OTBUF OR LINK MUST BE SPECIFIED'           32800010
         MEXIT                                                          33600010
.MGER060 ANOP                                                           34400010
         MNOTE 12,'RET MUST APPEAR WITH MSGID,MSG OR OTBUF'             35200010
         MEXIT                                                          36000010
.CONT010 ANOP                                                           36800010
&RETURN  SETC      '$MRT&SYSNDX'                                        37600010
         AIF   (T'&RET EQ 'O').BYP060                                   38400010
&RETURN  SETC  '&RET'                                                   39200010
.BYP060  ANOP                                                           40000010
         AIF   (&ID+&OBF+&MG EQ 0).BYP250                               40800010
         AIF   (N'&FUNCT EQ 0).BYP130                                   41600010
&REPCNT  SETC      '0'                                                  42400010
         AIF   (T'&INCNT EQ 'O').BYP120                                 43200010
&REPCNT  SETC      '&INCNT'                                             44000010
.BYP120  ANOP                                                           44800010
&FLAGS   SETC      '$&FUNCT(1)'                                         45600010
         AIF   (N'&FUNCT EQ 1).BYP180                                   46400010
         AIF   (N'&FUNCT EQ 2).BYP160                                   47200010
.BYP130  ANOP                                                           48000010
         MNOTE 12,'MISSING OR INVALID FUNCT= OPERAND'                   48800010
         MEXIT                                                          49600010
.BYP160  ANOP                                                           50400010
&FLAGS1  SETC      '$&FUNCT(2)'                                         51200010
.BYP180  ANOP                                                           52000010
&NAME    DS    0H .               TOTE MESSAGE CALL                     52800010
         LA    &PREG0,&RETURN .        GET RETURN ADDRESS               53600010
         BAL   &PREG1,$MSGLINK .        BRANCH TO LINKAGE SUBROUTINE    54400010
         AIF   (T'&MSGID EQ 'O').BYP190                                 55200010
         DC    AL2(&MSGID) .         MESSAGE IDENTIFIER                 56000010
         AGO   .BYP195                                                  56800010
.BYP190  ANOP                                                           57600010
         DC    XL2'8000' .        INDICATES MESSAGE IS SUPPLIED         58400010
* .                                 IN PARAMETER LIST                   59200010
.BYP195  ANOP                                                           60000010
         AIF   (N'&FUNCT EQ 2).BYP200                                   60800010
         DC    AL1(&FLAGS) .         FUNCTION FLAGS                     61600010
         AGO   .BYP210                                                  62400010
.BYP200  ANOP                                                           63200010
         DC    AL1(&FLAGS+&FLAGS1) .  FUNCTION FLAGS           @Y17XAUU 64000010
.BYP210  ANOP                                                           64800010
         DC    AL1(&REPCNT) .            REPLY BUFFER LENGTH            65600010
         AIF   (T'&OTBUF EQ 'O').BYP230                                 66400010
         DC    AL1(&OTCNT) .           OUT MESSAGE LENGTH               67200010
         DC    AL3(&OTBUF) .       OUT MESSAGE ADDRESS                  68000010
         AGO   .BYP240                                                  68800010
.BYP230  ANOP                                                           69600010
         AIF   (T'&MSG EQ 'O').BYP240                                   70400010
         DC    AL1($MG&SYSNDX.E-$MSG&SYSNDX.) . OUT MESSAGE LENGTH      71200010
         DC    AL3($MSG&SYSNDX.) .    OUT MESSAGE ADDRESS               72000010
$MSG&SYSNDX DC    C&MSG                                                 72800010
$MG&SYSNDX.E DS    0C                                                   73600010
.BYP240  ANOP                                                           74400010
.BYP250  ANOP                                                           75200010
         AIF   (T'&LINK EQ 'O').BYP450                                  76000010
$MSGLINK DS    0H .               LINK ROUTINE FOR TOTE MSG CALL        76800010
         AIF   ('&LINK' EQ 'XCTL').BYP350                               77600010
         LINK  EP=IEDQWK .        LINK TO TOTE MESSAGE MODULE           78400010
         LR    &RETREG,&PREG0 .          GET RETURN ADDRESS             79200010
         BR    &RETREG .              BRANCH TO RETURN POINT            80000010
         AGO   .BYP370                                                  80800010
.BYP350  ANOP                                                           81600010
         XCTL  (2,12),EP=IEDQWM2 .      GO TO TOTE TRACE MODULE  S99528 82400010
.BYP370  ANOP                                                           83200010
*                                                                       84000010
$CEC     EQU   X'80' .            CONTROL TERMINAL MESSAGE FLAG         84800010
$REP     EQU   X'40' .            C.T. MESSAGE WITH REPLY FLAG          85600010
$PRT     EQU   X'20' .            PRINTER MESSAGE FLAG                  86400010
$SRC     EQU   X'10' .            SOURCE MESSAGE FLAG          @Y17XAUU 87200010
.BYP450  ANOP                                                           88000010
$MRT&SYSNDX DS    0H .                RETURN ADDRESS                    88800010
         MEND                                                           89600010
./  ADD  SSI=72000074,NAME=IOBLOCKS
*        %GOTO PLSIOBK;           /* BILINGUAL HEADER                   00400000
         MACRO                                                          00900020
         IOBLOCKS                                                       01800020
*                                                                       02700020
*        I/O CONTROL BLOCKS  (ECB,TECB ADDRESS,IOB,DCB)                 03600022
*                                                                       03900022
*        VERSION 10.0 (TCAM,TOTE)                              @Y17XAXU 04100000
*                                                                       04500020
IOBLOCKS DSECT                                                          05400020
*                                                                       06300020
*        EVENT CONTROL BLOCK                                            07200020
*                                                                       08100020
ECBOLT   DS    F .                EVENT CONTROL BLOCK                   09000000
*                                                                       09050022
*        UNIT CONTROL BLOCK ADDRESS                                     09100022
*                                                                       09150022
OLTUCBA  DS    AL2 .              UCB ADDRESS                           09160000
*                                                                       09170022
*        TERMINAL NAME TABLE ENTRY OFFSET                               09180022
*                                                                       09190022
OLTTCOFF DS    H .                C. TNT ENTRY OFFSET          @Y17XAXU 09195000
OLTTNOFF DS    H .                REAL TNT ENTRY OFFSET        @Y17XAXU 09200000
OLTTRSID DS    H                  NETWORK ADDRESS              @Y17XAXU 09220000
*                                                                       09250022
*        TCAM RELATIVE LINE NUMBER                                      09300022
*                                                                       09350022
OLTTCRLN DS    C .                RLN                                   09400000
OLTLCBA  DS    AL3 .              LCB ADDRESS OF 3705          @Y17XAXU 09420000
*                                                                       09450022
OLTTCTNT DS    F .                C. TNT ENTRY ADDRESS         @Y17XAXU 09470000
OLTRLTNT DS    A                  REAL TNT ENTRY ADDRESS       @Y17XAXU 09500000
OLTTDLN  DS    H .                LENGTH OF TD TTE AREA        @Y17XAXU 09508000
OLTFLAG1 DS    C .                TEST DEVICE FLAG BYTE        @Y17XAXU 09516000
OLTTNTAS EQU   X'80'              TOTE TNT ENTRY ASSIGNED      @Y17XAXU 09524000
OLTPRSC  EQU   X'20'              ON=PRI TD, OFF=SEC TD        @Y17XAXU 09525000
OLTUNRD  EQU   X'10'              ON=UNREAD DATA               @Y17XAXU 09526000
*                                 OFF=NO UNREAD DATA           @Y17XAXU 09527000
OLTEX    EQU   X'08'              EXCEPTION RESPONSE           @Y17XAXU 09528000
OLTFME   EQU   X'04'              DEFINITE RESPONSE            @Y17XAXU 09529000
OLTEN    EQU   X'02'              ON=EXPEDITED,OFF=NORMAL      @Y17XAXU 09530000
         DS    C                  RESERVED                     @Y17XAXU 09532000
OLTQCBA  DS    A                  QCB ADDRESS                    S22024 09580000
OLTCCWA  DS    A                  ADDRESS OF READ CCW CHAIN      S22024 09660000
OLTBUFA  DS    A                  ADDRESS OF BUFFER CONTAINING   S22024 09700000
*                                 READ DATA                      S22024 09740000
*                                                                       09807022
*        DATA BLOCKING FIELD                                            09814022
*                                                                       09821022
OLTDTBUF DS    A .                RESPONSE BUFFER ADDRESS               09828000
OLTDTCNT DS    H .                RESPONSE BUFFER SIZE                  09835000
OLTFLAG2 DS    BL1 .              DATA BLOCKING SIZE                    09842000
*                                                                       09849022
OLTPTIMD EQU   X'80' .            POST WAITIO IMMEDIATELY               09856022
OLTMVDAT EQU   X'40' .            MOVE RESPONSE TO BUFFER               09863022
OLTLV3IO EQU   X'20' .            LAST EXIO TO DEV WAS LEVEL 3          09870022
OLTSIOAC EQU   X'10' .            EXIO TO DEVICE IS OUTSTANDING         09877022
*                                                                       09884022
         DS    CL1                RESERVED                     @ZM47554 09892010
OLTSN    DS    0F                 DEVICE SEQ NUMBER FIELD      @ZM47554 09893010
         DS    CL2                FLAGS                        @ZM47554 09894010
OLTSEQ   DS    H                  SEQUENCE NUMBER (FROM SNA TH)@ZM47554 09895010
*                                                                       09900020
*        TEST EVENT CONTROL BLOCK ADDRESS                               10800020
*                                                                       11700020
TECBADDR DS    F .                ADDRESS OF TECB                       12600000
*                                                                       13500020
*        I/O BLOCK                                                      14400020
*                                                                       15300020
IOB      DS    0F                                                       16200020
*                                                                       17100020
IOBFLG1  DS    CL1                FIRST FLAG BYTE                       18000020
IOBFLG2  DS    CL1                SECOND FLAG BYTE                      18900020
IOBSNS   DS    CL2                FIRST TWO SENSE BYTES                 19800020
IOBECBAD DS    0F                 ECB ADDRESS                           20700020
IOBECBCD DS    CL1                ECB CODE                              21600020
         DS    CL3                                                      22000022
IOBCSW   DS    0F                 CHANNEL STATUS WORD                   22500020
IOBFLG3  DS    CL1                THIRD FLAG BYTE                       23400020
IOBCSW1  DS    CL7                LAST 7 BYTES OF LAST CSW.             24300020
IOBCCWAD DS    0F                 CCW ADDRESS                           25200020
IOBSIOCD DS    CL1                START I/O CODE                        26100020
         DS    CL3                                                      26500022
IOBDCBAD DS    F                  DCB ADDRESS                           27000020
IOBREPM  DS    CL1                REPOSITION MODIFIER                   27900020
IOBRSTAD DS    CL3                RESTART ADDRESS                       28800020
IOBINCR  DS    CL2                BLOCK COUNT INCREMENT                 29700020
IOBERRCT DS    CL2                ERROR COUNTS                          30600020
IOBUCBX  DS    CL1                UCB INDEX                      S99528 30930022
IOBWORK  DS    CL3                WORK AREA                      S99528 30960022
IOBFLG4  DS    CL1                FLAGS FOR TOTE & ITS APPENDAGE S99528 30990022
IOBATTN  EQU   X'80'              ATTENTION INTERRUPT EXPECTED   S99528 31020022
IOBCSWV  EQU   X'40'              CSW SAVE AREA VALID            S99528 31050022
IOBSEC   EQU   X'20'              SECONDARY IOB                  S99528 31080022
IOBPRI   EQU   X'10'              PRIMARY IOB                    S99528 31110022
IOBATNE  EQU   X'08'              ERROR ON CE/DE BEFORE ATTN     S99528 31140022
IOBCSWNV EQU   X'04'              CSW AREA TWO INVALID           S99528 31150022
IOBCSWS  DS    CL7                CSW SAVE AREA                         31170022
*                                                                       31500020
*        DATA EXTENT BLOCK ADDRESS                                      32400022
*                                                                       33300020
         ORG   IOB+44                                                   43300022
*                                                                       64800020
*        DATA CONTROL BLOCK                                             65700020
*                                                                       66600020
DCB      EQU   *                                                        68400020
*                                                                       69300020
DCBDCDEP DS    5F                 DEVICE DEPENDENT FIELD                70200020
DCBBUFNO DS    C                  NUMBER OF BUFFERS IN DATA SET         71100020
DCBBUFCB DS    CL3                BUFFER POOL CONTROL BLOCK ADDRESS     72000020
DCBBUFL  DS    H                  BUFFER LENGTH                         72900020
DCBDSORG DS    H                  DATA SET ORGANIZATION                 73800020
DCBIOBAD DS    F                  I/O BLOCK ADDRESS                     74700020
DCBBGFEK DS    C                  BUFFER TECNIQUE, BUFFER ALIGNMENT     75600020
DCBEODAD DS    CL3                END OF DATA SET ROUTINE               76500020
DCBRECFM DS    C                  RECORD FORMAT                         77400020
DCBEXLST DS    CL3                EXIT LIST                             78300020
DCBTIOT  DS    H                                                        79200020
DCBMACRF DS    H                  MACRO INSTRUCTION REFERENCE           80100020
DCBIFLGS DS    C                  I/O SUPERVISOR FLAGS                  81000020
DCBDEBAD DS    CL3                DATA EXTENT BLOCK ADDRESS             81900020
OLTDEBA  EQU   DCB+44             DEB ADDRESS                           82300022
DCBOFLGS DS    C                  OPEN FLAGS                            82800020
         DS    CL3                RESERVED                              83700020
DCBOPTCD DS    CL1                OPTION CODES                          84600020
         DS    CL7                RESERVED                              85500020
DCBEOEA  DS    H                  END OF EXTENT APPENDAGE               86400020
DCBPCIA  DS    H                  PROGRAM CONTROLLED INTERRUPT APPENDAG 87300020
DCBSIOA  DS    H                  START I/O APPENDAGE                   88200020
DCBCENDA DS    H                  CHANNEL END APPENDAGE                 89100020
DCBXENDA DS    H                  ABNORMAL END APPENDAGE                90000020
         DS    H                  RESERVED                              90900020
         MEND                                                @Y17XAXU*/ 90907000
*%PLSIOBK: ;                                                            90914000
*DECLARE                                                                90921000
*  1 IOBLOCKS BDY(WORD) BASED,    /*                         @Y17XAXU*/ 90928000
*/*                                                          @Y17XAXU*/ 90935000
*/*      I/O CONTROL BLOCKS  (ECB,TECB ADDRESS,IOB,DCB)      @Y17XAXU*/ 90942000
*/*                 VERSION 10.0 (TCAM,TOTE)                 @Y17XAXU*/ 90949000
*/*                                                          @Y17XAXU*/ 90956000
*/*      EVENT CONTROL BLOCK                                 @Y17XAXU*/ 90963000
*/*                                                          @Y17XAXU*/ 90970000
*   2 ECBOLT PTR(31),             /* EVENT CONTROL BLOCK     @Y17XAXU*/ 90977000
*/*                                                          @Y17XAXU*/ 90984000
*/*      UNIT CONTROL BLOCK ADDRESS                          @Y17XAXU*/ 90991000
*/*                                                          @Y17XAXU*/ 90998000
*   2 OLTUCBA FIXED(16),          /* UCB ADDRESS             @Y17XAXU*/ 91005000
*/*                                                          @Y17XAXU*/ 91012000
*   2 OLTTCOFF FIXED(16),         /* C. TNT ENTRY OFFSET     @Y17XAXU*/ 91019000
*   2 OLTTNOFF FIXED(16),         /* REAL TNT OFFSET         @Y17XAXU*/ 91026000
*   2 OLTTRSID FIXED(16),         /* NETWORK ADDRESS         @Y17XAXU*/ 91033000
*   2 OLTTCRLN CHAR(1),           /* RLN                     @Y17XAXU*/ 91040000
*   2 OLTLCBA PTR(24),            /* LCB ADDRESS OF 3705     @Y17XAXU*/ 91047000
*   2 OLTTCTNT PTR(31),           /* C. TNT ENTRY ADDRESS    @Y17XAXU*/ 91054000
*   2 OLTRLTNT PTR(31),           /* REAL TNT ENTRY ADDRESS  @Y17XAXU*/ 91061000
*   2 OLTTDLN FIXED(15),          /* LENGTH OF TD TTE AREA   @Y17XAXU*/ 91068000
*   2 OLTFLAG1 BIT(8),            /* TEST DEVICE FLAG BYTE 1 @Y17XAXU*/ 91075000
*    3 OLTTNTAS BIT(1),           /* TD TNT ENTRY ASSIGNED   @Y17XAXU*/ 91082000
*    3 * BIT(1),                  /* RESERVED                @Y17XAXU*/ 91089000
*    3 OLTPRSC BIT(1),            /* ON=PRI TD,OFF=SEC TD    @Y17XAXU*/ 91089700
*    3 OLTUNRD BIT(1),            /* ON=UNREAD DATA          @Y17XAUU*/ 91090400
*                                 /* OFF=NO UNREAD DATA      @Y17XAUU*/ 91091100
*    3 OLTEX BIT(1),              /* EXCEPTION RESPONSE      @Y17XAXU*/ 91091800
*    3 OLTFME BIT(1),             /* DEFINITE RESPONSE       @Y17XAXU*/ 91092500
*    3 OLTEN BIT(1),              /* ON=EXPEDITED            @Y17XAXU*/ 91093200
*                                 /* OFF=NORMAL              @Y17XAXU*/ 91093900
*    3 * BIT(1),                  /* UNUSED                  @Y17XAXU*/ 91094600
*   2 * CHAR(1),                  /* RESERVED                @Y17XAXU*/ 91096000
*   2 OLTQCBA PTR(31),            /* QCB ADDRESS             @Y17XAXU*/ 91103000
*   2 OLTCCWA PTR(31),            /* READ CCW CHAIN ADDRESS  @Y17XAXU*/ 91110000
*   2 OLTBUFA PTR(31),            /* ADDRESS OF BUFFER       @Y17XAXU*/ 91117000
*                                 /* CONTAINING READ DATA    @Y17XAXU*/ 91124000
*   2 OLTDTBUF PTR(31),           /* RESPONSE BUFFER ADDRESS @Y17XAXU*/ 91131000
*   2 OLTDTCNT FIXED(15),         /* RESPONSE BUFFER SIZE    @Y17XAXU*/ 91138000
*   2 OLTFLAG2 BIT(8),            /* TEST DEVICE FLAG BYTE 2 @Y17XAXU*/ 91145000
*    3 OLTPTIMD BIT(1),           /* POST WAITI/0 IMMEDIATELY@Y17XAXU*/ 91152000
*    3 OLTMVDAT BIT(1),           /* MOVE RESPONSE TO BUFFER @Y17XAXU*/ 91159000
*    3 OLTLV3IO BIT(1),           /* LAST EXIO WAS LEVEL 3   @Y17XAXU*/ 91166000
*    3 OLTSIOAC BIT(1),           /* EXIO TO DEVICE IS       @Y17XAXU*/ 91173000
*                                 /* OUTSTANDING             @Y17XAXU*/ 91180000
*    3 * BIT(4),                  /* RESERVED                @Y17XAXU*/ 91187000
*   2 * CHAR(1),                  /* RESERVED                @Y17XAXU*/ 91194010
*   2 OLTSN CHAR(4) BDY(WORD),    /* DEVICE SEQ NUMBER FIELD @ZM47554*/ 91195010
*     3 * CHAR(2),                /* FLAGS                   @ZM47554*/ 91196010
*     3 OLTSEQ FIXED(16),         /* SEQUENCE NUMBER (FROM SNA TH    */ 91197010
*                                   /*                       @ZM47554*/ 91198010
*   2 TECBADDR PTR(31),           /* TECB ADDRESS            @Y17XAXU*/ 91201000
*/*                                                          @Y17XAXU*/ 91208000
*/*      I/O BLOCK                                           @Y17XAXU*/ 91215000
*/*                                                          @Y17XAXU*/ 91222000
*   2 IOB BDY(WORD),              /* IOB CONTROL BLOCK       @Y17XAXU*/ 91229000
*    3 IOBFLG1 CHAR(1),           /* FIRST FLAG BYTE         @Y17XAXU*/ 91236000
*    3 IOBFLG2 CHAR(1),           /* SECOND FLAG BYTE        @Y17XAXU*/ 91243000
*    3 IOBSNS CHAR(2),            /* FIRST TWO SENSE BYTE    @Y17XAXU*/ 91250000
*    3 IOBECBAD BDY(WORD),        /* ECB ADDRESS             @Y17XAXU*/ 91257000
*     4 IOBECBCD CHAR(1),         /* ECB CODE                @Y17XAXU*/ 91264000
*     4 * CHAR(3),                /* RESERVED                @Y17XAXU*/ 91271000
*    3 IOBCSW BDY(WORD),          /* CHANNEL STATUS WORD     @Y17XAXU*/ 91278000
*     4 IOBFLG3 CHAR(1),          /* THIRD FLAG BYTE         @Y17XAXU*/ 91285000
*     4 IOBCSW1 CHAR(7),          /* LAST 7 BYTES OF LAST CSW@Y17XAXU*/ 91292000
*    3 IOBCCWAD BDY(WORD),        /* CHANNEL COMMAND WORD    @Y17XAXU*/ 91299000
*     4 IOBSIOCD CHAR(1),         /* START I/O CODE          @Y17XAXU*/ 91306000
*     4 * CHAR(3),                /* LAST 3 BYTES OF CCW     @Y17XAXU*/ 91313000
*    3 IOBDCBAD PTR(31),          /* DCB ADDRESS             @Y17XAXU*/ 91320000
*    3 IOBREPM CHAR(1),           /* REPOSITION MODIFIER     @Y17XAXU*/ 91327000
*    3 IOBRSTAD CHAR(3),          /* RESTART ADDRESS         @Y17XAXU*/ 91334000
*    3 IOBINCR CHAR(2),           /* BLOCK COUNT INCREMENT   @Y17XAXU*/ 91341000
*    3 IOBERRCT CHAR(2),          /* ERROR COUNT             @Y17XAXU*/ 91348000
*    3 IOBUCBX CHAR(1),           /* UCB INDEX               @Y17XAXU*/ 91355000
*    3 IOBWORK CHAR(3),           /* WORK AREA               @Y17XAXU*/ 91362000
*    3 IOBFLG4 BIT(8),            /* FLAGS FOR TOTE AND ITS  @Y17XAXU*/ 91369000
*                                 /* APPENDAGE               @Y17XAXU*/ 91376000
*     4 IOBATTN BIT(1),           /* ATTENTION INTERRUPT     @Y17XAXU*/ 91383000
*                                 /* EXPECTED                @Y17XAXU*/ 91390000
*     4 IOBCSWV BIT(1),           /* CSW SAVE AREA VALID     @Y17XAXU*/ 91397000
*     4 IOBSEC BIT(1),            /* SECONDARY IOB           @Y17XAXU*/ 91404000
*     4 IOBPRI BIT(1),            /* PRIMARY IOB             @Y17XAXU*/ 91411000
*     4 IOBATNE BIT(1),           /* ERROR ON CE/DE BEFORE   @Y17XAXU*/ 91418000
*                                 /* ATTENTION               @Y17XAXU*/ 91425000
*     4 IOBCSWNV BIT(1),          /* CSW AREA TWO INVALID    @Y17XAXU*/ 91432000
*     4 * BIT(2),                 /* RESERVED                @Y17XAXU*/ 91439000
*    3 IOBCSWS CHAR(7),           /* CSW SAVE AREA           @Y17XAXU*/ 91446000
*/*                                                          @Y17XAXU*/ 91453000
*/*      DATA EXTENT BLOCK                                   @Y17XAXU*/ 91460000
*/*                                                          @Y17XAXU*/ 91467000
*   2 DCB BDY(WORD),              /* DATA CONTROL BLOCK      @Y17XAXU*/ 91474000
*    3 DCBDCDEP(5) PTR(31),       /* DEVICE DEPENDENT FIELD  @Y17XAXU*/ 91481000
*    3 DCBBUFNO CHAR(1),          /* NUMBER OF BUFFERS IN    @Y17XAXU*/ 91488000
*                                 /* DATA SET                @Y17XAXU*/ 91495000
*    3 DCBBUFCB CHAR(3),          /* BUFFER POOL CONTROL BLOCK       */ 91502000
*                                 /* ADDRESS                 @Y17XAXU*/ 91509000
*    3 DCBBUFL FIXED(15),         /* BUFFER LENGTH           @Y17XAXU*/ 91516000
*    3 DCBDSORG CHAR(2),          /* DATA SET ORGANIZATION   @Y17XAXU*/ 91523000
*    3 DCBIOBAD PTR(31),          /* I/O BLOCK ADDRESS       @Y17XAXU*/ 91530000
*    3 DCBBGFEK CHAR(1),          /* BUFFER TECHNIQUE        @Y17XAXU*/ 91537000
*                                 /* BUFFER ALLIGNMENT       @Y17XAXU*/ 91544000
*    3 DCBEODAD PTR(24),          /* END OF DATASET ROUTINE  @Y17XAXU*/ 91551000
*                                 /* ADDRESS                 @Y17XAXU*/ 91558000
*    3 DCBRECFM CHAR(1),          /* RECORD FORMAT           @Y17XAXU*/ 91565000
*    3 DCBEXLST PTR(24),          /* EXIT LIST               @Y17XAXU*/ 91572000
*    3 DCBTIOT FIXED(15),         /* OFFSET FROM TIOT ORIGIN @Y17XAXU*/ 91579000
*                                 /* TO TIOELNGH FIELD IN    @Y17XAXU*/ 91586000
*                                 /* TIOT ENTRY FOR DD       @Y17XAXU*/ 91593000
*                                 /* STATEMENT ASSOCIATED    @Y17XAXU*/ 91600000
*                                 /* WITH THIS DCB           @Y17XAXU*/ 91607000
*    3 DCBMACFR CHAR(2),          /* MACRO INSTRUCTION REF   @Y17XAXU*/ 91614000
*    3 OLTDEBA PTR(31),           /* ADDRESS OF ASSOCIATED   @Y17XAXU*/ 91621000
*                                 /* DEB                     @Y17XAXU*/ 91628000
*     4 DCBIFLGS CHAR(1),         /* I/O SUPERVISOR FLAGS    @Y17XAXU*/ 91635000
*     4 DCBDEBAD PTR(24) BDY(BYTE), /* ADDRESS OF ASSOCIATED @Y17XAXU*/ 91642000
*                                 /* DEB                     @Y17XAXU*/ 91649000
*    3 DCBOFLGS CHAR(1),          /* OPEN FLAGS              @Y17XAXU*/ 91656000
*    3 * CHAR(3),                 /* RESERVED                @Y17XAXU*/ 91663000
*    3 DCBOPTCD CHAR(1),          /* OPTION CODE             @Y17XAXU*/ 91670000
*    3 * CHAR(7),                 /* RESERVED                @Y17XAXU*/ 91677000
*    3 DCBEOEA FIXED(15),         /* END OF EXTENT APPENDAGE @Y17XAXU*/ 91684000
*    3 DCBPCIA FIXED(15),         /* PCI APPENDAGE           @Y17XAXU*/ 91691000
*    3 DCBSIOA FIXED(15),         /* SIO I/O APPENDAGE       @Y17XAXU*/ 91698000
*    3 DCBCENDA FIXED(15),        /* CHANNEL END APPENDAGE   @Y17XAXU*/ 91705000
*    3 DCBXENDA FIXED(15),        /* ABNORMAL END APPENDAGE  @Y17XAXU*/ 91712000
*    3 * CHAR(2);                 /* RESERVED                @Y17XAXU*/ 91719000
*                                 /*                         @Y17XAXU*/ 91726000
*%IOBKEND: ;                      /* END OF IOBLOCKS         @Y17XAXU*/ 91733000
./  ADD  SSI=71880123,NAME=OLTCB
*%GOTO OLTCBPLS;                       /*                        S21903 00050000
         MACRO                                                          00100000
         OLTCB &DSECT=YES,&EQUATES=NO,&POINTER=NO,&CONFG=NO             00150000
.* CHANGE ACTIVITY                                                      00160010
.* A000000-999999                                              @G36XRXV 00170010
.* C165500,626000,626500,634000                                @G36XRXV 00180010
*                                                                       00200000
*        ON-LINE TEST CONTROL BLOCK                                     00250000
*                                                                       00300000
*        STATUS = VERSION 10.0                                 @Y17XAXU 00350000
*                                                                       00400000
*CHANGE ACTIVITY AS FOLLOWS:                                            00450000
TOTODISP EQU   8                                                        00500000
         AIF   ('&POINTER' NE 'YES').BYP001                             00550000
TOTOBPTR DSECT                                                          00600000
*                                                                       00650000
TOTELKEY DS    C .           OLTCB QUEUE ELEMENT KEY                    00700000
TOTELQCB DS    AL3 .         ADDRESS OF OLTCB QCB                       00750000
         DS    C .                                                      00800000
TOTELLNK DS    AL3 .         OLTCB QUEUE ELEMENT LINK FIELD             00850000
*                                                                       00900000
         AGO   .BYPASS                                                  00950000
.BYP001  ANOP                                                           01000000
         AIF   ('&DSECT' EQ 'NO').BYPASS                                01050000
TOTOLTCB DSECT                                                          01100000
         AGO   .BYPASS1                                                 01150000
.BYPASS  ANOP                                                           01200000
TOTOLTCB DS    0F                                                       01250000
.BYPASS1 ANOP                                                           01300000
*                                                                       01350000
*              SECTION CONTROL TABLE MAPPING                            01400000
*                                                                       01450000
$SCTTBLE DS    0F                                                       01500000
$ERRLPCT DS    H .           LOOP ON ERROR COUNT                        01550000
*                                                                       01600000
$TESTOPT DS    C .           TEST OPTION FIELD                          01650000
*                                                                       01700000
$NOPRT   EQU   X'04' .            NO PRINT OPTION FLAG                  01750000
$INDEFLP EQU   X'02' .            INDEFINITE ERROR LOOP FLAG            01800000
$FSTCOMM EQU   X'01' .            FIRST ERROR COMMUNICATION FLAG        01850000
*                                                                       01900000
$ERROPT  DS    C .           ERROR AND OPTION FIELD                     01950000
*                                                                       02000000
$TESTERR EQU   X'80' .            TEST ERROR FLAG                       02050000
$ASTERIK EQU   X'40' .            PRINT ASTERIK ON TERMINATE MSG FLAG   02100000
$CATERR  EQU   X'20' .            CATASTROPHIC ERROR FLAG               02150000
$ALTPRNT EQU   X'10' .            ALTERNATE PRINTER OPTION FLAG         02200000
$NOCNTRL EQU   X'08' .            NO CONTROL PRINT OPTION FLAG          02250000
$NERRPRT EQU   X'04' .            NO ERROR PRINT OPTION FLAG            02300000
$LOOPERR EQU   X'02' .            LOOP ON ERROR OPTION FLAG             02350000
$LOOPTST EQU   X'01' .            LOOP ON TEST ENTRY OPTION FLAG        02400000
*                                                                       02450000
$RT0108  DS    C .           ROUTINE MASK 1 THRU 8                      02500000
$RT0916  DS    C .           ROUTINE MASK 9 THRU 16                     02550000
$DRIVER  DS    C .           DRIVER IDENTIFICATION                      02600000
*                                                                       02650000
$TOTE    EQU   X'8A' .            TOTE ID                      @Y17XAXU 02700000
*                                                                       02750000
$SPARE1  DS    C .           UNUSED                                     02800000
$TSSSYM  DS    H .           RESERVED FOR TSS                           02850000
$PDEVFLG DS    C .           PRIMARY DEVICE FLAGS                       02900000
*                                                                       02950000
$FPMOLD  EQU   X'80' .            FILE PROTECT FLAG                     03000000
$EXFILPT EQU   X'40' .            ADDITIONAL FILE PROTECT FLAG          03050000
$TSSSYS1 EQU   X'20' .            RESERVED FOR TSS                      03100000
$LASTDEV EQU   X'10' .            LAST DEVICE OF SUBSYSTEM FLAG         03150000
*        EQU   X'08' .            SPARE                                 03200000
$TERMNDX EQU   X'04' .            RESERVED FOR TSS                      03250000
$PATHDEF EQU   X'02' .            RESERVED FOR TSS                      03300000
$LASTSUB EQU   X'01' .            LAST DEVICE OF LAST SUBSYSTEM FLAG    03350000
*                                                                       03400000
$CDSFLGS DS    C .           DEVICE FLAGS FROM CDS FLAG BYTE            03450000
*                                                                       03500000
$FPM     EQU   X'80' .            FILE PROTECT FLAG                     03550000
$SHARED  EQU   X'40' .            SHARED DEVICE FLAG                    03600000
$CEVOL   EQU   X'20' .            CE VOLUME FLAG                        03650000
$EXTINTC EQU   X'10' .            DEV ADDR ASSOCIATED WITH EXT FLAG     03700000
$SYMNAME EQU   X'08' .            SYMBOLIC NAME FLAG                    03750000
$TWOCHSW EQU   X'04' .            TWO CHANNEL SWITCH FLAG               03800000
$CUSTSYM EQU   X'02' .            CUSTOMER ASSIGNED SYMBOLIC            03850000
*                                   NAME FLAG                           03900000
$COMMCN  EQU   X'01' .            LINE CONNECTION REQUIRED FLAG         03950000
*                                                                       04000000
$PDEVADR DS    F .           PRIMARY DEVICE ADDRESS                     04050000
$PDEVDSC DS    F .           PRIMARY DEVICE DESCRIPTORS                 04100000
$CDS8T19 DS    3F .          PRIMARY DEVICE CDS BYTES 8 THRU 19         04150000
$RMSKCNT DS    C .           ROUTINE MASK COUNT LENGTH                  04200000
$EXECFLG DS    C .           EXECUTIVE PROGRAM FLAGS                    04250000
*                                                                       04300000
$CECCMIN EQU   X'80' .            REPLY IN TO OUTSTANDING CECOM FLAG    04350000
$MULTDEV EQU   X'40' .            MORE THAN ONE DEVICE ENTRY FLAG       04400000
$RTNSLCT EQU   X'20' .            OPERATOR MADE ROUTINE SELECTION FLAG  04450000
$ERRCNT  EQU   X'10' .            OPERATOR SPECIFIED ERROR LOOP COUNT   04500000
$LSTPDEV EQU   X'08' .            DON'T ASSIGN MORE PRIMARY DEVICES FLG 04550000
$CLEANUP EQU   X'04' .            SECTION ENTERED FOR CLEANUP FLAG      04600000
$CTRLMOD EQU   X'02' .            CONTROL MODE AVAILABLE FLAG           04650000
$QSCTMOD EQU   X'01' .            QUIESCENT MODE AVAILABLE FLAG         04700000
*                                                                       04750000
$OLTSIZE DS    H .           OLT REGION SIZE                            04800000
$OLTFLGS DS    C .           OLT FUNCTIONAL FLAGS                       04850000
*                                                                       04900000
$MANINTV EQU   X'80' .            MANUAL INTERVENTION ROUTINE FLAG      04950000
$CLEANRT EQU   X'40' .            OLT HAS CLEANUP ROUTINE FLAG          05000000
$RETAIN  EQU   X'20' .            RETAIN IS ACTIVE FLAG                 05050000
$CONTCB  EQU   X'10' .            CONTINGENT CONNECTION BROKEN FLAG     05100000
$RETCODE EQU   X'08' .                                                  05150000
$TRACE   EQU   X'04' .                                                  05200000
$LASTSEC EQU   X'02' .            LAST SECTION SCHEDULED FLAG           05250000
*                                                                       05300000
         DS    C .           UNUSED                                     05350000
$TOTFLG1 DS    C .           TOTE 1ST FLAG BYTE                         05400000
*                                                                       05450000
$LINESHR EQU   X'80' .            LINE CAN BE SHARED FLAG               05500000
$TDATBLK EQU   X'40' .            TOTE MESSAGE BLOCKING FLAG            05550000
$TERMSEC EQU   X'20'              TRM REQUESTS TEST IN BACKUP    S22024 05600000
*                                   MODE                         S22024 05650000
$CTEQTT  EQU   X'10'              CONTROL TERMINAL AND TEST      S22024 05700000
*                                   TERMINAL ARE ON THE SAME LINES22024 05750000
*                                                                       05800000
$TOTFLG2 DS    C .           TOTE 2ND FLAG BYTE                         05850000
$R017024 DS    C .           ROUTINE MASK 017 THRU 024                  05900000
$R025032 DS    C .           ROUTINE MASK 025 THRU 032                  05950000
$R033040 DS    C .           ROUTINE MASK 033 THRU 040                  06000000
$R041048 DS    C .           ROUTINE MASK 041 THRU 048                  06050000
$R049056 DS    C .           ROUTINE MASK 049 THRU 056                  06100000
$R057064 DS    C .           ROUTINE MASK 057 THRU 064                  06150000
$R065072 DS    C .           ROUTINE MASK 065 THRU 072                  06200000
$R073080 DS    C .           ROUTINE MASK 073 THRU 080                  06250000
$R081088 DS    C .           ROUTINE MASK 081 THRU 088                  06300000
$R089096 DS    C .           ROUTINE MASK 089 THRU 096                  06350000
$R097104 DS    C .           ROUTINE MASK 097 THRU 104                  06400000
$R105112 DS    C .           ROUTINE MASK 105  THRU 112                 06450000
$R113120 DS    C .           ROUTINE MASK 113  THRU 120                 06500000
$R121128 DS    C .           ROUTINE MASK 121  THRU 128                 06550000
$R129136 DS    C .           ROUTINE MASK 129  THRU 136                 06600000
$R137144 DS    C .           ROUTINE MASK 137  THRU 144                 06650000
$R145152 DS    C .           ROUTINE MASK 145  THRU 152                 06700000
$R153160 DS    C .           ROUTINE MASK 153  THRU 160                 06750000
$R161168 DS    C .           ROUTINE MASK 161  THRU 168                 06800000
$R169176 DS    C .           ROUTINE MASK 169  THRU 176                 06850000
$R177184 DS    C .           ROUTINE MASK 177  THRU 184                 06900000
$R185192 DS    C .           ROUTINE MASK 185  THRU 192                 06950000
$R193200 DS    C .           ROUTINE MASK 193  THRU 200                 07000000
$R201208 DS    C .           ROUTINE MASK 201  THRU 208                 07050000
$R209216 DS    C .           ROUTINE MASK 209  THRU 216                 07100000
$R217224 DS    C .           ROUTINE MASK 217  THRU 224                 07150000
$R225232 DS    C .           ROUTINE MASK 225  THRU 232                 07200000
$R233240 DS    C .           ROUTINE MASK 233  THRU 240                 07250000
$R241248 DS    C .           ROUTINE MASK 241  THRU 248                 07300000
$R249255 DS    C .           ROUTINE MASK 249  THRU 255                 07350000
$RETMASK DS    C .           RETURN CODE MASK                           07400000
         DS    C .           SPARE                                      07450000
         DS    CL6           SPARE                               S05331 07500000
$MSGIDAC DS    CL2           ACTIVE OLT ID                       S05331 07550000
$TABLE   DS    F .           ADDR OF BRANCH TABLE                       07600000
$PASS    DS    F .           ADDR OF PASSON AREA                        07650000
$EXT     DS    F .           ADDRESS OF EXTERNAL DATA                   07700000
         DS    6F .          SCT EXPANSION AREA                         07750000
*                                                                       07800000
*                                                                       07850000
TOTSMGRT DS    A .           SERVICE MANAGER RETURN SAVE                07900000
TOTSAVE1 DS    18F .         OLT SUBTASK 1ST SAVE AREA                  07950000
TOTSAVE2 DS    18F .         OLT SUBTASK 2ND SAVE AREA                  08000000
TOTSAVE3 DS    18F .         OLT SUBTASK 3RD SAVE AREA                  08050000
TOTSAVE4 DS    18F .         OLT SUBTASK 4TH SAVE AREA                  08100000
TOTSAVE5 DS    18F .         OLT SUBTASK 5TH SAVE AREA                  08150000
TOTSAVE6 DS    18F .         OLT SUBTASK 6TH SAVE AREA         @Y17XAXU 08200000
TOTWOSV1 DS    F .           IEDQWO LEV 1 SAVE AREA            @Y17XAXU 08250000
TOTWOSV2 DS    F             IEDQWO LEV 2 SAVE AREA            @Y17XAXU 08300000
TOTWOSV3 DS    F .           IEDQWO LEV 3 SAVE AREA            @Y17XAXU 08350000
TOTWOSV4 DS    F .           IEDQWO LEV 4 SAVE AREA            @Y17XAXU 08400000
TOTOLTPT EQU   TOTSAVE5+44                                              08450000
TOTOLTEP EQU   TOTSAVE5+64                                              08500000
TOTSVEND DS    0C .               END OF TOTE SAVE AREAS                08550000
*                                                                       08600000
TOTBKASN DS    H .           MAIN STORAGE BLOCKS ASSIGNED TO THIS OLT   08650000
TOTBKRQD DS    H .           MAIN STORAGE BLOCKS REQUIRED BY THIS OLT   08700000
*                                                                       08750000
TOTMMSPC DS    F .           OLT UNUSED MAIN STORAGE SPACE              08800000
*                                                              @Y17XAXU 08850000
*              SOURCE TERMINAL ENTRY                           @Y17XAXU 08900000
*                                                              @Y17XAXU 08950000
TOTSRENT DS    0F .          SOURCE TERMINAL ENTRY             @Y17XAXU 09000000
TOTSROFF DS    H .                OFFSET TO SOURCE TNT ENTRY   @Y17XAXU 09050000
         DS    H .                RESERVED                     @Y17XAXU 09100000
TOTSRLCB DS    F .                SOURCE LCB ADDRESS           @Y17XAXU 09150000
*                                                                       09200000
*              CONTROL TERMINAL ENTRY                                   09250000
*                                                                       09300000
TOTCTENT DS    0F .          CONTROL TERMINAL ENTRY                     09350000
TOTCTUCB DS    AL2 .              C.T. UCB ADDRESS                      09400000
TOTCTOFF DS    H .                OFFSET TO C.T. TNT ENTRY     @Y17XAXU 09450000
*                                 (DUMMY)                      @Y17XAXU 09500000
TOTCROFF DS    H .                OFFSET TO C.T. TNT ENTRY              09550000
*                                 (REAL)                       @Y17XAXU 09600000
TOTCRSID DS    H .                NETWORK ADDRESS OF C.T.      @Y17XAXU 09650000
TOTCTRLN DS    C .                C.T. RELATIVE LINE NUMBER             09700000
TOTCTLCB DS    CL3 .              C.T. LCB ADDRESS                      09750000
TOTCTTNT DS    F .                C.T. TERMINAL NAME TABLE ENTRY        09800000
*                                   ADDRESS (DUMMY ENTRY)               09850000
TOTCRTNT DS    F .                C.T. TERMINAL NAME TABLE ENTRY        09900000
*                                   ADDRESS (REAL ENTRY)                09950000
TOTCTTLN DS    H                  LENGTH OF CT TTE AREA                 10000000
TOTCTFLG DS    C                  CONTROL TERMINAL FLAGS                10050000
TOTCTASN EQU   X'80'              DUMMY ENTRY ASSIGNED           S22024 10100000
TOTCTORN EQU   X'40'              CONTROL TERMINAL ON 3705       S22024 10150000
TOTCTSWD EQU   X'01'              DIAL CONTROL TERMINAL          S22024 10200000
TOTCTEND DS    0C .               END OF BASIC C.T. AREA       @Y17XAXU 10250000
TOTCTRNL DS    CL8                GROUP NAME FOR CT LINE         S22024 10300000
TOTCTNAM DS    CL9                CONTROL TERM NAME IN EBCDIC    S22024 10350000
TOTCTDFL DS    C                  CONTROL TERMINAL INITIAL CONDITIONS   10400000
TOTCTTRM EQU   X'80'                   TERMINAL DEVICE FLAG             10450000
TOTCTLIN EQU   X'40'                   LINE ADDRESS FLAG                10500000
TOTCTGP  EQU   X'10'                   GENERAL POLL INITIALLY ACTIVE    10550000
*                                        ON TEST LINE                   10600000
TOTCTLST EQU   X'08'                   CT INITIALLY STOPPED             10650000
TOTCTHD  EQU   X'04'                   CT INITIALLY HELD                10700000
TOTCTIAC EQU   X'02'                   CT INVITATION LIST ENTRY         10750000
*                                        INITIALLY INACTIVE             10800000
*                                                                       10850000
         DS    CL3           RESERVED                          @Y17XAXU 10900000
TOTCUTST DS    0F            CONTROL INFO FOR $CUTEST MACRO             10950000
TOTCUFLG DS    1C            $CUTEST FLAGS                              11000000
*                                                                       11050000
TOTCUDON EQU   X'80'              CUTEST ISSUED                         11100000
TOTCUCUP EQU   X'40'              CUTEST CLEAN UP REQUIRED              11150000
*                                                                       11200000
TOTCU#AD DS    1C            $CUTEST NUMBER OF CONTIGUOUS ADDRESSES     11250000
TOTCUCUU DS    2C            $CUTEST STARTING ADDRESS                   11300000
*                                                                       11350000
TOTCUSAV DS    1F            $CUTEST SAVE AREA                          11400000
*                                                                       11450000
TOTCURS1 DS    1C            $CUTEST CODE PARAMETER                     11500000
TOTCURS2 DS    1C            $CUTEST HEX CHANNEL ID                     11550000
TOTCURS3 DS    1C            $CUTEST RESERVED BYTE 3 CODE PARAMETER     11600000
TOTCURS4 DS    1C            $CUTEST RESERVED BYTE 4 CODE PARAMETER     11650000
*                                                                       11700000
TOTWOOPC DS    6F            IEDQWO OPERATOR CONTROL PARM LIST  SA41602 11750000
TOTPLIST DS    0F            OPERATOR CONTROL PARAMETER LIST     S22024 11800000
TOTOKEY  DS    C                  KEY                            S22024 11850000
TOTOQCBA DS    CL3                OP CONTROL QCB ADDRESS         S22024 11900000
TOTOPRI  DS    C                  PRIORITY                       S22024 11950000
TOTOLINK DS    CL3                LINK FIELD                     S22024 12000000
TOTOVBCD DS    C                  VERB CODE                      S22024 12050000
TOTOELNG DS    C                  LENGTH OF ELEMENT              S22024 12100000
TOTORLN  DS    C                  RELATIVE LINE NUMBER           S22024 12150000
TOTORTCD DS    C                  RETURN CODE                    S22024 12200000
TOTOFLG  DS    0FL1               FLAG BYTE                    @YM08136 12250000
TOTOATC  EQU   X'80'              USE ALTERATE TTCIN           @YM08136 12300000
TOTOECBA DS    F                  ECB ADDRESS                    S22024 12350000
TOTOLADR DS    CL8                TERMINAL NAME OR LINE ADDRESS  S22024 12400000
TOTOALTT DS    H                  ALTERNATE TTCIN                       12450000
         DS    CL38               UNUSED                       @YM08136 12500000
TOTOPCLN DS    A             OP CONTROL ECB ADDRESS FOR CLEANUP  S22024 12550000
TOTUSCOR DS    F             CORE CURRENTLY IN USE BY OLT        S22024 12600000
*              ALTERNATE PRINTER ENTRY                                  12650000
*                                                                       12700000
TOTAPENT DS    0F .          ALTERNATE PRINTER ENTRY                    12750000
TOTAPUCB DS    AL2 .              A.P. UCB ADDRESS                      12800000
TOTAPOFF DS    H .                OFFSET TO A.P. TNT ENTRY     @Y17XAXU 12850000
*                                 (DUMMY ENTRY)                @Y17XAXU 12900000
TOTAROFF DS    H .                OFFSET TO A.P. TNT ENTRY              12950000
*                                 (REAL ENTRY)                 @Y17XAXU 13000000
TOTARSID DS    H .                NETWORK ADDRESS OF A.P.      @Y17XAXU 13050000
TOTAPRLN DS    C .                A.P. RELATIVE LINE NUMBER             13100000
TOTAPLCB DS    CL3 .              A.P. LCB ADDRESS                      13150000
TOTAPTNT DS    F .                A.P. TERMINAL NAME TABLE ENTRY        13200000
*                                   ADDRESS (DUMMY ENTRY)               13250000
TOTARTNT DS    F                  A.P. TERMINAL NAME TABLE ENTRY        13300000
*                                   ADDRESS ( REAL ENTRY)               13350000
TOTAPTLN DS    H                  LENGTH OF AP TTE AREA                 13400000
TOTAPFLG DS    C                  ALTERNATE PRINTER FLAGS               13450000
TOTAPASN EQU   X'80'              DUMMY ENTRY ASSIGNED           S22024 13500000
TOTAPORN EQU   X'40'              AP ON 3705                     S22024 13550000
TOTAPSWD EQU   X'01'              DIAL ALTERNATE PRINTER         S22024 13600000
TOTAPEND DS    0C .               END OF BASIC AP AREA         @Y17XAXU 13650000
TOTAPRNL DS    CL8                GROUP NAME FOR AP LINE         S22024 13700000
TOTAPDFL DS    C                  ALTERNATE PRINTER INITIAL CONDITIONS  13750000
*                                                                       13800000
TOTAPTER EQU   X'80'                   TERMINAL DEVICE FLAG             13850000
TOTAPLIN EQU   X'40'                   LINE ADDRESS FLAG                13900000
TOTAPGP  EQU   X'10'                   GENERAL POLL INITIALLY ACTIVE    13950000
*                                        ON TEST LINE                   14000000
TOTAPLST EQU   X'08'                   A.P. INITIALLY STOPPED           14050000
TOTAPHD  EQU   X'04'                   A.P. INITIALLY HELD              14100000
TOTAPIAC EQU   X'02'                   A.P. INVITATION LIST ENTRY       14150000
*                                        INITIALLY INACTIVE             14200000
         DS    F             UNUSED                            @ZM47554 14220010
*                                                                       14350000
TOTAPDCB DS    F             LOCAL PRINTER DCB ADDRESS           S22024 14400000
TOTPDECB DS    5F .          LOCAL PRINTER DECB                         14450000
*                                                                       14500000
TOTPARML DS    F             ADDRESS OF PARAMETER LIST FOR      SA41612 14550000
*                              MACRO SERVICE CALL               SA41612 14600000
*                                                                       14650000
TOTOLTMQ DS    A .           SUBTASK MESSAGE QUEUE                      14700000
TOTOTECB DS    F .           TOTE SUBTASK ECB                           14750000
*                                                                       14800000
TOTRESSV DS    F .           POINTER TO MOTHER TASK SAVE AREA           14850000
TOTTCBAD DS    F .           SUBTASK TCB ADDRESS                        14900000
TOTCMPCD DS    F .           SUBTASK COMPLETION CODE                    14950000
*                                                                       15000000
TOTOLTPL DS    3F .          OLT INPUT PARAMETER LIST                   15050000
TOT#TBLE EQU   TOTOLTPL+8 .  BRANCH TABLE ADDRESS                       15100000
*                                                                       15150000
TOTWTORP DS    0F .          WTOR PARM LIST FOR OPERATOR COMMUNICATION  15200000
TOTINCNT DS    C .                REPLY BYTE COUNT                      15250000
TOTINADR DS    3C .               REPLY BUFFER ADDRESS                  15300000
TOTINECB DS    F .                REPLY ECB ADDRESS                     15350000
*                                                                       15400000
TOTWTOPL DS    0F .          WTO & WTOR PL FOR OPERATOR COMMUNICATION   15450000
         DS    C .                                                      15500000
TOTOTCNT DS    C .                OUT MESSAGE COUNT                     15550000
         DS    H .                                                      15600000
TOTOTBUF DS    CL84          OUTPUT AREA                                15650000
TOTINBUF DS    CL80          REPLY BUFFER                               15700000
*                                                                       15750000
TOTOLTID DS    H .           TOTE OLT IDENTIFICATION                    15800000
TOTRTCOD DS    C .           SERVICE MODULE RETURN CODE                 15850000
         DS    C .           UNUSED                                     15900000
*                                                                       15950000
TOTPLNKQ DS    0F .          PLINK MODULE QUEUE                         16000000
TOTPLFWD DS    F .                QUEUE FORWARD POINTER                 16050000
TOTPLBKW DS    F .                QUEUE BACKWARD POINTER                16100000
         DS    F .           RESERVED                          @Y17XAX6 16150000
TOTWKSPC DS    16D .         TOTE WORK AREA                             16200000
TOTWKEND DS    0C .               END OF TOTE WORK AREA                 16250000
TOTWKLNT EQU   TOTWKEND-TOTWKSPC .     LENGTH OF TOTE WORKAREA          16300000
         DS    5F .          UNUSED                                     16350000
TOTAVTPT DS    F .           ADDRESS OF AVT                             16400000
TOTSTAE  DS    F             ADDRESS OF STAE EXIT ROUTINE        S22024 16450000
TOTRESPL DS    F .           ADDRESS OF TOTE RESIDENT PARAMETER LIST    16500000
TOTFLG01 DS    C .           TOTE 1ST FLAG BYTE  (ABNORMAL)    @G36XRXV 16550010
TOTCLNST EQU   X'02'         CLEANUP STARTED                   @YM08158 16600000
TOTCLNED EQU   X'01'         CLEANUP ENDED                     @YM08158 16650000
*                                                                       16700000
TOTFINAL EQU   X'80'              FINAL MESSAGE INDICATOR        S05331 16750000
TOTCONFG EQU   X'40'              CONFIGURATOR RUN                      16800000
TOTIPLCU EQU   X'20'              FORCED CLEANUP FROM IPL        S05331 16850000
TOTEXIT  EQU   X'10'              IEDQWO CONTROL FLOW FLAG     @Y17XAXU 16900000
TOTAPTST EQU   X'08'              AP ON TEST LINE              @Y17XAUU 16950000
TOTPRMPT EQU   X'04'              PROMPTER RUN                   S22024 17000000
*                                                                       17050000
TOTFLG02 DS    C .           TOTE 2ND FLAG BYTE                         17100000
*                                                                       17150000
TOTTTSPE EQU   X'80' .            TEST SESSION PENDING END     @Y17XAXU 17200000
TOTTSST  EQU   X'40' .            CT/AP LINE IN TEST MODE      @Y17XAUU 17250000
TOTDEV0X EQU   X'20'              TEST DEVICE ON 270X            S22024 17300000
TOTOLTRQ EQU   X'10'              ONLINE TEST REQUEST FLAG       S22024 17350000
TOTCHKSZ EQU   X'08'              UPDATE SUBTASK STORAGE         S22024 17400000
*                                   ALLOCATION FLAG              S22024 17450000
TOTCONMD EQU   X'04'              CALL TOTE CONCENTRATOR MODULE SA41597 17500000
*                                   FOR INITIAL STATUS SET UP   SA41597 17550000
TOTCONCU EQU   X'02'              CONCENTRATOR CLEAN UP REQUIREDSA41597 17600000
TOTDEVRN EQU   X'01'              TEST DEVICE ON 3704/3705       S22024 17650000
*                                                                       17700000
TOTFLG03 DS    C .           TOTE 3RD FLAG BYTE                         17750000
*                                                                       17800000
TOTAPOER EQU   X'80' .            ALTERNATE PRINTER OPTION ERROR FLAG   17850000
TOTTDFER EQU   X'40' .            TEST DEVICE FIELD ERROR FLAG          17900000
TOTTSTER EQU   X'20' .            TEST ID FIELD ERROR FLAG              17950000
TOTOPTER EQU   X'10' .            OPTION FIELD ERROR FLAG               18000000
TOTIMNCP EQU   X'08' .            TEMPORARY NO CONT PRINT FLAG          18050000
TOTTSINC EQU   X'04' .            INCLUSIVE TEST ID ENTRY FLAG          18100000
TOTREPEX EQU   X'02'              REPLY EXPECTED FLAG           SA41613 18150000
*                                                                       18200000
TOTFLG04 DS    C .           TOTE 4TH FLAG BYTE                         18250000
TOTPRCTF EQU   X'08'         COUNTERFEIT PRIMARY TEST DEVICE   @YM08407 18300000
TOTSCCTF EQU   X'04'         COUNTERFEIT SECONDARY TEST DEVICE @YM08407 18350000
*                                                                       18400000
TOTNUMDV EQU   X'80' .            NUMERIC TRM ENTRY FLAG                18450000
TOTDTCHD EQU   X'40' .            SUBTASK ALREADY DETACHED FLAG         18500000
TOTCLOSE EQU   X'20' .            TCAM CLOSEDOWN IN PROGRESS FLAG       18550000
TOTTTSWT EQU   X'01' .            TEST TERMINAL LINE SWITCHED FLAG      18600000
*                                                                       18650000
TOTFLG05 DS    C .           TOTE 5TH FLAG BYTE                         18700000
*                                                                       18750000
TOTPRINT EQU   X'80' .            ACCESS METHOD PRINT FLAG              18800000
TOTCECOM EQU   X'40' .            ACCESS METHOD CECOM FLAG              18850000
TOTREPLY EQU   X'20' .            ACCESS METHOD CECOM WITH REPLY FLAG   18900000
TOTSRCE  EQU   X'10' .            SEND MSG TO SOURCE TERMINAL  @Y17XAXU 18950000
TOTSRCON EQU   X'08' .            TRM ENTERED FROM SYSCON      @Y17XAXU 19000000
TOTTMOUT EQU   X'04' .            WAIT TIMEOUT FLAG                     19050000
TOTEXIOF EQU   X'02' .            ACCESS METHOD EXIO FLAG               19100000
TOTNDMSG EQU   X'01' .            SEND CANCEL OR TERMINATE MESSAGE FLAG 19150000
*                                                                       19200000
TOTFLG06 DS    C .           TOTE 6TH FLAG BYTE                         19250000
*                                                                       19300000
TOTOTERM EQU   X'80' .            SECTION TERMINATE FLAG                19350000
TOTCBOPN EQU   X'40'              CANCEL BEFORE OPEN                    19400000
TOTWACAN EQU   X'20' .            CANCEL REQUEST PENDING                19450000
TOTNCMFG EQU   X'10' .            NON-CONCURRENT MODE FLAG              19500000
TOTABEND EQU   X'08' .            OLT HAS ABENDED FLAG                  19550000
TOTCANCL EQU   X'04' .            CANCEL TESTING FLAG                   19600000
TOTOTACT EQU   X'02' .            OLT ACTIVE FLAG                       19650000
TOTNPERR EQU   X'01' .            NO PERMANENT ERROR FLAG               19700000
*                                                                       19750000
TOTFLG07 DS    C .           TOTE 7TH FLAG BYTE                         19800000
*                                                                       19850000
TOTPRIEX EQU   X'80' .            PRIMARY DEVICE FOR EXIO/WAITIO FLAG   19900000
TOTSECEX EQU   X'40' .            SECONDARY DEV  FOR EXIO/WAITIO FLAG   19950000
TOTMSCEC EQU   X'08' .            TOTE MESSAGE SOURCE FLAG - CECOM      20000000
TOTMSREP EQU   X'04' .            TOTE MESSAGE SOURCE FLAG - CECOM      20050000
TOTMSPRT EQU   X'02' .            TOTE MESSAGE SOURCE FLAG - CECOM      20100000
TOTMSSRC EQU   X'01' .            TOTE MESSAGE SOURCE FLAG     @Y17XAXU 20150000
*                                                                       20200000
TOTFLG08 DS    C .           TOTE 8TH FLAG BYTE                         20250000
*                                                                       20300000
*                                 BITS 0-3 ARE DPRINT FORMS CNTRL FLAGS 20350000
*                                 BITS 4-7 ARE DPRINT LEVEL CNTRL FLAGS 20400000
*                                                                       20450000
*                                                                       20500000
TOTFLG09 DS    C .           TOTE 9TH FLAG BYTE                         20550000
*                                                                       20600000
TOTAPCON EQU   X'80' .            PRINTER = SYSTEM CONSOLE FLAG         20650000
TOTAPOUT EQU   X'40' .            PRINTER = SYSTEM PRINTER FLAG         20700000
TOTCTCON EQU   X'20' .            CONTROL TERMINAL = SYS CONSOLE FLAG   20750000
TOTAPTRM EQU   X'10' .            PRINTER = TERMINAL FLAG               20800000
TOTNOBRK EQU   X'08'              NO BREAK OPTION SPECIFIED      S22024 20850000
TOTLNCON EQU   X'04'              LINE CONNECTION ALREADY DONE   S22024 20900000
TOTPRECT EQU   X'02' .            NO ALTERNATE PRINTER FLAG             20950000
*                                   (OR CT = AP)                 S05331 21000000
TOTMACFT EQU   X'01'              UNSUPPORTED MACRO FUNCTION FLAG       21050000
*                                                                       21100000
TOTFLG10 DS    C .           TOTE 10TH FLAG BYTE                        21150000
*                                                                       21200000
TOTTERMS EQU   X'80' .            TEST DEVICES = TERMINALS FLAG         21250000
TOTTNTRQ EQU   X'08' .            DUMMY TNT ENTRY REQUEST FLAG          21300000
TOTOLTED EQU   X'04' .            ON-LINE TEST ENDED FLAG               21350000
TOTOLTWT EQU   X'02' .            ON-LINE TEST WAITING FLAG             21400000
TOTOLTRS EQU   X'01' .            ON-LINE TEST RESTART FLAG             21450000
*                                                                       21500000
TOTTTBEL DS    CL1           TERMINAL NAME TABLE ENTRY                  21550000
*                              NAME LENGTH                              21600000
         DS    CL1           UNUSED                                     21650000
         AIF   ('&CONFG' EQ 'YES').CNFBYP                               21700000
TOTEXT   DS    14F .         EXTERNAL DATA BUFFER                       21750000
TOTPASS  DS    16F .         PASSON DATA BUFFER                         21800000
TOTTRMBF DS    0C .          TRM BUFFER FOR TRM ANALYSIS                21850000
TOTPRIBK DS    0F .          PRIMARY TEST DEVICE I/O CONTROL BLOCKS     21900000
TOTPRECB DS    F .           PRIMARY ECB                                21950000
*                                                                       22000000
*              PRIMARY TEST DEVICE ENTRY                                22050000
*                                                                       22100000
TOTPRENT DS    0F .          TOTE PRIMARY TEST DEVICE ENTRY             22150000
*                                                                       22200000
TOTPRUCB DS    AL2 .              PRIMARY DEVICE UCB ADDRESS            22250000
TOTPCOFF DS    H .                OFFSET TO PRIMARY DEVICE     @Y17XAXU 22300000
*                                 (DUMMY ENTRY)                @Y17XAXU 22350000
TOTPROFF DS    H .                OFFSET TO PRIMARY TNT ENTRY           22400000
*                                 (REAL ENTRY)                 @Y17XAXU 22450000
TOTPRSID DS    H .                NETWORK ADDRESS OF PRIMARY   @Y17XAXU 22500000
TOTPRRLN DS    C .                PRIMARY DEVICE RELATIVE               22550000
*                                   LINE NUMBER                         22600000
TOTPRLCB DS    AL3 .              ADDRESS OF 3705 LCB          @Y17XAXU 22650000
TOTPDTNT DS    F .                PRIMARY TNT ENTRY ADDRESS    @Y17XAXU 22700000
*                                 (DUMMY ENTRY)                @Y17XAXU 22750000
TOTTNTPR DS    F                  PRIMARY TNT ENTRY ADDRESS    @Y17XAXU 22800000
*                                 (REAL ENTRY)                 @Y17XAXU 22850000
TOTPRLEN DS    H .                LENGTH OF PRIMARY TTE AREA   @Y17XAXU 22900000
TOTPRFLG DS    C .                PRIMARY FLAGS                @Y17XAXU 22950000
TOTPRTAS EQU   X'80' .            PRIMARY TNT ENTRY ASSIGNED   @Y17XAXU 23000000
TOTPRLU  EQU   X'40' .            LU TERMINAL                  @Y17XAXU 23050000
TOTPPRSC EQU   X'20' .            ON=PRIMARY                   @Y17XAX6 23100000
*                                 OFF=SECONDARY                @Y17XAX6 23150000
TOTPUNRD EQU   X'10' .            ON=UNREAD DATA               @Y17XAX6 23200000
*                                 OFF=NO UNREAD DATA           @Y17XAX6 23250000
TOTPREX  EQU   X'08' .            EXCEPTION RESPONSE           @Y17XAX6 23300000
TOTPRFME EQU   X'04' .            DEFINITE RESPONSE            @Y17XAX6 23350000
TOTPEXNM EQU   X'02' .            ON=EXPEDITED                 @Y17XAX6 23400000
*                                 OFF=NORMAL                   @Y17XAX6 23450000
         DS    C .                RESERVED                     @Y17XAXU 23500000
TOTPRQCB DS    F                  PRIMARY QCB ADDRESS            S22024 23550000
TOTPRCCW DS    F                  ADDRESS OF READ CCW FOR PRIMARYS22024 23600000
TOTPRBUF DS    F                  ADDRESS OF BUFFER CONTAINING   S22024 23650000
*                                   READ DATA FOR PRIMARY        S22024 23700000
*                                                                       23750000
*        PRIMARY DEVICE DATA BLOCKING FIELD                             23800000
*                                                                       23850000
TOTPDTBF DS    A .           RESPONSE BUFFER ADDRESS                    23900000
TOTPDTCT DS    H .           RESPONSE BUFFER SIZE                       23950000
TOTPFLGS DS    BL1 .         FLAGS                                      24000000
         DS    CL1           UNUSED                            @ZM47554 24050010
TOTPRSN  DS    0F            PRIMARY SEQ NUMBER FIELD          @ZM47554 24058010
         DS    CL2           FLAGS                             @ZM47554 24066010
TOTPRSEQ DS    H             SEQUENCE NUMBER (FROM SNA TH)     @ZM47554 24074010
*                                                              @ZM47554 24082010
TOTPTECB DS    F .           PRIMARY TECB ADDRESS                       24100000
TOTPRIOB DS    11F           PRIMARY IOB                                24150000
TOTPRDCB DS    18F .         PRIMARY DCB                                24200000
TOTPRDEB EQU   TOTPRDCB+44        PRIMARY DEB ADDRESS                   24250000
*                                                                       24300000
TOTSCIBK DS    0F .          SECONDARY TEST DEVICE I/O CONTROL BLOCKS   24350000
TOTSCECB DS    F .           SECONDARY ECB                              24400000
*                                                                       24450000
*              SECONDARY TEST DEVICE ENTRY                              24500000
*                                                                       24550000
TOTSCENT DS    0F .          TOTE SECONDARY TEST DEVICE ENTRY           24600000
*                                                                       24650000
TOTSCUCB DS    AL2 .              SECONDARY DEVICE UCB ADDRESS          24700000
TOTNCOFF DS    H .                OFFSET TO SECONDARY TNT ENTRY@Y17XAXU 24750000
*                                 (DUMMY ENTRY)                @Y17XAXU 24800000
TOTSCOFF DS    H .                OFFSET TO SECONDARY TNT ENTRY         24850000
*                                 (REAL ENTRY)                 @Y17XAXU 24900000
TOTSRSID DS    H .                NETWORK ADDRESS OF SECONDARY @Y17XAXU 24950000
TOTSCRLN DS    C .                SECONDARY DEVICE RELATIVE             25000000
*                                   LINE NUMBER                         25050000
TOTSCLCB DS    AL3 .              ADDRESS OF 3705 LCB          @Y17XAXU 25100000
TOTSDTNT DS    F .                SECONDARY TNT ENTRY ADDRESS  @Y17XAXU 25150000
*                                 (DUMMY ENTRY)                @Y17XAXU 25200000
TOTSRTNT DS    F .                SECONDARY TNT ENTRY ADDRESS  @Y17XAXU 25250000
*                                 (REAL ENTRY)                 @Y17XAXU 25300000
TOTSCLEN DS    H .                LENGTH OF SECONDARY TTE AREA @Y17XAXU 25350000
TOTSCFLG DS    C .                SECONDARY FLAGS              @Y17XAXU 25400000
TOTSCTAS EQU   X'80' .            SECONDARY TNT ENTRY ASSIGNED @Y17XAXU 25450000
TOTSCLU  EQU   X'40' .            LU DEVICE                    @Y17XAXU 25500000
TOTSPRSC EQU   X'20' .            ON=PRIMARY                   @Y17XAX6 25550000
*                                 OFF=SECONDARY                @Y17XAX6 25600000
TOTSUNRD EQU   X'10' .            ON=UNREAD DATA               @Y17XAX6 25650000
*                                 OFF=NO UNREAD DATA           @Y17XAX6 25700000
TOTSCEX  EQU   X'08' .            EXCEPTION RESPONSE           @Y17XAX6 25750000
TOTSCFME EQU   X'04' .            DEFINITE RESPONSE            @Y17XAX6 25800000
TOTSEXNM EQU   X'02' .            ON=EXPEDITED                 @Y17XAX6 25850000
*                                 OFF=NORMAL                   @Y17XAX6 25900000
         DS    C .                RESERVED                     @Y17XAXU 25950000
TOTSCQCB DS    F                  SECONDARY QCB ADDRESS          S22024 26000000
TOTSCCCW DS    F                  ADDRESS OF READ CCW FOR        S22024 26050000
*                                   SECONDARY TEST DEVICE        S22024 26100000
TOTSCBUF DS    F                  ADDRESS OF BUFFER CONTAINING   S22024 26150000
*                                   READ DATA FOR SECONDARY      S22024 26200000
*                                                                       26250000
*        SECONDARY DEVICE DATA BLOCKING FIELD                           26300000
*                                                                       26350000
TOTSDTBF DS    A .           RESPONSE BUFFER ADDRESS                    26400000
TOTSDTCT DS    H .           RESPONSE BUFFER SIZE                       26450000
TOTSFLGS DS    BL1 .         FLAGS                                      26500000
         DS    CL1           UNUSED                            @ZM47554 26550010
TOTSCSN  DS    0F            SECONDARY SEQ NUMBER FIELD        @ZM47554 26558010
         DS    CL2           FLAGS                             @ZM47554 26566010
TOTSCSEQ DS    H             SEQUENCE NUMBER (FROM SNA TH)     @ZM47554 26574010
*                                                              @ZM47554 26582010
TOTSTECB DS    F .           SECONDARY TECB ADDRESS                     26600000
TOTSCIOB DS    11F           SECONDARY IOB                              26650000
TOTSCDCB DS    18F .         SECONDARY DCB ADDRESS                      26700000
TOTSCDEB EQU   TOTSCDCB+44        SECONDARY DEB ADDRESS                 26750000
*                                                                       26800000
TOTTRMND DS    0C .          END OF TRM BUFFER                          26850000
*                                                                       26900000
TOTCROLT DS    CL8 .         CURRENT OLT I.D.                           26950000
*  THE FOLLOWING EQUATES ARE USED BY THE 'INCLUSIVE' ROUTINE IN IEDQWE  27000000
TOTCRALP EQU   TOTCROLT+5                                               27050000
TOTCRTOO EQU   TOTCROLT+6                                               27100000
TOTONELT EQU   TOTCROLT+7                                               27150000
TOTCRFST EQU   TOTCROLT+8                                               27200000
TOTSECBL EQU   TOTCROLT+9                                               27250000
TOTONECU EQU   TOTCROLT+10                                              27300000
TOTCRSEC EQU   TOTCROLT+11                                              27350000
TOTSECBK EQU   TOTCROLT+12                                              27400000
TOTONEND EQU   TOTCROLT+13                                              27450000
TOTCRFLG EQU   TOTCROLT+15                                              27500000
TOTFTTIM EQU   X'80'              FIRST TIME SWITCH                     27550000
TOTCLRFG EQU   X'00'              USED TO CLEAR FIRST  TIME SWITCH      27600000
TOTSAADR EQU   TOTCROLT+16                                              27650000
TOTOLTTB DS    10CL3 .       OLT I.D. TABLE                             27700000
TOTOLTTE DS    0C .               END OF TABLE                          27750000
*                                                                       27800000
TOTCONTB DS    10CL1         CONCENTRATOR INITIAL STATUS TABLE  SA41597 27850000
*                              FOR TEST DEVICES                 SA41597 27900000
TOTCONCT DS    CL1           CONCENTRATOR STATUS FOR CONTROL    SA41597 27950000
*                              TERMINAL                         SA41597 28000000
TOTCONAP DS    CL1           CONCENTRATOR STATUS FOR ALTERNATE  SA41597 28050000
*                              PRINTER                          SA41597 28100000
TOTCONND DS    0C            END OF TABLE                       SA41597 28150000
*                                                               SA41597 28200000
*        CONCENTRATOR INITIAL STATUS CONDITIONS                 SA41597 28250000
*                                                               SA41597 28300000
TOTCSTOP EQU   X'80'              CONCENTRATOR INITIALLY STOPPEDSA41597 28350000
TOTCHELD EQU   X'40'              CONCENTRATOR INITIALLY HELD   SA41597 28400000
TOTCINAC EQU   X'20'              CONCENTRATOR INITIALLY        SA41597 28450000
*                                   INACTIVE                    SA41597 28500000
TOTCSTRT EQU   X'E0'              NONE SET IF ORIGINALLY STARTEDSA41597 28550000
         DS    CL38          SPARE                              SA41597 28600000
TOTTDTBL DS    10F .         TOTE TEST DEVICE TABLE                     28650000
TOTLETGO EQU   TOTTDTBL+36        LAST ENTRY POINTER                    28700000
TOTTDEND DS    0F .               END OF TABLE                          28750000
*                                                                       28800000
*              TEST DEVICE INITIAL CONDITIONS                           28850000
*                                                                       28900000
TOTTDTRM EQU   X'80' .            TERMINAL DEVICE FLAG                  28950000
TOTTDLIN EQU   X'40' .            LINE ADDRESS FLAG                     29000000
TOTTDGRB EQU   X'20' .            TEST DEVICE GRABBED FLAG              29050000
TOTTDORN EQU   X'10'              TEST DEVICE ON A 3705          S22024 29100000
TOTTDLST EQU   X'08' .            TEST DEVICE INITIALLY STOPPED         29150000
TOTTDTHD EQU   X'04' .            TEST DEVICE INITIALLY HELD            29200000
TOTTDIAC EQU   X'02' .            TEST DEVICE INVITATION LIST           29250000
*                                   ENTRY INITIALLY INACTIVE            29300000
TOTTSWPM EQU   X'01'              A SWITCH HAS BEEN PERFORMED    Y06330 29350000
TOTTNIPL EQU   X'06'              NO IPL REQUIRED FOR 3705       S05331 29400000
*                                                                       29450000
*                                                                       29500000
*        WAITIO ECB LIST                                                29550000
*                                                                       29600000
TOTWECBA DS    A .           POINTER TO ECB FOR TEST DEVICE             29650000
TOTECBPT DS    A             POINTER TO SUBTASK ECB                     29700000
*                                                                       29750000
TOTTLCNT DS    H .           TEST LOOP COUNT                            29800000
         DS    CL2 .         RESERVED                          @Y17XAX6 29850000
         AGO   .EQUATES                                                 29900000
.CNFBYP  ANOP                                                           29950000
         DS    CL4 .         RESERVED                          @Y17XAX6 30000000
CDSWORK  DS    0D            CONFIGURATOR WORK AREA                     30050000
CDSREC   DS    0CL256 .      CDS RECORD CREATION AREA                   30100000
CDSUNIT  DS    CL4 .              UNIT ADDRESS                          30150000
CDSMODEL DS    CL1 .              MODEL                                 30200000
CDSFEAT  DS    CL1 .              FEATURES                              30250000
CDSCLASS DS    CL1 .              CLASS                                 30300000
CDSTYPE  DS    CL1 .              TYPE DEVICE                           30350000
CDSBYTES DS    CL1 .              BYTE COUNT                            30400000
CDSFLAGS DS    CL1 .              FLAGS                                 30450000
*                                                                       30500000
CDSFPMOD EQU   X'80' .                 FILE PROTECT MODE FLAG           30550000
CDSDVSHR EQU   X'40' .                 DEVICE SHARED WITH ANOTHER SYS   30600000
CDSFEVOL EQU   X'20' .                 F.E. VOLUME MOUNTED FLAG         30650000
CDSEXINT EQU   X'10' .                 EXTERNAL INTERRUPT POSSIBLE FLAG 30700000
CDSSYMNM EQU   X'08' .                 SYMBOLIC ADDRESSING FLAG         30750000
CDSTWOCH EQU   X'04' .                 TWO CHANNEL SWITCH FLAG          30800000
CDSCUSYM EQU   X'02' .                 CUSTOMER ASSIGNED SYMBOLIC NAME  30850000
CDSLCNCT EQU   X'01' .                 LINE CONNECTION REQUIRED         30900000
*                                                                       30950000
CDSSIGNL DS    CL2 .              EXTERNAL SIGNAL MASK                  31000000
CDSNAME  DS    0CL8 .             SYMBOLIC (ALTERNATE MEMBER) NAME      31050000
CDSTCU   DS    CL2 .              OR      TCU FEATURES                  31100000
CDSMISC  DS    CL3 .                      MISC                          31150000
CDSRMASK DS    CL3 .                      SECTION RUN MASK              31200000
CDSFXARA DS    0CL4 .             EXTENDED FIXED AREA                   31250000
CDSFXLEN DS    CL1 .                   LENGTH                           31300000
CDSFXFLG DS    CL2 .                   FLAGS                            31350000
*                                           TWO BYTE SET MODE           31400000
CDSSETMD EQU   X'80' .                      AUTOCALL FEATURE            31450000
CDSAUTCL EQU   X'40' .                      SWITCHED LINE               31500000
CDSMPNT  EQU   X'20' .                      NON-SWITCHED MULTIDROP LINE 31550000
CDSMDROP EQU   X'10' .                      BSC WORLD TRADE DATA SET    31600000
CDSWTBSC EQU   X'08' .                                                  31650000
*                                                                       31700000
CDSLNCON DS    CL1                     LINE CONNECTION CMD SEQ CODE     31750000
CDSVAR   DS    0C    .            CDS VARIABLE FIELD                    31800000
         ORG   CDSWORK+256                                              31850000
CDSINPUT DS    0CL80         INPUT TO UNIT CONFIGURATOR AREA            31900000
CDSTCUTY DS    CL4 .              TCU TYPE (EBCDIC)                     31950000
CDSSYMBL DS    CL8 .              SYMBOLIC TERMINAL NAME (EBCDIC)       32000000
CDSTERM  DS    CL4 .              TERMINAL TYPE (EBCDIC)                32050000
CDSADAP  DS    CL1 .              ADAPTER TYPE                          32100000
*                                                                       32150000
CDSIBM1  EQU   X'10' .                 IBM I                            32200000
CDSIBM2  EQU   X'20' .                 IBM II                           32250000
CDSIBMTY EQU   X'30'                   IBM TTY                          32300000
CDSTTY1  EQU   X'40' .                 TTY I                            32350000
CDSTTY2  EQU   X'50' .                 TTY II                           32400000
CDSWTTY  EQU   X'60' .                 WTC TTY                          32450000
CDSSDA1  EQU   X'70' .                 SDA I                            32500000
CDSIBM3  EQU   X'80' .                 IBM III                          32550000
CDSSDA2  EQU   X'90' .                 SDA II                           32600000
*                                                                       32650000
CDSLINE  DS    CL1 .              LINE TYPE                             32700000
*                                                                       32750000
CDSPTP   EQU   X'01' .                 LEASED POINT TO POINT            32800000
CDSMP    EQU   X'02' .                 LEASED MULTIPOINT                32850000
CDSSWTCH EQU   X'03' .                 SWITCHED WITHOUT AUTODIAL        32900000
CDSSWAUT EQU   X'04' .                 SWITCHED WITH AUTODIAL           32950000
CDSLOCAL EQU   X'05' .                 LOCAL                            33000000
*                                                                       33050000
CDSCONN  DS    CL1 .              LINE CONNECTION CODE                  33100000
*                                                                       33150000
CDSBYP   EQU   X'00' .                 BYPASS                           33200000
CDSDISEN EQU   X'01' .                 DISABLE, ENABLE OR DIAL          33250000
CDSDSMI  EQU   X'02' .                 DISABLE, SETMODE, ENABLE OR DIAL 33300000
* .                                         FOR SDA I                   33350000
CDSDSMIT EQU   X'03' .                 DISABLE, SETMODE, ENABLE OR DIAL 33400000
* .                                         FOR SDA II                  33450000
CDSDSAD0 EQU   X'04' .                 DISABLE, SADZERO, ENABLE OR DIAL 33500000
CDSDSAD1 EQU   X'05' .                 DISABLE, SADONE,  ENABLE OR DIAL 33550000
CDSDSAD2 EQU   X'06' .                 DISABLE, SADTWO,  ENABLE OR DIAL 33600000
CDSDSAD3 EQU   X'07' .                 DISABLE, SADFOUR, ENABLE OR DIAL 33650000
*                                                                       33700000
CDS#POLL DS    CL1 .              NUMBER OF POLLING CHARACTERS (HEX)    33750000
CDSPOLL  DS    CL7 .              POLLING CHARACTERS                    33800000
CDS#ADDR DS    CL1 .              NUMBER OF ADDRESSING CHARACTERS (HEX) 33850000
CDSADDR  DS    CL10 .             ADDRESSING CHARACTERS                 33900000
         DS    CL1 .              UNUSED                                33950000
CDS#DIAL DS    CL1 .              NUMBER OF DIAL DIGITS                 34000000
CDSDIAL  DS    CL20 .             DIAL DIGITS                           34050000
CDS#ID   DS    C .                CPU ID LENGTH                         34100000
CDSCPUID DS    15C .              CPU ID                                34150000
CDSCODE  DS    C .           ADAPTER LINE CODE                          34200000
CDSCFLGS DS    CL1           RESERVED                                   34250000
CDSFNFLG DS    CL1 .              FUNCTION FLAGS                        34300000
*                                                                       34350000
CDSADD   EQU   X'02' .                 ADD                              34400000
CDSDEL   EQU   X'04' .                 DELETE                           34450000
CDSCHNG  EQU   X'06' .                 CHANGE                           34500000
CDSEXIBT EQU   X'08' .                 EXHIBIT                          34550000
*                                                                       34600000
CDSRETFL DS    CL1 .              RETURN CODE                           34650000
*                                                                       34700000
CDSNRML  EQU   X'00' .                 NORMAL RETURN                    34750000
CDSINVLD EQU   X'01' .                 INVALID                          34800000
*                                                                       34850000
CDSBLDL  DS    0CL40 .       BLDL LIST FOR CONFIG DIRECTORY             34900000
CDSMEMBR DS    CL8 .              MEMBER NAME                           34950000
CDSTTRC  DS    CL3 .              CESD RELATIVE TTR                     35000000
CDSTTRC4 DS    CL1 .              CESD RELATIVE TTR 4TH BYTE            35050000
CDSTTRD  DS    CL3 .              DATA RELATIVE TTR                     35100000
CDSTTRD4 DS    CL1 .              DATA RELATIVE TTR 4TH BYTE            35150000
CDSTTRNS DS    CL4 .              RESERVED                              35200000
CDSATTRB DS    CL2 .              ATTRIBUTES                            35250000
CDSMAIN  DS    CL3 .              MAIN STORAGE REQUIREMENTS             35300000
CDSBLK1  DS    CL2 .              LENGTH OF FIRST BLOCK                 35350000
CDSEPADR DS    CL3 .              ENTRY POINT ADDRESS                   35400000
CDSTXBLK DS    CL3 .              FIRST TEXT BLOCK ORIGIN               35450000
CDSSSI   DS    CL7 .              CDS SSI                               35500000
*                                                                       35550000
         DS    0D .                                                     35600000
CDSCESD  DS    0CL56 .       CESD RECORD FOR CONFIG PDS                 35650000
CDSCESID DS    CL1 .              CESD IDENTIFICATION                   35700000
CDSCESPR DS    CL3 .              UNUSED                                35750000
CDSESD01 DS    CL2 .              ESDID OF FIRST ESD                    35800000
CDSCESCT DS    CL2 .              COUNT                                 35850000
CDSCESNM DS    CL8 .              MEMBER NAME                           35900000
CDSCESTY DS    CL1 .              TYPE                                  35950000
CDSCESAD DS    CL3 .              ADDRESS                               36000000
CDSCESGM DS    CL1 .              SEGMENT                               36050000
CDSCESLN DS    CL3 .              ID AND LENGTH                         36100000
CDSESD02 DS    CL16 .             SECOND ESD RECORD                     36150000
CDSESD03 DS    CL16 .             THIRD ESD RECORD                      36200000
*                                                                       36250000
CDSCNTL  DS    0CL20 .       CONTROL RECORD FOR CONFIG PDS              36300000
CDSCTLID DS    CL1 .              CNTROL IDENTIFICATION                 36350000
CDSCTLSP DS    CL3 .              UNUSED                                36400000
CDSCNT01 DS    CL2 .              # BYTES FOLLOWING CCW                 36450000
CDSCNT02 DS    CL2 .              COUNT                                 36500000
CDSCCW   DS    CL8 .              CHANNEL CONTROL WORD                  36550000
CDSCESDI DS    CL2 .              CESD ENTRY                            36600000
CDSRECLN DS    CL2 .              LENGTH OF TEXT RECORD                 36650000
CDSTTBLE DS    A .           TERMINAL TABLE ENTRY ADDRESS               36700000
CDSTINDX DS    H .           TERMNAME TABLE INDEX                       36750000
         DS    CL142 .       RESERVED                          @Y17XAX6 36800000
.EQUATES ANOP                                                           36850000
TOTWAITI DS    D             WAITIO TIME INTERVAL                       36900000
TOTGRABP DS    F             CURRENT SECONDARY DEVICE POINTER           36950000
TOTAPNAM DS    CL8           ALTERNATE PRINTER NAME IN EBCDIC           37000000
TOTOLTEN DS    F             ENTRY POINT ADDRESS OF OLT                 37050000
TOTWAWRK DS    20F .         IEDQWA WORK AREA                  @Y17XAXU 37100000
TOTWOWRK DS    35F           IEDQWO WORK SPACE                  SA41602 37150000
         DS    CL52          RESERVED FOR MAINTENANCE          @Y17XAXU 37200000
TOTSERV  DS    0CL454 .           START OF SERVICE ROUTINES    @Y17XAXU 37250000
*                                 WORK AREA                    @Y17XAXU 37300000
************************************************************** @Y17XAXU 37350000
*                                                            * @Y17XAXU 37400000
*        THE LABEL 'TOTSERV' DEFINES THE START OF THE SERVICE* @Y17XAXU 37450000
*        ROUTINE WORK AREA. IT'S PURPOSE IS TO PROVIDE       * @Y17XAXU 37500000
*        PRE TCAM 10.0 SERVICE ROUTINES A MEANS OF BEING     * @Y17XAXU 37550000
*        REENTRANT . MODIFIABLE DATA AREAS ARE MOVED TO THIS * @Y17XAXU 37600000
*        WORK SPACE. SERVICE MODULES WHICH USE THIS AREA     * @Y17XAXU 37650000
*        SHOULD DEFINE IN A DSECT FASHION (DO NOT INCLUDE A  * @Y17XAXU 37700000
*        DSECT STATEMENT) THEIR MODIFIABLE DATA AREAS. THE   * @Y17XAXU 37750000
*        MODIFIABLE AREA WILL BECOME A CONTINUATION OF THIS  * @Y17XAXU 37800000
*        DSECT (OLTCB) AND SHOULD BE PLACED IMMEDIATELY      * @Y17XAXU 37850000
*        BEHIND THE OLTCB MACRO STATEMENT.                   * @Y17XAXU 37900000
*                                                            * @Y17XAXU 37950000
************************************************************** @Y17XAXU 38000000
.MEND    ANOP                                                           38050000
TOTOBEND DS    0F .          END OF OLTCB                    @Y17XAX6   38100000
         MEND   ,             */                                        38150000
 %OLTCBPLS:   ;                                                         38200000
 /*                                                                   */38250000
 /*      ON-LINE TEST CONTROL BLOCK FOR PLS MODULES                   */38300000
 /*                                                                   */38350000
 /*      STATUS = VERSION 10.0                                @Y17XAXU*/38400000
 /*                                                                   */38450000
         DECLARE                                                        38500000
           1 TOTOLTCB BASED (OLTCBPTR) BDY(DWORD), /*     @Y17XAX6*/    38550000
 %IF PONTER¬='YES' %THEN                                                38600000
   %GOTO BYP001;                                                        38650000
             2 TOTOBPTR,                                                38700000
               3 TOTELKEY CHAR(1),                /* OLTCB QUEUE      */38750000
                                                  /* ELEMENT KEY      */38800000
               3 TOTELQCB PTR(24),                /* ADDRESS OF OLTCB */38850000
                                                  /* QCB              */38900000
               3 * CHAR(1),                       /* UNUSED           */38950000
               3 TOTELLNK PTR(24),                /* OLTCB QUEUE      */39000000
                                                  /*ELEMENT LINK FIELD*/39050000
 /*                                                                   */39100000
 /*            SECTION CONTROL TABLE MAPPING                          */39150000
 /*                                                                   */39200000
 %BYP001:   ;                                                           39250000
             2 $SCTTBLE BDY(WORD),                /* SECTION CONTROL    39300000
                                                      TABLE   @Y17XAX6*/39350000
               3 $ERRLPCT FIXED(15) BDY(HWORD),   /* LOOP ON ERROR      39400000
                                                      COUNT   @Y17XAX6*/39450000
               3 $TESTOPT CHAR(1),      /* TEST OPTION FIELD @Y17XAX6*/ 39500000
                 4 * BIT(5),                      /* UNUSED           */39550000
                 4 $NOPRT BIT(1),                 /* X'04'- NO PRINT    39600000
                                            OPTION FLAG  @Y17XAX6*/     39650000
                 4 $INDEFLP BIT(1),               /* X'02'- INDEFINITE  39700000
                                           ERROR LOOP FLAG @Y17XAX6*/   39750000
                 4 $FSTCOMM BIT(1),               /* X'01'-FIRST ERROR  39800000
                                           COMMUNICATION FLAG @Y17XAX6*/39850000
               3 $ERROPT CHAR(1),                 /* ERROR AND OPTION   39900000
                                                      FIELD  @Y17XAX6 */39950000
                 4 $TESTERR BIT(1),      /* X'80'- TEST ERROR @Y17XAX6*/40000000
                 4 $ASTERIK BIT(1),      /* X'40'- PRINT ASTERIK ON     40050000
                                          TERMINATE MSG FLAG @Y17XAX6 */40100000
                 4 $CATERR BIT(1),       /* X'20'-CATASTROPHIC ERROR    40150000
                                          FLAG @Y17XAX6*/               40200000
                 4 $ALTPRNT BIT(1),       /* X'10'- ALTERNATE PRINTER   40250000
                                          OPTION FLAG   @Y17XAX6*/      40300000
                 4 $NOCNTRL BIT(1),       /* X'08'- NO CONTROL PRINT    40350000
                                           OPTION  @Y17XAX6*/           40400000
                 4 $NERRPRT BIT(1),       /* X'04'- NO ERROR PRINT      40450000
                                           OPTION FLAG @Y17XAX6*/       40500000
                 4 $LOOPERR BIT(1),       /* X'02'- LOOP ON ERROR       40550000
                                           OPTION FLAG @Y17XAX6*/       40600000
                 4 $LOOPTST BIT(1),       /* X'01'- LOOP ON TEST        40650000
                                          ENTRY OPTION FLAG @Y17XAX6*/  40700000
               3 $RT0108 CHAR(1) BDY(BYTE),       /* ROUTINE MASK 1     40750000
                                               THROUGH 8 @Y17XAX6     */40800000
               3 $RT0916 CHAR(1),                 /* ROUTINE MASK 9     40850000
                                               THROUGH 16 @Y17XAX6*/    40900000
               3 $DRIVER CHAR(1),            /* DRIVER   @Y17XAX6*/     40950000
               3 $SPARE1 CHAR(1) BDY(BYTE),       /* UNUSED   @Y17XAX6*/41000000
       3 $TSSSYM CHAR(2) BDY(HWORD),      /* RESERVED FOR TSS @Y17XAX6*/41050000
               3 $PDEVFLG CHAR(1),                /* PRIMARY DEVICE     41100000
                                                      FLAGS   @Y17XAX6*/41150000
                 4 $FPMOLD BIT(1),                /* X'80'- FILE        41200000
                                           PROTECT FLAG  @Y17XAX6*/     41250000
                 4 $EXFILPT BIT(1),               /* X'40'- ADDITIONAL  41300000
                                           FILE PROTECT FLAG @Y17XAX6*/ 41350000
                 4 $TSSSYS1 BIT(1),               /* X'20'- RESERVED    41400000
                                                FOR TSS @Y17XAX6*/      41450000
                 4 $LASTDEV BIT(1),               /* X'10'- LAST        41500000
                                 DEVICE OF SUBSYSTEM FLAG  @Y17XAX6*/   41550000
                 4 * BIT(1),                      /* X'08'- SPARE     */41600000
                 4 $TERMNDX BIT(1),               /* X'04'- RESERVED    41650000
                                                    FOR TSS  @Y17XAX6*/ 41700000
                 4 $PATHDEF BIT(1),               /* X'02'- RESERVED    41750000
                                                    FOR TSS  @Y17XAX6*/ 41800000
                 4 $LASTSUB BIT(1),               /* X'01'- LAST        41850000
                               DEVICE OF LAST SUBSYSTEM FLAG @Y17XAX6*/ 41900000
               3 $CDSFLGS CHAR(1),                /* DEVICE FLAGS FROM  41950000
                                      CDS FLAG BYTE @Y17XAX6*/          42000000
                 4 $FPM BIT(1),                   /* X'80'- FILE        42050000
                                      PROTECT FLAG @Y17XAX6*/           42100000
                 4 $SHARED BIT(1),                /* X'40'- SHARED      42150000
                                      DEVICE FLAG  @Y1XAX6*/            42200000
                 4 $CEVOL BIT(1),                 /* X'20'- CE VOLUME   42250000
                                                      FLAG  @Y17XAX6  */42300000
                 4 $EXTINTC BIT(1),               /* X'10'- DEV ADDR    42350000
                                     ASSOCIATED WITH EXT FLAG @Y17XAX6*/42400000
                 4 $SYMNAME BIT(1),               /* X'08'- SYMBOLIC    42450000
                                                 NAME FLAG @Y17XAX6*/   42500000
                 4 $TWOCHSW BIT(1),               /* X'04'-TWO CHANNEL  42550000
                                              SWITCH FLAG @Y17XAX6*/    42600000
                 4 $CUSTSYM BIT(1),               /* X'02'- CUSTOMER    42650000
                        ASSIGNED SYMBOLIC NAME FLAG  @Y17XAX5*/         42700000
                 4 $COMMCN  BIT(1),               /* X'01'- LINE        42750000
                        CONNECTION REQUIRED FLAG @Y17XAX6*/             42800000
               3 $PDEVADR PTR(31) BDY(WORD),      /* PRIMARY DEVICE     42850000
                                                ADDRESS  @Y17XAX6*/     42900000
               3 $PDEVDSC CHAR(4),                /* PRIMARY DEVICE     42950000
                                          DESCRIPTORS @Y17XAX6*/        43000000
               3 $CDS8T19 CHAR(12) BDY(WORD),     /* PRIMARY DEVICE     43050000
                                  CDS BYTE8 8 THROUGH 19 @Y17XAX6*/     43100000
               3 $RMSKCNT CHAR(1),                /* ROUTINE MASK       43150000
                                       COUNT LENGTH @Y17XAX6*/          43200000
               3 $EXECFLG CHAR(1),                /* EXECUTIVE PROGRAM  43250000
                                                    FLAGS  @Y17XAX6 */  43300000
                 4 $CECCMIN BIT(1),               /* X'80'- REPLY IN    43350000
                                 TO OUTSTANDING CECOM FLAG @Y17XAX6*/   43400000
                 4 $MULTDEV BIT(1),               /* X'40'- MORE THAN   43450000
                                    ONE DEVICE ENTRY FLAG  @Y17XAX6*/   43500000
                 4 $RTNSLCT BIT(1),               /* X'20'- OPERATOR    43550000
                           MADE ROUTINE SELECTION FLAG  @Y17XAX6*/      43600000
                 4 $ERRCNT  BIT(1),               /* X'10'- OPERATOR    43650000
                           SPECIFIED ERROR LOOP COUNT  @Y17XAX6*/       43700000
                 4 $LSTPDEV BIT(1),               /* X'08'- DON'T       43750000
                           ASSIGN MORE PRIMARY DEVICES FLAG  @Y17XAX6*/ 43800000
                 4 $CLEANUP BIT(1),               /* X'04'- SECTION     43850000
                            ENTERED FOR CLEANUP FLAG  @Y17XAX6*/        43900000
                 4 $CTRLMOD BIT(1),               /* X'02'- CONTROL     43950000
                                 MODE AVAILABLE FLAG  @Y17XAX6 */       44000000
                 4 $QSCTMOD BIT(1),               /* X'01'- QUIESCENT   44050000
                                MODE AVAILABLE FLAG  @Y17XAX6*/         44100000
        3 $OLTSIZE FIXED(15) BDY(HWORD),   /* OLT REGION SIZE @Y17XAX6*/44150000
         3 $OLTFLGS CHAR(1),     /* OLT FUNCTIONAL FLAGS @Y17XAX6*/     44200000
                 4 $MANINTV BIT(1),               /* X'80'- MANUAL      44250000
                              INTERVENTION ROUTINE FLAG  @Y17XAX6*/     44300000
                 4 $CLEANRT BIT(1),               /* X'40'-OLT HAS      44350000
                                     CLEANUP ROUTINE FLAG  @Y17XAX6*/   44400000
                 4 $RETAIN BIT(1),                /* X'20'- RETAIN      44450000
                                           IS ACTIVE FLAG @Y17XAX6*/    44500000
                 4 $CONTCB BIT(1),                /* X'10'-CONTINGENT   44550000
                              CONNECTION BROKEN FLAG  @Y17XAX6*/        44600000
                 4 $RETCODE BIT(1),               /* X'08'   @Y17XAX6 */44650000
                 4 $TRACE  BIT(1),                /* X'04'   @Y17XAX6 */44700000
                 4 $LASTSEC BIT(1),               /* X'02'- LAST        44750000
                              SECTION SCHEDULED FLAG  @Y17XAX6*/        44800000
                 4 * BIT(1),            /* X'01'- UNUSED          */    44850000
               3 * CHAR(1),                       /* UNUSED           */44900000
               3 $TOTFLG1 CHAR(1),      /* TOTE 1ST FLAG BYTE @Y17XAX6*/44950000
                 4 $LINESHR BIT(1),               /* X'80'- LINE CAN    45000000
                                          BE SHARED FLAG @Y17XAX6*/     45050000
                 4 $TDATBLK BIT(1),               /* X'40'- TOTE        45100000
                                       MESSAGE BLOCKING FLAG @Y17XAX6*/ 45150000
                 4 $TERMSEC BIT(1),          /* X'20'- TRM REQUESTS     45200000
                          TEST IN BACKUP MODE @Y17XAX6*/                45250000
                 4 $CTEQTT BIT (1),       /* X'10'-CONTROL TERMINAL     45300000
                      AND TEST TERMINAL ARE ON SAME LINE  @Y17XAX6*/    45350000
                 4 * BIT(4),                      /* UNUSED     S22024*/45400000
               3 $TOTFLG2 CHAR(1) BDY(BYTE),      /* TOTE 2ND FLAG      45450000
                                                 BYTE  @Y17XAX6  */     45500000
               3 $R017024 CHAR(1),                /* ROUTINE MASK 017   45550000
                                                 THRU 024 @Y17XAX6*/    45600000
               3 $R025032 CHAR(1),                /* ROUTINE MASK 025   45650000
                                                 THRU 032 @Y17XAX6*/    45700000
               3 $R033040 CHAR(1),                /* ROUTINE MASK 033   45750000
                                                 THRU 040 @Y17XAX6*/    45800000
               3 $R041048 CHAR(1),                /* ROUTINE MASK 041   45850000
                                                 THRU 048 @Y17XAX6*/    45900000
               3 $R049056 CHAR(1),                /* ROUTINE MASK 049   45950000
                                                 THRU 056 @Y17XAX6*/    46000000
               3 $R057064 CHAR(1),                /* ROUTINE MASK 057   46050000
                                                 THRU 064 @Y17XAX6*/    46100000
               3 $R065072 CHAR(1),                /* ROUTINE MASK 065   46150000
                                                 THRU 072 @Y17XAX6*/    46200000
               3 $R073080 CHAR(1),                /* ROUTINE MASK 073   46250000
                                                 THRU 080 @Y17XAX6*/    46300000
               3 $R081088 CHAR(1),                /* ROUTINE MASK 081   46350000
                                                 THRU 088 @Y17XAX6*/    46400000
               3 $R089096 CHAR(1),                /* ROUTINE MASK 089   46450000
                                                 THRU 096 @Y17XAX6*/    46500000
               3 $R097104 CHAR(1),                /* ROUTINE MASK 097   46550000
                                                 THRU 104 @Y17XAX6*/    46600000
               3 $R105112 CHAR(1),                /* ROUTINE MASK 105   46650000
                                                 THRU 112 @Y17XAX6*/    46700000
               3 $R113120 CHAR(1),                /* ROUTINE MASK 113   46750000
                                                 THRU 120 @Y17XAX6*/    46800000
               3 $R121128 CHAR(1),                /* ROUTINE MASK 121   46850000
                                                 THRU 128  @Y17XAX6*/   46900000
               3 $R129136 CHAR(1),                /* ROUTINE MASK 129   46950000
                                                 THRU 136 @Y17XAX6*/    47000000
               3 $R137144 CHAR(1),                /* ROUTINE MASK 137   47050000
                                                 THRU 144 @Y17XAX6*/    47100000
               3 $R145152 CHAR(1),                /* ROUTINE MASK 145   47150000
                                                 THRU 152 @Y17XAX6*/    47200000
               3 $R153160 CHAR(1),                /* ROUTINE MASK 153   47250000
                                                 THRU 160 @Y17XAX6*/    47300000
               3 $R161168 CHAR(1),                /* ROUTINE MASK 161   47350000
                                                 THRU 168 @Y17XAX6*/    47400000
               3 $R169176 CHAR(1),                /* ROUTINE MASK 169   47450000
                                                 THRU 176  @Y17XAX6*/   47500000
               3 $R177184 CHAR(1),                /* ROUTINE MASK 177   47550000
                                                 THRU 184  @Y17XAX6*/   47600000
               3 $R185192 CHAR(1),                /* ROUTINE MASK 185   47650000
                                                 THRU 192 @Y17XAX6*/    47700000
               3 $R193200 CHAR(1),                /* ROUTINE MASK 193   47750000
                                                 THRU 200 @Y17XAX6*/    47800000
               3 $R201208 CHAR(1),                /* ROUTINE MASK 201   47850000
                                                 THRU 208 @Y17XAX6*/    47900000
               3 $R209216 CHAR(1),                /* ROUTINE MASK 209   47950000
                                                 THRU 216 @Y17XAX6*/    48000000
               3 $R217224 CHAR(1),                /* ROUTINE MASK 217   48050000
                                                 THRU 224 @Y17XAX6*/    48100000
               3 $R225232 CHAR(1),                /* ROUTINE MASK 225   48150000
                                                 THRU 232  @Y17XAX6*/   48200000
               3 $R233240 CHAR(1),                /* ROUTINE MASK 233   48250000
                                                 THRU 240 @Y17XAX6*/    48300000
               3 $R241248 CHAR(1),                /* ROUTINE MASK 241   48350000
                                                 THRU 248 @Y17XAX6*/    48400000
               3 $R249255 CHAR(1),                /* ROUTINE MASK 249   48450000
                                                 THRU 255 @Y17XAX6*/    48500000
               3 $RETMASK CHAR(1),       /* RETURN CODE MASK @Y17XAX6*/ 48550000
               3 * CHAR(1),                       /* SPARE            */48600000
               3 * CHAR (6),                   /* SPARE      S05331*/   48650000
               3 $MSGIDAC CHAR (2),       /* ACTIVE OLT ID @Y17XAX6*/   48700000
               3 $TABLE PTR(31) BDY(WORD),        /* ADDRESS OF BRANCH  48750000
                                                      TABLE  @Y17XAX6 */48800000
               3 $PASS PTR(31) BDY(WORD),         /* ADDRESS OF PASSON  48850000
                                                      AREA  @Y17XAX6  */48900000
               3 $EXT  PTR(31) BDY(WORD),         /* ADDRESS OF         48950000
                                            EXTERNAL DATA @Y17XAX6*/    49000000
               3 * CHAR(24) BDY(WORD),            /* SCT EXPANSION      49050000
                                                      AREA   @Y17XAX6 */49100000
             2 TOTSMGRT PTR(31),                  /* SERVICE MANAGER  */49150000
                                                  /*  RETURN SAVE     */49200000
             2 TOTSAVE1 CHAR(72) BDY(WORD),       /* OLT SUBTASK 1ST  */49250000
                                                  /*  SAVE AREA       */49300000
             2 TOTSAVE2 CHAR(72) BDY(WORD),       /* OLT SUBTASK 2ND  */49350000
                                                  /*  SAVE AREA       */49400000
             2 TOTSAVE3 CHAR(72) BDY(WORD),       /* OLT SUBTASK 3RD  */49450000
                                                  /*  SAVE AREA       */49500000
             2 TOTSAVE4 CHAR(72) BDY(WORD),       /* OLT SUBTASK 4TH  */49550000
                                                  /*  SAVE AREA       */49600000
             2 TOTSAVE5 BDY(WORD),                /* OLT SUBTASK 5TH  */49650000
               3 * CHAR(44),                      /*  SAVE AREA       */49700000
               3 TOTOLTPT PTR(31),                                      49750000
               3 * CHAR(16),                                            49800000
               3 TOTOLTEP PTR(31),                                      49850000
               3 * CHAR(4),                                             49900000
             2 TOTSAVE6 CHAR(72) BDY(WORD),       /* OLT SUBTASK 6TH  */49950000
                                                  /* SAVE AREA@Y17XAXU*/50000000
             2 TOTWOSV1 PTR(31),                  /* IEDQWO LEV 1     */50050000
                                                  /* SAVE AREA@Y17XAXU*/50100000
             2 TOTWOSV2 PTR(31),                  /* IEDQWO LEV 2     */50150000
                                                  /* SAVE AREA@Y17XAXU*/50200000
             2 TOTWOSV3 PTR(31),                  /* IEDQWO LEV 3     */50250000
                                                  /* SAVE AREA@Y17XAXU*/50300000
             2 TOTWOSV4 PTR(31),                  /* IEDQWO LEV 4     */50350000
                                                  /* SAVE AREA@Y17XAXU*/50400000
  2 TOTSVEND CHAR(0),  /* END OF TOTE SAVE AREAS  @Y17XAX6*/            50450000
             2 TOTBKASN FIXED(15) BDY(HWORD),     /* MAIN STORAGE     */50500000
                                                  /*  BLOCKS ASSIGNED */50550000
                                                  /*  TO THIS OLT     */50600000
             2 TOTBKRQD FIXED(15) BDY(HWORD),     /* MAIN STORAGE     */50650000
                                                  /*  BLOCKS REQUIRED */50700000
                                                  /*  BY THIS OLT     */50750000
             2 TOTMMSPC CHAR(4) BDY(WORD),        /* OLT UNUSED MAIN  */50800000
                                                  /*  STORAGE SPACE   */50850000
 /*                                                          @Y17XAXU*/ 50900000
 /*            SOURCE TERMINAL ENTRY                         @Y17XAXU*/ 50950000
 /*                                                          @Y17XAXU*/ 51000000
             2 TOTSRENT BDY(WORD),   /* SRC TERMINAL ENTRY   @Y17XAXU*/ 51050000
               3 TOTSROFF FIXED(16), /* TTCIN OF SOURCE      @Y17XAXU*/ 51100000
               3 * CHAR(2),          /* RESERVED             @Y17XAXU*/ 51150000
               3 TOTSRLCB PTR(31),   /* SOURCE LCB ADDRESS   @Y17XAXU*/ 51200000
 /*                                                                   */51250000
 /*            CONTROL TERMINAL ENTRY                                 */51300000
 /*                                                                   */51350000
             2 TOTCTENT BDY(WORD),                /* CONTROL TERMINAL */51400000
                                                  /*  ENTRY           */51450000
               3 TOTCTUCB FIXED(16),              /* C.T. UCB ADDRESS */51500000
               3 TOTCTOFF FIXED(16),              /* OFFSET TO C.T.   */51550000
                                                  /*  TNT ENTRY       */51600000
                                                  /* (DUMMY)  @Y17XAXU*/51650000
               3 TOTCROFF FIXED(16),              /* OFFSET TO C.T.   */51700000
                                                  /* TNT ENTRY        */51750000
                                                  /* (REAL)   @Y17XAXU*/51800000
               3 TOTCRSID FIXED(16),              /* C.T. NETWORK    */ 51850000
                                                  /* ADDRESS @Y17XAXU*/ 51900000
               3 TOTCTRLN CHAR (1),               /* C.T. RELATIVE    */51950000
                                                  /*  LINE NUMBER     */52000000
               3 TOTCTLCB PTR(24),                /* C.T. LCB ADDRESS */52050000
               3 TOTCTTNT PTR(31),                /* C.T. TERMINAL    */52100000
                                                  /*  NAME TABLE ENTRY*/52150000
                                                  /* ADDRESS (DUMMY)  */52200000
               3 TOTCRTNT PTR(31),                /* CT TNT ADDRESS   */52250000
                                                  /* (REAL ENTRY)     */52300000
               3 TOTCTTLN FIXED(15),              /* LENGTH OF CT TTE */52350000
                                                  /*  AREA            */52400000
               3 TOTCTFLG CHAR(1),                /* CONTROL TERMINAL */52450000
                                                  /* FLAGS            */52500000
                 4 TOTCTASN BIT(1),               /* X'80'-   S22024*/  52550000
                                                  /* DUMMY EN-S22024*/  52600000
                                                  /* TRY ASGN.S22024*/  52650000
                 4 TOTCTORN BIT (1),              /* X'40'- CTS22024*/  52700000
                                                  /* ON 3705  S22024*/  52750000
                 4 * BIT(5),                     /* RESERVED @Y17XAXU*/ 52800000
                   4 TOTCTSWD BIT(1),            /* X'01' DIAL S22024*/ 52850000
        3 TOTCTEND CHAR(0),    /* END OF BASIC C.T. AREA  @Y17XAX6*/    52900000
                 3 TOTCTRNL CHAR (8),            /* GROUP NAME S22024*/ 52950000
                                                 /* OF CT LINE S22024*/ 53000000
               3 TOTCTNAM CHAR (9),               /* CONTROL TERMINAL */53050000
                                                  /* NAME IN EBCDIC   */53100000
             2 TOTCTDFL CHAR (1),                /* CONTROL TERMINAL  */53150000
                                                 /* INITIAL CONDITIONS*/53200000
               3 TOTCTTRM BIT(1),                /* X'80'-TERMINAL    */53250000
                                                 /* DEVICE FLAG       */53300000
               3 TOTCTLIN BIT (1),               /* X'40'-LINE ADDRESS*/53350000
                                                 /* FLAG              */53400000
               3 * BIT(1),                       /* UNUSED            */53450000
               3 TOTCTGP BIT(1),                 /* X'10'-GENERAL POLL*/53500000
                                                 /* INITIALLY ACTIVE  */53550000
                                                 /* ON TEST LINE      */53600000
               3 TOTCTLST BIT (1),               /* X'08'-CT INITIALLY*/53650000
                                                 /* STOPPED           */53700000
               3 TOTCTHD BIT (1),                /* X'04'-CT INITIALLY*/53750000
                                                 /* HELD              */53800000
               3 TOTCTIAC BIT (1),               /* X'02'-CT INVITA-  */53850000
                                                 /* TION LIST ENTRY   */53900000
                                                 /* INITIALLY INACTIVE*/53950000
               3 * BIT (1),                      /* UNUSED            */54000000
             2 * CHAR(3),                        /* RESERVED  @Y17XAXU*/54050000
             2 TOTCUTST,                         /* CONTROL INFO FOR  */54100000
                                                 /* $CUTEST MACRO     */54150000
               3 TOTCUFLG CHAR(1),               /* $CUTEST FLAGS     */54200000
                 4 TOTCUDON BIT (1),             /* X'80-CUTEST ISSUED*/54250000
                 4 TOTCUCUP BIT (1),             /* X'40'-CUTEST CLEAN*/54300000
                                                 /* UP REQUIRED       */54350000
                 4 * BIT (6),                    /* UNUSED            */54400000
               3 TOTCU#AD CHAR (1),              /* $CUTEST NUMBER OF   54450000
                                      CONTIGUOUS ADDRESS @Y16XAX6*/     54500000
               3 TOTCUCUU CHAR (2),              /* $CUTEST STARTING  */54550000
                                                 /* ADDRESS           */54600000
               3 TOTCUSAV    CHAR (4),           /* $CUTEST SAVE AREA */54650000
               3 TOTCURS1 CHAR (1),              /* $CUTEST CODE      */54700000
                                                 /* PARAMETER         */54750000
               3 TOTCURS2 CHAR (1),              /* $CUTEST HEX       */54800000
                                                 /* CHANNEL ADDRESS   */54850000
               3 TOTCURS3 CHAR (1),              /* $CUTEST RESERVED  */54900000
                                                 /* BYTE 3 CODE       */54950000
                                                 /* PARAMETER         */55000000
               3 TOTCURS4 CHAR (1),              /* $CUTEST RESERVED  */55050000
                                                 /* BYTE 4 CODE       */55100000
                                                 /* PARAMETER         */55150000
             2 TOTWOOPC CHAR(24),                 /* IEDQWO   SA41602*/ 55200000
                                                  /* OP CNTRL SA41602*/ 55250000
                                                  /* PARM LISTSA41602*/ 55300000
             2 TOTPLIST CHAR (24),               /* OP CONTROL S22024*/ 55350000
                                                 /* PARM LIST  S22024*/ 55400000
               3 TOTOKEY CHAR(1),                /* KEY        S22024*/ 55450000
               3 TOTOQCBA CHAR(3),               /* QCB ADDR   S22024*/ 55500000
               3 TOTOPRI CHAR(1),                /* PRIORITY   S22024*/ 55550000
               3 TOTOLINK CHAR(3),               /* LINK FIELD S22024*/ 55600000
               3 TOTOVBCD CHAR(1),               /* VERB CODE  S22024*/ 55650000
               3 TOTOELNG CHAR(1),               /* LENGTH     S22024*/ 55700000
               3 TOTORLN CHAR(1),                /* RELATIVE   S22024*/ 55750000
                                                 /* LINE NO    S22024*/ 55800000
               3 TOTORTCD CHAR(1),               /* RETURN CODES22024*/ 55850000
               3 TOTOECBA CHAR(4),               /* ECB ADDR   S22024*/ 55900000
                 4 TOTOFLG CHAR(1),              /* FLAG BYTE           55950000
                                                             @YM08136*/ 56000000
                   5 TOTOATTC BIT(1),            /* USE ALTERNATE TTCIN 56050000
                                                             @YM08136*/ 56100000
                   5 *        BIT(7),            /* UNUSED   @YM08136*/ 56150000
                 4 *       CHAR(3),              /* UNUSED   @YM08136*/ 56200000
               3 TOTOLADR CHAR(8),               /* TERM NAME  S22024*/ 56250000
                                                 /* OR LINE    S22024*/ 56300000
                                                 /* ADDRESS    S22024*/ 56350000
             2 TOTOALTT FIXED(16),               /* ALTERNATE TTCIN     56400000
                                                             @YM08136*/ 56450000
             2 * CHAR (38),                      /* UNUSED   @YM08136*/ 56500000
             2 TOTOPCLN PTR(31),                 /* OP CONTROL S22024*/ 56550000
                                                 /* ECB ADDRESSS22024*/ 56600000
                                                 /* FOR CLEANUPS22024*/ 56650000
             2 TOTUSCOR PTR (31),                /* CORE IN USES22024*/ 56700000
 /*                                                                   */56750000
 /*            ALTERNATE PRINTER ENTRY                                */56800000
 /*                                                                   */56850000
             2 TOTAPENT BDY(WORD),                /* ALTERNATE PRINTER*/56900000
                                                  /*  ENTRY           */56950000
               3 TOTAPUCB FIXED(16),              /* A.P. UCB ADDRESS */57000000
               3 TOTAPOFF FIXED(16),              /* OFFSET TO A.P.   */57050000
                                                  /*  TNT ENTRY       */57100000
                                                  /* (DUMMY)  @Y17XAXU*/57150000
               3 TOTAROFF FIXED(16),              /* OFFSET TO A.P.   */57200000
                                                  /* TNT ENTRY        */57250000
                                                  /* (REAL)   @Y17XAXU*/57300000
               3 TOTARSID FIXED(16),              /* NETWORK ADDRESS  */57350000
                                                  /* OF A.P.  @Y17XAXU*/57400000
               3 TOTAPRLN CHAR(1),                /* A.P. RELATIVE    */57450000
                                                  /*  LINE NUMBER     */57500000
               3 TOTAPLCB PTR(24),                /* A.P. LCB ADDRESS */57550000
               3 TOTAPTNT PTR(31),                /* A.P. TERMINAL    */57600000
                                                  /*  NAME TABLE ENTRY*/57650000
                                                  /* ADDRESS (DUMMY)  */57700000
               3 TOTARTNT PTR(31),                /* AP TNT ADDRESS   */57750000
                                                  /* (REAL ENTRY)     */57800000
               3 TOTAPTLN FIXED(15),              /* LENGTH OF AP TTE */57850000
                                                  /* AREA             */57900000
               3 TOTAPFLG CHAR (1),               /* A.P FLAGS S22024*/ 57950000
                 4 TOTAPASN BIT(1),               /* X'80'-   S22024*/  58000000
                                                  /* DUMMY EN-S22024*/  58050000
                                                  /* TRY ASGN.S22024*/  58100000
                 4 TOTAPORN BIT (1),              /* X'40'- APS22024*/  58150000
                                                  /* ON 3705  S22024*/  58200000
                 4 * BIT(5),                     /* RESERVED @Y17XAXU*/ 58250000
                 4 TOTAPSWD BIT(1),              /* X'01' DIAL S22024*/ 58300000
       3 TOTAPEND CHAR(0),     /* END OF BASIC A.P. AREA  @Y17XAX6*/    58350000
                 3 TOTAPRNL CHAR (8),            /*GROUP NAME S05331*/  58400000
                                                 /* OF AP LINE S05331*/ 58450000
               2 TOTAPDFL CHAR (1),              /* ALTERNATE PRINTER*/ 58500000
                                                 /* INITIAL CONDITIONS*/58550000
               3 TOTAPTER BIT (1),               /* X'80'-TERMINAL    */58600000
                                                 /* DEVICE FLAG       */58650000
               3 TOTAPLIN BIT (1),               /* X'40'-LINE ADDRESS*/58700000
                                                 /* FLAG              */58750000
               3 * BIT (1),                      /* UNUSED            */58800000
               3 TOTAPGP BIT (1),                /* X'10'-GENERAL POLL*/58850000
                                                 /* INITIALLY ACTIVE  */58900000
                                                 /* ON TEST LINE      */58950000
               3 TOTAPLST BIT (1),               /* X'08'-AP INITIALLY*/59000000
                                                 /* STOPPED           */59050000
               3 TOTAPHD BIT (1),                /* X'04'-AP INITIALLY*/59100000
                                                 /* HELD              */59150000
               3 TOTAPIAC BIT (1),               /* X'02'-AP INVITA-  */59200000
                                                 /* TION LIST ENTRY   */59250000
                                                 /* INITIALLY INACTIVE*/59300000
               3 * BIT (1),                      /* UNUSED            */59350000
             2 * FIXED(31),                      /* UNUSED    @ZM47554*/59370010
             2 TOTAPDCB PTR (31),                 /* LOCAL      S22024*/59600000
                                                  /* PRINTER    S22024*/59650000
                                                  /* DCB ADDRESSS22024*/59700000
             2 TOTPDECB CHAR(20) BDY(WORD),       /* LOCAL PRINTER    */59750000
                                                  /*  DECB            */59800000
             2 TOTPARML PTR (31),                /* ADDR OF   SA41612*/ 59850000
                                                 /* PARM LIST SA41612*/ 59900000
                                                 /* FOR MACRO SA41612*/ 59950000
                                                 /* CALL      SA41612*/ 60000000
             2 TOTOLTMQ PTR(31),                  /* SUBTASK MESSAGE  */60050000
                                                  /*  QUEVE           */60100000
             2 TOTOTECB CHAR(4) BDY(WORD),        /* TOTE SUBTASK ECB */60150000
             2 TOTRESSV PTR(31),                  /* POINTER TO MOTHER*/60200000
                                                  /*  TASK SAVE AREA  */60250000
             2 TOTTCBAD PTR(31),                  /* SUBTASK TCB ADDR */60300000
             2 TOTCMPCD CHAR(4),                  /* SUBTASK          */60350000
                                                  /*  COMPLETION CODE */60400000
             2 TOTOLTPL BDY(WORD),                /* OLT INPUT        */60450000
                                                  /*  PARAMETER LIST  */60500000
               3 * CHAR (8),                     /* UNUSED            */60550000
               3 TOT#TBLE PTR(31),     /* BRANCH TABLE ADDR  @Y17XAX6*/ 60600000
             2 TOTWTORP BDY(WORD),                /* WTOR PARAMETER   */60650000
                                                  /*  LIST FOR        */60700000
                                                  /*  OPERATOR        */60750000
                                                  /*  COMMUNICATION   */60800000
               3 TOTINCNT PTR(8),                 /* REPLY BYTE COUNT */60850000
               3 TOTINADR PTR(24),                /* REPLY BUFFER ADDR*/60900000
               3 TOTINECB PTR(31),                /* REPLY ECB ADDRESS*/60950000
             2 TOTWTOPL BDY(WORD),                /* WTO & WTOR PARM  */61000000
                                                  /*  LIST FOR        */61050000
                                                  /*  OPERATOR        */61100000
                                                  /*  COMMUNICATION   */61150000
               3 * CHAR (1),                     /* UNUSED            */61200000
               3 TOTOTCNT PTR(8),                 /* OUT MESSAGE COUNT*/61250000
               3 * CHAR (2),                     /* UNUSED            */61300000
               3 TOTOTBUF CHAR (84),             /* OUTPUT AREA       */61350000
                                                  /*  BUFFER          */61400000
               3 TOTINBUF CHAR(80),               /* REPLY BUFFER     */61450000
             2 TOTOLTID CHAR(2) BDY(HWORD),       /* TOTE OLT         */61500000
                                                  /*  IDENTIFICATION  */61550000
             2 TOTRTCOD CHAR(1),                  /* SERVICE MODULE   */61600000
                                                  /*  RETURN CODE     */61650000
             2 * CHAR(1),                         /* UNUSED           */61700000
             2 TOTPLNKQ BDY(WORD),                /* PLINK MODULE     */61750000
                                                  /*  QUEUE           */61800000
               3 TOTPLFWD PTR(31),                /* QUEUE FORWARD    */61850000
                                                  /*  POINTER         */61900000
               3 TOTPLBKW PTR(31),                /* QUEUE BACKWARD   */61950000
                                                  /*  POINTER         */62000000
      2 * CHAR(4),      /* RESERVED    @Y17XAX6*/                       62050000
             2 TOTWKSPC CHAR(128) BDY(DWORD),     /* TOTE WORK AREA   */62100000
     2 TOTWKEND CHAR(0),  /* WORK SPACE END  @Y17XAX6*/                 62150000
             2 * CHAR (20),                       /* UNUSED           */62200000
             2 TOTAVTPT PTR (31),                 /* ADDRESS OF AVT   */62250000
             2 TOTSTAE PTR (31),                  /* ADDRESS OF S22024*/62300000
                                                  /* STAE EXIT  S22024*/62350000
                                                  /* ROUTINE    S22024*/62400000
             2 TOTRESPL PTR(31),                  /* ADDRESS OF TOTE  */62450000
                                                  /*  RESIDENT        */62500000
                                                  /*  PARAMETER LIST  */62550000
             2 TOTFLG01 CHAR(1) ABNL,             /* TOTE 1ST FLAG    */62600010
                                                  /*  BYTE   @G36XRXV */62650010
               3 TOTFINAL BIT (1),               /* FINAL MSG  S05331*/ 62700000
                                                 /* INDICATOR  S05331*/ 62750000
               3 TOTCONFG BIT (1),                /* X'40'-CONFIGURA-*/ 62800000
                                                  /* RUN             */ 62850000
               3 TOTIPLCU BIT (1),               /* X'20'-FORCES05331*/ 62900000
                                                 /* CLEANUP    S05331*/ 62950000
                                                 /* FROM IPL   S05331*/ 63000000
               3 TOTEXIT BIT(1),                 /*X'10'- IEDQWO     */ 63050000
                                                 /* CONTROL FLOW      */63100000
                                                 /* FLAG      @Y17XAXU*/63150000
               3 TOTAPTST BIT(1),        /* AP ON TEST LINE   @Y17XAXU*/63200000
               3 TOTPRMPT BIT (1),                /* X'04'-     S22024*/63250000
                                                  /* PROMPTER   S22024*/63300000
                                                  /* RUN        S22024*/63350000
               3 TOTCLNST BIT(1) ABNL, /*CLEANUP STARTED      @G36XRXV*/63400010
               3 TOTCLNED BIT(1),   /* CLEANUP ENDED          @YM08158*/63450000
             2 TOTFLG02 CHAR(1),                  /* TOTE 2ND FLAG    */63500000
                                                  /*  BYTE            */63550000
                 3 TOTTTSPE BIT(1),      /* TEST SESSION      @Y17XAXU*/63600000
                                         /* PEND END          @Y17XAXU*/63650000
                 3 TOTTSST BIT(1),       /* CT/AP IN TEST MODE@Y17XAXU*/63700000
                 3 TOTDEV0X BIT(1),               /* X'20'-TESTS22024*/ 63750000
                                                  /* DEVICE ON S22024*/ 63800000
                                                  /* 270X      S22024*/ 63850000
               3 TOTOLTRQ BIT(1),                 /* X'10'-ON- S22024*/ 63900000
                                                  /* LINE TEST S22024*/ 63950000
                                                  /* REQUEST   S22024*/ 64000000
                                                  /* FLAG      S22024*/ 64050000
               3 TOTCHKSZ BIT(1),                 /* X'08'- UPDATE    */64100000
                                                  /*  SUBTASK STORAGE */64150000
                                                  /*  ALLOCATION FLAG */64200000
               3 TOTCONMD BIT (1),                /* X'04'-GETSA41597*/ 64250000
                                                  /* CONC MOD SA41597*/ 64300000
                                                  /* FOR INIT SA41597*/ 64350000
                                                  /* STATUS   SA41597*/ 64400000
                                                  /* SET UP   SA41597*/ 64450000
               3 TOTCONCU BIT(1),                 /* X'02'CONCSA41597*/ 64500000
                                                  /* CLEANUP  SA41597*/ 64550000
                                                  /* REQUIRED SA41597*/ 64600000
               3 TOTDEVRN BIT(1),                 /* X'01-TEST S22024*/ 64650000
                                                  /* DEVICE ON S22024*/ 64700000
                                                  /* 3705      S22024*/ 64750000
             2 TOTFLG03 CHAR(1),                  /* TOTE 3RD FLAG    */64800000
                                                  /*  BYTE            */64850000
               3 TOTAPOER BIT(1),                 /* X'80'- ALTERNATE */64900000
                                                  /*  PRINTER OPTION  */64950000
                                                  /*  ERROR FLAG      */65000000
               3 TOTTDFER BIT(1),                 /* X'40'- TEST      */65050000
                                                  /*  DEVICE FIELD    */65100000
                                                  /*  ERROR FLAG      */65150000
               3 TOTTSTER BIT(1),                 /* X'20'- TEST ID   */65200000
                                                  /*  FIELD ERROR FLAG*/65250000
               3 TOTOPTER BIT(1),                 /* X'10'- OPTION    */65300000
                                                  /*  FIELD ERROR FLAG*/65350000
               3 TOTIMNCP BIT(1),                 /* X'08'- TEMPORARY */65400000
                                                  /*  NO CONTROL PRINT*/65450000
                                                  /*  FLAG            */65500000
               3 TOTTSINC BIT(1),                 /* X'04'- INCLUSIVE */65550000
                                                  /*  TEST ID ENTRY   */65600000
                                                  /*  FLAG            */65650000
               3 TOTREPEX BIT(1),                /* X'02'-    SA41613*/ 65700000
                                                 /* REPLY     SA41613*/ 65750000
                                                 /* EXPECTED  SA41613*/ 65800000
                                                 /* FLAG      SA41613*/ 65850000
               3 * BIT (1),                      /* UNUSED     S22024*/ 65900000
             2 TOTFLG04 CHAR(1),                  /* TOTE 4TH FLAG    */65950000
                                                  /*  BYTE            */66000000
               3 TOTNUMDV BIT(1),                 /* X'80'- NUMERIC   */66050000
                                                  /*  TRM ENTRY FLAG  */66100000
               3 TOTDTCHD BIT(1),                 /* X'40'- SUBTASK   */66150000
                                                  /*  ALREADY DETACHED*/66200000
                                                  /*  FLAG            */66250000
               3 TOTCLOSE BIT(1),                 /* X'20'- TCAM      */66300000
                                                  /*  CLOSEDOWN IN    */66350000
                                                  /*  PROGRESS FLAG   */66400000
               3 TOTPRCTF BIT (1),/*PRIMARY TEST DEVICE COUNTERFEIT     66450000
                                                            @YM08407*/  66500000
               3 TOTSCCTF BIT (1),/* SECONDARY TEST DEVICE COUNTERFEIT  66550000
                                                            @YM08407*/  66600000
               3 * BIT (1),                      /* UNUSED     S22024*/ 66650000
               3 * BIT (1),                      /* UNUSED     S22024*/ 66700000
               3 TOTTTSWT BIT(1),                 /* X'01'- TEST      */66750000
                                                  /*  TERMINAL LINE   */66800000
                                                  /*  SWITCHED FLAG   */66850000
             2 TOTFLG05 CHAR(1),                  /* TOTE 5TH FLAG    */66900000
                                                  /*  BYTE            */66950000
               3 TOTPRINT BIT(1),                 /* X'80'- ACCESS    */67000000
                                                  /*  METHOD PRINT    */67050000
                                                  /*  FLAG            */67100000
               3 TOTCECOM BIT(1),                 /* X'40'- ACCESS    */67150000
                                                  /*  METHOD CECOM    */67200000
                                                  /*  FLAG            */67250000
               3 TOTREPLY BIT(1),                 /* X'20'- ACCESS    */67300000
                                                  /*  METHOD CECOM    */67350000
                                                  /*  WITH REPLY FLAG */67400000
               3 TOTSRCE BIT(1),     /* SEND MSG TO SOURCE   @Y17XAXU*/ 67450000
               3 TOTSRCON BIT(1),    /* TRM ENTERED FROM SRC @Y17XAXU*/ 67500000
               3 TOTTMOUT BIT(1),                 /* X'04'- WAIT      */67550000
                                                  /*  TIMEOUT FLAG    */67600000
               3 TOTEXIOF BIT(1),                 /* X'02'- ACCESS    */67650000
                                                  /*  METHOD EXIO FLAG*/67700000
               3 TOTNDMSG BIT(1),                 /* X'01'- SEND      */67750000
                                                  /*  CANCEL OR       */67800000
                                                  /*  TERMINATE       */67850000
                                                  /*  MESSAGE FLAG    */67900000
             2 TOTFLG06 CHAR(1),                  /* TOTE 6TH FLAG    */67950000
                                                  /*  BYTE            */68000000
               3 TOTOTERM BIT(1),                 /* X'80'-SECTION    */68050000
                                                  /*  TERMINATE FLAG  */68100000
               3 TOTCBOPN BIT(1),                 /* X'40'-CANCEL     */68150000
                                                  /* BEFORE OPEN      */68200000
               3 TOTWACAN BIT(1),                 /* X'20'-CANCEL     */68250000
                                                  /* REQUEST PENDING  */68300000
               3 TOTNCMFG BIT(1),                 /* X'10'-NON-CONCUR-*/68350000
                                                  /*  RENT MODE FLAG  */68400000
               3 TOTABEND BIT(1),                 /* X'08'- OLT HAS   */68450000
                                                  /*  ABENDED FLAG    */68500000
               3 TOTCANCL BIT(1),                 /* X'04'- CANCEL    */68550000
                                                  /*  TESTING FLAG    */68600000
               3 TOTOTACT BIT(1),                 /* X'02'- OLT ACTIVE*/68650000
                                                  /*  FLAG            */68700000
               3 TOTNPERR BIT(1),                 /* X'01'- NO PERMA- */68750000
                                                  /*  NENT ERROR FLAG */68800000
             2 TOTFLG07 CHAR(1),                  /* TOTE 7TH FLAG    */68850000
                                                  /*  BYTE            */68900000
               3 TOTPRIEX BIT(1),                 /* X'80'- PRIMARY   */68950000
                                                  /*  DEVICE FOR      */69000000
                                                  /*  EXIO/WAITIO FLAG*/69050000
               3 TOTSECEX BIT(1),                 /* X'40'- SECONDARY */69100000
                                                  /*  DEVICE FOR      */69150000
                                                  /*  EXIO/WAITIO FLAG*/69200000
               3 * BIT (1),                      /* UNUSED     S22024*/ 69250000
               3 * BIT (1),                      /* UNUSED            */69300000
               3 TOTMSCEC BIT(1),                 /* X'08'- TOTE      */69350000
                                                  /*  MESSAGE SOURCE  */69400000
                                                  /*  FLAG - CECOM    */69450000
               3 TOTMSREP BIT(1),                 /* X'04'- TOTE      */69500000
                                                  /*  MESSAGE SOURCE  */69550000
                                                  /* 'FLAG - CECOM    */69600000
               3 TOTMSPRT BIT(1),                 /* X'02'- TOTE      */69650000
                                                  /*  MESSAGE SOURCE  */69700000
                                                  /*  FLAG - CECOM    */69750000
               3 TOTMSSRC BIT(1), /* TOTE MESSAGE SOURCE FLAG @Y17XAX6*/69800000
             2 TOTFLG08 CHAR(1),                  /* TOTE 8TH FLAG    */69850000
                                                  /*  BYTE            */69900000
               3 TOTFMCTL BIT(4),                 /* BITS 0-3 ARE     */69950000
                                                  /*  DPRINT FORMS    */70000000
                                                  /*  CONTROL FLAGS   */70050000
               3 * BIT(4),                        /* BITS 4-7 ARE     */70100000
                                                  /*  DPRINT LEVEL    */70150000
                                                  /*  CONTROL FLAGS   */70200000
             2 TOTFLG09 CHAR(1),                  /* TOTE 9TH FLAG    */70250000
                                                  /*  BYTE            */70300000
               3 TOTAPCON BIT(1),                 /* X'80'- PRINTER = */70350000
                                                  /*  SYSTEM CONSOLE  */70400000
                                                  /*  FLAG            */70450000
               3 TOTAPOUT BIT(1),                 /* X'40'- PRINTER = */70500000
                                                  /*  SYSTEM PRINTER  */70550000
                                                  /*  FLAG            */70600000
               3 TOTCTCON BIT(1),                 /* X'20'- CONTROL   */70650000
                                                  /*  TERMINAL = SYS  */70700000
                                                  /*  CONSOLE FLAG    */70750000
               3 TOTAPTRM BIT(1),                 /* X'10'- PRINTER = */70800000
                                                  /*  TERMINAL FLAG   */70850000
               3 TOTNOBRK BIT (1),               /* X'08' - NO S22024*/ 70900000
                                                 /* BREAK OPT  S22024*/ 70950000
               3 TOTLNCON BIT (1),               /* X'04'-LINE S22024*/ 71000000
                                                 /* CONN DONE  S22024*/ 71050000
               3 TOTPRECT BIT(1),                 /* X'02'- NO        */71100000
                                                  /*  ALTERNATE       */71150000
                                                  /*  PRINTER FLAG    */71200000
               3 TOTMACFT BIT(1),                 /* X'01'-UN- S22024*/ 71250000
                                                  /* SUPPORTED S22024*/ 71300000
                                                  /* MACRO     S22024*/ 71350000
                                                  /* FUNCTION  S22024*/ 71400000
             2 TOTFLG10 CHAR(1),                  /* TOTE 10TH FLAG   */71450000
                                                  /*  BYTE            */71500000
               3 TOTTERMS BIT(1),                 /* X'80'- TEST      */71550000
                                                  /*  DEVICES=TERMINAL*/71600000
                                                  /*  FLAG            */71650000
               3 * BIT (1),                      /* UNUSED     S22024*/ 71700000
               3 * BIT (1),                      /* UNUSED     S22024*/ 71750000
               3 * BIT (1),                      /* UNUSED    S22024*/  71800000
               3 TOTTNTRQ BIT(1),                 /* X'08'- DUMMY TNT */71850000
                                                  /*  ENTRY REQUEST   */71900000
                                                  /*  FLAG            */71950000
               3 TOTOLTED BIT(1),                 /* X'04'- ON-LINE   */72000000
                                                  /*  TEST ENDED FLAG */72050000
               3 TOTOLTWT BIT(1),                 /* X'02'- ON-LINE   */72100000
                                                  /*  TEST WAITING    */72150000
                                                  /*  FLAG            */72200000
               3 TOTOLTRS BIT(1),                 /* X'01'- ON-LINE   */72250000
                                                  /*  TEST RESTART    */72300000
                                                  /*  FLAG            */72350000
             2 TOTTTBEL PTR(8),                  /* TERMINAL NAME     */72400000
                                                  /*  TABLE ENTRY NAME*/72450000
                                                  /*  LENGTH          */72500000
             2 * CHAR (1),                       /* RESERVED          */72550000
 %IF CONFG='YES'  %THEN                                                 72600000
    %GOTO CNFBYP;                                                       72650000
             2 TOTEXT CHAR(56) BDY(WORD),         /* EXTERNAL DATA    */72700000
                                                  /*  BUFFER          */72750000
             2 TOTPASS CHAR(64) BDY (WORD),       /* PASSON DATA      */72800000
                                                  /*  BUFFER          */72850000
             2 TOTPRECB CHAR(4),                  /* PRIMARY ECB      */72900000
               3 TOTPRIBK CHAR(4),                /* PRIMARY TEST     */72950000
                                                  /* DEVICE I/O       */73000000
                                                  /*  CONTROL BLOCKS  */73050000
                 4 TOTTRMBF CHAR(4),              /* TRM BUFFER FOR   */73100000
                                         /*  TRM ANALYSIS  @Y17XAX6*/   73150000
 /*                                                                   */73200000
 /*            PRIMARY TEST DEVICE ENTRY                              */73250000
 /*                                                                   */73300000
             2 TOTPRENT BDY(WORD),                /* TOTE PRIMARY TEST*/73350000
                                                  /*  DEVICE ENTRY    */73400000
               3 TOTPRUCB FIXED(16),              /* PRIMARY DEVICE   */73450000
                                                  /*  UCB ADDRESS     */73500000
               3 TOTPCOFF FIXED(16),              /* OFFSET TO SECOND */73550000
                                                  /* TNT ENTRY        */73600000
                                                  /* (DUMMY)  @Y17XAXU*/73650000
               3 TOTPROFF FIXED(16),              /* OFFSET TO PRIMARY*/73700000
                                                  /*  TNT ENTRY       */73750000
                                                  /* (REAL)   @Y17XAXU*/73800000
               3 TOTPRSID FIXED(16),              /* NETWORK ADDRESS  */73850000
                                                  /* OF PRI   @Y17XAXU*/73900000
               3 TOTPRRLN CHAR(1),                /* PRIMARY DEVICE   */73950000
                                                  /*  RELATIVE LINE   */74000000
                                                  /*  NUMBER          */74050000
               3 TOTPRLCB PTR(24),                /* 3705 LCB @Y17XAX6*/74100000
                                                  /* ADDRESS  @Y17XAXU*/74150000
               3 TOTPDTNT PTR(31),                /* PRIMARY TNT      */74200000
                                                  /* ADDRESS          */74250000
                                                  /* (DUMMY)  @Y17XAXU*/74300000
               3 TOTTNTPR PTR(31),                /* PRIMARY TERMINAL */74350000
                                                  /* TNT ADDRESS -REAL*/74400000
               3 TOTPRLEN FIXED(15),              /* PRIMARY TTE AREA */74450000
                                                  /* LENGTH   @Y17XAXU*/74500000
               3 TOTPRFLG CHAR(1),                /* PRIMARY          */74550000
                                                  /* FLAGS    @Y17XAXU*/74600000
                4 TOTPRTAS BIT(1),                /* PRIMARY TNT      */74650000
                                                  /* ASSIGNED @Y17XAXU*/74700000
                4 TOTPRLU BIT(1),                 /* LU TERM  @Y17XAXU*/74750000
       4 TOTPPRSC BIT(1),  /* ON=PRIMARY, OFF=SECONDARY @Y17XAX6*/      74800000
    4 TOTPUNRD BIT(1),  /* ON=UNREAD DATA, OFF=NO UNREAD DATA @Y17XAX6*/74850000
   4 TOTPREX BIT(1),  /* EXCEPTION RESPONSE  @Y17XAX6*/                 74900000
   4 TOTPRFME BIT(1),  /* DEFINITE RESPONSE  @Y17XAX6*/                 74950000
   4 TOTPEXNM BIT(1), /* ON=EXPEDITED, OFF=NORMAL  @Y17XAX6*/           75000000
                4 * BIT(1),                       /* RESERVED @Y17XAX6*/75050000
               3 * CHAR(1),                       /* RESERVED @Y17XAXU*/75100000
               3 TOTPRQCB PTR (31),               /* PRIMARY QCBS22024*/75150000
                                                  /* ADDRESS    S22024*/75200000
               3 TOTPRCCW PTR (31),               /* ADDRESS OF S22024*/75250000
                                                  /* READ CCW   S22024*/75300000
                                                  /* FOR PRIMARYS22024*/75350000
                                                  /* TEST DEVICES22024*/75400000
               3 TOTPRBUF PTR (31),               /* ADDRESS OF S22024*/75450000
                                                  /* BUFFER CON-S22024*/75500000
                                                  /* TAINING    S22024*/75550000
                                                  /* READ DATA  S22024*/75600000
                                                  /* FOR PRIMARYS22024*/75650000
                                                  /* TTE AREA         */75700000
 /*                                                                   */75750000
     /* PRIMARY DEVICE DATA BLOCKING FIELD                            */75800000
 /*                                                                   */75850000
             2 TOTPDTBF POINTER (31),             /* RESPONSE BUFFER  */75900000
                                                  /*  ADDRESS         */75950000
             2 TOTPDTCT FIXED (15),               /* RESPONSE BUFFER  */76000000
                                                  /*  SIZE            */76050000
             2 TOTPFLGS CHAR (1),                 /* FLAGS            */76100000
             2 * CHAR (1),                        /* UNUSED  @ZM47554 */76150010
             2 TOTPRSN CHAR(4) BDY(WORD),         /* PRIMARY SEQ      */76155010
                                                  /* NUMBER FIELD     */76160010
                                                  /*         @ZM47554 */76165010
               3 * CHAR(2),                       /* FLAGS   @ZM47554 */76170010
               3 TOTPRSEQ FIXED(16),              /* SEQUENCE NUMBER  */76175010
                                                  /* (IN SNA TH )     */76180010
                                                  /*         @ZM47554 */76185010
             2 TOTPTECB PTR(31),                  /* PRIMARY TECB ADDR*/76200000
             2 TOTPRIOB CHAR (44),                /* PRIMARY   S22024*/ 76250000
                                                  /* IOB       S22024*/ 76300000
             2 TOTPRDCB CHAR (72) BDY(WORD), /* PRIMARY DCB @Y17XAX6*/  76350000
               3 * CHAR (44),                     /* UNUSED    S22024*/ 76400000
               3 TOTPRDEB PTR (31),               /* PRIMARY   S22024*/ 76450000
                                                  /* DEB ADDR  S22024*/ 76500000
             2 TOTSCECB CHAR(4),                  /* SECONDARY ECB    */76550000
               3 TOTSCIBK CHAR(4),                /* SECONDARY TEST   */76600000
                                                  /* DEVICE I/O       */76650000
                                                  /*  CONTROL BLOCKS  */76700000
 /*                                                                   */76750000
 /*            SECONDARY TEST DEVICE ENTRY                            */76800000
 /*                                                                   */76850000
             2 TOTSCENT BDY(WORD),                /* TOTE SECONDARY   */76900000
                                                  /*  TEST DEVICE     */76950000
                                                  /*  ENTRY           */77000000
               3 TOTSCUCB FIXED(16),              /* SECONDARY DEVICE */77050000
                                                  /*  UCB ADDRESS     */77100000
               3 TOTNCOFF FIXED(16),              /* OFFSET TO        */77150000
                                                  /* SECONDARY TNT    */77200000
                                                  /* ENTRY            */77250000
                                                  /* (DUMMY)  @Y17XAXU*/77300000
               3 TOTSCOFF FIXED(16),              /* OFFSET TO        */77350000
                                                  /*  SECONDARY TNT   */77400000
                                                  /*  ENTRY           */77450000
                                                  /* (REAL)   @Y17XAXU*/77500000
               3 TOTSRSID FIXED(16),              /* NETWORK ADDRESS  */77550000
                                                  /* OF SEC   @Y17XAXU*/77600000
               3 TOTSCRLN CHAR(1),                /* SECONDARY DEVICE */77650000
                                                  /*  RELATIVE LINE   */77700000
                                                  /*  NUMBER          */77750000
               3 TOTSCLCB PTR(24),                /* 3705 LCB @Y17XAX6*/77800000
                                                  /* ADDRESS  @Y17XAXU*/77850000
               3 TOTSDTNT PTR(31),                /* SECONDARY        */77900000
                                                  /* TNT ENTRY        */77950000
                                                  /* ADDRESS  @Y17XAXU*/78000000
                                                  /* (DUMMY)  @Y17XAXU*/78050000
               3 TOTSRTNT PTR(31),                /* SECONDARY        */78100000
                                                  /* TERMINAL TNT ADDR*/78150000
                                                  /* (REAL ENTRY)     */78200000
               3 TOTSCLEN FIXED(15),              /* SECONDARY TTE    */78250000
                                                  /* AREA LEN @Y17XAXU*/78300000
               3 TOTSCFLG CHAR(1),                /* SECONDARY        */78350000
                                                  /* FLAGS    @Y17XAXU*/78400000
                4 TOTSCTAS BIT(1),                /* SECONDARY TNT    */78450000
                                                  /* ASSIGNED @Y17XAXU*/78500000
                4 TOTSCLU BIT(1),                 /* LU TERM  @Y17XAXU*/78550000
  4 TOTSPRSC BIT(1),  /* ON=PRIMARY, OFF=SECONDARY  @Y17XAX6*/          78600000
  4 TOTSUNRD BIT(1),  /* ON=UNREAD DATA, OFF=NO UNREAD DATA @Y17XAX6*/  78650000
  4 TOTSCEX BIT(1), /* EXCEPTION RESPONSE @Y17XAX6*/                    78700000
  4 TOTSCFME BIT(1), /* DEFINITE RESPONSE  @Y17XAX6*/                   78750000
  4 TOTSEXNM BIT(1), /* ON=EXPEDITED, OFF=NORMAL  @Y17XAX6*/            78800000
                4 * BIT(1),                       /* RESERVED @Y17XAX6*/78850000
               3 * CHAR(1),                       /* RESERVED @Y17XAXU*/78900000
               3 TOTSCQCB PTR (31),               /* SECONDARY  S22024*/78950000
                                                  /* QCB ADDRESSS22024*/79000000
               3 TOTSCCCW PTR (31),               /* ADDRESS OF S22024*/79050000
                                                  /* READ CCW   S22024*/79100000
                                                  /* FOR SECON- S22024*/79150000
                                                  /* DARY TEST  S22024*/79200000
                                                  /* DEVICE     S22024*/79250000
               3 TOTSCBUF PTR(31),                /* ADDRESS OF S22024*/79300000
                                                  /* BUFFER CON-S22024*/79350000
                                                  /* TAINING    S22024*/79400000
                                                  /* READ DATA  S22024*/79450000
                                                  /* FOR SECON- S22024*/79500000
                                                  /* DARY TEST  S22024*/79550000
                                                  /* DEVICE     S22024*/79600000
 /*                                                                   */79650000
     /* SECONDARY DEVICE DATA BLOCKING FIELD                          */79700000
 /*                                                                   */79750000
             2 TOTSDTBF POINTER (31),             /* RESPONSE BUFFER  */79800000
                                                  /* ADDRESS          */79850000
             2 TOTSDTCT FIXED (15),               /* RESPONSE BUFFER  */79900000
                                                  /*  SIZE            */79950000
             2 TOTSFLGS CHAR (1),                 /* FLAGS            */80000000
             2 * CHAR (1),                        /* UNUSED  @ZM47554 */80050010
             2 TOTSCSN CHAR(4) BDY(WORD),         /* SECONDARY SEQ    */80055010
                                                  /* NUMBER FIELD     */80060010
                                                  /*         @ZM47554 */80065010
               3 * CHAR(2),                       /* FLAGS   @ZM47554 */80070010
               3 TOTSCSEQ FIXED(16),              /* SEQUENCE NUMBER  */80075010
                                                  /* (IN SNA TH )     */80080010
                                                  /*         @ZM47554 */80085010
             2 TOTSTECB CHAR(4),                  /* SECONDARY TECB   */80100000
                                                  /*  ADDRESS         */80150000
             2 TOTSCIOB CHAR (44),                /* SECONDARY S22024*/ 80200000
                                                  /* IOB       S22024*/ 80250000
        2 TOTSCDCB CHAR (72) BDY(WORD), /* SECONDARY DCB   @Y17XAX6*/   80300000
                                                  /* DCB       S22024*/ 80350000
               3 * CHAR (44),                     /* UNUSED    S22024*/ 80400000
               3 TOTSCDEB PTR (31),               /* SECONDARY S22024*/ 80450000
                                                  /* DEB ADDR  S22024*/ 80500000
             2 TOTCROLT CHAR (8),                 /* CURRENT   S22024*/ 80550000
                                                  /* OLT ID    S22024*/ 80600000
               3 TOTTRMND CHAR (1),               /* END OF    S22024*/ 80650000
                                                  /* TRM BUFFERS22024*/ 80700000
             2 TOTOLTTB (10) CHAR(3),             /* OLT ID    S22024*/ 80750000
                                                  /* TABLE     S22024*/ 80800000
             2 TOTOLTTE CHAR (0),        /* END OF TABLE @Y17XAX6*/     80850000
           2 TOTCONTB (10) CHAR (1),              /* CONC INITSA41597*/ 80900000
                                                  /* STAT TBL SA41597*/ 80950000
           2 TOTCONCT CHAR (1),                   /* CONC STATSA41597*/ 81000000
                                                  /* FOR CT   SA41597*/ 81050000
           2 TOTCONAP CHAR (1),                   /* CONC STATSA41597*/ 81100000
                                                  /* FOR AP   SA41597*/ 81150000
           2 TOTCONND CHAR (0),        /* END OF TABLE  @Y17XAX6*/      81200000
             2 * CHAR (38),                       /* UNUSED   SA41597*/ 81250000
             2 TOTTDTBL (10) CHAR(4),             /* TOTE TEST DEVICE */81300000
                                                  /*  TABLE           */81350000
               3 * CHAR(1),                                             81400000
                 4 TOTTDTRM BIT(1),               /* X'80'- TERMINAL  */81450000
                                                  /*  DEVICE FLAG     */81500000
                 4 TOTTDLIN BIT(1),               /* X'40' - LINE ADDR*/81550000
                                                  /*  FLAG            */81600000
                 4 TOTTDGRB BIT(1),               /* X'20'-TEST DEVICE*/81650000
                                                  /* GRABBED FLAG     */81700000
                 4 TOTTDORN BIT(1),               /* X'10'-TEST S22024*/81750000
                                                  /* DEVICE ON  S22024*/81800000
                                                  /* A 3705     S22024*/81850000
                 4 TOTTDLST BIT(1),               /* X'08' - TEST     */81900000
                                                  /*  DEVICE INITIALLY*/81950000
                                                  /*  STOPPED         */82000000
                 4 TOTTDTHD BIT(1),               /* X'04' - TEST     */82050000
                                                  /*  DEVICE INITIALLY*/82100000
                                                  /*  HELD            */82150000
                 4 TOTTDIAC BIT(1),               /* X'02' - TEST     */82200000
                                                  /*  DEVICE INVITA-  */82250000
                                                  /*  TION LIST ENTRY */82300000
                                                  /*  INITIALLY       */82350000
                                                  /*  INACTIVE        */82400000
                 4 TOTTSWPM BIT(1),              /*X'01'-SWITCHY06330*/ 82450000
                                                 /* HAS BEEN   Y06330*/ 82500000
                                                 /* PERFORMED  Y06330*/ 82550000
               3 * CHAR (3),                     /* SKIP   @Y17XAX6 */  82600000
               2 TOTTDEND CHAR(0),        /* END OF TABLE  @Y17XAX6*/   82650000
 /*                                                                   */82700000
     /* WAITIO ECB LIST                                               */82750000
 /*                                                                   */82800000
             2 TOTWECBA POINTER(31),              /* POINTER TO ECB   */82850000
                                                  /* FOR TEST DEVICE  */82900000
             2 TOTECBPT POINTER (31),             /* POINTER TO       */82950000
                                                  /* SUBTASK ECB      */83000000
             2 TOTTLCNT FIXED(15),                /* TEST LOOP COUNT  */83050000
            2 * CHAR(2),  /*RESERVED  @Y17XAX6*/                        83100000
 %GOTO MEND;                                                            83150000
 %CNFBYP:   ;                                                           83200000
             2 * CHAR(4),             /* RESERVED   @Y17XAX6*/          83250000
             2 CDSREC CHAR(256) BDY(DWORD),       /* CONFIGURATOR WORK*/83300000
                                                  /*  AREA            */83350000
               3 CDSUNIT PTR(31),                 /* UNIT ADDRESS     */83400000
                 4 CDSWORK CHAR (1),                                    83450000
               3 CDSMODEL CHAR(1),                /* MODEL            */83500000
               3 CDSFEAT CHAR(1),                 /* FEATURES         */83550000
               3 CDSCLASS CHAR(1),                /* CLASS            */83600000
               3 CDSTYPE CHAR(1),                 /* TYPE DEVICE      */83650000
               3 CDSBYTES CHAR(1),                /* BYTE COUNT       */83700000
               3 CDSFLAGS CHAR(1),                /* FLAGS            */83750000
                 4 CDSFPMOD BIT(1),               /* X'80'- FILE      */83800000
                                                  /*  PROTECT MODE    */83850000
                                                  /*  FLAG            */83900000
                 4 CDSDVSHR BIT(1),               /* X'40'- DEVICE    */83950000
                                                  /*  SHARED WITH     */84000000
                                                  /*  ANOTHER SYSTEM  */84050000
                 4 CDSFEVOL BIT(1),               /* X'20'- F.E.      */84100000
                                                  /*  VOLUME MOUNTED  */84150000
                                                  /*  FLAG            */84200000
                 4 CDSEXINT BIT(1),               /* X'10'- EXTERNAL  */84250000
                                                  /*  INTERRUPT       */84300000
                                                  /*  POSSIBLE FLAG   */84350000
                 4 CDSSYMNM BIT(1),               /* X'08'- SYMBOLIC  */84400000
                                                  /*  ADDRESSING FLAG */84450000
                 4 CDSTWOCH BIT(1),               /* X'04'- TWO       */84500000
                                                  /*  CHANNEL SWITCH  */84550000
                                                  /*  FLAG            */84600000
                 4 CDSCUSYM BIT(1),               /* X'02'- CUSTOMER  */84650000
                                                  /*  ASSIGNED        */84700000
                                                  /*  SYMBOLIC NAME   */84750000
                 4 CDSLCNCT BIT(1),               /* X'01'- LINE      */84800000
                                                  /*  CONNECTION      */84850000
                                                  /*  REQUIRED        */84900000
               3 CDSSIGNL CHAR(2),                /* EXTERNAL SIGNAL  */84950000
                                                  /*  MASK            */85000000
               3 CDSNAME CHAR(8),                 /* SYMBOLIC         */85050000
                                                  /*  (ALTERNATE      */85100000
                                                  /*  MEMBER) NAME    */85150000
                 4 CDSTCU CHAR(2),                /* OR TCU FEATURES  */85200000
                 4 CDSMISC CHAR(3),               /* MISC             */85250000
                 4 CDSRMASK CHAR(3),              /* SECTION RUN MASK */85300000
               3 CDSFXARA CHAR(4),                /* EXTENDED FIXED   */85350000
                                                  /*  AREA            */85400000
                 4 CDSFXLEN CHAR(1),              /*   LENGTH         */85450000
                 4 CDSFXFLG CHAR(2),              /*   FLAGS          */85500000
                   5 CDSSETMD BIT(1),             /* X'80'- TWO BYTE  */85550000
                                                  /*  SET MODE        */85600000
                   5 CDSAUTCL BIT(1),             /* X'40'- AUTOCALL  */85650000
                                                  /*  FEATURE         */85700000
                   5 CDSMPNT BIT(1),              /* X'20'- SWITCHED  */85750000
                                                  /*  LINE            */85800000
                   5 CDSMDROP BIT(1),             /* X'10'- NON-      */85850000
                                                  /*  SWITCHED MULTI- */85900000
                                                  /*  DROP LINE       */85950000
                   5 CDSWTBSC BIT(1),             /* X'08'- BSC WORLD */86000000
                                                  /*  TRADE DATA SET  */86050000
                   5 * BIT(11),                   /* UNUSED           */86100000
                 4 CDSLNCON CHAR(1),              /* LINE CONNECTION  */86150000
                                                  /*  CMD SEQ CODE    */86200000
             2 CDSINPUT CHAR(80),                 /* INPUT TO UNIT    */86250000
                                                  /*  CONFIGURATOR    */86300000
                                                  /*  AREA            */86350000
               3 CDSTCUTY CHAR(4),                /* TCU TYPE (EBCDIC)*/86400000
                 4 CDSVAR CHAR (1),               /* CDS VARIABLE     */86450000
                                                  /*  FIELD           */86500000
               3 CDSSYMBL CHAR(8),                /* SYMBOLIC TERMINAL*/86550000
                                                  /*  NAME (EBCDIC)   */86600000
               3 CDSTERM CHAR(4),                 /* TERMINAL TYPE    */86650000
                                                  /*  (EBCDIC)        */86700000
               3 CDSADAP CHAR(1),                 /* ADAPTER TYPE     */86750000
                 4 CDSIBM3 BIT(1),                /* X'80'- IBM III   */86800000
                 4 CDSTTY1 BIT(1),                /* X'40'- TTY I     */86850000
                 4 CDSIBM2 BIT(1),                /* X'20'- IBM II    */86900000
                 4 CDSIBM1 BIT(1),                /* X'10'- IBM I     */86950000
                 4 * BIT(4),                      /* UNUSED           */87000000
               3 CDSLINE CHAR(1),                 /* LINE TYPE        */87050000
                 4 * BIT(5),                      /* UNUSED           */87100000
                 4 CDSSWAUT BIT(1),               /* X'04'- SWITCHED  */87150000
                                                  /*  WITH AUTODIAL   */87200000
                 4 CDSMP BIT(1),                  /* X'02'- LEASED    */87250000
                                                  /*  MULTIPOINT      */87300000
                 4 CDSPTP BIT(1),                 /* X'01'- LEASED    */87350000
                                                  /*  POINT TO POINT  */87400000
               3 CDSCONN CHAR(1),                 /* LINE CONNECTION  */87450000
                                                  /*  CODE            */87500000
                 4 * BIT(5),                      /* UNUSED           */87550000
                 4 CDSDSAD0 BIT(1),               /* X'04'- DISABLE,  */87600000
                                                  /*  SADZERO,ENABLE  */87650000
                                                  /*  OR DIAL         */87700000
                 4 CDSDSMI BIT(1),                /* X'02'- DISABLE,  */87750000
                                                  /*  SETMODE,ENABLE  */87800000
                                                  /*  OR DIAL FOR SDAI*/87850000
                 4 CDSDISEN BIT(1),               /* X'01'-DISABLE,   */87900000
                                                  /*  ENABLE OR DIAL  */87950000
               3 CDSNPOLL CHAR(1),                /* NUMBER OF POLLING*/88000000
                                                  /*  CHARACTERS (AEX)*/88050000
               3 CDSPOLL CHAR(7),                 /* POLLING CHARACTER*/88100000
               3 CDSNADDR CHAR(1),                /* NUMBER OF ADDRES-*/88150000
                                                  /*  SING CHARACTERS */88200000
                                                  /*  (HEX)           */88250000
               3 CDSADDR CHAR(10),                /* ADDRESSING       */88300000
                                                  /*  CHARACTERS      */88350000
               3 * CHAR(1),                       /* UNUSED           */88400000
               3 CDSNDIAL CHAR(1),                /* NUMBER OF DIAL   */88450000
                                                  /*  DIGITS          */88500000
               3 CDSDIAL CHAR(20),                /* DIAL DIGITS      */88550000
               3 CDSNID CHAR(1),                  /* CPU ID LENGTH    */88600000
               3 CDSCPUID CHAR(15),               /* CPU ID           */88650000
               3 CDSCODE CHAR (1),                /* ADAPTER LINE CODE*/88700000
               3 CDSCFLGS CHAR (1),              /* RESERVED          */88750000
               3 CDSFNFLG CHAR(1),                /* FUNCTION FLAGS   */88800000
                 4 * BIT(4),                      /* UNUSED           */88850000
                 4 CDSEXIBT BIT(1),               /* X'08'-EXHIBIT    */88900000
                 4 CDSDEL BIT(1),                 /* X'04'-DELETE     */88950000
                 4 CDSADD BIT(1),                 /* X'02'-ADD        */89000000
                 4 * BIT(1),                      /* UNUSED           */89050000
               3 CDSRETFL CHAR (1),               /* RETURN CODE      */89100000
                 4 * BIT(7),                      /* UNUSED           */89150000
                 4 CDSINVLD BIT (1),              /* X'01'- INVALID   */89200000
             2 CDSBLDL CHAR(40),                  /* BLDL LIST FOR    */89250000
                                                  /*  CONFIG DIRECTORY*/89300000
               3 CDSMEMBR CHAR(8),                /*  MEMBER NAME     */89350000
               3 CDSTTRC CHAR(3),                 /* CESD RELATIVE TTR*/89400000
               3 CDSTTRC4 CHAR(1),                /* CESD RELATIVE TTR*/89450000
                                                  /*  4TH BYTE        */89500000
               3 CDSTTRD CHAR(3),                 /* DATA RELATIVE TTR*/89550000
               3 CDSTTRD4 CHAR(1),                /* DATA RELATIVE TTR*/89600000
                                                  /*  4TH BYTE        */89650000
               3 CDSTTRNS CHAR(4),                /* RESERVED         */89700000
               3 CDSATTRB CHAR(2),                /* ATTRIBUTES       */89750000
               3 CDSMAIN CHAR(3),                 /* MAIN STORAGE     */89800000
                                                  /*  REQUIREMENTS    */89850000
               3 CDSBLK1 CHAR(2),                 /* LENGTH OF FIRST  */89900000
                                                  /*  BLOCK           */89950000
               3 CDSEPADR CHAR(3),      /* ENTRY POINT ADDR @Y17XAX6*/  90000000
               3 CDSTXBLK CHAR(3),      /* FIRST TEXT BLOCK @Y17XAX6*/  90050000
                                                  /*  ORIGIN          */90100000
               3 CDSSSI CHAR(7),                  /* CDS SSI          */90150000
             2 CDSCESD CHAR(56) BDY(DWORD),       /* CESD RECORD FOR  */90200000
                                                  /*  CONFIG PDS      */90250000
               3 CDSCESID CHAR(1),                /* CESD ID          */90300000
               3 CDSCESPR CHAR(3),                /* UNUSED           */90350000
               3 CDSESD01 CHAR(2),                /* ESDID OF FIRST   */90400000
                                                  /*  ESD             */90450000
               3 CDSCESCT FIXED(15),              /* COUNT            */90500000
               3 CDSCESNM CHAR(8),                /* MEMBER NAME      */90550000
               3 CDSCESTY CHAR(1),                /* TYPE             */90600000
               3 CDSCESAD PTR(24),                /* ADDRESS          */90650000
               3 CDSCESGM CHAR(1),                /* SEGMENT          */90700000
               3 CDSCESLN CHAR(3),                /* ID AND LENGTH    */90750000
               3 CDSESD02 CHAR(16),               /* SECOND ESD RECORD*/90800000
               3 CDSESD03 CHAR(16),               /* THIRD ESD RECORD */90850000
             2 CDSCNTL CHAR(20),                  /* CONTROL RECORD   */90900000
                                                  /* FOR CONFIG PDS   */90950000
               3 CDSCTLID CHAR(1),                /* CONTROL ID       */91000000
               3 CDSCTLSP CHAR(3),                /* UNUSED           */91050000
               3 CDSCNT01 CHAR(2),   /* # BYTES FOLLOWING CCW @Y17XAX6*/91100000
               3 CDSCNT02 CHAR(2),              /* COUNT   @Y17XAX6 */  91150000
               3 CDSCCW CHAR(8),                  /* CHANNEL CONTROL  */91200000
                                                  /*  WORD            */91250000
               3 CDSCESDI CHAR(2),                /* CESD ENTRY       */91300000
               3 CDSRECLN CHAR (2),               /* LENGTH OF TEXT   */91350000
                                                  /* RECORD           */91400000
             2 CDSTTBLE PTR (31),                 /* TERMINAL TABLE   */91450000
                                                  /* ENTRY ADDRESS    */91500000
             2 CDSTINDX FIXED(15),                /* TERMNAME TABLE   */91550000
                                                  /* INDEX            */91600000
             2 * CHAR (142),               /* RESERVED  @Y17XAX6*/      91650000
 %MEND:    ;                                                            91700000
           2 TOTWAITI CHAR (8) BDY(DWORD),       /* WAITIO TIME      */ 91750000
                                                 /* INTERVAL         */ 91800000
           2 TOTGRABP PTR (31),                  /* CURRENT SECONDARY*/ 91850000
                                                 /* DEVICE POINTER   */ 91900000
           2 TOTAPNAM CHAR (8),                  /* ALTERNATE PRINTER*/ 91950000
                                                 /* NAME IN EBCDIC   */ 92000000
           2 TOTOLTEN PTR (31),                  /* ENTRY POINT      */ 92050000
                                                 /* ADDRESS OF OLT   */ 92100000
           2 TOTWAWRK CHAR(80),      /* IEDQWA WORK AREA     @Y17XAUU*/ 92150000
           2 TOTWOWRK CHAR (140),                /* IEDQWO    SA41602*/ 92200000
                                                 /* WORKAREA  SA41602*/ 92250000
           2 * CHAR (52),                        /* PATCH    @Y17XAXU*/ 92300000
             2 TOTSERV BDY(DWORD),   /* START OF SERVICE     @Y17XAXU*/ 92350000
                                     /* ROUTINE WORK AREA    @Y17XAXU*/ 92400000
             2 TOTOBEND CHAR (0);            /* @Y17XAX6*/              92450000
 DCL $TOTE BIT(8) CONSTANT('8A'X);      /* TOTE ID @Y17XAX6 */          92500000
 %IF CONFG¬='YES' %THEN %GOTO MEND1;                                    92550000
 DCL CDSIBMTY BIT(8) CONSTANT('30'X); /* IBM TTY @Y17XAX6*/             92600000
 DCL CDSTTY2 BIT(8) CONSTANT('50'X); /* TTY II  @Y17XAX6*/              92650000
 DCL CDSWTTY BIT(8) CONSTANT('60'X); /* WTC TTY  @Y17XAX6*/             92700000
 DCL CDSSDA1 BIT(8) CONSTANT('70'X); /* SDA 1 @Y17XAX6*/                92750000
 DCL CDSSDA2 BIT(8) CONSTANT('90'X);  /* SDA II @Y17XAX6*/              92800000
 DCL CDSSWTCH BIT(8) CONSTANT('03'X);      /* SWITCHED WITHOUT          92850000
                                                    AUTODIAL  @Y17XAX6*/92900000
 DCL CDSLOCAL BIT(8) CONSTANT('05'X); /* LOCAL  @Y17XAX6*/              92950000
 DCL CDSBYP BIT(8) CONSTANT('00'X);  /* BYPASS  @Y17XAX6*/              93000000
 DCL CDSDSMIT BIT(8) CONSTANT('03'X);           /* DISABLE,SETMODE      93050000
                             ENABLE OR DIAL FOR SDA II  @Y17XAX6*/      93100000
 DCL CDSDSAD1 BIT(8) CONSTANT('05'X);           /* DISABLE, SADONE      93150000
                                  ENABLE OR DIAL  @Y17XAX6*/            93200000
 DCL CDSDSAD2 BIT(8) CONSTANT('06'X);           /* DISABLE, SADTWO      93250000
                                 ENABLE OR DIAL  @Y17XAX6*/             93300000
 DCL CDSDSAD3 BIT(8) CONSTANT('07'X);           /* DISABLE, SADFOUR     93350000
                                   ENABLE OR DIAL  @Y17XAX6*/           93400000
 DCL CDSCHNG BIT(8) CONSTANT('06'X);  /* CHANGE  @Y17XAX6*/             93450000
 DCL CDSNRML BIT(8) CONSTANT('00'X);  /* NORMAL RETURN  @Y17XAX6 */     93500000
 %MEND1:   ;                                                            93550000
./  ADD  SSI=60240689,NAME=PLINK
         MACRO                                                          00200020
&NAME    PLINK &LOAD=,&EPLIST=,&CALL=,&SIZE=,                          C00400020
               &DELETE=,&RETURN=,&MF=                                   00600020
.*                                                                      00800020
.* MACRO NAME: PLINK                                                    01000020
.*                                                                      01200020
.* STATUS:     CHANGE LEVEL 001                                         01400020
.*                                                                      01600020
.* FUNCTION:   TO PROVIDE THE LINKAGE NECESSARY TO EXECUTE THE PLINK    01800020
.*             MODULE. THE MACRO GENERATES A PARAMETER LIST AND/OR      02000020
.*             LOADS REGISTER 15 WITH THE ADDRESS OF THE PLINK MODULE   02200020
.*             AND REGISTER 1 WITH THE ADDRESS OF A PARAMETER LIST.     02400020
.*                                                                      02600020
.* REGISTER 15 RETURN CODE:    (SET BY LOAD AND DELETE FUNCTIONS ONLY.) 02800020
.*                                                                      03000020
.*             CODE       MEANING                                       03200020
.*                                                                      03400020
.*              00       THE REQUESTED FUNCTION HAS BEEN ACCOMPLISHED   03600020
.*                       SUCCESSFULLY.                                  03800020
.*                                                                      04000020
.*              04       THE PLINK FACILITY IS NOT AVAILABLE.           04200020
.*                                                                      04400020
.*              08       AN ERROR OTHER THAN THOSE DESCRIBED HAS        04600020
.*                       OCCURRED.                                      04800020
.*                                                                      05000020
.*              0C       LOAD - THE REQUESTED MODULE IS NOT AVAILABLE   05200020
.*                       IN THE SYSTEM.                                 05400020
.*                       DELETE - THE SPECIFIED MODULE IS NOT IN CORE.  05600020
.*                                                                      05800020
.*              10       LOAD - THERE IS NOT ENOUGH CORE AVAILABLE.     06000020
.*                       DELETE - NEVER RETURNS THIS CODE.              06200020
.*                                                                      06400020
.* PARAMETERS AND/OR KEYWORDS:                                          06600020
.*                                                                      06800020
.*             LOAD(SUBLIST)-THE ENTRY POINT NAMES OF MODULES TO BE     07000020
.*                 LOADED. IF MORE THAN ONE, SEPARATED BY COMMAS AND    07200020
.*                 ENCLOSED IN PARENTHESES.                             07400020
.*                                                                      07600020
.*             EPLIST-THE ADDRESS OF A LIST WHERE ENTRY POINT ADDRESSES 07800020
.*                    OF THE LOADED MODULES WILL BE STORED. MUST        08000020
.*                    ACCOMPANY THE LOAD PARAMETER.                     08200020
.*                                                                      08400020
.*             SIZE-  INTEGER DEFINING THE TOTAL AMOUNT OF CORE IN 1K   08600020
.*                                                                      08800020
.*                    MULTIPLES REQUIRED TO RUN TEST.                   09000020
.*             CALL-  MODULE TO TRANSFER CONTROL TO; TWO FORMS ALLOWED, 09200020
.*                                                                      09400020
.*                    1. ADDRESS- LOCATION CONTAINING THE ENTRY POINT.  09600020
.*                                                                      09800020
.*                    2. (15)   - INDICATES REGISTER 15 CONTAINS THE    10000020
.*                                ADDRESS. R15 MUST HAVE BEEN LOADED    10200020
.*                                PRIOR TO INVOKING PLINK.              10400020
.*                                                                      10600020
.* NOTE:       CALL=(15) CANNOT BE USED WHEN LOADING OR DELETING IN THE 10800020
.*             SAME PLINK AS CALL.                                      11000020
.*                                                                      11200020
.*             DELETE(SUBLIST)-SAME COMMENTS AS APPLY TO LOAD.          11400020
.*                                                                      11600020
.*             RETURN=YES- INDICATES CONTROL IS TO BE RETURNED TO THE   11800020
.*                         CALLING MODULE. ITS REGISTERS ARE RESTORED   12000020
.*                         AND A BRANCH IS MADE TO THE ADDRESS STORED   12200020
.*                         IN REGISTER 14.                              12400020
.*                                                                      12600020
.*             MF= E,ADDRESS/(1) INDICATES THE EXECUTE FORM OF THE      12800020
.*                 MACRO WITH THE PARAMETER LIST ADDRESS EITHER         13000020
.*                 SPECIFIED OR PREVIOUSLY LOADED IN REGISTER 1.        13200020
.*                                                                      13400020
.*                                                                      13600020
.*             MF= L  INDICATES THE LIST FORM OF THE MACRO WITH NO      13800020
.*                    EXECUTABLE CODE GENERATED.                        14000020
.*                                                                      14200020
.* RESTRICTIONS: LOAD AND RETURN MAY NOT BE SPECIFIED IN THE SAME       14400020
.*               MACRO.                                                 14600020
.*               CALL AND RETURN MAY NOT BE SPECIFIED IN THE SAME       14800020
.*               MACRO.                                                 15000020
.*                                                                      15200020
.*                                                                      15400020
.* WARNING:    IF CALL OR RETURN AND LOAD OR DELETE ARE USED IN THE     15600020
.*             SAME MACRO AND THE RETURN CODE IS NOT ZERO, A BRANCH     15800020
.*             WILL BE MADE AROUND THE RETURN OR CALL INSTRUCTIONS.     16000020
.*                                                                      16200020
.* CONTROL BITS SET BY THIS MACRO:                                      16400020
.*                                                                      16600020
.*             L&SYSNDX DC B'&L1&C&B&B&D&R&B&S'                         16800020
.*                            |  | | | | | | |                          17000020
.*                            |  | 0 0 | | 0 |                          17200020
.*                            |  |     | |   SIZE                       17400020
.*                            |  |     | RETURN                         17600020
.*                            |  |     DELETE                           17800020
.*                               CALL                                   18000020
.*                            LOAD                                      18200020
.*                                                                      18400020
.* GLOBALS SET OR RESET BY THIS MACRO:                                  18600020
.*                                                                      18800020
.*             &CR AND &MOD(255)                                        19000020
.*                                                                      19200020
.* GLOBALS EXAMINED BY THIS MACRO: NONE                                 19400020
.*                                                                      19600020
.* SYMBOLS GENERATED BY THIS MACRO: NONE                                19800020
.*                                                                      20000020
.* MNOTES ISSUED BY THIS MACRO:                                         20200020
.*                                                                      20400020
.*             MNOTE 8,'DELETE AND RETURN INVALID.'                     20600020
.*                                                                      20800020
.*             MNOTE 8,'DELETE AND CALL INVALID.'                       21000020
.*                                                                      21200020
.*             MNOTE 8,'DELETE AND LOAD INVALID.'                       21400020
.*                                                                      21600020
.*             MNOTE 8,'LOAD AND RETURN INVALID.'                       21800020
.*                                                                      22000020
.*             MNOTE 8,'CALL AND RETURN INVALID.'                       22200020
.*                                                                      22400020
.*             MNOTE 8,'THERE IS NO LIST EXPANSION FOR CALL.'           22600020
.*                                                                      22800020
.*             MNOTE 8,'THERE IS NO LIST EXPANSION FOR RETURN.'         23000020
.*                                                                      23200020
.*             MNOTE 8,'ENTRY POINT LIST ADDRESS MISSING.'              23400020
.*                                                                      23600020
.*             MNOTE 8,'NO MACRO OPERANDS SELECTED.'                    23800020
.*                                                                      24000020
.*             MNOTE 8,'REG 15 CANNOT BE USED FOR CALL ADDRESS WHEN     24200020
.*                      LOAD OR DELETE ARE SPECIFIED.'                  24400020
.*                                                                      24600020
.* REASONS:    ABOVE MNOTES ARE SELF EXPLANATORY.                       24800020
.*                                                                      25000020
.* EXAMPLE:                                                             25200020
.*                                                                      25400020
.* *******************************************                          25600020
.* *  NAME  * OPERATION *       OPERAND      *                          25800020
.* *******************************************                          26000020
.* *        *           *                    *                          26200020
.* * SYMBOL *   PLINK   * LOAD=(SUBLIST),    *                          26400020
.* *        *           * EPLIST=ADDR,       *                          26600020
.* *        *           * SIZE=INTEGER,      *                          26800020
.* *        *           * CALL=ADDR/(15),   *                           27000020
.* *        *           * DELETE=(SUBLIST),  *                          27200020
.* *        *           * RETURN=YES,        *                          27400020
.* *        *           * MF=(E,ADDR/(1))    *                          27600020
.* *        *           *   =L               *                          27800020
.* *        *           *                    *                          28000020
.*                                                                      28200020
         GBLA  &CR                                                      28400020
         GBLC  &MOD(255)                                                28600020
         LCLA  &C1,&C2,&CTR,&N                                          28800020
         LCLB  &L1,&C,&B,&D,&R,&S,&E                                    29000020
         LCLC  &FILEN                                                   29200020
&L1      SETB  (T'&LOAD NE 'O')   SET TO 1 IF PARAMETER EXISTS.         29400020
&C       SETB  (T'&CALL NE 'O')                                         29600020
&D       SETB  (T'&DELETE NE 'O')                                       29800020
&R       SETB  (T'&RETURN NE 'O')                                       30000020
&S       SETB  (T'&SIZE NE 'O')                                         30200020
&E       SETB  (T'&EPLIST NE 'O')                                       30400020
.*                                                                      30600020
.* TEST FOR INVALID COMBINATIONS                                        30800020
.*                                                                      31000020
         AIF   (&L1+&R GT 1).ERR1                                       31200020
         AIF   (&C+&R GT 1).ERR2                                        31400020
         AIF   (&L1+&D GT 1).ERR8                                       31600020
         AIF   (&C+&D GT 1).ERR9                                        31800020
         AIF   (&D+&R GT 1).ERR10                                       32000020
.*                                                                      32200020
         AIF   (T'&NAME NE 'O').N1                                      32400020
&FILEN   SETC  'A&SYSNDX'                                               32600020
         AGO   .N2                                                      32800020
.N1      ANOP                                                           33000020
&FILEN   SETC  '&NAME'                                                  33200020
.*                                                                      33400020
.N2      AIF   (&CR NE 0).T2                                            33600020
&CR      SETA  1                                                        33800020
.*                                                                      34000020
.T2      ANOP                                                           34200020
&C1      SETA  N'&LOAD            C1=# OF LOAD MODULES                  34400020
&C2      SETA  N'&DELETE          C2=# OF DELETE MODULES                34600020
.*                                                                      34800020
         AIF   (T'&MF EQ 'O').STD .GO TO STD FORM IF MF OMITTED         35000020
         AIF   ('&MF(1)' EQ 'E').EXEC .GOTO EXEC FORM IF MF=E           35200020
         AIF   ('&MF(1)' EQ 'L').LISTA .GOTO LIST FORM IF MF=L          35400020
.*                                                                      35600020
.STD     AIF   (&L1 NE 0).LOADA . TEST FOR LOAD PARAM.                  35800020
         AGO   .DELA .            NO, TRY DELETE                        36000020
.LOADA   AIF   (&L1+&C GT 1).LOADC . IS IT LOAD&CALL?                   36200020
.LOADB   ANOP                                                           36400020
&FILEN   L     R15,#TABLE         TABLE OF EXECUTIVE ENTRY POINTS       36600020
&FILEN   SETC  ' '                                                      36800020
         L     R15,28(R15)        ENTRY TO TRANSIENT MANAGER            37000020
         LA    R14,R&SYSNDX       RETURN ADDRESS                        37200020
         CNOP  2,4                                                      37400020
         BALR  R1,R15                                                   37600020
         AGO   .LISTB             SET UP PARAMETER LIST                 37800020
.LOADC   AIF   ('&CALL'(1,1) NE '(').LOADB  CHECK FOR REGISTER 15       38000020
         AGO   .ERR7                                                    38200020
.*                                                                      38400020
.DELA    ANOP                                                           38600020
         AIF   (&D EQ 0).CALLA                                          38800020
         AGO   .LOADB                                                   39000020
.CALLA   ANOP                                                           39200020
         AIF   (&C NE 1).RETC                                           39400020
.CALLB   AIF   ('&CALL'(1,1) EQ '(').CALLC                              39600020
&FILEN   L     R15,&CALL                                                39800020
&FILEN   SETC  ' '                                                      40000020
         BALR  R14,R15                                                  40200020
         MEXIT                                                          40400020
.CALLC   ANOP                                                           40600020
&FILEN   L     R15,0(R15)                                               40800020
&FILEN         SETC ' '                                                 41000020
&FILEN   BALR  R14,R15            BRANCH TO ADDRESS IN R15              41200020
         MEXIT                                                          41400020
.*                                                                      41600020
.EXEC    ANOP                                                           41800020
         AIF   (N'&MF GE 2).EXECA                                       42000020
         AIF   (&C EQ 1).CALLB                                          42200020
.RETC    ANOP                                                           42400020
         AIF   (&R EQ 0).ERR6                                           42600020
&FILEN   L     R13,4(R13)         GET OLD SAVE AREA ADDRESS             42800020
&FILEN   SETC  ' '                                                      43000020
         LM    R14,R12,12(R13)    RESTORE CALLING PROGRAM'S REGISTERS.  43200020
         BR    R14                RETURN                                43400020
         MEXIT                                                          43600020
.EXECA   AIF   ('&MF(2)'(1,1) EQ '(').R1                                43800020
&FILEN   LA    R1,&MF(2) .        LOAD R1 WITH PARAMETER LIST ADDRESS.  44000020
&FILEN   SETC  ' '                                                      44200020
.R1      ANOP                                                           44400020
&FILEN   L     R15,#TABLE                                               44600020
&FILEN   SETC  ' '                                                      44800020
         L     R15,28(R15)                                              45000020
         BALR  R14,R15                                                  45200020
         AIF   (&C EQ 0).EXECB                                          45400020
         AIF   ('&CALL'(1,1) EQ '(').ERR7                               45600020
.CALLD   ANOP                                                           45800020
         LTR   R15,R15            TEST RETURN CODE                      46000020
         BNZ   E&SYSNDX           IF NOT ZERO, BRANCH AROUND CALL       46200020
         L     R15,&CALL                                                46400020
         BALR  R14,R15                                                  46600020
E&SYSNDX EQU   *                                                        46800020
         MEXIT                                                          47000020
.EXECB   ANOP                                                           47200020
         AIF   (&R EQ 1).RETB                                           47400020
         MEXIT                                                          47600020
.RETB    ANOP                                                           47800020
         LTR   R15,R15            TEST RETURN CODE                      48000020
         BNZ   E&SYSNDX                                                 48200020
         L     R13,4(R13)         GET CALLING MODULES SAVE AREA         48400020
         LM    R14,R12,12(R13)    RESTORE REGISTERS                     48600020
         BR    R14                RETURN TO CALLING MODULE              48800020
E&SYSNDX EQU   *                                                        49000020
         MEXIT                                                          49200020
.LISTA   ANOP                                                           49400020
         AIF   (&C EQ 1).ERR3                                           49600020
         AIF   (&R EQ 1).ERR4                                           49800020
.*                                                                      50000020
.LISTB   ANOP                                                           50200020
&FILEN   DC    A(P&SYSNDX) .      OLTEP PARAMETER LIST ADDRESS          50400020
&FILEN   SETC  ' '                                                      50600020
         DC    A(L&SYSNDX) .      POINTER TO CONTROL BYTE               50800020
         AIF   (&L1 EQ 0).LISTC                                         51000020
         DC    A(L&SYSNDX+4) .    POINTER TO LOAD MODULE LIST           51200020
         AIF   (&E EQ 0).ERR5                                           51400020
         DC    A(&EPLIST) .       ENTRY POINT LIST ADDRESS              51600020
         AGO   .LISTD                                                   51800020
.LISTC   ANOP                                                           52000020
         DC    A(0)                                                     52200020
         DC    A(0)                                                     52400020
.LISTD   ANOP                                                           52600020
         AIF   (&D EQ 0).LISTE                                          52800020
         DC    A(D&SYSNDX)        POINTER TO LIST OF DELETED MODULES    53000020
         AGO   .DELC                                                    53200020
.LISTE   ANOP                                                           53400020
         DC    A(0)                                                     53600020
.DELC    ANOP                                                           53800020
P&SYSNDX DC    B'00000000' .      INDICATORS FOR TRANSIENT MANAGER      54000020
         DC    AL1(1) .           MACRO LEVEL                           54200020
         DC    CL2'28' .          IDENTITY OF MACRO EXPANSION           54400020
L&SYSNDX DC    B'&L1&C&B&B&D&R&B&S' .    CONTROL BYTE                   54600020
         AIF   (T'&SIZE EQ 'O').QA                                      54800020
         DC    AL1(&SIZE)         CORE NEEDED IN 1K MULTIPLES           55000020
         AGO   .QB                                                      55200020
.QA      ANOP                                                           55400020
         DC    AL1(0)             CORE NEEDED IN 1K MULTIPLES           55600020
.QB      ANOP                                                           55800020
         DC    AL1(&C1)           # OF LOAD MODULES                     56000020
         DC    AL1(&C2)           # OF DELETED MODULES                  56200020
         AIF   (&L1 EQ 0).DELB                                          56400020
&CTR     SETA  1                                                        56600020
.P2      ANOP                                                           56800020
         DC    CL8'&LOAD(&CTR)'                                         57000020
.P3      ANOP                                                           57200020
&N       SETA  1                                                        57400020
.P4      AIF   ('&LOAD(&CTR)' EQ '&MOD(&N)').EX2                        57600020
         AIF   (&N EQ &CR).EX3                                          57800020
&N       SETA  &N+1                                                     58000020
         AGO   .P4                                                      58200020
.EX3     ANOP                                                           58400020
         EXTRN &LOAD(&CTR)                                              58600020
&MOD(&CR) SETC '&LOAD(&CTR)'                                            58800020
&CR      SETA  &CR+1                                                    59000020
.EX2     ANOP                                                           59200020
         AIF   (&CTR EQ &C1).DELB                                       59400020
&CTR     SETA  &CTR+1                                                   59600020
         AGO   .P2                                                      59800020
.DELB    AIF   (&D EQ 0).DELD                                           60000020
D&SYSNDX EQU   *                                                        60200020
&CTR     SETA  1                                                        60400020
.PA      ANOP                                                           60600020
         DC    CL8'&DELETE(&CTR)'                                       60800020
         AIF   (&CTR EQ &C2).DELD                                       61000020
&CTR     SETA  &CTR+1                                                   61200020
         AGO   .PA                                                      61400020
.DELD    ANOP                                                           61600020
R&SYSNDX DS    0H                 RETURN ON HALFWORD BOUNDARY           61800020
.*                                                                      62000020
         AIF   (&C EQ 0).RETA                                           62200020
         AGO   .CALLD                                                   62400020
.RETA    ANOP                                                           62600020
         AIF   (&R EQ 1).RETB                                           62800020
         AIF   (&L1+&C+&D+&R EQ 0).ERR6                                 63000020
         MEXIT                                                          63200020
.ERR1    MNOTE 8,'LOAD AND RETURN INVALID.'                             63400020
         MEXIT                                                          63600020
.ERR2    MNOTE 8,'CALL AND RETURN INVALID.'                             63800020
         MEXIT                                                          64000020
.ERR3    MNOTE 8,'THERE IS NO LIST EXPANSION FOR CALL.'                 64200020
         MEXIT                                                          64400020
.ERR4    MNOTE 8,'THERE IS NO LIST EXPANSION FOR RETURN.'               64600020
         MEXIT                                                          64800020
.ERR5    MNOTE 8,'ENTRY POINT LIST ADDRESS MISSING.'                    65000020
         MEXIT                                                          65200020
.ERR6    MNOTE 8,'NO MACRO OPERANDS HAVE BEEN CHOSEN.'                  65400020
         MEXIT                                                          65600020
.ERR7    MNOTE 8,'REG 15 CANNOT BE USED FOR CALL ADDRESS WHEN LOAD OR  C65800020
                DELETE ARE SPECIFIED.'                                  66000020
         MEXIT                                                          66200020
.ERR8    MNOTE 8,'DELETE AND LOAD INVALID.'                             66400020
         MEXIT                                                          66600020
.ERR9    MNOTE 8,'DELETE AND CALL INVALID.'                             66800020
         MEXIT                                                          67000020
.ERR10   MNOTE 8,'DELETE AND RETURN INVALID.'                           67200020
         MEXIT                                                          67400020
         MEND                                                           67600020
./  ADD  SSI=71450747,NAME=RESPL
*        %GOTO PLSRESPL;          /*BILINGUAL HEADER                    00500000
         MACRO                                                          01000020
&NAME    RESPL &DSECT=YES,&EQUATES=NO                                   02000022
         LCLC  &A0010,&A0020,&A0030,&A0040,&A0050                       03000020
         LCLC  &A0060,&A0070,&A0080,&A0090,&A0095,&A0096       @Y17XAUU 03050000
         LCLC  &A0097,&A0098,&A0099                            @Y17XAXU 03120000
*                                                                       03200020
*        TOTE RESIDENT CONTROL BLOCK                                    03300022
*                                                                       03400022
*        STATUS = VERSION 10.0                                 @Y17XAXU 03600000
*                                                                       03800020
         AIF   ('&DSECT' EQ 'NO').BYP010                                04000020
&A0010   SETC  '0'                                                      05000020
&A0020   SETC  '0'                                                      06000020
&A0030   SETC  '0'                                                      07000020
&A0040   SETC  '0'                                                      08000020
&A0050   SETC  '0'                                                      09000020
&A0060   SETC  '0'                                                      09200022
&A0070   SETC  '0'                                                      09400022
&A0080   SETC  '0'                                                      09600022
&A0090   SETC  '0'                                                      09800022
&A0095   SETC  '0'                                               S22024 09900000
&A0096   SETC  '0'                                             @Y17XAUU 09950000
&A0097   SETC  '0'                                             @Y17XAXU 09960000
&A0098   SETC  '0'                                             @Y17XAUU 09970000
&A0099   SETC  '0'                                             @Y17XAUU 09980000
         AGO   .BYP020                                                  10000020
.BYP010  ANOP                                                           11000020
&A0010   SETC  'ERROR'                                                  12000020
&A0020   SETC  'SMGR'                                                   13000020
&A0030   SETC  'IEDQWA'                                                 14000020
&A0040   SETC  'OLTETXR'                                                15000020
&A0050   SETC  'PRFSTXT-PRFSUNIT'                                       16000020
&A0060   SETC  'QREMFRX'                                                16200022
&A0070   SETC  'QREMELX'                                                16400022
&A0080   SETC  'QADDNDX'                                                16600022
&A0090   SETC  'QADDAFX'                                                16800022
&A0095   SETC  'STAERT'                                          S22024 16900000
&A0096   SETC  'HIERSCAN'                                      @XM05672 16950010
&A0097   SETC  'POSTWAIT'                                      @Y17XAXU 16955000
&A0098   SETC  'ALLOCBUF'                                      @Y17XAXU 16970000
&A0099   SETC  'FREEBUF'                                       @Y17XAUU 16980000
.BYP020  ANOP                                                           17000020
         AIF   ('&DSECT' EQ 'NO').BYP030                                18000020
&NAME    DSECT                                                          19000020
         AGO   .BYP040                                                  20000020
.BYP030  ANOP                                                           21000020
&NAME    DS    0F                                                       22000020
.BYP040  ANOP                                                           23000020
RESTECBS DC    A(0)               PARAMETER LIST FOR TOTE WAIT          23800022
         DC    XL1'80'            SET ECB CODE TO WAITING               24200022
         DC    AL3(RESTECB1)      ADDRESS OF USBTASK ECB                24600022
RESTECB1 DC    F'0'               SUBTASK REQUEST ECB                   25000022
*                                                                       25400022
RESOBQCB DS    0F                 OLTCB QUEUE CONTROL BLOCK             25800022
RESOBFWD DC    A(RESOBQCB)        OLTCB QUEUE FORWARD POINTER           26200022
RESOBBKW DC    A(RESOBQCB)        OLTCB QUEUE BACKWARD POINTER          26600022
*                                                                       27000022
RESTTLST DC    A(0)               LAST TOTE TNT ENTRY ADDRESS           27400022
RESBKTOT DC    H'12'              TOTAL STORAGE BLOCKS FOR TOTE  S22024 27800000
RESBKAVL DC    H'8'               CURRENT FREE STORAGE BLOCKS           28200022
RESEFQCB DC    A(RESEFQCB)        EXTENDED AREA FREE QUEUE              28600022
*                                   CONTROL BLOCK                       29000022
RESTNTCT DC    X'00'              TOTAL NUMBER OF TNT ENTRIES           29400022
RESDMTTE DC    AL3(0)             POINTER TO TOTE EXTENDED AREA         29800022
*                                   FOR TTE'S AND QCB'S                 30200022
RESETXRA DC    A(&A0040)          END OF TASK EXIT ROUTINE ADDRESS      30600022
RESSTAEA DC    A(&A0095)          STAE EXIT ROUTINE ADDRESS      S22024 30800000
RESSMGRA DC    A(&A0020)          SERVICE MANAGER ENTRY ADDRESS         31000022
RES#TBLE EQU   RESSMGRA-28        BRANCH TABLE ADDRESS                  31400022
RESWBFNC DC    X'00'              IEDQWB FUNCTION REQUEST CODE          31800022
*                                                                       32200022
RESFLAGS DC    XL1'0'             TOTE RESIDENT FLAG BYTE               32600022
*                                                                       33000022
RESINIT  EQU   X'80'                   TOTE INITIALIZED FLAG            33400022
RESFIRST EQU   X'40'                   FIRST-TIME INDICATOR             33800022
*                                                                       34200022
         DC    XL2'0000'          UNUSED                       @XM05672 34600010
RESTRMQ  DC    A(RESTRMQ)         TOTE TRM QUEUE CONTROL BLOCK          35000022
         DS    XL1'0'             UNUSED                                35400022
RESTNTPT DS    AL3(0)             ADDRESS OF START OF TOTE TNT          35800022
*                                   ENTRIES                             36200022
*                                                                       36600022
*           BRANCH TABLE FOR QUEUE HANDLERS                             37000022
*                                                                       37400022
RESQHBL  DS    0F                 ALIGN ON FULLWORD                     37800022
RESREMFR DC    A(&A0060)          ADDRESS OF REMOVE ELEMENT FROM        38200022
*                                   FRONT HANDLER                       38600022
RESREMEL DC    A(&A0070)          ADDRESS OF REMOVE SPECIFIED           39000022
*                                   ELEMENT HANDLER                     39400022
RESADDND DC    A(&A0080)          ADDRESS OF ADD ELEMENT TO END         39800022
*                                   HANDLER                             40200022
RESADDAF DC    A(&A0090)          ADDRESS OF ADD ELEMENT AFTER          40600022
*                                   ANOTHER SPECIFIED ELEMENT HANDLER   40610000
RESPLRVT DC    A(&A0097)          POST/WAIT ROUTINE            @Y17XAXU 40610500
RESABUF  DC    A(&A0098)          BUFFER ALLOCATION ROUTINE    @Y17XAXU 40612000
RESFBUF  DC    A(&A0099)          BUFFER DEALLOCATION ROUTINE  @Y17XAXU 40613000
RESMHSRC DC    H'0' .             TOTE MH TTCIN                @Y17XAXU 40614000
RESMHNAT DC    H'0' .             TOTE MH NETWORK ADDRESS      @Y17XAXU 40615000
RESTOTMH DC    A(0) .             TOTE MH ADDRESS              @Y17XAXU 40620000
RESPLADR DS    0F .               SERVICE ROUTINE ADDRESSES    @Y17XAXU 40630000
RESPLWO  DC    A(0) .             I/O ACCESS MANAGER           @Y17XAXU 40640000
RESPLAB  DC    A(0) .             DATE ROUTINE                 @Y17XAXU 40650000
RESPLAJ  DC    A(0) .             $CUTEST ROUTINE              @Y17XAXU 40660000
RESPL35  DC    A(0) .             EXIO ROUTINE                 @Y17XAXU 40670000
RESPLAA  DC    A(0) .             TIME ROUTINE                 @Y17XAXU 40680000
RESPL39  DC    A(0) .             DPRINT LOAD 1 ROUTINE        @Y17XAXU 40690000
RESPLP1  DC    A(0) .             DPRINT LOAD 2 ROUTINE        @Y17XAXU 40700000
RESPLP2  DC    A(0) .             DPRINT LOAD 2 ROUTINE        @Y17XAXU 40710000
RESPL37  DC    A(0) .             CECOM ROUTINE                @Y17XAXU 40720000
RESPL28  DC    A(0) .             PLINK ROUTINE                @Y17XAXU 40730000
RESPL36  DC    A(0) .             WAITIO ROUTINE               @Y17XAXU 40740000
RESPLAC  DS    0F .               $GRAB ROUTINE                @Y17XAXU 40750000
RESPL21  DS    A(0) .             $LETGO ROUTINE               @Y17XAXU 40760000
RESPL41  DC    A(0) .             CONVERT ROUTINE              @Y17XAXU 40770000
RESPL16  DC    A(0) .             GETCONFIG ROUTINE            @Y17XAXU 40780000
RESPL42  DS    0F .               MORECORE ROUTINE             @Y17XAXU 40790000
RESPL43  DC    A(0) .             FREECORE ROUTINE             @Y17XAXU 40800000
RESPL44  DC    A(0) .             DIO ROUTINE                  @Y17XAXU 40810000
RESPL47  DC    A(0) .             ROUTINE ROUTINE              @Y17XAXU 40820000
RESPLM2  DC    A(0) .             TRACE/RETURN CODE ROUTINE    @Y17XAXU 40830000
RESPL25  DC    A(0) .             SEND ROUTINE                 @Y17XAXU 40840000
RESPL33  DC    A(0) .             RECEIVE ROUTINE              @Y17XAXU 40850000
RESTLIB  DC    A(&A0096)          ADDR OF HIERARCHY SCAN RTN   @XM05672 40860010
RESPLA1  DC    A(0) .             TOTE INPUT PROCESSOR ADDRESS @Y17XAXU 40870000
RESAPDCB DCB   DSORG=PS,MACRF=WC,DDNAME=DIAGMSG,BLKSIZE=80      SA21903 41100000
RESAPOPN EQU   RESAPDCB+48                                      SA21903 41200000
         MEND                                                @Y17XAXU*/ 41300000
*%PLSRESPL: ;                                                           41400000
*DECLARE                                                                41500000
*  1 IEDRESPL BDY(WORD) BASED,    /*                         @Y17XAXU*/ 41600000
*/*                                                          @Y17XAXU*/ 41700000
*/*      TOTE RESIDENT CONTROL BLOCK                         @Y17XAXU*/ 41800000
*/*      STATUS = VERSION 10.0 (TCAM,TOTE)                   @Y17XAXU*/ 41900000
*/*                                                          @Y17XAXU*/ 42000000
*   2 RESTECBS PTR(31),           /* PARMLIST FOR TOTE WAIT  @Y17XAXU*/ 42100000
*   2 * CHAR(1),                  /* ECSB CODE               @Y17XAXU*/ 42200000
*   2 * PTR(24) BDY(BYTE),        /* SUBTASK ECB ADDRESS     @Y17XAXU*/ 42300000
*   2 RESTECB1 PTR(31),           /* SUBTASK REQUEST ECB     @Y17XAXU*/ 42400000
*   2 RESOBQCB BDY(WORD),         /* OLTCB QUEUE CONTROL     @Y17XAXU*/ 42500000
*                                 /* BLOCK                   @Y17XAXU*/ 42600000
*    3 RESOBFWD PTR(31),          /* OLTCB QUEUE FORWARD     @Y17XAXU*/ 42700000
*                                 /* POINTER                 @Y17XAXU*/ 42800000
*    3 RESOBBKW PTR(31),          /* OLTCB QUEUE BACKWARD    @Y17XAXU*/ 42900000
*                                 /* POINTER                 @Y17XAXU*/ 43000000
*   2 RESTTLST PTR(31),           /* LAST TOTE TNT ENTRY     @Y17XAXU*/ 43100000
*                                 /* ADDRESS                 @Y17XAXU*/ 43200000
*   2 RESBKTOT FIXED(15),         /* TOTAL STORAGE BLOCKS    @Y17XAXU*/ 43300000
*                                 /* FOR TOTE                @Y17XAXU*/ 43400000
*   2 RESBKAVL FIXED(15),         /* CURRENT FREE STORAGE    @Y17XAXU*/ 43500000
*                                 /* BLOCKS                  @Y17XAXU*/ 43600000
*   2 RESEFQCB PTR(31),           /* EXTENTED AREA FREE      @Y17XAXU*/ 43700000
*                                 /* QUEUE CONTROL BLOCK     @Y17XAXU*/ 43800000
*   2 RESTNTCT PTR(8),            /* TOTAL NUMBER OF TNT     @Y17XAXU*/ 43900000
*                                 /* ENTRIES                 @Y17XAXU*/ 44000000
*   2 RESDMTTE PTR(24) BDY(BYTE), /* POINTER TO TOTE         @Y17XAXU*/ 44100000
*                                 /* EXTENTED AREA FOR TTE'S,@Y17XAXU*/ 44200000
*                                 /* QCB'S AND LGB'S         @Y17XAXU*/ 44300000
*   2 RESETXRA PTR(31),           /* END OF TASK EXIT ROUTINE@Y17XAXU*/ 44400000
*                                 /* ADDRESS                 @Y17XAXU*/ 44500000
*   2 RESSTAEA PTR(31),           /* STAE EXIT ROUTINE       @Y17XAXU*/ 44600000
*                                 /* ADDRESS                 @Y17XAXU*/ 44700000
*   2 RESSMGRA PTR(31),           /* SERVICE MANAGER ENTRY   @Y17XAXU*/ 44800000
*                                 /* ADDRESS                 @Y17XAXU*/ 44900000
*   2 RESWBFNC CHAR(1),           /* IEDQWB FUNCTION REQUEST @Y17XAXU*/ 45000000
*                                 /* CODE                    @Y17XAXU*/ 45100000
*   2 RESFLAGS BIT(8),            /* TOTE RESIDENT FLAGS     @Y17XAXU*/ 45200000
*    3 RESINIT BIT(1),            /* TOTE INITIALIZED FLAG   @Y17XAXU*/ 45300000
*    3 RESFIRST BIT(1),           /* FIRST-TIME INDICATOR    @Y17XAXU*/ 45400000
*    3 * BIT(6),                  /* RESERVED                @Y17XAXU*/ 45500000
*   2 * CHAR(2),                  /* RESERVED                @Y17XAXU*/ 45600000
*   2 RESTRMQ PTR(31),            /* TRM QUEUE CONTROL BLOCK @Y17XAXU*/ 45700000
*   2 * CHAR(1),                  /* RESERVED                @Y17XAXU*/ 45800000
*   2 RESTNTPT PTR(24) BDY(BYTE), /* ADDRESS OF START OF     @Y17XAXU*/ 45900000
*                                 /* TOTE TNT ENTRIES        @Y17XAXU*/ 46000000
*/*                                                          @Y17XAXU*/ 46100000
*/*      BRANCH TABLE FOR QUEUE HANDLERS                     @Y17XAXU*/ 46200000
*/*                                                          @Y17XAXU*/ 46300000
*   2 RESQHBL BDY(WORD),          /*                         @Y17XAXU*/ 46400000
*    3 RESREMFR PTR(31),          /* ADDRESS OF REMOVE       @Y17XAXU*/ 46500000
*                                 /* ELEMENT FROM FRONT      @Y17XAXU*/ 46600000
*                                 /* HANDLER                 @Y17XAXU*/ 46700000
*    3 RESREMEL PTR(31),          /* ADDRESS OF REMOVE       @Y17XAXU*/ 46800000
*                                 /* SPECIFIED ELEMENT       @Y17XAXU*/ 46900000
*                                 /* HANDLER                 @Y17XAXU*/ 47000000
*    3 RESADDND PTR(31),          /* ADDRESS OF ADD ELEMENT  @Y17XAXU*/ 47100000
*                                 /* TO END HANDLER          @Y17XAXU*/ 47200000
*    3 RESADDAF PTR(31),          /* ADD OF ADD ELEMENT AFTER@Y17XAXU*/ 47300000
*                                 /* ANOTHER SPECIFIED       @Y17XAXU*/ 47400000
*                                 /* ELEMENT                 @Y17XAXU*/ 47500000
*   2 RESPLRVT PTR(31),           /* POST/WAIT ROUTINE       @Y17XAUU*/ 47510000
*   2 RESABUF PTR(31),            /* BUFFER ALLOCATION RTN   @Y17XAXU*/ 47520000
*   2 RESFBUF PTR(31),            /* BUFFER DEALLOCATION RTN @Y17XAXU*/ 47530000
*   2 RESMHSRC FIXED(16),         /* TOTE MH TTCIN           @Y17XAXU*/ 47540000
*   2 RESMHNAT FIXED(16),         /* TOTE MH NETWORK ADDRESS @Y17XAXU*/ 47550000
*   2 RESTOTMH PTR(31),           /* TOTE MH ADDRESS         @Y17XAXU*/ 47600000
*   2 RESPLADR BDY(WORD),         /* SERVICE ROUTINE ADDR    @Y17XAXU*/ 47700000
*    3 RESPLWO PTR(31),           /* I/O ACCESS MANAGER      @Y17XAXU*/ 47800000
*    3 RESPLAB PTR(31),           /* DATE ROUTINE            @Y17XAXU*/ 47900000
*    3 RESPLAJ PTR(31),           /* $CUTEST ROUTINE         @Y17XAXU*/ 48000000
*    3 RESPL35 PTR(31),           /* EXIO ROUTINE            @Y17XAXU*/ 48100000
*    3 RESPLAA PTR(31),           /* TIME ROUTINE            @Y17XAXU*/ 48200000
*    3 RESPL39 PTR(31),           /* DPRINT LOAD 1 ROUTINE   @Y17XAXU*/ 48300000
*    3 RESPLP1 PTR(31),           /* DPRINT LOAD 2 ROUTINE   @Y17XAXU*/ 48400000
*    3 RESPLP2 PTR(31),           /* DPRINT LOAD 2 ROUTINE   @Y17XAXU*/ 48500000
*    3 RESPL37 PTR(31),           /* CECOM ROUTINE           @Y17XAXU*/ 48600000
*    3 RESPL28 PTR(31),           /* PLINK ROUTINE           @Y17XAXU*/ 48700000
*    3 RESPL36 PTR(31),           /* WAITIO ROUTINE          @Y17XAXU*/ 48800000
*    3 RESPLAC PTR(31),           /* $GRAB ROUTINE           @Y17XAXU*/ 48900000
*     4 RESPL21 PTR(31),          /* $LETGO ROUTINE          @Y17XAXU*/ 49000000
*    3 RESPL41 PTR(31),           /* CONVERT ROUTINE         @Y17XAXU*/ 49100000
*    3 RESPL16 PTR(31),           /* GETCONFIG ROUTINE       @Y17XAXU*/ 49200000
*    3 RESPL42 PTR(31),           /* MORECORE ROUTINE        @Y17XAXU*/ 49300000
*     4 RESPL43 PTR(31),          /* FREECORE ROUTINE        @Y17XAXU*/ 49400000
*    3 RESPL44 PTR(31),           /* DIO ROUTINE             @Y17XAXU*/ 49500000
*    3 RESPL47 PTR(31),           /* ROUTINE ROUTINE         @Y17XAXU*/ 49600000
*    3 RESPLM2 PTR(31),           /* TRACE/RETURN CODE       @Y17XAXU*/ 49700000
*                                 /* ROUTINE                 @Y17XAXU*/ 49800000
*    3 RESPL25 PTR(31),           /* SEND ROUTINE            @Y17XAXU*/ 49900000
*    3 RESPL33 PTR(31),           /* RECEIVE ROUTINE         @Y17XAXU*/ 50000000
*   2 RESTLIB PTR(31),            /* ADDRESS OF OLTLIB DCB   @Y17XAXU*/ 50100000
*   2 RESAPDCB BDY(WORD);         /* START OF AP DCB AREA    @Y17XAXU*/ 50200000
*                                 /*                         @Y17XAXU*/ 50300000
*%RESPLEND: ;                     /* END OF RESPL            @Y17XAXU*/ 50400000
./  ADD  SSI=61400513,NAME=TACSMD
         MACRO                                                          01000020
         TACSMD                                                         02000020
.*A562000-566000,026000                                          S21101 02300010
.*A568000                                                        S22025 02400010
.*C562000,566000                                                 S22025 02500010
.*           MACRO VERSION DATED 6/24/71                         S21101 02600010
.*             MACRO UPDATED 10/20/71                            S22025 02800010
*                     TCAM ACCESS METHOD WORKAREA                       03000020
         SPACE 2                                                        04000020
IEDQWRKA DSECT                                                          05000020
PWASAVE  DS    0F                                                       06000020
GWASAVE  DS    F                        ADDRESS OF USER'S               07000020
*                                       REGISTER SAVEAREA               08000020
PWAPEWA  DS    F .                      ADDR OF PROCESS ENTRY WORKAREA  09000020
GWAPEB   DS    F                        ADDRESS OF PART-EMPTY BFR       10000020
PWASTART DS    0F                       ADDRESS OF FIRST BYTE OF        11000020
*                                       DATA IN WORKAREA                12000020
GWAMOVE  DS    F                        ADDRESS OF NEXT BYTE IN A       13000020
*                                       BUFFER TO BE MOVED              14000020
PWACKPT  DS    0F                                                       15000020
GWACKPT  DS    F                        ADDRESS OF USER'S               16000020
*                                       CHECKPOINT ROUTINE              17000020
GWAPEWA  DS    F                        ADDRESS OF NEXT EMPTY BYTE      18000020
*                                       IN USER'S WORKAREA              19000020
PWAECB   DS    0F                       PUT/WRITE ECB                   20000020
GWAECB   DS    F                        GET/READ ECB                    21000020
PWAELEM  DS    0F                                                       22000020
GWAELEM  DS    5F .                     SPECIAL AQCTL ELEMENT           23000020
PWALIST  DS    0F                                                       24000020
GWALIST  DS    0F                       AQCTL PARAMETER LIST            25000020
MOVEAD   DS    F                        ADDR OF FIELD TO BE MOVED       26000020
TARGETAD DS    F                        TARGET OF DATA MOVEMENT         27000020
PFLAG    DS    FL1                      END-OF-LIST INDICATOR           28000020
LENGTHAD DS    3X                       ADDRESS OF LENGTH OF FIELD      29000020
PWASAVA  DS    0F                       PUT/WRITE SAVEAREA              30000020
GWASAVA  DS    18F                      READ/CHECK SAVEAREA             31000020
PWAFLG   DS    H                                                        32000020
IOBPSAVE DS    F                        CONTAINS ADDRESS OF PARTLY      33000020
*                                       EMPTY BUFFER UNIT               34000020
GWASTAT  DS    0F                       ADDR OF STATUS INDICATORS       35000020
PWASTAT  DS    F                        ADDR OF STATUS INDICATORS       36000020
PWASOWA  DS    0H                       SIZE OF WORKAREA                37000020
GWASOWA  DS    H                        SIZE OF USER'S WORKAREA         38000020
PWACTL   DS    X                        WORKAREA CONTENTS               39000020
*                                       DESCRIPTOR BYTE                 40000020
GWARDEL  DS    X                        RECORD DELIMITER                41000020
GWABUFL  DS    H                        SIZE OF MCP BUFFER              42000020
PWAOPTCD DS    0X                                                       43000020
GWAOPTCD DS    X                        GENERAL SWITCHES                44000020
PWARECFM DS    0X                                                       45000020
GWARECFM DS    X                        GENERAL SWITCHES                46000020
GWALRECL DS    H                        SIZE OF LOGICAL WORK UNIT       47000020
PWAOFF   DS    H                                                        48000020
CTLADDR  DS    F                        ADDR OF WORKAREA CONTROL BYTE   49000020
GWASCAN  DS    H                        SIZE OF FIELD TO BE SCANNED     50000020
BUFCNT   DS    H                        EMPTY-BUFFER COUNTER            51000020
IOBUSZE  DS    H                        COUNT OF DATA IN A LOGICAL      52000020
*                                       BUFFER                          53000020
IOBPSZE  DS    H                        PREFIX SIZE WORKAREA            54000020
IOBSRCE  DS    H                        TERMNAME TABLE OFFSET           55000020
GWARTVE  DS    2F                       MSG RETRIEVAL WORKAREA          56000020
GWAOPT2  DS    X                        OPTIONS FROM TPDATE      S22025 56200010
GWADLTE  EQU   X'40'                   DELETE=YES SPECIFIED      S21101 56400010
GWADATE  EQU   X'10'                    DTSAREA IS SPEC          S22025 56600010
GWADTSA  DS    AL3                      DATE/TIME/SOURCE AREA    S22025 56800010
WRKAEND  EQU   *                                                        57000020
WRKASIZE EQU   WRKAEND-IEDQWRKA                                         58000020
         MEND                                                           59000020
./  ADD  SSI=71100933,NAME=TAIBD
         MACRO                                                          00500006
         TAIBD &EXT=(NETWKCTL,GETREAD,PUTWRITE,POINT,CKREQ,QRESET)      01000006
IEDQAIB  DSECT                                                          01500006
         SPACE                                                          02000006
*        OS/VS2 , TCAM LEVEL 9, 9/22/75                        @Z40X9AG 02100009
         SPACE 1                                               @Z40X9AG 02200009
.*A605000                                                      @ZA03744 02250010
.*D620000                                                      @ZA03744 02300010
.*C525000,640000                                               @Z40X9AG 02350010
.*A200000                                                      @OZ09941 02400010
.*C815000-835000                                               @OZ11191 02450010
AIBSTATE DS    X                        STATUS OF BLOCK                 02500006
AIBFREE  EQU   X'00'                    BLOCK AVAILABLE                 03000006
AIBBUSY  EQU   X'80'                    BLOCK BUSY                      03500006
AIBCHAIN DS    AL3                      LINK FIELD OF CHAIN OF          04000006
*                                       AIBS                            04500006
AIBECBA  DS    A                        ADDRESS OF ECB FOR SVC102       05000006
AIBPCBAD DS    A                        PCB ADDRESS                     05500006
AIBWAPTR DS    A                        POINTER TO WORKAREA IN          06000006
*                                       AIB                             06500006
AIBKEY   DS    X                        RCB KEY FIELD                   07000006
AIBAPKEY EQU   X'18'                    APPL PROG / NETWKCTL FUNC       07500006
AIBQCBA  DS    AL3                      QCB ADDRESS OF RCB              08000006
AIBPRI   DS    X                        PRIORITY OF RCB                 08500006
AIBLINK  DS    AL3                      LINK FIELD OF RCB               09000006
AIBEXT   DS    0F                       EXTENSION FOR FUNCTION          09500006
         LCLA  &IND                                                     10000006
&IND     SETA  1                                                        10500006
.LOOP1   AIF   (&IND GT 6).NEXT1                                        11000006
         AIF   ('&EXT(&IND)' EQ 'NETWKCTL').NET                         11500006
&IND     SETA  &IND+1                                                   12000006
         AGO   .LOOP1                                                   12500006
.NET     ANOP                                                           13000006
         SPACE 1                                                        13500006
*        OPCTL / NETWORK CONTROL FUNCTION EXTENSION                     14000006
AIBCOMCD DS    XL1                      COMMAND VERB FIELD              14500006
*                     BIT   DEFINITIONS                               * 15000006
AIBMCNT  EQU   X'06'                    MCOUNT                          15500006
AIBTPDAT EQU   X'07'                    TPDATE                          16000006
AIBQCLS  EQU   X'10'                    MCPCLOSE - QUICK                16500006
AIBFCLS  EQU   X'11'                    MCPCLOSE - FLUSH                17000006
AIBTCHNG EQU   X'20'                    TCHNG                           17500006
AIBQCOPY EQU   X'40'                    QCOPY                           18000006
AIBICHNG EQU   X'49'                    ICHNG                           18500006
AIBICOPY EQU   X'50'                    ICOPY                           19000006
AIBTCOPY EQU   X'80'                    TCOPY                           19500006
AIBMRLSE EQU   X'87'                    MREALEASE                       20000006
AIBICPYX EQU   X'D0'                    ICOPY EXTENDED         @OZ09941 20200010
*                                                                     * 20500006
AIBFLAG1 DS    XL1                      FLAG BYTE                       21000006
*                     BIT   DEFINITIONS                               * 21500006
AIBENT01 EQU   X'01'                    3705 SERVICE RTN ENTRY          22000006
*                                       CODE FOR TCOPY                  22500006
AIBENT02 EQU   X'02'                    3705 SERVICE ENTRY              23000006
*                                       CODE FOR ICOPY                  23500006
AIBGETSZ EQU   X'80'                    FLAG = SIZING REQUEST           24000006
AIBTNT   EQU   X'40'                    FLAG = LOOK UP TERMINAL         24500006
*                                       ENTRY ADDRESS                   25000006
*                                                                     * 25500006
AIBFLAG2 DS    XL1                      FLAG BYTE                       26000006
*                     BIT   DEFINITIONS                               * 26500006
AIBRES04 EQU   X'04'                    3705 SERVICE RTN RESPONSE       27000006
*                                       FOR ICOPY                       27500006
AIBRES08 EQU   X'08'                    3705 SERVICE RTN RESPONSE       28000006
*                                       FOR TCOPY                       28500006
AIBDTS   EQU   X'20'                    BIT ON = DATE TIME REQUEST      29000006
AIBDEL   EQU   X'40'                    BIT ON = 'DELETE=YES' SPECIFIED 29500006
AIBRECDL EQU   X'80'                    BIT ON = GET RECORD DELIMITER   30000006
*                                                                     * 30500006
AIBOPRC  DS    XL1                      RETURN CODE FIELD               31000006
AIBNAME  DS    0XL8                     TERM OR DD NAME                 31500006
         DS    F                        FILLER FOR DOUBLY USED AREA     32000006
AIBRNTO  DS    AL4                      3705 INTERFACE FIELD            32500006
AIBRNFRO DS    AL4                      3705 INTERFACE FIELD            33000006
AIBTNDX  DS    H                        TERMINAL INDEX FIELD            33500006
         DS    H                        FIELD SET & CHECKED BY 3705     34000006
*                                       SERVICE ROUTINE                 34500006
AIBCOUNT DS    H                        DATA BYTE COUNT                 35000006
AIBLIMIT DS    H                        QCOPY LIMIT VALUE               35500006
AIBRNRET DS    AL4                      RETURN ADD TO CONTINUE PROC     36000006
*                                       AFTER CALL TO 3705 SERVICE RTN  36500006
AIBQLMNA DS    AL4                      PTR TO USER'S TERM NA AREA FOR  37000006
*                                       QCOPY FUNCTION                  37500006
         DS    F                        RESERVED                        38000006
AIBXMLST DS    3F                       XMPOST LIST                     38500006
AIBDATA  DS    0F                       DATA AREA                       39000006
         SPACE 1                                                        39500006
.NEXT1   ANOP                                                           40000006
&IND     SETA  1                                                        40500006
.LOOP2   AIF   (&IND GT 6).NEXT2                                        41000006
         AIF   ('&EXT(&IND)' EQ 'GETREAD').GR                           41500006
&IND     SETA  &IND+1                                                   42000006
         AGO   .LOOP2                                                   42500006
.GR      ANOP                                                           43000006
         SPACE 1                                                        43500006
*        GET / READ FUNCTION EXTENSION                                  44000006
         SPACE 1                                                        44500006
         ORG   AIBEXT                   GETREAD                         45000006
AIBGPEWA DS    A                        ADDRESS OF PEWA                 45500006
AIBRECFG DS    X                        DCBRECFM                        46000006
AIBMACRF DS    X                        DCBMACRF                        46500006
AIBBUFL  DS    H                        DCBBUFL                         47000006
AIBBLKSI DS    H                        DCBBLKSI                        47500006
AIBLRECL DS    H                        DCBLRECL                        48000006
AIBOPTCG DS    X                        DCBOPTCD                        48500006
AIBEXLFG DS    X                        CHECKPOINT FLAG                 49000006
CKPTFLG  EQU   X'0F'                    CHECKPOINT IN EXIT LIST         49500006
AIBLNGTH DS    H                        DECLNGTH                        50000006
AIBDECBG DS    A                        ADDRESS OF DECB                 50500006
AIBDECS  DS    A                        DECSDECB                        51000006
WAFULL   EQU   X'40'                    WORKAREA FILLED                 51500006
AIBCTLG  DS    A                        ADDRESS OF CTL BYTE IN WA       52000006
AIBCMPTG DS    0CL16                    POST PARAMETER LIST    @Z40X9AG 52500009
AIBSSGF1 DS    XL1                      FLAG BYTE 1            @Z40X9AG 52550009
AIBSSGEC EQU   X'2C'                    SCH SRB ENTRY CODE     @Z40X9AG 52600009
AIBSSGEA DS    AL3                      ECB ADDRESS            @Z40X9AG 52650009
AIBSSGAS DS    A                        ASCB ADDRESS           @Z40X9AG 52700009
AIBSSGCC DS    XL1                      COMPLETION CODE        @Z40X9AG 52750009
         DS    XL1                      UNUSED                 @Z40X9AG 52800009
AIBSSGID DS    H                        ASID                   @Z40X9AG 52850009
AIBSSGTC DS    A                        TCB ADDRESS            @Z40X9AG 52900009
         ORG   AIBSTATE+72                                              53000006
AIBWAG   DS    0F                       START OF WORKAREA               53500006
.NEXT2   ANOP                                                           54000006
&IND     SETA  1                                                        54500006
.LOOP3   AIF   (&IND GT 6).NEXT3                                        55000006
         AIF   ('&EXT(&IND)' EQ 'PUTWRITE').PW                          55500006
&IND     SETA  &IND+1                                                   56000006
         AGO   .LOOP3                                                   56500006
.PW      ANOP                                                           57000006
         SPACE 1                                                        57500006
*        PUT / WRITE FUNCTION EXTENSION                                 58000006
         SPACE 1                                                        58500006
         ORG   AIBEXT                   PUTWRITE                        59000006
AIBPPEWA DS    A                        ADDRESS OF PEWA                 59500006
AIBMSTRT DS    H                        START OF MESSAGE                60000006
AIBWASZE DS    H                        SIZE OF WORKAREA                60500006
         DS    X                        RESERVED               @ZA03744 60700009
AIBEXLFP DS    X                        CHECKPOINT INDICATOR            61000006
CKPTFLP  EQU   X'0F'                    CHECKPOINT IN EXIT LIST         61500006
AIBOPTCP DS    X                        DCBOPTCD                        62500006
AIBRECFP DS    X                        DCBRECFM                        63000006
AIBDECBP DS    A                        ADDRESS OF DECB                 63500006
AIBCMPTP DS    0CL16                    POST PARAMETER LIST    @Z40X9AG 64000009
AIBSSPF1 DS    XL1                      FLAG BYTE 1            @Z40X9AG 64050009
AIBSSPEC EQU   X'2C'                    SCH SRB ENTRY CODE     @Z40X9AG 64100009
AIBSSPEA DS    AL3                      ECB ADDRESS            @Z40X9AG 64150009
AIBSSPAS DS    A                        ASCB ADDRESS           @Z40X9AG 64200009
AIBSSPCC DS    XL1                      COMPLETION CODE        @Z40X9AG 64250009
         DS    XL1                      UNUSED                 @Z40X9AG 64300009
AIBSSPID DS    H                        ASID                   @Z40X9AG 64350009
AIBSSPTC DS    A                        TCB ADDRESS            @Z40X9AG 64400009
         ORG   AIBSTATE+72                                              64500006
AIBWAP   DS    0F                       START OF WORKAREA               65000006
.NEXT3   ANOP                                                           65500006
&IND     SETA  1                                                        66000006
.LOOP4   AIF   (&IND GT 6).NEXT4                                        66500006
         AIF   ('&EXT(&IND)' EQ 'POINT').PT                             67000006
&IND     SETA  &IND+1                                                   67500006
         AGO   .LOOP4                                                   68000006
.PT      ANOP                                                           68500006
         SPACE 1                                                        69000006
*        POINT FUNCTION EXTENSION                                       69500006
         SPACE 1                                                        70000006
         ORG   AIBEXT                   POINT                           70500006
AIBRPEWA DS    A                        ADDRESS OF PEWA                 71000006
AIBSTANM DS    FL8                      STATION NAME                    71500006
AIBINOUT DS    X                        INPUT OR OUTPUT                 72000006
AIBIN    EQU   C'I'                     INPUT SEQUENCE NUMBER           72500006
AIBOUT   EQU   C'O'                     OUTPUT SEQUENCE NUMBER          73000006
AIBSEQNO DS    H                        SEQUENCE NUMBER                 73500006
AIBCMPTR DS    3F                       CROSS MEMORY POST LIST          74000006
         ORG   AIBSTATE+72                                              74500006
AIBWAR   DS    0F                       START OF WORKAREA               75000006
.NEXT4   ANOP                                                           75500006
&IND     SETA  1                                                        76000006
.LOOP5   AIF   (&IND GT 6).NEXT5                                        76500006
         AIF   ('&EXT(&IND)' EQ 'CKREQ').CK                             77000006
&IND     SETA  &IND+1                                                   77500006
         AGO   .LOOP5                                                   78000006
.CK      ANOP                                                           78500006
         SPACE 1                                                        79000006
*        CHECK REQUEST FUNCTION EXTENSION                               79500006
         SPACE 1                                                        80000006
         ORG   AIBEXT                   CKREQ                           80500006
*              CHECK REQUEST ELEMENT IN AIB STARTS WITH AIBKEY          81000006
AIBCKECB DS    A                        ADDRESS OF ECB - CREECB@OZ11191 81500010
AIBOFFS  DS    0H                       TERM ENTRY OFFSET -    @OZ11191 82000010
*                                        CREOFFS               @OZ11191 82500010
AIBCPEWA DS    A                        ADDRESS OF FIRST PEWA  @OZ11191 83000010
*                                        IN CHAIN - CREDEB     @OZ11191 83500010
AIBCMPTC DS    3F                       CROSS MEMORY POST LIST          84000006
.NEXT5   ANOP                                                           84500006
&IND     SETA  1                                                        85000006
.LOOP6   AIF   (&IND GT 6).FINIS                                        85500006
         AIF   ('&EXT(&IND)' EQ 'QRESET').QR                            86000006
&IND     SETA  &IND+1                                                   86500006
         AGO   .LOOP6                                                   87000006
.QR      ANOP                                                           87500006
         SPACE 1                                                        88000006
*        QRESET FUNCTION EXTENSION                                      88500006
         SPACE 1                                                        89000006
         ORG   AIBEXT                   QRESET                          89500006
AIBQPEWA DS    A                        ADDRESS OF PEWA                 90000006
AIBDESTN DS    FL8                      DESTINATION QUEUE NAME          90500006
AIBOSEQN DS    H                        OUTPUT SEQUENCE NUMBER          91000006
AIBINDEX DS    H                        INDEX TO TERMINAL ENTRY         91500006
AIBTTPTR DS    A                        ADDR OF TERM TABLE ENTRY        92000006
AIBMAXNO DS    F                        MAXIMUM SEQ NUMBER              92500006
AIBMSGNO DS    H                        MESSAGE NUMBER                  93000006
AIBRETCD DS    H                        RETURN CODE                     93500006
AIBCMPTQ DS    3F                       CROSS MEMORY POST LIST          94000006
         ORG   AIBSTATE+72                                              94500006
AIBWAQR  DS    0F                       START OF WORKAREA               95000006
.FINIS   SPACE                                                          95500006
         MEND                                                           96000006
./  ADD  SSI=70060646,NAME=TBDUD
*        %GOTO BDUPLS;                  /* BILINGUAL HEADER             01000010
         MACRO                                                          02000010
         TBDUD                                                          03000010
.*A000000-999999                                               @Y17XAXF 04000010
IEDBDU   DSECT                                                          05000010
*                                                                       06000010
*        DSECT FOR BASIC DEVICE UNIT                                    07000010
*                                                                       08000010
BDUCMND  DS    XL1 .               COMMAND CODE                         09000010
BDUMODIF DS    XL1 .               MODIFIER BYTE                        10000010
BDUFNFLG DS    XL1 .               FUNCTION FLAGS                       11000010
BDUSTHDR EQU   X'80' .                  START OF HEADER                 12000010
BDUHEADR EQU   X'40' .                  HEADER PREFIX                   13000010
BDULEADG EQU   X'20' .                  LEADING GRAPHICS                14000010
BDUFRSTB EQU   X'10' .                  FIRST BLOCK                     15000010
BDUTPTX  EQU   X'08' .                  TRANSPARENT TEXT                16000010
BDUPOSAK EQU   X'04' .                  POSITIVE ACKNOWLEDGEMENT        17000010
BDUNEGAK EQU   X'02' .                  NEGATIVE ACKNOWLEDGEMENT        18000010
BDUALTAK EQU   X'01' .                  ALTERNATE ACKNOWLEDGEMENT       19000010
BDUBDUFG DS    XL1 .               BDU FLAGS                            20000010
BDUXERLK EQU   X'80'               /* RESET ERROR LOCK */               20500010
BDURSP   DS    0XL2  .           SYSTEM AND ERROR RESP         @YM08042 20700010
BDUSYRSP DS    XL1 .               SYSTEM RESPONSE                      21000010
BDUERROR EQU   X'80' .                  ERROR INDICATOR                 22000010
*BDUPHASE      BITS 1-2                 PHASE INDICATOR                 23000010
*BDURESP       BITS 3-7                 STATUS INFORMATION              24000010
BDUEXRSP DS    XL1 .               EXTENDED RESPONSE                    25000010
*BDUXINIT      BITS 0-2                 INITIAL STATUS                  26000010
*BDUXFINL      BITS 3-6                 FINAL STATUS                    27000010
BDUXGRPH EQU   X'01' .                  LEADING GRAPHICS                28000010
BDUEND   EQU   *                        END OF THE BDU HEADER           28300010
BDUTEXT  EQU   *                        BDU TEXT FIELD                  28600010
BDUMBHSC EQU   X'80' .                  CHANGE BH SET ASSOCATION        28700010
BDUMBHSA EQU   X'40' .                  ACTIVATE BH SET ASSOCATION      28800010
BDUMBHSD EQU   X'20' .                  DEACTIVATE BH SET ASSOCATION    28900010
BDULEN   EQU   *-IEDBDU .          BDU LENGTH                           29000010
         MEND                                                           30000010
*                                                                    */ 31000010
*%BDUPLS:;                                                              32000010
*DECLARE                                                                33000010
*  1 IEDBDU  BASED BDY(BYTE),                                           34000010
*/*                                                                  */ 35000010
*/*      DSECT FOR BASIC DEVICE UNIT                                 */ 36000010
*/*                                                                  */ 37000010
*    2 BDUCMND  CHAR(1),                /* COMMAND CODE              */ 38000010
*    2 BDUMODIF CHAR(1),                /* MODIFIER BYTE             */ 39000010
*    2 BDUFNFLG BIT(8),                 /* FUNCTION FLAGS            */ 40000010
*      3 BDUSTHDR BIT(1),               /*   START OF HEADER         */ 41000010
*      3 BDUHEADR BIT(1),               /*   HEADER PREFIX           */ 42000010
*      3 BDULEADG BIT(1),               /*   LEADING GRAPHICS        */ 43000010
*      3 BDUFRSTB BIT(1),               /*   FIRST BLOCK             */ 44000010
*      3 BDUTPTX  BIT(1),               /*   TRANSPARENT TEXT        */ 45000010
*      3 BDUPOSAK BIT(1),               /*   POSITIVE ACKNOWLEDGEMENT*/ 46000010
*      3 BDUNEGAK BIT(1),               /*   NEGATIVE ACKNOWLEDGEMENT*/ 47000010
*      3 BDUALTAK BIT(1),               /*   ALTERNATE ACKNOWLEDGEMNT*/ 48000010
*    2 BDUBDUFG BIT(8),                 /* BDU FLAGS                 */ 49000010
*      3 BDUXERLK BIT(1),               /* RESET ERROR LOCK */          49500010
*    2 BDURSP BIT(16),                  /* SYS & ERROR RESP  @YMO8042*/ 49700010
*      3 BDUSYRSP BIT(8),               /* SYSTEM RESPONSE   @YM08042*/ 50000010
*        4 BDUERROR BIT(1),             /*   ERROR INDICATOR @YM08042*/ 50900010
*        4 BDUPHASE BIT(2),             /*   PHASE INDICATOR @YM08042*/ 51800010
*        4 BDURESP  BIT(5),             /*   STATUS INFO     @YM08042*/ 52700010
*      3 BDUEXRSP CHAR(1),              /* EXTENDED RESPONSE @YM08042*/ 53600010
*        4 BDUXINIT BIT(3),             /*   INITIAL STATUS  @YM08042*/ 54500010
*        4 BDUXFINL BIT(4),             /*   FINAL STATUS    @YM08042*/ 55400010
*        4 BDUXGRPH BIT(1),             /*   LEAD GRAPHICS   @YM08042*/ 56300010
*    2 BDUEND CHAR(0);                  /* END OF THE BDU HEADER     */ 57300010
* DCL BDUTEXT CHAR(*) DEF(BDUEND);      /* BDU TEXT FIELD            */ 57600010
*/* BDUTEXT VALUES                                                   */ 57650010
* DCL BDUMBHSC BIT(8) CONSTANT('80'X);  /* CHANGE BH SET ASSOCIATION */ 57700010
* DCL BDUMBHSA BIT(8) CONSTANT('40'X);  /* ACTIVATE BH SET              57750010
*                                          ASSOCATION                */ 57800010
* DCL BDUMBHSD BIT(8) CONSTANT('20'X);  /* DEACTIVATE BH SET            57850010
*                                          ASSOCATION                */ 57900010
* %BDULEN='LENGTH(IEDBDU)';             /* BDU LENGTH                */ 58000010
./  ADD  SSI=91070537,NAME=TCAVTD
*        %GOTO PLSTCAVT;                /*                              00000100
         MACRO                                                          00000200
         TCAVTD &DSECT=YES                                              00000300
.*A000000-999999                                               @Y17XAXF 00000400
.*C000005-000067 (RESEQUENCE MODULE TO INSERT FIX)             @OZ31115 00000500
         AIF   ('&DSECT' EQ 'NO').NODSECT                               00050500
IEDQCKAD DSECT                                                          96899900
         AGO   .GENFLD                                                  96949900
.NODSECT ANOP                                                           96999900
IEDQCKAD DS    0D                                                       97049900
.GENFLD  ANOP                                                           97099900
*                                                                       97149900
*        CHECKPOINT/RESTART ADDRESS VECTOR TABLE                        97199900
*                                                                       97249900
CAVTTCWA DS    A                        ADDRESS OF TCAM CHECKPOINT      97299900
*                                       WORKAREA                        97349900
CAVTNWA  DS    A                        WORKAREA FOR 3705               97399900
*                                       CHECKPOINT/RESTART              97449900
CAVTWTG  DS    XL1                      WHERE TO GO AFTER A 3705        97499900
*                                       CHECKPOINT I/O                  97549900
CAVTFLGS DS    XL1                      CHECKPOINT/RESTART FLAGS        97599900
CAVTRSV1 DS    XL2                      RESERVED                        97649900
CAVTWL1  DS    0CL16                    WAIT LIST WITH TCAM WITH OR     97699900
*                                       WITHOUT 3705 CHECKPOINT         97749900
CAVTTQE  DS    A                        ECB FOR TCAM CKPT QUEUE         97799900
CAVTEOL1 DS    XL1                      END OF LIST - TCAM CKPT ONLY    97849900
CAVTTIOE DS    AL3                      ECB FOR TCAM CKPT I/O           97899900
CAVTWL2  DS    0CL8                     WAIT LIST WITH ONLY 3705 CKPT   97949900
CAVTEOL2 DS    XL1                      END OF LIST - NO 3705 CKPT I/O  97999900
*                                       STARTED                         98049900
CAVTNQE  DS    AL3                      ECB FOR 3705 CKPT QUEUE         98099900
CAVTEOL3 DS    XL1                      END OF LIST - 3705 CKPT I/O     98149900
*                                       STARTED                         98199900
CAVTNIOE DS    AL3                      ECB FOR 3705 CKPT I/O           98249900
CAVTCRIO DS    A .                      ADDRESS OF 3705 CHECKPOINT/     98299900
*                                        RESTART I/O ROUTINE            98349900
CAVTCKTR DS    XL2                      TCAM CKPT TRACE OFFSET @OZ31115 98399900
CAVTNTR  DS    XL2                      3705 CKPT TRACE OFFSET @OZ31115 98439900
CAVTSIZE EQU   *-IEDQCKAD               SIZE OF CHECKPOINT AVT          98479900
         MEND  */                                                       98519900
*%PLSTCAVT : ;                                                          98559900
* DECLARE                                                               98599900
* 1 IEDQCKAD BDY(DWORD) BASED(RCAVT),                                   98639900
*/*                                                                  */ 98679900
*/*      CHECKPOINT/RESTART ADDRESS VECTOR TABLE                     */ 98719900
*/*                                                                  */ 98759900
*  2 CAVTTCWA PTR(31),                  /* ADDRESS OF TCAM CHECKPOINT   98799900
*                                          WORKAREA                  */ 98839900
*  2 CAVTNWA  PTR(31),                  /* WORKAREA FOR 3705            98879900
*                                          CHECKPOINT/RESTART        */ 98919900
*  2 CAVTWTG  BIT(8),                   /* WHERE TO GO AFTER A 3705     98959900
*                                          CHECKPOINT I/O            */ 98999900
*  2 CAVTFLGS BIT(8),                   /* CHECKPOINT/RESTART FLAGS  */ 99039900
*  2 *        CHAR(2),                  /* RESERVED                  */ 99079900
*  2 CAVTWL1,                           /* WAIT LIST WITH TCAM WITH OR  99119900
*                                          WITHOUT 3705 CHECKPOINT   */ 99159900
*   3 CAVTTQE  PTR(31),                 /* ECB FOR TCAM CKPT QUEUE   */ 99199900
*   3 CAVTEOL1 BIT(8),                  /* EOL - TCAM CKPT ONLY      */ 99239900
*   3 CAVTTIOE PTR(24),                 /* ECB FOR TCAM CKPT I/O     */ 99279900
*   3 CAVTWL2,                          /* WAIT LIST WITH ONLY          99319900
*                                          3705 CHPT                 */ 99359900
*    4 CAVTEOL2 BIT(8),                 /* EOL - NO 3705 CKPT I/O       99399900
*                                          STARTED                   */ 99439900
*    4 CAVTNQE  PTR(24),                /* ECB FOR 3705 CKPT QUEUE   */ 99479900
*    4 CAVTEOL3 BIT(8),                 /* END OF LIST - 3705 CKPT I/O  99519900
*                                          STARTED                   */ 99559900
*    4 CAVTNIOE PTR(24),                /* ECB FOR 3705 CKPT I/O     */ 99599900
*  2 CAVTCRIO PTR(31),                  /* ADDRESS OF 3705 CHECKPOINT   99639900
*                                          /RESTART I/O ROUTINE      */ 99679900
*  2 CAVTCKTR FIXED(16),                /* OFFSET TO TCAM CHECKPOINT    99719900
*                                          TRACE TABLE       @OZ31115*/ 99759900
*  2 CAVTNTR FIXED(16);                 /* OFFSET TO 3705 CHECKPOINT    99799900
*                                          TRACE TABLE       @OZ31115*/ 99839900
*%CAVTSIZE='LENGTH(IEDQCKAD)';          /* SIZE OF CHECKPOINT AVT    */ 99879900
./  ADD  SSI=71310501,NAME=TCMD0D
*        %GOTO CMD0PLS;            /* BILINGUAL HEADER                  00300000
         MACRO                                                          00600000
         TCMD0D                                                         00900000
.*A000000-999999                                               @Y17XAXF 01200000
*                                                                       01500000
*        FID0 COMMAND CODES                                             01800000
*                                                                       02100000
         SPACE                                                          02400000
CD0READ  EQU   X'01' .             READ COMMANDS                        02700000
*                                                                       03000000
*        READ MODIFIERS                                                 03300000
*                                                                       03600000
CD0R     EQU   X'00' .                  READ NORMAL                     03900000
CD0RB    EQU   X'01' .                  READ BLOCK                      04200000
CD0RM    EQU   X'02' .                  READ MESSAGE                    04500000
CD0RT    EQU   X'03' .                  READ TRANSMISSION               04800000
CD0RD    EQU   X'04' .                  READ TRANSMISSION DISCONNECT    05100000
CD0RI    EQU   X'05'                    READ WITH INVITE                05400000
         SPACE                                                          05700000
CD0WRT   EQU   X'02' .             WRITE COMMAND                        06000000
*                                                                       06300000
*        WRITE MODIFIERS                                                06600000
*                                                                       06900000
CD02     EQU   X'00' .                  WRITE NORMAL                    07200000
CD0WM    EQU   X'01' .                  WRITE WITH EOM                  07500000
CD0WT    EQU   X'02' .                  WRITE WITH EOT                  07800000
CD0WD    EQU   X'03' .                  WRITE WITH DISCONNECT           08100000
CD0WR    EQU   X'06' .                  WRITE WITH READ                 08400000
CD0WI    EQU   X'07' .                  WRITE WITH INVITE               08700000
CD0WC    EQU   X'08'                    WRITE WITH CONTACT              09000000
CD0WCM   EQU   X'09' .                  WRITE WITH CONTACT(EXT)         09300000
CD0WCT   EQU   X'0A' .                  WRITE WITH CONTACT(EOT)         09600000
CD0WCD   EQU   X'0B' .                  WRITE WITH CONTACT AND DISCONN  09900000
CD0WCR   EQU   X'0E' .                  WRITE WITH CONTACT AND READ     10200000
         SPACE                                                          10500000
CD0TEST  EQU   X'03' .             TEST COMMAND                         10800000
*                                                                       11100000
*        TEST MODIFIERS                                                 11400000
*                                                                       11700000
CD0T     EQU   X'00' .                  TEST DEVICE NORMAL              12000000
CD0TC    EQU   X'01' .                  TEST DEVICE WITH CONTACT        12300000
CD0TD    EQU   X'02' .                  TEST DEVICE WITH DISCONNECT     12600000
CD0TCD   EQU   X'03' .                  TEST DEV WITH CDNTACT & DISCONN 12900000
CD0TI    EQU   X'04' .                  TEST LINE NORMAL                13200000
CD0TIC   EQU   X'05' .                  TEST LINE WITH CONTACT          13500000
CD0TID   EQU   X'06' .                  TEST LINE WITH DISCONNECT       13800000
CD0TICD  EQU   X'07' .                  TEST LINE WITH CONTACT & DISCON 14100000
         SPACE                                                          14400000
CD0REST  EQU   X'04' .             RESTART COMMAND                      14700000
*                                                                       15000000
*        RESTART MODIFIERS                                              15300000
*                                                                       15600000
CD0RLINE EQU   X'00' .                  LINE                            15900000
CD0RDEV  EQU   X'01' .                  DEVICE                          16200000
CD0RLSES EQU   X'02' .                  REP SESSION INIT INFO FOR LINE  16500000
CD0RDSES EQU   X'04' .                  REP SESSION INIT INFO FOR DEV   16800000
         SPACE                                                          17100000
CD0INV   EQU   X'05' .             INVITE COMMAND                       17400000
*                                                                       17700000
*        INVITE MODIFIERS                                               18000000
*                                                                       18300000
CD0I     EQU   X'00' .                  INVITE NORMAL                   18600000
CD0IB    EQU   X'01' .                  INVITE BLOCK                    18900000
CD0IM    EQU   X'02' .                  INVITE MESSAGE                  19200000
CD0IT    EQU   X'03' .                  INVITE TRANSMISSION             19500000
CD0ID    EQU   X'04' .                  INVITE TRANSMISSION WITH DISCON 19800000
CD0IA    EQU   X'05' .                  INVITE WITH AUTO RESTART        20100000
CD0IP    EQU   X'06' .                  INVITE PERPETUAL                20400000
         SPACE                                                          20700000
CD0CONT  EQU   X'06' .             CONTACT COMMAND                      21000000
*                                                                       21300000
*        NO CONTACT MODIFIERS                                           21600000
*                                                                       21900000
         SPACE                                                          22200000
CD0DISC  EQU   X'07' .             DISCONNECT COMMAND                   22500000
*                                                                       22800000
*        DISCONNECT MODIFIERS                                           23100000
*                                                                       23400000
CD0D     EQU   X'00' .                  DISCONNECT NORMAL               23700000
CD0DI    EQU   X'01' .                  DISCONNECT WITH INVITE          24000000
CD0DE    EQU   X'02' .                  DISCONNECT WITH END-OF-CALL     24300000
CD0DEI   EQU   X'03' .                  DISCONNECT WITH EOC AND INVITE  24600000
         SPACE                                                          24900000
CD0CTRL  EQU   X'08' .             CONTROL COMMAND                      25200000
*                                                                       25500000
*        CONTROL MODIFIERS                                              25800000
*                                                                       26100000
CD0CDISL EQU   X'01' .                  DISPLAY LINE STATUS             26400000
CD0CRSII EQU   X'02' .                  REP SESS INIT INFO FOR A LINE   26700000
CD0CAI   EQU   X'03' .                  ACTIVATES INVITES               27000000
CD0CDI   EQU   X'04' .                  DEACTIVATES INVITES             27300000
CD0CCSII EQU   X'05' .                  COPY SESS INIT INFO             27600000
CD0CDDS  EQU   X'06' .                  DISPLAY DEVICE STATUS           27900000
CD0CRDS  EQU   X'07' .                  REQ DEV STATISTICS              28200000
CD0CDS   EQU   X'08' .                  DISPLAY STORAGE                 28500000
CD0CSTD  EQU   X'09' .                  SET TIME AND DATE               28800000
CD0CSCMS EQU   X'0A' .                  SET CHANNEL MODE SECONDARY      29100000
CD0CDLNA EQU   X'0B' .                  DISPLAY LINE'S NETWORK ADDR     29400000
CD0CALT  EQU   X'0C' .                  ACTIVATE LINE TRACE             29700000
CD0CTLT  EQU   X'0D' .                  TERMINATE LINE TRACE            30000000
CD0CCMS  EQU   X'12' .                  CHANGE MODEM SPEED              30300000
CD0CSCMP EQU   X'15' .                  SET CHANNEL MODE PRIMARY        30600000
CD0CCDM  EQU   X'18' .                  COPY DESTINATION MODE           30900000
CD0CPD   EQU   X'1C' .                  PHYSICAL DISCONNECT             31200000
CD0CCDSI EQU   X'21' .                  COPY DEV SESSION INFO           31500000
CD0CRDSI EQU   X'22' .                  REP DEV SESSION INFO            31800000
CD0CREL  EQU   X'41' .                  RESET ERROR LOCK                32100000
CD0CRDQ  EQU   X'42' .                  RESET DEVICE QUEUES             32400000
CD0CRCMR EQU   X'43' .                  REQ CONTROLMODE RESET           32700000
CD0CRI   EQU   X'44' .                  RESET IMMEDIATE                 33000000
CD0CROTT EQU   X'48' .                  RESET ONLINE TERMINAL TEST      33300000
CD0CSTB  EQU   X'4A' .                  SWITCH TO BACKUP                33600000
CD0CSBTP EQU   X'4C' .                  SWITCH FROM BACKUP TO PRIMARY   33900000
CD0CRINV EQU   X'4D' .                  RESET INVITE                    34200000
CD0CRC   EQU   X'50' .                  RESET CONDITIONAL               34500000
CD0CREOC EQU   X'60' .                  RESET AT ENDOF COMMAND          34800000
CD0CSEP  EQU   X'82' .                  SWITCH TO EP MODE               35100000
CD0CSNCP EQU   X'83' .                  SWITCH TO NCP MODE              35400000
CD0CCLSP EQU   X'84' .                  CHGE LINE SERVICE-SEEKING PAUSE 35700000
CD0CCLNR EQU   X'85' .                  CHGE LINE NEG POLL RSP LIMIT    36000000
CD0CCSL  EQU   X'86' .                  CHGE SESSION LIMIT              36300000
CD0CCDTL EQU   X'8C' .                  CHGE DEV TRANSMISSION LIMIT     36600000
CD0CMBHS EQU   X'8D' .                  MODIFY BLK HANDLER SET ASSOC    36900000
CD0CAL   EQU   X'98' .                  ACTIVATE LINE                   37200000
CD0CD0   EQU   X'99' .                  DEACTIVATE ORDERLY              37500000
CD0CSDM  EQU   X'9A' .                  SET DESTINATION MODE            37800000
CD0CDLH  EQU   X'C2' .                  DEACTIVATE LINE HALT            38100000
         MEND                                                           38400000
*        */                                                             38700000
*%CMD0PLS:;                                                             39000000
*/*                                                                  */ 39300000
*/*      FID0 COMMAND CODES                                          */ 39600000
*/*                                                                  */ 39900000
*                                                                       40200000
*DCL CD0READ  BIT(8) CONSTANT('01'X); /* READ COMMAND                */ 40500000
*/*                                                                  */ 40800000
*/*      READ MODIFIERS                                              */ 41100000
*/*                                                                  */ 41400000
*DCL CD0R      BIT(8) CONSTANT('00'X); /*  READ NORMAL               */ 41700000
*DCL CD0RB     BIT(8) CONSTANT('01'X); /*  READ BLOCK                */ 42000000
*DCL CD0RM     BIT(8) CONSTANT('02'X); /*  READ MESSAGE              */ 42300000
*DCL CD0RT     BIT(8) CONSTANT('03'X); /*  READ TRANSMISSION         */ 42600000
*DCL CD0RD     BIT(8) CONSTANT('04'X); /*  READ TRANSMISSION DISCON  */ 42900000
*DCL CD0RI     BIT(8) CONSTANT('05'X); /*  READ WITH INVITE          */ 43200000
*                                                                       43500000
*DCL CD0WRT    BIT(8) CONSTANT('02'X); /* WRITE COMMAND              */ 43800000
*/*                                                                  */ 44100000
*/*      WRITE MODIFIERS                                             */ 44400000
*/*                                                                  */ 44700000
*DCL CD0W      BIT(8) CONSTANT('00'X); /*  WRITE NORMAL              */ 45000000
*DCL CD0WM     BIT(8) CONSTANT('01'X); /*  WRITE WITH EOM            */ 45300000
*DCL CD0WT     BIT(8) CONSTANT('02'X); /*  WRITE WITH EOT            */ 45600000
*DCL CD0WD     BIT(8) CONSTANT('03'X); /*  WRITE WITH DISCONNECT     */ 45900000
*DCL CD0WR     BIT(8) CONSTANT('06'X); /*  WRITE WITH READ           */ 46200000
*DCL CD0WI     BIT(8) CONSTANT('07'X); /*  WRITE WITH INVITE         */ 46500000
*DCL CD0WC     BIT(8) CONSTANT('08'X); /*  WRITE WITH CONTACT        */ 46800000
*DCL CD0WCM    BIT(8) CONSTANT('09'X); /*  WRITE WITH CONTACT(EXT)   */ 47100000
*DCL CD0WCT    BIT(8) CONSTANT('0A'X); /*  WRITE WITH CONTACT(EOT)   */ 47400000
*DCL CD0WCD    BIT(8) CONSTANT('0B'X); /* WRITE WITH CONTACT & DISCON*/ 47700000
*DCL CD0WCR    BIT(8) CONSTANT('0E'X); /*  WRITE WITH CONTACT & READ */ 48000000
*                                                                       48300000
*DCL CD0TEST  BIT(8) CONSTANT('03'X); /* TEST COMMAND                */ 48600000
*/*                                                                  */ 48900000
*/*      TEST MODIFIERS                                              */ 49200000
*/*                                                                  */ 49500000
*DCL CD0T     BIT(8) CONSTANT('00'X); /*  TEST DEVICE NORMAL         */ 49800000
*DCL CD0TC    BIT(8) CONSTANT('01'X); /*  TEST DEVICE WITH CONTACT   */ 50100000
*DCL CD0TD    BIT(8) CONSTANT('02'X); /*  TEST DEVICE WITH DISCONN   */ 50400000
*DCL CD0TCD   BIT(8) CONSTANT('03'X); /*  TEST DEV WITH CONTACT & DIS*/ 50700000
*DCL CD0TI    BIT(8) CONSTANT('04'X); /*  TEST LINE NORMAL           */ 51000000
*DCL CD0TIC   BIT(8) CONSTANT('05'X); /*  TEST LINE WITH CONTACT     */ 51300000
*DCL CD0TID   BIT(8) CONSTANT('06'X); /*  TEST LINE WITH DISCONNECT  */ 51600000
*DCL CD0TICD  BIT(8) CONSTANT('07'X); /*  TEST LINE WITH CONT & DISC */ 51900000
*                                                                       52200000
*/*                                                                  */ 52500000
*/*      RESTART MODIFIERS                                           */ 52800000
*/*                                                                  */ 53100000
*DCL CD0RLINE BIT(8) CONSTANT('00'X); /*  LINE                       */ 53400000
*DCL CD0RDEV  BIT(8) CONSTANT('01'X); /*  DEVICE                     */ 53700000
*DCL CD0RLSES BIT(8) CONSTANT('02'X); /*  REP SESS INIT INFO FOR LINE*/ 54000000
*DCL CD0RDSES BIT(8) CONSTANT('04'X); /*  REP SESS INIT INFO FOR DEV */ 54300000
*                                                                       54600000
*DCL CD0INV   BIT(8) CONSTANT('05'X); /* INVITE COMMAND              */ 54900000
*/*                                                                  */ 55200000
*/*      INVITE MODIFIERS                                            */ 55500000
*/*                                                                  */ 55800000
*DCL CD0I     BIT(8) CONSTANT('00'X); /*  INVITE NCORMAL             */ 56100000
*DCL CD0IB    BIT(8) CONSTANT('01'X); /*  INVITE BLOCK               */ 56400000
*DCL CD08M    BIT(8) CONSTANT('02'X); /*  INVITE MESSAGE             */ 56700000
*DCL CD0IT    BIT(8) CONSTANT('03'X); /*  INVITE TRANSMISSION        */ 57000000
*DCL CD08D    BIT(8) CONSTANT('04'X); /*  INVITE TRANS WITH DISC     */ 57300000
*DCL CD08A    BIT(8) CONSTANT('05'X); /*  INVITE WITH AUTO RESTART   */ 57600000
*DCL CD0IP    BIT(8) CONSTANT('06'X); /*  INVITE PERPETUAL           */ 57900000
*                                                                       58200000
*DCL CD0CONT  BIT(8) CONSTANT('06'X); /* CONTACT COMMAND             */ 58500000
*/*                                                                  */ 58800000
*/*      NO CONTACT MODIFIERS                                        */ 59100000
*/*                                                                  */ 59400000
*                                                                       59700000
*DCL CD0DISC  BIT(8) CONSTANT('07'X); /* DISCONNECT COMMAND          */ 60000000
*/*                                                                  */ 60300000
*/*      DISCONNECT MODIFIERS                                        */ 60600000
*/*                                                                  */ 60900000
*DCL CD0D     BIT(8) CONSTANT('00'X); /*  DISCONNECT NORMAL          */ 61200000
*DCL CD0DI    BIT(8) CONSTANT('01'X); /* DISCONNECT WITH INVITE      */ 61500000
*DCL CD0DE    BIT(8) CONSTANT('02'X); /*  DISCONNECT WITH END-OF-CALL*/ 61800000
*DCL CD0DEI   BIT(8) CONSTANT('03'X); /*  DISCONNECT WITH EOC AND INV*/ 62100000
*                                                                       62400000
*DCL CD0CTRL  BIT(8) CONSTANT('08'X); /* CONTROL COMMAND             */ 62700000
*/*                                                                  */ 63000000
*/*      CONTROL MODIFIERS                                           */ 63300000
*/*                                                                  */ 63600000
*DCL CD0CDISL BIT(8) CONSTANT('01'X); /*  DISPLAY LINE STATUS        */ 63900000
*DCL CD0CRSII BIT(8) CONSTANT('02'X); /*  REP SESS INIT INFO FOR LINE*/ 64200000
*DCL CD0CA8   BIT(8) CONSTANT('03'X); /*  ACTIVATES INVITES          */ 64500000
*DCL CD0CDI   BIT(8) CONSTANT('04'X); /*  DEACTIVATES INVITES        */ 64800000
*DCL CD0CCSII BIT(8) CONSTANT('05'X); /*  COPY SESS INIT INFO        */ 65100000
*DCL CD0CDDS  BIT(8) CONSTANT('06'X); /*  DISPLAY DEVICE STATUS      */ 65400000
*DCL CD0CRDS  BIT(8) CONSTANT('07'X); /*  REQ DEVICE STATISTICS      */ 65700000
*DCL CD0CDS   BIT(8) CONSTANT('08'X); /*  DISPLAY STORAGE            */ 66000000
*DCL CD0CSTD  BIT(8) CONSTANT('09'X); /*  SET TIME AND DATE          */ 66300000
*DCL CD0CSCMS BIT(8) CONSTANT('0A'X); /*  SET CHANNEL MODE SECONDARY */ 66600000
*DCL CD0CDLNA BIT(8) CONSTANT('0B'X); /*  DISPLAY LINE'S NETWORK ADDR*/ 66900000
*DCL CD0CALT  BIT(8) CONSTANT('0C'X); /*  ACTIVATE LINE TRACE        */ 67200000
*DCL CD0CTLT  BIT(8) CONSTANT('0D'X); /*  TERMINATE LINE TRACE       */ 67500000
*DCL CD0CCMS  BIT(8) CONSTANT('12'X); /*  CHANGE MODEM SPEED         */ 67800000
*DCL CD0CSCMP BIT(8) CONSTANT('15'X); /*  SET CHANNEL MODE PRIMARY   */ 68100000
*DCL CD0CCDM  BIT(8) CONSTANT('18'X); /*  COPY DESTINATION MODE      */ 68400000
*DCL CD0CPD   BIT(8) CONSTANT('1C'X); /*  PHYSICAL DISCONNECT        */ 68700000
*DCL CD0CCDSI BIT(8) CONSTANT('21'X); /*  COPY DEV SESSION INFO      */ 69000000
*DCL CD0CRDSI BIT(8) CONSTANT('22'X); /*  REP DEV SESSION INFO       */ 69300000
*DCL CD0CREL  BIT(8) CONSTANT('41'X); /*  RESET ERROR LOCK           */ 69600000
*DCL CD0CRD1  BIT(8) CONSTANT('42'X); /*  RESET DEVICE QUEUES        */ 69900000
*DCL CD0CRCMR BIT(8) CONSTANT('43'X); /*  REQ CONTROL MODE RESET     */ 70200000
*DCL CD0CRI   BIT(8) CONSTANT('44'X); /*  RESET IMMEDIATE            */ 70500000
*DCL CD0CROTT BIT(8) CONSTANT('48'X); /*  RESET ONLINE TERMINAL TEST */ 70800000
*DCL CD0CSTB  BIT(8) CONSTANT('4A'X); /*  SWITCH TO BACKUP           */ 71100000
*DCL CD0CSBTP BIT(8) CONSTANT('4C'X); /*  SWITCH FROM BACKUP TO PRIM */ 71400000
*DCL CD0CRINV BIT(8) CONSTANT('4D'X); /*  RESET INVITE               */ 71700000
*DCL CD0CRC   BIT(8) CONSTANT('50'X); /*  RESET CONDITIONAL          */ 72000000
*DCL CD0CREOC BIT(8) CONSTANT('60'X); /*  RESET AT END OF COMMAND    */ 72300000
*DCL CD0CSEP  BIT(8) CONSTANT('82'X); /*  SWITCH TO EP MODE          */ 72600000
*DCL CD0CSNCP BIT(8) CONSTANT('83'X); /*  SWITCH TO NCP MODE         */ 72900000
*DCL CD0CCLSP BIT(8) CONSTANT('84'X); /*  CHGE LINE SERV-SEEKING PAUS*/ 73200000
*DCL CD0CCLNR BIT(8) CONSTANT('85'X); /*  CHGE LINE NEG POLL RSP LIM */ 73500000
*DCL CD0CCSL  BIT(8) CONSTANT('86'X); /*  CHGE SESSION LIMIT         */ 73800000
*DCL CD0CCDTL BIT(8) CONSTANT('8C'X); /*  CHGE DEV TRANSMISSION LIMIT*/ 74100000
*DCL CD0CMBHS BIT(8) CONSTANT('8D'X); /*  MOD BLK HANDLER SET ASSOC  */ 74400000
*DCL CD0CAL   BIT(8) CONSTANT('98'X); /*  ACTIVATE LINE              */ 74700000
*DCL CD0CD0   BIT(8) CONSTANT('99'X); /*  DEACTIVATE ORDERLY         */ 75000000
*DCL CD0CSDM  BIT(8) CONSTANT('9A'X); /*  SET DESTINATION MODE       */ 75300000
*DCL CD0CDLH  BIT(8) CONSTANT('C2'X); /*  DEACTIVATE LINE HALT       */ 75600000
./  ADD  SSI=71310502,NAME=TCMD1D
*        %GOTO CMD1PLS;                /* BILINGUAL HEADER              00400000
         MACRO                                                          00800000
         TCMD1D                                                         01200000
.*A000000-999999                                               @Y17XAXF 01600000
*                                                                       02000000
*        DFC FID1 COMMANDS                                              02400000
*                                                                       02800000
CD1PREPS EQU   X'02' .             PREPARE SWITCH                       03200000
CD1SWCOM EQU   X'03' .             SWITCH COMPLETE                      03600000
CD1LSTAT EQU   X'04' .             LUSTAT                               04000000
CD1RTR   EQU   X'05' .             READY TO RECEIVE                     04400000
CD1ANS   EQU   X'06' .             AUTO NETWORK SHUTDOWN                04800000
CD1ANSC  EQU   X'07' .             ANS COMPLETE                         05200000
CD1ACTLU EQU   X'0D' .             ACTIVATE LU                          05600000
CD1DATLU EQU   X'0E' .             DEACTIVATE LU                        06000000
CD1ACTPU EQU   X'11' .             ACTIVATE PU                          06400000
CD1DATPU EQU   X'12' .             DEACTIVATE PU                        06800000
CD1BIND  EQU   X'31' .             BIND                                 07200000
CD1UBIND EQU   X'32' .             UNBIND                               07600000
CD1INITC EQU   X'50' .             INIT COMPLETE                        08000000
CD1QEC   EQU   X'80' .             QUIESCE AT END OF CHAIN              08400000
CD1QC    EQU   X'81' .             QUIESCE COMPLETE                     08800000
CD1REL1  EQU   X'82' .             RELEASE QUIESCE                      09200000
CD1CANCL EQU   X'83' .             CANCEL                               09600000
CD1CHASE EQU   X'84' .             CHASE                                10000000
CD1SDT   EQU   X'A0' .             START DATA TRAFFIC                   10400000
CD1CLEAR EQU   X'A1' .             CLEAR                                10800000
CD1STSN  EQU   X'A2' .             SET AND TEST SEQ NUMBERS             11200000
CD1RQR   EQU   X'A3' .             REQUEST RECEIVED                     11600000
CD1SHUTD EQU   X'C0' .             SHUTDOWN                             12000000
CD1SHUTC EQU   X'C1' .             SHUTDOWN COMPLETE                    12400000
CD1RSHUT EQU   X'C2' .             REQUEST SHUTDOWN                     12800000
CD1BID   EQU   X'C8' .             BID                                  13200000
CD1SIG   EQU   X'C9' .             SIGNAL                               13600000
         EJECT                                                          14000000
*                                                                       14400000
*                                                                       14800000
*        NETWORK SERVICES FID1 COMMANDS                                 15200000
*                                                                       15600000
*                                                                       16000000
CD1NETS  EQU   X'01' .             NETWORK SERVICES IND                 16400000
         SPACE                                                          16800000
*                                                                       17200000
*        CONFIGURATION SERVICES FID1 COMMANDS                           17600000
*                                                                       18000000
CD1CONFS EQU   X'02' .             CONFIGURATION SERV IND               18400000
         SPACE                                                          18800000
CD1CONT  EQU   X'01' .               CONTACT                            19200000
CD1DCONT EQU   X'02' .               DISCONTACT                         19600000
CD1IPLI  EQU   X'03' .               IPL INITIAL                        20000000
CD1IPLT  EQU   X'04' .               IPL TEXT                           20400000
CD1IPLF  EQU   X'05' .               IPL FINAL                          20800000
CD1DMPI  EQU   X'06' .               DUMP INITIAL                       21200000
CD1DMPT  EQU   X'07' .               DUMP TEXT                          21600000
CD1DMPF  EQU   X'08' .               DUMP FINAL                         22000000
CD1RPO   EQU   X'09' .               REMOTE POWER OFF                   22400000
CD1ACTLK EQU   X'0A' .               ACTIVATE LINK                      22800000
CD1DATLK EQU   X'0B' .               DEACTIVATE LINK                    23200000
CD1CESLW EQU   X'0C' .               CONTROL ENTER SLOWDOWN             23600000
CD1CXSLW EQU   X'0D' .               CONTROL EXIT SLOWDOWN              24000000
CD1CONNO EQU   X'0E' .               CONNECT OUT                        24400000
CD1ABC   EQU   X'0F' .               ABANDON CONNECTION                 24800000
CD1SETV  EQU   X'11' .               SET CONTROL VECTOR                 25200000
CD1SENV  EQU   X'12' .               SENSE CONTROL VECTOR               25600000
CD1ESLOW EQU   X'14' .               ENTERING SLOWDOWN                  26000000
CD1EXSLW EQU   X'15' .               EXITING SLOWDOWN                   26400000
CD1ACI   EQU   X'16' .               ACTIVATE CONNECT IN                26800000
CD1DCI   EQU   X'17' .               DEACTIVATE CONNECT IN              27200000
CD1ACO   EQU   X'18' .               ABANDON CONNECT OUT                27600000
CD1ANA   EQU   X'19' .               ASSIGN NETWORK ADDR                28000000
CD1FNA   EQU   X'1A' .               FREE NETWORK ADDR                  28400000
CD1REQD  EQU   X'1B' .               REQUEST DISCONTACT                 28800000
CD1CONCT EQU   X'80' .               CONTACTED                          29200000
CD1INOP  EQU   X'81' .               INOPERATIVE                        29600000
CD1REQC  EQU   X'84' .               REQUEST CONTACT                    30000000
         SPACE                                                          30400000
*                                                                       30800000
*        MAINTENANCE SERVICES FID1 COMMANDS                             31200000
*                                                                       31600000
CD1MAINT EQU   X'03' .             MAINTENANCE SERV IND                 32000000
         SPACE                                                          32400000
CD1EX    EQU   X'01' .               EXECUTE TEST                       32800000
CD1ACTTR EQU   X'02' .               ACTIVATE TRACE                     33200000
CD1DACTR EQU   X'03' .               DEACTIVATE TRACE                   33600000
CD1RTP   EQU   X'08' .               REQUEST TEST PROCEDURE             34000000
CD1RMS   EQU   C'81' .               RECORD MAINTENANCE STATISTICS      34400000
CD1RTTD  EQU   X'82' .               RECORD TEST DATA                   34800000
CD1RTRD  EQU   X'83' .               RECORD TRACE DATA                  35200000
         SPACE                                                          35600000
*                                                                       36000000
*        MEASUREMENT SERVICES FID1 COMMANDS                             36400000
*                                                                       36800000
CD1MEAS  EQU   X'04' .             MEASUREMENT SERVICES IND             37200000
         SPACE                                                          37600000
CD1STM   EQU   X'01' .               START MEASUREMENT                  38000000
CD1SPM   EQU   X'02' .               STOP MEASUREMENT                   38400000
CD1RMD   EQU   X'80' .               RECORD MEASUREMENT DATA            38800000
         SPACE                                                          39200000
*                                                                       39600000
*        SESSION SERVICES FID1 COMMANDS                                 40000000
*                                                                       40400000
CD1SESS  EQU   X'06' .             SESSION SERVICES IND                 40800000
         SPACE                                                          41200000
CD1CINIT EQU   X'01' .               CONTROL INITIATE                   41600000
CD1CTERM EQU   X'02' .               CONTROL TERMINATE                  42000000
CD1NSPRO EQU   X'04' .               NS PROC ERROR                      42400000
CD1INITS EQU   X'81' .               INITIATE SELF                      42800000
CD1INITO EQU   X'81' .               INITIATE OTHER                     43200000
CD1TERMO EQU   X'82' .               TERMINATE OTHER                    43600000
CD1TERMS EQU   X'83' .               TERMINATE SELF                     44000000
CD1BINDF EQU   X'85' .               BIND FAILURE                       44400000
CD1SESST EQU   X'86' .               SESSION STARTED                    44800000
CD1UBNDF EQU   X'87' .               UNBIND FAILURE                     45200000
CD1SESEN EQU   X'88' .               SESSION ENDED                      45600000
         MEND                                                           46000000
*        */                                                             46400000
*%CMD1PLS:;                                                             46800000
*/*                                                                  */ 47200000
*/*      DFC FID1 COMMANDS                                           */ 47600000
*/*                                                                  */ 48000000
* DCL CD1PREPS BIT(8) CONSTANT('02'X);  /* PREPARE SWITCH            */ 48400000
* DCL CD1SWCOM BIT(8) CONSTANT('03'X);  /* SWITCH COMPLETE           */ 48800000
* DCL CD1LSTAT BIT(8) CONSTANT('04'X);  /* LUSTAT                    */ 49200000
* DCL CD1RTR   BIT(8) CONSTANT('05'X);  /* READY TO RECEIVE          */ 49600000
* DCL CD1ANS   BIT(8) CONSTANT('06'X);  /* AUTO NETWORK SHUTDOWN     */ 50000000
* DCL CD1ANSC  BIT(8) CONSTANT('07'X);  /*  ANS COMPLETE             */ 50400000
* DCL CD1ACTLU BIT(8) CONSTANT('0D'X);  /* ACTIVATE LU               */ 50800000
* DCL CD1DATLU BIT(8) CONSTANT('0E'X);  /* DEACTIVATE LU             */ 51200000
* DCL CD1ACTPU BIT(8) CONSTANT('11'X);  /* ACTIVATE PU               */ 51600000
* DCL CD1DATPU BIT(8) CONSTANT('12'X);  /* DEACTIVATE PU             */ 52000000
* DCL CD1BIND  BIT(8) CONSTANT('31'X);  /* BIND                      */ 52400000
* DCL CD1UBIND BIT(8) CONSTANT('32'X);  /* UNBIND                    */ 52800000
* DCL CD1INITC BIT(8) CONSTANT('50'X);  /* INIT COMPLETE             */ 53200000
* DCL CD1QEC   BIT(8) CONSTANT('80'X);  /* QUIESCE AT END OF CHAIN   */ 53600000
* DCL CD1QC    BIT(8) CONSTANT('81'X);  /* QUIESCE COMPLETE          */ 54000000
* DCL CD1RELQ  BIT(8) CONSTANT('82'X);  /* RELEASE QUIESCE           */ 54400000
* DCL CD1CANCL BIT(8) CONSTANT('83'X);  /* CANCEL                    */ 54800000
* DCL CD1CHASE BIT(8) CONSTANT('84'X);  /* CHASE                     */ 55200000
* DCL CD1SDT   BIT(8) CONSTANT('A0'X);  /* START DATA TRAFFIC        */ 55600000
* DCL CD1CLEAR BIT(8) CONSTANT('A1'X);  /* CLEAR                     */ 56000000
* DCL CD1STSN  BIT(8) CONSTANT('A2'X);  /* SET AND TEST SEQ NUMBERS  */ 56400000
* DCL CD1RQR   BIT(8) CONSTANT('A3'X);  /* REQUEST RECEIVED          */ 56800000
* DCL CD1SHUTD BIT(8) CONSTANT('C0'X);  /* SHUTDOWN                  */ 57200000
* DCL CD1SHUTC BIT(8) CONSTANT('C1'X);  /* SHUTDOWN COMPLETE         */ 57600000
* DCL CD1RSHUT BIT(8) CONSTANT('C2'X);  /* REQUEST SHUTDOWN          */ 58000000
* DCL CD1BID  BIT(8) CONSTANT('C8'X);   /* BID                       */ 58400000
* DCL CD1SIG   BIT(8) CONSTANT('C9'X);  /* SIGNAL                    */ 58800000
         @EJECT;                                                        59200000
*/*                                                                  */ 59600000
*/*                                                                  */ 60000000
*/*      NETWORK SERVICES FID1 COMMANDS                              */ 60400000
*/*                                                                  */ 60800000
*/*                                                                  */ 61200000
* DCL CD1NETS  BIT(8) CONSTANT('01'X);  /* NETWORK SERV IND          */ 61600000
         @SPACE;                                                        62000000
*/*                                                                  */ 62400000
*/*      CONFIGURATION SERVICES FID1 COMMANDS                        */ 62800000
*/*                                                                  */ 63200000
* DCL CD1CONFS BIT(8) CONSTANT('02'X);  /* CONFIGURATION SERV IND    */ 63600000
         @SPACE;                                                        64000000
* DCL CD1CONT  BIT(8) CONSTANT('01'X);  /*   CONTACT                 */ 64400000
* DCL CD1DCONT BIT(8) CONSTANT('02'X);  /*   DISCONTACT              */ 64800000
* DCL CD1IPLI  BIT(8) CONSTANT('03'X);  /*   IPL INITIAL             */ 65200000
* DCL CD1IPLT  BIT(8) CONSTANT('04'X);  /*   IPL TEXT                */ 65600000
* DCL CD1IPLF  BIT(8) CONSTANT('05'X);  /*   IPL FINAL               */ 66000000
* DCL CD1DMPI  BIT(8) CONSTANT('06'X);  /*   DUMP INITIAL            */ 66400000
* DCL CD1DMPT  BIT(8) CONSTANT('07'X);  /*   DUMP TEXT               */ 66800000
* DCL CD1DMPF  BIT(8) CONSTANT('08'X);  /*   DUMP FINAL              */ 67200000
* DCL CD1RPO   BIT(8) CONSTANT('09'X);  /*   REMOTE POWER OFF        */ 67600000
* DCL CD1ACTLK BIT(8) CONSTANT('0A'X);  /*   ACTIVATE LINK           */ 68000000
* DCL CD1DACLK BIT(8) CONSTANT('0B'X);  /*   DEACTIVATE LINK         */ 68400000
* DCL CD1CESLW BIT(8) CONSTANT('0C'X);  /*   CONTROL ENTER SLOWDOWN  */ 68800000
* DCL CD1CXSLW BIT(8) CONSTANT('0D'X);  /*   CONTROL EXIT SLOWDOWN   */ 69200000
* DCL CD1CONNO BIT(8) CONSTANT('0E'X);  /*   CONNECT OUT             */ 69600000
* DCL CD1ABC   BIT(8) CONSTANT('0F'X);  /*   ABANDON CONNECTION      */ 70000000
* DCL CD1SETV  BIT(8) CONSTANT('11'X);  /*   SET CONTROL VECTOR      */ 70400000
* DCL CD1SENV  BIT(8) CONSTANT('12'X);  /*   SENSE CONTROL VECTOR    */ 70800000
* DCL CD1ESLOW BIT(8) CONSTANT('14'X);  /*   ENTERING SLOWDOWN       */ 71200000
* DCL CD1EXSLW BIT(8) CONSTANT('15'X);  /*   EXITING SLOWDOWN        */ 71600000
* DCL CD1ACI   BIT(8) CONSTANT('16'X);  /*   ACTIVATE CONNECT IN     */ 72000000
* DCL CD1DCI   BIT(8) CONSTANT('17'X);  /*   DEACTIVATE CONNECT IN   */ 72400000
* DCL CD1ACO   BIT(8) CONSTANT('18'X);  /*   ABANDON CONNECT OUT     */ 72800000
* DCL CD1ANA   BIT(8) CONSTANT('19'X);  /*   ASSIGN NETWORK ADDR     */ 73200000
* DCL CD1FNA   BIT(8) CONSTANT('1A'X);  /*   FREE NETWORK ADDR       */ 73600000
* DCL CD1REQD  BIT(8) CONSTANT('1B'X);  /*   REQUEST DISCONTACT      */ 74000000
* DCL CD1CONCT BIT(8) CONSTANT('80'X);  /*   CONTACTED               */ 74400000
* DCL CD1INOP  BIT(8) CONSTANT('81'X);  /*   INOPERATIVE             */ 74800000
* DCL CD1REQC  BIT(8) CONSTANT('84'X);  /*   REQUEST CONTACT         */ 75200000
         @SPACE;                                                        75600000
*/*                                                                  */ 76000000
*/*      MAINTENANCE SERVICES FID1 COMMANDS                          */ 76400000
*/*                                                                  */ 76800000
* DCL CD1MAINT BIT(8) CONSTANT('03'X);  /* MAINTENANCE SERV IND      */ 77200000
         @SPACE;                                                        77600000
* DCL CD1EX    BIT(8) CONSTANT('01'X);  /*   EXECUTE TEST            */ 78000000
* DCL CD1ACTTR BIT(8) CONSTANT('02'X);  /*   ACTIVATE TRACE          */ 78400000
* DCL CD1DACTR BIT(8) CONSTANT('03'X);  /*   DEACTIVATE TRACE        */ 78800000
* DCL CD1RTP   BIT(8) CONSTANT('80'X);  /*   REQUEST TEST PROCEDURE  */ 79200000
* DCL CD1RMS   BIT(8) CONSTANT('81'X);  /*   RECORD MAINT STATISTICS */ 79600000
* DCL CD1RTTD  BIT(8) CONSTANT('82'X);  /*   RECORD TEST DATA        */ 80000000
* DCL CD1RTRD  BIT(8) CONSTANT('83'X);  /*   RECORD TRACE DATA       */ 80400000
         @SPACE;                                                        80800000
*/*                                                                  */ 81200000
*/*      MEASUREMENT SERVICES FID1 COMMANDS                          */ 81600000
*/*                                                                  */ 82000000
* DCL CD1MEAS  BIT(8) CONSTANT('04'X);  /*   MEASUREMENT SERV IND    */ 82400000
         @SPACE;                                                        82800000
* DCL CD1STM   BIT(8) CONSTANT('01'X);  /*   START MEASUREMENT       */ 83200000
* DCL CD1STP   BIT(8) CONSTANT('02'X);  /*   STOP MEASUREMENT        */ 83600000
* DCL CD1RMD   BIT(8) CONSTANT('80'X);  /*   RECORD MEASUREMENT DATA */ 84000000
         @SPACE;                                                        84400000
*/*                                                                  */ 84800000
*/*      SESSION SERVICES FID1 COMMANDS                              */ 85200000
* DCL CD1SESS  BIT(8) CONSTANT('06'X);  /* SESSION SERV IND          */ 85600000
         @SPACE;                                                        86000000
* DCL CD1CINIT BIT(8) CONSTANT('01'X);  /*   CONTROL INITIATE        */ 86400000
* DCL CD1CTERM BIT(8) CONSTANT('02'X);  /*   CONTROL TERMINATE       */ 86800000
* DCL CD1NSPRO BIT(8) CONSTANT('04'X);  /*   NS PROC ERROR           */ 87200000
* DCL CD1INITS BIT(8) CONSTANT('81'X);  /*   INITIATE SELF           */ 87600000
* DCL CD1INITO BIT(8) CONSTANT('81'X);  /*   INITIATE OTHER          */ 88000000
* DCL CD1TERMO BIT(8) CONSTANT('82'X);  /*   TERMINATE OTHER         */ 88400000
* DCL CD1TERMS BIT(8) CONSTANT('83'X);  /*   TERMINATE SELF          */ 88800000
* DCL CD1BINDF BIT(8) CONSTANT('85'X);  /*   BIND FAILURE            */ 89200000
* DCL CD1SESST BIT(8) CONSTANT('86'X);  /*   SESSION STARTED         */ 89600000
* DCL CD1UBNDF BIT(8) CONSTANT('87'X);  /*   UNBIND FAILURE          */ 90000000
* DCL CD1SESEN BIT(8) CONSTANT('88'X);  /*   SESSION ENDED           */ 90400000
./  ADD  SSI=63280124,NAME=TCNRD
*        %GOTO PLSCNR;                  /* BILINGUAL HEADER             02000010
         MACRO                                                          04000010
         TCNRD                                                          06000010
.*A000000,999999                                               @Y17XAXF 08000010
*                                                                       10000010
*        ASSEMBLER VERSION NOT SUPPORTED                                12000010
*                                                                       14000010
         MEND  */                                                       16000010
*%PLSCNR:;                                                              18000010
*/*                                                                  */ 20000010
*/*      3705 CHECKPOINT RESOURCE RECORD                             */ 22000010
*/*                                                                  */ 24000010
*DCL 1 IEDQCNRD BASED(RCKPREC),         /*3705 CHECKPOINT RESOURCE      26000010
*                                         RECORD                     */ 28000010
*      2 CNRTNTOF FIXED(15),            /*TNT OFFSET OF THE RESOURCE */ 30000010
*      2 CNRDATTM CHAR(8),              /*DATE AND TIME OF CKPT      */ 32000010
*        3 CNRDATE CHAR(4),             /*DATE OF CKPT               */ 34000010
*        3 CNRTIME CHAR(4),             /*TIME OF CKPT               */ 36000010
*      2 CNRCNTL  BIT(16),              /*CONTROL FLAGS              */ 38000010
*        3 CNRFBHS BIT(1),              /*ACT/DEACT BHSET ISSUED     */ 40000010
*                                       /*                   @YM07411*/ 40500010
*        3 CNRFBHSC BIT(1),             /*CHANGE BHSET ISSUED        */ 41000010
*                                       /*                   @YM07411*/ 41500010
*        3 CNRFSSP BIT(1),              /*SERVICE SEEKING PAUSE         42000010
*                                         ISSUED                     */ 44000010
*        3 CNRFNPL BIT(1),              /*NEGATIVE POLL LIMIT ISSUED */ 46000010
*        3 CNRFCSL BIT(1),              /*CHANGE SESSION LIMIT ISSUED*/ 48000010
*        3 CNRFCTL BIT(1),              /*CHANGE TRANSMISSION LIMIT     50000010
*                                         ISSUED                     */ 52000010
*        3 CNRFMSS BIT(1),              /*MODEM SPEED SELECT ISSUED  */ 54000010
*        3 CNRFRDR BIT(1),              /*REPLACE DEVICE RECORD         56000010
*                                         ISSUED                     */ 58000010
*        3 *       BIT(8),              /*RESERVED                   */ 60000010
*      2 CNRBHSET CHAR(2),              /*BHSET DATA                 */ 62000010
*        3 CNRBHFUN CHAR(1),            /*BHSET FUNCTION             */ 64000010
*          4 CNRBHFN0 BIT(1),           /*FLAG FOR FUNCTION TYPE        64600010
*                                         0-ACT/DACT,1-CHANGE        */ 65200010
*          4 *        BIT(7),           /*RESERVED                   */ 66000010
*        3 CNRBHPOS CHAR(1),            /*BHSET POSITION             */ 67000010
*      2 CNRSSPAU CHAR(1),              /*SERVICE SEEKING PAUSE DATA */ 68000010
*      2 CNRNEGPL CHAR(1),              /*NEGATIVE POLL LIMIT DATA   */ 70000010
*      2 CNRCSLIM CHAR(1),              /*CHANGE SESSION LIMIT DATA  */ 72000010
*      2 CNRCTLIM CHAR(1),              /*CHANGE TRANSMISSION LIMIT     74000010
*                                         DATA                       */ 76000010
*      2 CNRMSSEL CHAR(1),              /*MODEM SPEED SELECT DATA    */ 78000010
*      2 CNRDEVRC CHAR(*);              /*DEVICE RECORD              */ 80000010
./  ADD  SSI=70060527,NAME=TCOMD
*        %GOTO COMPLS;                  /* BILINGUAL HEADER             02000010
         MACRO                                                          04000010
         TCOMD                                                          06000010
.*A000000,999999                                               @Y17XAXF 08000010
IEDCOM   DSECT                                                          10000010
*                                                                       12000010
*        DSECT FOR COMMON IPL/DMP WKAREA (IGCMH10D,MI,MP,MD,ME,MF,MG)   14000010
*                                                                       16000010
COMKEY   DS    XL1 .                    KEY FIELD                       18000010
COMQCB   DS    AL3 .                    QCB ADDRESS                     20000010
COMPRI   DS    XL1 .                    PRIORITY FIELD                  22000010
COMLINK  DS    AL3 .                    LINK FIELD                      24000010
COMOPCE  DS    A .                      OPCE POINTER                    26000010
COMFLAGS DS    XL1 .                    FLAG FIELD                      28000010
COMDLCN4 EQU   X'02' .                   DLC RETURN TO N4               30000010
COMDLCMP EQU   X'12' .                   DLC RETURN TO MP               32000010
COMDLCMF EQU   X'14' .                   DLC RETURN TO MF               34000010
         DS    AL3 .                    RESERVED                        36000010
COMTTRZ  DS    A .                      TTR SAVE AREA          @YM04692 38000010
         MEND                                                           40000010
*        */                                                             42000010
*%COMPLS:;                                                              44000010
*DECLARE                                                                46000010
*  1 IEDCOM BASED BDY(WORD),                                            48000010
*/*                                                                  */ 50000010
*/*      DSECT FOR COMMON IPL/DMP WKAREA (IGCMH10D,MI,MP,MD,ME,MF,MG)*/ 52000010
*/*                                                                  */ 54000010
*   2 COMKEY   PTR(8),                  /* KEY FIELD                 */ 56000010
*   2 COMQCB   PTR(24),                 /* QCB ADDRESS               */ 58000010
*   2 COMPRI   PTR(8),                  /* PRIORITY FIELD            */ 60000010
*   2 COMLINK  PTR(24),                 /* LINK FIELD                */ 62000010
*   2 COMOPCE  PTR(31),                 /* OPCE POINTER              */ 64000010
*   2 COMFLAGS BIT(8),                  /* FLAG FIELD                */ 66000010
*   2 *        PTR(24),                 /* RESERVED                  */ 68000010
*   2 COMTTRZ  PTR(31),                 /* TTR SAVE AREA     @YM04692*/ 70000010
./  ADD  SSI=61050115,NAME=TCOMDMPD
*        %GOTO COMDPLS;                 /* BILINGUAL HEADER             03000010
         MACRO                                                          06000010
         TCOMDMPD                                                       09000010
.*A000000.999999                                               @Y17XAXF 12000010
*                                                                       15000010
*        COMMON DUMP WORKAREA (IGCMP10D)                                18000010
*                                                                       21000010
COMINBF1 DS    512C .                   INPUT BUFFER1                   24000010
COMINBF2 DS    512C .                   INPUT BUFFER2                   27000010
         DS    F .                      RESERVED                        30000010
COMNEXT  DS    A .                      NEXT DATA TO XFER               33000010
COMNEXT1 DS    A .                      INITIAL AREA                    36000010
COMDECB  DS    20C .                    DECB FOR WRITES                 39000010
COMLEN   EQU   *-IEDCOM .               COMMON WKAREA LENGTH            42000010
         MEND                                                           45000010
*        */                                                             48000010
*%COMDPLS:;                                                             51000010
*/*                                                                  */ 54000010
*/*      COMMON DUMP WKAREA (IGCMP10D)                               */ 57000010
*/*                                                                  */ 60000010
*   2 COMINBF1 CHAR(512),               /* INPUT BUFFER1             */ 63000010
*   2 COMINBF2 CHAR(512),               /* INPUT BUFFER2             */ 66000010
*   2 *        PTR(31),                 /* RESERVED                  */ 69000010
*   2 COMNEXT  PTR(31),                 /* NEXT DATA TO XFER         */ 72000010
*   2 COMNEXT1 PTR(31),                 /* INITIAL AREA              */ 75000010
*   2 COMDECB  CHAR(20);                /* DECB FOR WRITES           */ 78000010
*%COMLEN='LENGTH(IEDCOM)';              /* COMMON WKAREA LENGTH      */ 81000010
*/* COMFLAGS VALUES                                                  */ 84000010
*DCL COMDLCN4 BIT(8) CONSTANT('02'X);   /* DLC RETURN TO N4          */ 87000010
*DCL COMDLCMP BIT(8) CONSTANT('12'X);   /* DLC RETURN TO MP          */ 90000010
*DCL COMDLCMF BIT(8) CONSTANT('14'X);   /* DLC RETURN TO MF          */ 93000010
./  ADD  SSI=91240389,NAME=TCONV
         MACRO                                                          00700000
&NAME  TCONV   &MF=,&TYPE=EH,&FROM=,&TO=,&COUNT=,&MAP=NO,&LSTNAME=,    X01400000
               &RET=                                                    02100000
.*                                                                      02800000
         GBLB  &EXECUTV,&E536454                                        03500000
         GBLB  &RCC .        SET TO 1 IF INTLZE WILL SUPPORT RCC        04200000
         LCLA  &FLAG,&ERROR,&KOUNT                                      04900000
         LCLB  &RCC1                                                    05600000
         LCLC  &F,&SIZE,&CHAR,&Z                                        06300000
.*                                                                      07000000
         AIF   ('&MAP' EQ 'YES').MAP1                                   07700000
         AIF   (T'&MF EQ 'O').STD                                       08400000
         AIF   ('&MF' EQ 'L' OR '&MF' EQ 'S').STD                       09100000
         AIF   ('&MF'(1,3) NE '(E,').MFERROR                            09800000
&CHAR    SETC  '&NAME'                                                  10500000
         AIF   ('&MF'(4,3) EQ '(1)').RG1                                11200000
         AIF   ('&MF'(4,1) EQ '(').RG2                                  11900000
&CHAR    LA    R1,&MF(2) .         ADDRESS OF PARAMETER LIST            12600000
&CHAR    SETC  ' '                                                      13300000
         AGO   .RG1                                                     14000000
.RG2     ANOP                                                           14700000
&KOUNT   SETA  K'&MF(2)-2                                               15400000
&F       SETC  '&MF(2)'(2,&KOUNT)                                       16100000
         AIF   ('&F'(1,1) EQ 'R').C724                                  16800000
&CHAR    LR    R1,R&F .            ADDRESS OF PARAMETER LIST            17500000
&CHAR    SETC  ' '                                                      18200000
         AGO   .RG1                                                     18900000
.C724    ANOP                                                           19600000
&CHAR    LR    R1,&F .             ADDRESS OF PARAMETER LIST            20300000
&CHAR    SETC  ' '                                                      21000000
.RG1     ANOP                                                           21700000
.RCC2    ANOP                                                           22400000
         AIF   ('&RCC' EQ '0').RCCA                                     23100000
         AIF   (T'&RET EQ 'O').RCCD                                     23800000
         AIF   ('&RET'(1,1) EQ '#').RCCB                                24500000
         AIF   ('&RET'(1,1) EQ '(').RCCC                                25200000
         MVC   $RETMASK,&RET .     SET RETURN CODE MASK                 25900000
         AGO   .RCCD                                                    26600000
.RCCE    ANOP                                                           27300000
         MVI   $RETMASK,#ALL-#RC0 . SET RETURN CODE MASK                28000000
         AGO   .RCCD                                                    28700000
.RCCB    ANOP                                                           29400000
         MVI   $RETMASK,#ALL-&RET . SET RETURN CODE MASK                30100000
         AGO   .RCCD                                                    30800000
.RCCC    ANOP                                                           31500000
         MVI   $RETMASK,#ALL-&RET(1) . SET RETURN CODE MASK             32200000
         AGO   .RCCD                                                    32900000
.RCCA    ANOP                                                           33600000
         AIF   (T'&RET EQ 'O').RCCD                                     34300000
         MNOTE 5,'RETURN CODE NOT SUPPORTED BY -INTLZE-'                35000000
.RCCD    ANOP                                                           35700000
         AIF   (&RCC1).RCC3                                             36400000
&CHAR    BAL   R14,#EXIT .         BRANCH TO LINKAGE SUBROUTINE         37100000
         MEXIT                                                          37800000
.MFERROR MNOTE 8,'MF VALUE (&MF) INCORRECT, NO STATEMENTS GENERATED.'   38500000
         MEXIT                                                          39200000
.STD     ANOP                                                           39900000
         AIF   (T'&FROM NE 'O').TEST3                                   40600000
&ERROR   SETA  1                                                        41300000
         MNOTE 8,'FROM ADDRESS MISSING.'                                42000000
.TEST3   AIF   (T'&TO NE 'O').TEST4                                     42700000
&ERROR   SETA  1                                                        43400000
         MNOTE 8,'TO ADDRESS MISSING.'                                  44100000
.TEST4   AIF   (T'&COUNT NE 'O').BEGIN                                  44800000
&ERROR   SETA  1                                                        45500000
         MNOTE 8,'COUNT MISSING.'                                       46200000
.BEGIN   ANOP                                                           46900000
         AIF   (&ERROR EQ 1).EXIT                                       47600000
         AIF   ('&TYPE' NE 'HE').CNVRT2                                 48300000
&FLAG    SETA  X'8000'                                                  49000000
.CNVRT2  ANOP                                                           49700000
         AIF   ('&MF' EQ 'L').LIST                                      50400000
&NAME    LA    R14,&FROM(1) . GET ADDR OF DATA                          51100000
         AIF   (N'&FROM EQ 1).CNVRT4                                    51800000
.TEST5   AIF   (&FROM(2) GE 2 OR &FROM(2) LE 14).CNVRT3                 52500000
&ERROR   SETA  1                                                        53200000
         MNOTE 8,'INVALID REG SPEC FOR FROM.'                           53900000
.CNVRT3  ANOP                                                           54600000
         AIF   (&ERROR EQ 1).EXIT                                       55300000
         AR    R14,&FROM(2) . INCREMENT ADDRESS                         56000000
.CNVRT4  ANOP                                                           56700000
         ST    R14,QWIE&SYSNDX . PLACE ADDR IN PARAMETER LIST           57400000
         LA    R14,&TO . GET OUTPUT DATA ADDR                           58100000
         ST    R14,QWIU&SYSNDX . OUTPUT DATA STORE                      58800000
         LA    R14,R&SYSNDX .     RETURN ADDRESS                        59500000
&RCC1    SETB  1                                                        60200000
         AGO   .RCC2                                                    60900000
.RCC3    ANOP                                                           61600000
         CNOP  0,4                                                      62300000
         BAL   R1,#EXIT .          BRANCH TO LINKAGE SUBROUTINE         63000000
&CHAR    SETC  '&LSTNAME'                                               63700000
         AGO   .STD1                                                    64400000
.LIST    ANOP                                                           65100000
&CHAR    SETC  '&NAME'                                                  65800000
         CNOP  0,4                                                      66500000
.STD1    ANOP                                                           67200000
         AIF   (&EXECUTV).OLTSEP                                        67900000
&CHAR    DC    B'00000000' .       CONTROL PROGRAM FLAGS                68600000
         AGO   .OLTSEP1                                                 69300000
.OLTSEP  ANOP                                                           70000000
&CHAR    DC    B'00000001' .       CONTROL PROGRAM FLAGS                70700000
.OLTSEP1 ANOP                                                           71400000
         DC    AL1(2) .            MACRO LEVEL                          72100000
         DC    CL2'41' .           MACRO ID                             72800000
QWIE&SYSNDX  DC  XL4'00000000' . ADDRESS OF DATA                        73500000
QWIU&SYSNDX  DC  XL4'00000000' .  OUTPUT DATA                           74200000
C&SYSNDX DC    AL2(&COUNT+&FLAG) . COUNT AND TYPE INFORMATION           74900000
**                                BIT 0 SET TO 1 INDICATES 'HE' TYPE.   75600000
         AIF   ('&MF' EQ 'L').EXIT                                      76300000
R&SYSNDX DS    0H .               RETURN ON HALFWORD BOUNDARY           77000000
         MEXIT                                                          77700000
.MAP1    ANOP                                                           78400000
CONVMAP  DSECT                                                          79100000
&Z       SETC  '$'                                                      79800000
         AIF   (&E536454).ZIPPER                                        80500000
           DC  XL1'0' .            CONTROL PROGRAM FLAGS                81200000
           DC  XL1'0' .            MACRO LEVEL                          81900000
           DC  XL2'0' .            MACRO ID                             82600000
         AGO   .ZIPPED                                                  83300000
.ZIPPER  ANOP                                                           84000000
&Z.CNVTRMG DC  XL1'0' .            CONTROL PROGRAM FLAGS                84700000
&Z.CNVLEVL DC  XL1'0' .            MACRO LEVEL                          85400000
&Z.CNVIDNT DC  XL2'0' .            MACRO ID                             86100000
.ZIPPED  ANOP                                                           86800000
&Z.CNVFROM DC  A(0) .              FROM ADDRESS                         87500000
&Z.CNVTO   DC  A(0) .              TO   ADDRESS                         88200000
&Z.CNVCT   DC  XL2'0' .            TYPE & COUNT                         88900000
.EXIT    MEND                                                           89600000
./  ADD  SSI=71080522,NAME=TDEBAPD
         MACRO                                                          02000020
         TDEBAPD                                                        04000020
IEDQDEB  DSECT                          DATA EXTENT BLOCK FOR           06000020
*                                       TCAM APPLICATION PROGRAMS       08000020
*                                                                       10000020
*                                                                       12000020
*                                                                       14000020
*                                                                     * 16000020
*                                                                     * 18000020
DEBTAMID DS    FL1                      TAM DEB IDENTIFIER              20000020
DEBTCBAD DS    3X                       ADDRESS OF TCB FOR THIS DEB     22000020
         DS    FL1                      RESERVED                        24000020
DEBDEBAD  DS    3X                       ADDRESS OF NEXT DEB            26000020
*                                       IN SAME TASK                    28000020
         DS    FL1                      RESERVED                        30000020
DEBPCBAD DS    3X                       ADDRESS OF PROCESS CONTROL      32000020
*                                       BLOCK FOR THIS TASK             34000020
         DS    4X                       RESERVED                        35000010
DEBTAMPP DS    X                        POST-PENDING FLAG BYTE          44000020
DEBPEBAD DS    AL3                      ADDRESS OF PROCESS       Y02027 45000010
*                                       EXTENSION BLOCK          Y02027 46000010
         DS    FL1                      RESERVED                        48000020
DEBPEWA  DS    AL3                      ADDRESS OF THE PROCESS   Y02027 49000010
*                                       ENTRY WORKAREA           Y02027 50000010
         DS    FL1                      RESERVED                        54000020
DEBDCBAD DS    3X                       ADDRESS OF THIS DEB'S DCB       56000020
         DS    FL1                      RESERVED                        58000020
DEBLCMWA DS    3X                       ADDRESS OF LOCATE MODE          60000020
*                                       WORKAREA                        62000020
DEBTAMOS DS    H                        TERMNAME TABLE OFFSET OF        62400010
*                                       CORRESPONDING PROCESS ENTRY     62800010
DEBSOWA  DS    H                        SIZE OF LOCATE MODE             63200010
*                                       WORKAREA                        63600010
DEBEND   EQU   *                                                        64000020
DEBSIZE  EQU   DEBEND-IEDQDEB                                           66000020
         MEND                                                           68000020
./  ADD  SSI=60241337,NAME=TDRQD
         MACRO                                                          01000022
         TDRQD                                                          02000022
* TDRQD MACRO UPDATED 7/2/71                                            03000022
IEDQDRQ  DSECT                                                          04000022
*                                                                       05000022
*              THIS IS A DSECT OF THE CONCENTRATOR DATA READY QUEUE.    06000022
*                                                                       07000022
DRQFLAG1 DS    XL1 .                    DRQ FLAG BYTE                   08000022
*                                       BITS 0,1,2 & 3 MUST BE 0        09000022
*                        BIT DEFINITIONS                                10000022
DRQDRQQ  EQU   X'04' .                  FLAG INDICATING A DRQ           11000022
DRQFQCB  EQU   X'02' .                  FLAG INDICATING A QCB           12000022
DRQHELD  EQU   X'01' .                  STOP SENDING - REUSE            13000022
*                                                                       14000022
DRQELCHN DS    AL3 .                    ELEMENT CHAIN                   15000022
DRQPRI   DS    CL1 .                    PRIORITY                        16000022
DRQLINK  DS    AL3 .                    DRQ LINK FIELD                  17000022
DRQSTVTO DS    XL1 .                    INDEX TO ENTRY IN SUBTASK       18000022
*                                       VECTOR TABLE                    19000022
*                        BIT DEFINITIONS                                20000022
DRQCSVTO EQU   X'20' .                  DRQ VTO                         21000022
*                                                                       22000022
DRQSTCHN DS    AL3 .                    STCB CHAIN                      23000022
DRQSTPRI DS    CL1 .                    PRIORITY OF THE STCB            24000022
DRQSLINK DS    AL3 .                    POINTER TO NEXT STCB IN CHAIN   25000022
DRQBUFCT DS    FL1 .                    TOTAL BUFFER COUNT              26000022
DRQERBCT DS    FL1 .                    ERB BUFFER COUNT                27000022
DRQTDO   DS    XL1 .                    TIME DELAY QUEUE OFFSET         28000022
DRQSTAT  DS    XL1 .                    STATUS OF THIS QCB              29000022
*                        BIT DEFINITIONS                                30000022
DRQEOM   EQU   X'80' .                  END OF MSG SENT                 31000022
DRQTRMHO EQU   X'40' .                  TERMINAL WAS HELD               32000022
DRQBUFRD EQU   X'20' .                  BUFFERED TERMINAL               33000022
DRQSEND  EQU   X'10' .                  SENDING TO BUFFERED TERM        34000022
DRQRECEV EQU   X'08' .                  RECEIVING FROM BUFFERED TERM    35000022
DRQSCHDL EQU   X'04' .                  PUT IN DELAY Q WHEN INACTIVE    36000022
DRQCLOCK EQU   X'02' .                  ON=CLOCK, OFF=INTERVAL          37000022
DRQTIME  EQU   X'01' .                  DELAY GREATER THEN 12 HOURS     38000022
*                                                                       39000022
DRQSCBOF DS    FL1 .                    X'00' - OFFSET TO PROPER SCB    40000022
DRQCURQ  DS    AL3 .                    POINTER TO CURRENT QCB          41000022
DRQFLAG3 DS    XL1 .                    DRQ FLAG BYTE                   42000022
*                        BIT DEFINITIONS                                43000022
DRQFSPCI EQU   X'80' .                  FIRST PCI FOR CONC MSG          44000022
DRQERBAV EQU   X'40' .                  INDICATES ENABLED CODE          45000022
*                                       REQUESTED ERB                   46000022
*                                                                       47000022
DRQRESV  DS    XL1 .                    RESERVED                        48000022
DRQCTBCT DS    FL1 .                    CTB COUNT                       49000022
DRQCTBMX DS    FL1 .                    MAX CTBS PER CONC MSG           50000022
DRQPRLVL DS    XL1 .                    HIGHEST PRIORITY LEVEL MSG      51000022
DRQPRVLK DS    0AL3 .                   POINTER TO THE LINK FIELD       52000022
DRQTDLNK DS    AL3 .                    LINK FIELD FOR TIME DELAY Q     53000022
DRQRELLN DS    FL1 .                    RELATIVE LINE NO                54000022
DRQDCBAD DS    AL3 .                    DCB ADDRESS                     55000022
DRQFLAG2 DS    XL1 .                    DRQ STATUS BITS                 56000022
*                        BIT DEFINITIONS                                57000022
DRQTSSES EQU   X'80' .                  TSO SESSION IN PROGRESS         58000022
DRQRSRV  EQU   X'10' .                  REUSE SERVICED BIT              59000022
DRQTERMQ EQU   X'08' .                  QUEUING BY TERMINAL             60000022
DRQSDFFO EQU   X'04' .                  CURRENTLY SENDING FEFO MSG      61000022
DRQPROC  EQU   X'02' .                  THIS QCB FOR A PROCESS ENTRY    62000022
DRQCKPT  EQU   X'01' .                  FLAG FOR CHECKPOINT             63000022
*                                                                       64000022
DRQQBACK DS    AL3 .                    QBACK CHAIN POINTER             65000022
*                                                                       66000022
*         *******************************************************       67000022
*     0   *   FLAG1   **                 ELCHN                  *       68000022
*         *******************************************************       69000022
*     4   *   PRI     **                 LINK                   *       70000022
*         *******************************************************       71000022
*     8   *   STVTO   **                 STCHN                  *       72000022
*         *******************************************************       73000022
*    12   *   STPRI   **                 SLINK                  *       74000022
*         *******************************************************       75000022
*    16   *   BUFCT   **   ERBCT    **   TD/      **   STAT     *       76000022
*         *******************************************************       77000022
*    20   *   SCBOF   **                 CURQ                   *       78000022
*         *******************************************************       79000022
*    24   *   FLAG3   **   RESV     **   CTBCT    **   CTBMX    *       80000022
*         *******************************************************       81000022
*    28   *   PRLVL   **                 TDLNK/PRVLK            *       82000022
*         *******************************************************       83000022
*    32   *   RELLN   **                 DCBAD                  *       84000022
*         *******************************************************       85000022
*    36   *   FLAG2   **                 QBACK                  *       86000022
*         *******************************************************       87000022
         MEND                                                           88000022
./  ADD  SSI=62530878,NAME=TDSID
*        %GOTO PLSDSI;                  /*                              02000010
         MACRO                                                          04000010
         TDSID                                                          06000010
.*A000000-999999                                               @Y17XAFF 08000010
*        NO ASSEMBLE VERSION OF THIS DSECT                              10000010
         MEND  */                                                       12000010
*%PLSDSI:;                                                              14000010
*/*                                                                  */ 16000010
*/*      COPY/REPLACE DEVICE SESSION INFORMATION                     */ 18000010
*/*                                                                  */ 20000010
* DECLARE                                                               22000010
* 1 IEDDSI1 BASED(RDSI1),               /*FIRST FIELD GROUP          */ 24000010
*  2 DSITOTNM FIXED(8),                 /* TOTAL NUM OF BYTES IN REC */ 26000010
*  2 DSINETAD FIXED(16) BDY(BYTE),      /* NET ADDR OF DEVICE        */ 28000010
*  2 DSIPOLL,                           /* POLLING CHARS FIELD       */ 30000010
*   3 DSIPOLNM FIXED(8),                /*  NUMBER OF POLLING CHARS  */ 32000010
*   3 DSIPOLCH CHAR(0);                 /*  POLLING CHARACTERS       */ 34000010
*                                                                       36000010
*                                                                       38000010
* DECLARE                                                               40000010
* 1 IEDDSI2 BASED(RDSI2),               /*SECOND FIELD GROUP         */ 42000010
*  2 DSIADRNM FIXED(8),                 /* NUMBER OF ADDRESSING CHAR */ 44000010
*  2 DSIADDR  CHAR(0);                  /* ADDRESSING CHARACTERS     */ 46000010
*                                                                       48000010
*                                                                       50000010
* DECLARE                                                               52000010
* 1 IEDDSI3 BASED(RDSI3),               /*THIRD FIELD GROUP          */ 54000010
*  2 DSINPTID BIT(8),                   /* INPUT IDENTIFIER          */ 56000010
*  2 DSISEQNO FIXED(16) BDY(BYTE),      /* BTU SEQ NUM FOR CURRENT      58000010
*                                          INVITE                    */ 60000010
*  2 DSIMODID FIXED(8);                 /* BTU MODIFIER              */ 62000010
*                                                                       64000010
*                                                                       66000010
* DECLARE                                                               68000010
* 1 IEDDSI4 BASED(RDSI4),               /*FOURTH FIELD GROUP         */ 70000010
*  2 DSIDIAL,                           /* DIAL DIGITS FIELD         */ 72000010
*   3 DSIDLCNT FIXED(8),                /*  COUNT OF DIAL DATA       */ 74000010
*   3 DSIDLMAX FIXED(8),                /*  MAX NUM OF DIAL DIGITS   */ 76000010
*   3 DSISLACT FIXED(8),                /*  ACTUAL NUM OF DIAL DIGITS   78000010
*                                                                    */ 80000010
*   3 DSIDLDIG CHAR(0);                 /*  DIAL DIGITS              */ 82000010
./  ADD  SSI=70060648,NAME=TDVCIDTD
*        %GOTO DVCIDPLS ;                                            /* 01000010
         MACRO                                                          02000022
         TDVCIDTD                                                       04000022
* TDVCIDTD MACRO UPDATED 7/2/71                                         06000022
.* TDVCIDTD MACRO CONVERTED TO BILINGUAL ON 11/01/72                    07000010
IEDQDVCT DSECT                                                          08000022
*              THIS IS A DSECT OF THE CONCENTRATOR DEVICE ID CHAR.      10000022
*              TABLE.                                                   12000022
*                                                                       14000022
DVCNO    DS    0FL1 .                   NO OF ENTRIES IN TABLE          16000022
DVCIDLTH DS    XL1 .                    LENGTH OF DEV ID CHARS          18000022
DVCRSV   DS    0XL1 .                   RESERVED                        20000022
DVCCHAR  DS    XL1 .                    ID CHARS - 1 BYTE OR            22000022
*                                       LARGER                          24000022
DVCENLTH DS    FL1 .                    ENTRY LENGTH                    26000022
DVCSTAT  DS    XL1 .                    STATUS                          28000022
*                        BIT DEFINITIONS                                30000022
DVCSORTD EQU   X'40' .                  TABLE SORTED                    32000022
*                                                                       34000022
DVCECW   EQU   * .                      END OF CONTROL WORD             36000022
DVCEND   EQU   X'FE' .                  END OF TABLE                    38000022
*                                                                       40000022
*         CONCENTRATOR                                                  42000022
*         *******************************************************       44000022
*     0   *   NO      **   RSV      **   ENLTH    **   STAT     *       46000022
*         *******************************************************       48000022
*     4   *   01      **    FF      **       TNT OFFSET         *       50000022
*         *******************************************************       52000022
*                                                                       54000022
*         FOLLOWING THE CONCENTRATOR ENTRY CONTIGUOUSLY IN CORE         56000022
*         ARE DVCID ENTRIES FOR EACH TERMINAL ATTACHED TO THE           58000022
*         CONCENTRATOR, IN ONE OF THE FOLLOWING FORMATS:                60000022
*                                                                       62000022
*         DVCID=NONE                                                    64000022
*         *******************************************************       66000022
*         *   01      **    FF      **       TNT OFFSET         *       68000022
*         *******************************************************       70000022
*                                                                       72000022
*         DVCID=CHAR                                                    74000022
*         *******************************************************       76000022
*         *  LENGTH   **  ID CHARS  **       TNT OFFSET         *       78000022
*         *******************************************************       80000022
*            1 BYTE      VAR LENGTH            2 BYTES                  82000022
*                                                                       84000022
         MEND   ,  */                                                   86000010
*%DVCIDPLS : ;                                                          86300010
*/* TDVCIDTD MACRO UPDATED 11/01/72                                  */ 86600010
*/*                                                                  */ 86900010
*/*  THIS IS A DSECT OF THE CONCENTRATOR DEVICE ID TABLE             */ 87200010
*DECLARE                                                                87500010
*  1 IEDQDVCT  BASED(IEDQDPTR) BDY(WORD),                               87800010
*   2 DVCIDLTH   PTR(8),                /* LENGTH OF DEVIC ID CHARS  */ 88100010
*     3 DVCNO    PTR(8),                /* NO OF ENTRIES IN TABLE    */ 88400010
*   2 DVCCHAR    (*) CHAR(1),           /* ID CHARS - 1 BYTE MINIMUM */ 88700010
*     3 DVCRSV   CHAR(1),               /* RESERVED                  */ 89000010
*   2 DVCENLTH   PTR(8),                /* ENTRY LENGTH              */ 89300010
*   2 DVCSTAT    BIT(8),                /* STATUS                    */ 89600010
*     3 *        BIT(1),                /* RESERVED                  */ 89900010
*     3 DVCSORTD BIT(1);                /* TABLE SORTED              */ 90200010
*DECLARE  DVCECW (*) CHAR(1) BASED      /* END OF CONTROL WORD       */ 90500010
*                (ADDR(IEDQDVCT) + LENGTH(IEDQDVCT));      /*@Y17XAXF*/ 90800010
*%DCL DVCEND CHAR ;                                                     91100010
*%DVCEND = '''FE''X' ;                                                  91400010
*/*                                                                  */ 91700010
*/*       CONCENTRATOR                                               */ 92000010
*/*       *******************************************************    */ 92300010
*/*   0   *   NO      **   RSV      **   ENLTH    **   STAT     *    */ 92600010
*/*       *******************************************************    */ 92900010
*/*   4   *  X'01'    **   X'FF'    **       TNT OFFSET         *    */ 93200010
*/*       *******************************************************    */ 93500010
*/*                                                                  */ 93800010
*/*       FOLLOWING THE CONCENTRATOR ENTRY CONTIGUOUSLY IN CORE      */ 94100010
*/*       ARE DVCID ENTRIES FOR EACH TERMINAL ATTACHED TO THE        */ 94400010
*/*       CONCENTRATOR, IN ONE OF THE FOLLOWING FORMATS:             */ 94700010
*/*                                                                  */ 95000010
*/*       DVCID=NONE                                                 */ 95300010
*/*       *******************************************************    */ 95600010
*/*       *  X'01'    **   X'FF'    **       TNT OFFSET         *    */ 95900010
*/*       *******************************************************    */ 96200010
*/*                                                                  */ 96500010
*/*       DVCID=CHAR                                                 */ 96800010
*/*       *******************************************************    */ 97100010
*/*       *  LENGTH   **  ID CHARS  **       TNT OFFSET         *    */ 97400010
*/*       *******************************************************    */ 97700010
*/*          1 BYTE      VAR LENGTH            2 BYTES               */ 98000010
*/*                                                                  */ 98300010
./  ADD  SSI=62660124,NAME=TEXTD
*        %GOTO EXTPLS;            /* BILINGUAL HEADER                   00400010
         MACRO                                                          00800010
         TEXTD                                                          01200010
.*A000000-999999                                               @Y17XAXF 01600010
*                                                                       02000010
*        FID0 NORMAL EXTEND RESPONSES                                   02400010
*                                                                       02800010
EXT00    EQU   X'00' .                  CONTROL MODE                    03200010
EXT20    EQU   X'20' .                  TEXT MODE                       03600010
EXT40    EQU   X'40' .                  TRANSPARENT TEXT MODE           04000010
EXT60    EQU   X'60' .                  HEADING MODE                    04400010
EXT80    EQU   X'80' .                  SPECIAL                         04800010
EXTE0    EQU   X'E0' .                  HARDWARE/USER ERROR             05200010
         SPACE                                                          05600010
*                                                                       06000010
*    FINAL STATUS WHEN INITIAL STATUS = CONTROL,TEXT,TRANSPARENT        06400010
*                                     TEXT, OR HEADING                  06800010
*                                                                       07200010
EXTX00   EQU   X'00' .                  TIME OUT                        07600010
EXTX04   EQU   X'04' .                  CUTOFF                          08000010
EXTX06   EQU   X'06' .                  REPLY TO TRANSMITTED DATA       08400010
*                                         WAS AN EOT                    08800010
EXTX08   EQU   X'08' .                  AN EOT WAS RECEIVED ON A BLK    09200010
*                                         THAT WAS IN ERROR             09600010
EXTX0A   EQU   X'0A' .                  END OF DLE CONTROL              10000010
EXTX0C   EQU   X'0C' .                  WRONG ACK                       10400010
EXTX0E   EQU   X'0E' .                  FOR  SS, NAK RETURNED IN        10800010
*                                         RSP TO A SELECTION,           11200010
*                                         POLL OR WRITE                 11600010
*                                       FOR BSC, AND EOT RETURNED       12000010
*                                         IN RESPONSE TO A SLECTION     12400010
*                                         POLL, OR WRITE                12800010
EXTX10   EQU   X'10' .                  RECEIVED SUB-BLOCK              13200010
EXTX12   EQU   X'12' .                  END OF TEXT                     13600010
EXTX14   EQU   X'14' .                  END OF BLOCK                    14000010
EXTX16   EQU   X'16' .                  DATA OR LEADIN GRAPHICS         14400010
*                                         RECEIVED WITH AN ENQ          14800010
EXTX18   EQU   X'18' .                  EOT RECEIVED WITH NO ERRORS     15200010
EXTX1A   EQU   X'1A' .                  REVERSE INTERRUPT               15600010
EXTX1C   EQU   X'1C' .                  POSITIVE ACK RETURNED           16000010
*                                         AND NO ERRORS INDICATED       16400010
*                                         ON A WRITE OPERATION          16800010
EXTX1E   EQU   X'1E' .                  WACK RECEIVED                   17200010
         EJECT                                                          17600010
*                                                                       18000010
*        FINAL STATUS WHEN INITIAL STATUS - SPECIAL                     18400010
*                                                                       18800010
EXTS00   EQU   X'00' .                  TIME-OUT WITH NOTHING REC       19200010
EXTS02   EQU   X'02' .                  COMMAND REJECT                  19600010
EXTS04   EQU   X'04' .                  LEVEL 2 AND LEVEL 3             20000010
*                                         BUFFER POOLS DEPLETED         20400010
EXTS06   EQU   X'06' .                  SELECTED                        20800010
EXTS08   EQU   X'08' .                  RECEIVED DISCONNECT SIGNAL      21200010
*                                         ON START-STOP OR DLE/EOT      21600010
EXTS0A   EQU   X'0A' .                  DATA WAS RECEIVED WHEN          22000010
*                                         IT WAS NOT EXPECTED           22400010
EXTS0C   EQU   X'0C' .                  A RESET OCCURRED                22800010
EXTS0E   EQU   X'0E' .                  THE DEVICE HAS BEEN POLLED      23200010
EXTS10   EQU   X'10' .                  TRANSMITTED SUB-BLOCK           23600010
EXTS12   EQU   X'12' .                  AN EOT WAS SENT AFTER A         24000010
*                                         SPECIFIED NUMBER OF WACKS     24400010
*                                         WERE RECEIVED IN RSP TO       24800010
*                                         TO A REQ OR OPER              25200010
EXTS14   EQU   X'14' .                  RECEIVED BREAK IN TEXT          25600010
EXTS16   EQU   X'16' .                  POLLING STOP                    26000010
EXTS18   EQU   X'18' .                  EOT TRANSMITTED                 26400010
EXTS1A   EQU   X'1A' .                  RECEIVED A BREAK SIGNAL         26800010
*                                         WHILE TRANSMITTING            27200010
EXTS1C   EQU   X'1C' .                  DISCONNECTED                    27600010
EXTS1E   EQU   X'1E' .                  CONNECTED                       28000010
         SPACE                                                          28400010
*                                                                       28800010
*        FINAL STATUS WHEN INITIAL STATUS = HARDWARE/USER ERROR         29200010
*                                                                       29600010
EXTH00   EQU   X'00' .                  USER ERROR                      30000010
EXTH04   EQU   X'04' .                  LEVEL 1 COMM SCANNER CHECK      30400010
EXTH08   EQU   X'08' .                  COMM LINE ADAPTER CHECK         30800010
EXTH0A   EQU   X'0A' .                  COMM SCANNER ADAPTER            31200010
*                                         FEEDBACK CHECK                31600010
EXTH0C   EQU   X'0C' .                  NOT USED                        32000010
EXTH10   EQU   X'10' .                  MODEM ERROR                     32400010
EXTH12   EQU   X'12' .                  MODEM TRANSMIT CLOCK OR         32800010
*                                         CLEAR-TO-SEND ERROR           33200010
EXTH14   EQU   X'14' .                  DSR-ON CHECK                    33600010
EXTH18   EQU   X'18' .                  DSR-OFF CHECK                   34000010
EXTH1C   EQU   X'1C' .                  ACU CHECK                       34400010
EXTE1E   EQU   X'1E' .                  PROGRAM FAILURE                 34800010
         SPACE                                                          35200010
*                                                                       35600010
*    CONDITIONAL EXTENDED RESPONSES                                     36000010
*                                                                       36400010
EXTC82   EQU   X'82' .                  CHANGE-SPEED COMMAND INVALID    36800010
EXTC83   EQU   X'83' .                  SPECIFIED LINE IS UNAVAILABLE   37200010
EXTC84   EQU   X'84' .                  ERROR LOCK                      37600010
EXTCE0   EQU   X'E0' .                  SWITCH-LINE-MODE COMMAND        38000010
*                                         WAS RECEIVED BUT LINE         38400010
*                                         NOT GENERATED AS MODE-        38800010
*                                         SWITCHABLE                    39200010
EXTCE1   EQU   X'E1' .                  SWITCH-LINE-MODE COMMAND        39600010
*                                         WAS RECEIVED BUT A            40000010
*                                         COMMAND IS ALREADY            40400010
*                                         EXECUTING ON THE LINE         40800010
*                                         OR LINE TRACE IS ACTIVE       41200010
         MEND                                                           41600010
*        */                                                             42000010
*%EXTPLS:;                                                              42400010
*/*                                                                  */ 42800010
*/*      FID0 NORMAL EXTEND RESPONSES                                */ 43200010
*/*                                                                  */ 43600010
*DCL EXT00    BIT(3) CONSTANT('000'B);  /*CONTROL MODE               */ 44000010
*DCL EXT20    BIT(3) CONSTANT('001'B);  /*TEXT MODE                  */ 44400010
*DCL EXT40    BIT(3) CONSTANT('010'B);  /*TRANSPARENT TEXT MODE      */ 44800010
*DCL EXT60    BIT(3) CONSTANT('011'B);  /*HEADING MODE               */ 45200010
*DCL EXT80    BIT(3) CONSTANT('100'B);  /*SPECIAL                    */ 45600010
*DCL EXTE0    BIT(3) CONSTANT('111'B);  /*HARDWARE/USER ERROR        */ 46000010
         @SPACE;                                                        46400010
*/*                                                                  */ 46800010
*/*  FINAL STATUS WHEN INITIAL STATUS = CONTROL,TEXT,TRANSPARENT     */ 47200010
*/*                                     TEXT, OR HEADING             */ 47600010
*/*                                                                  */ 48000010
*DCL EXTX00   BIT(4) CONSTANT('0000'B); /*TIME OUT                   */ 48400010
*DCL EXTX04   BIT(4) CONSTANT('0010'B); /*CUTOFF                     */ 48800010
*DCL EXTX06   BIT(4) CONSTANT('0011'B); /*REPLY TO TRANSMITTED DATA  */ 49200010
*/*                                       WAS AN EOT                 */ 49600010
*DCL EXTX08   BIT(4) CONSTANT('0100'B); /*AN EOT WAS RECEIVED ON A   */ 50000010
*/*                                       BLOCK THAT WAS IN ERROR    */ 50400010
*DCL EXTX0A   BIT(4) CONSTANT('0101'B); /*END OF DLE CONTROL         */ 50800010
*DCL EXTX0C   BIT(4) CONSTANT('0110'B); /*WRONG ACK                  */ 51200010
*DCL EXTX0E   BIT(4) CONSTANT('0111'B); /*FOR S/S, NAK RETURNED IN   */ 51600010
*/*                                       RSP TO A SELECTION,        */ 52000010
*/*                                       POLL OR WRITE              */ 52400010
*/*                                     FOR BSC, AND EOT RETURNED    */ 52800010
*/*                                       IN RESPONSE TO A SLECTION  */ 53200010
*/*                                       POLL, OR WRITE             */ 53600010
*DCL EXTX10   BIT(4) CONSTANT('1000'B); /* RECEIVED SUB-BLOCK        */ 54000010
*DCL EXTX12   BIT(4) CONSTANT('1001'B); /*END OF TEXT                */ 54400010
*DCL EXTX14   BIT(4) CONSTANT('1010'B); /*END OF BLOCK               */ 54800010
*DCL EXTX16   BIT(4) CONSTANT('1011'B); /*DATA OR LEADIN GRAPHICS    */ 55200010
*/*                                       RECEIVED WITH AN ENQ       */ 55600010
*DCL EXTX18   BIT(4) CONSTANT('1100'B); /*EOT RECEIVED WITH NO ERROR */ 56000010
*DCL EXTX1A   BIT(4) CONSTANT('1101'B); /*REVERSE INTERRUPT          */ 56400010
*DCL EXTX1C   BIT(4) CONSTANT('1110'B); /*POSITIVE ACK RETURNED      */ 56800010
*/*                                       AND NO ERRORS INDICATED    */ 57200010
*/*                                       ON A WRITE OPERATION       */ 57600010
*DCL EXTX1E   BIT(4) CONSTANT('1111'B); /*WACK RECEIVED              */ 58000010
         @EJECT;                                                        58400010
*/*                                                                  */ 58800010
*/*      FINAL STATUS WHEN INITIAL STATUS - SPECIAL                  */ 59200010
*/*                                                                  */ 59600010
*DCL EXTS00   BIT(4) CONSTANT('0000'B); /*TIME-OUT WITH NOTHING REC  */ 60000010
*DCL EXTS02   BIT(4) CONSTANT('0001'B); /*COMMAND REJECT             */ 60400010
*DCL EXTS04   BIT(4) CONSTANT('0010'B); /*LEVEL 2 AND LEVEL 3        */ 60800010
*/*                                       BUFFER POOLS DEPLETED      */ 61200010
*DCL EXTS06   BIT(4) CONSTANT('0011'B); /*SELECTED                   */ 61600010
*DCL EXTS08   BIT(4) CONSTANT('0100'B); /*RECEIVED DISCONNECT SIGNAL */ 62000010
*/*                                       ON START-STOP OR DLE/EOT   */ 62400010
*DCL EXTS0A   BIT(4) CONSTANT('0101'B); /*DATA WAS RECEIVED WHEN     */ 62800010
*/*                                       IT WAS NOT EXPECTED        */ 63200010
*DCL EXTS0C   BIT(4) CONSTANT('0110'B); /*A RESET OCCURRED           */ 63600010
*DCL EXTS0E   BIT(4) CONSTANT('0111'B); /*THE DEVICE HAS BEEN POLLED */ 64000010
*DCL EXTS10   BIT(4) CONSTANT('1000'B); /*TRANSMITTED SUB-BLOCK      */ 64400010
*DCL EXTS12   BIT(4) CONSTANT('1001'B); /*AN EOT WAS SENT AFTER A    */ 64800010
*/*                                       SPECIFIED NUMBER OF WACKS  */ 65200010
*/*                                       WERE RECEIVED IN RSP TO    */ 65600010
*/*                                       TO A REQ OR OPER           */ 66000010
*DCL EXTS14   BIT(4) CONSTANT('1010'B); /*RECEIVED BREAK IN TEXT     */ 66400010
*DCL EXTS16   BIT(4) CONSTANT('1011'B); /*POLLING STOP               */ 66800010
*DCL EXTS18   BIT(4) CONSTANT('1100'B); /*EOT TRANSMITTED            */ 67200010
*DCL EXTS1A   BIT(4) CONSTANT('1101'B); /*RECEIVED A BREAK SIGNAL    */ 67600010
*/*                                       WHILE TRANSMITTING         */ 68000010
*DCL EXTS1C   BIT(4) CONSTANT('1110'B); /*DISCONNECTED               */ 68400010
*DCL EXTS1E   BIT(4) CONSTANT('1111'B); /*CONNECTED                  */ 68800010
         @SPACE;                                                        69200010
*/*                                                                  */ 69600010
*/*      FINAL STATUS WHEN INITIAL STATUS = HARDWARE/USER ERROR      */ 70000010
*/*                                                                  */ 70400010
*DCL EXTH00   BIT(4) CONSTANT('0000'B); /*USER ERROR                 */ 70800010
*DCL EXTH04   BIT(4) CONSTANT('0010'B); /*LEVEL 1 COMM SCANNER CHECK */ 71200010
*DCL EXTH08   BIT(4) CONSTANT('0100'B); /*COMM LINE ADAPTER CHECK    */ 71600010
*DCL EXTH0A   BIT(4) CONSTANT('0101'B); /*COMM SCANNER ADAPTER       */ 72000010
*/*                                       FEEDBACK CHECK             */ 72400010
*DCL EXTH0C   BIT(4) CONSTANT('0110'B); /*NOT USED                   */ 72800010
*DCL EXTH10   BIT(4) CONSTANT('1000'B); /*MODEM ERROR                */ 73200010
*DCL EXTH12   BIT(4) CONSTANT('1001'B); /*MODEM TRANSMIT CLOCK OR    */ 73600010
*/*                                       CLEAR-TO-SEND ERROR        */ 74000010
*DCL EXTH14   BIT(4) CONSTANT('1010'B); /*DSR-ON CHECK               */ 74400010
*DCL EXTH18   BIT(4) CONSTANT('1100'B); /*DSR-OFF CHECK              */ 74800010
*DCL EXTH1C   BIT(4) CONSTANT('1110'B); /*ACU CHECK                  */ 75200010
*DCL EXTE1E   BIT(4) CONSTANT('1111'B); /*PROGRAM FAILURE            */ 75600010
         @SPACE;                                                        76000010
*/*                                                                  */ 76400010
*/*  CONDITIONAL EXTENDED RESPONSES                                  */ 76800010
*/*                                                                  */ 77200010
*DCL EXTC82   BIT(8) CONSTANT('82'X);   /*CHANGE-SPEED COMMAND INVAL */ 77600010
*DCL EXTC83   BIT(8) CONSTANT('83'X);   /*SPECIFIED LINE IS UNAVAIL  */ 78000010
*DCL EXTC84   BIT(8) CONSTANT('84'X);   /*ERROR LOCK                 */ 78400010
*DCL EXTCE0   BIT(8) CONSTANT('E0'X);   /*SWITCH-LINE-MODE COMMAND   */ 78800010
*/*                                       WAS RECEIVED BUT LINE      */ 79200010
*/*                                       NOT GENERATED AS MODE-     */ 79600010
*/*                                       SWITCHABLE                 */ 80000010
*DCL EXTCE1   BIT(8) CONSTANT('E1'X);   /*SWITCH-LINE-MODE COMMAND   */ 80400010
*/*                                       WAS RECEIVED BUT A         */ 80800010
*/*                                       COMMAND IS ALREADY         */ 81200010
*/*                                       EXECUTING ON THE LINE      */ 81600010
*/*                                       OR LINE TRACE IS ACTIVE    */ 82000010
./  ADD  SSI=71310503,NAME=TGMAIND
*        %GOTO PLSGMAIN;                /* BILINGUAL HEADER             00500000
         MACRO                                                          01000000
         TGMAIND                                                        01500000
         SPACE                                                          02000000
.*CHANGE ACTIVITY AS FOLLOWS:                                           02500000
.*A000000-999999                                               @Y17XAXU 03000000
         SPACE                                                          03500000
IEDGMAIN DSECT                                                          04000000
*                                                                       04500000
*        TSO WORK AREA                                                  05000000
*                                                                       05500000
GMTSBUFR DS    A .                      TSO BFR OR MSGGEN ADDR          06000000
GMTCBUFR DS    A .                      TCAM SCB ADDR                   06500000
GMMOVED  DS    H .                      DATA MOVED                      07000000
GMLINE   DS    H .                      LINE SIZE REMAINING             07500000
GMBLNTH  DS    H .                      TSO BFR DATA SIZE               08000000
GMMSGLEN DS    H .                      MESSAGE SIZE                    08500000
GMWBUFSZ DS    H .                      TCAM BUFFER SIZE                09000000
GMSECENT DS    X .                      SPECIAL ENTRY                   09500000
GMSTFD   EQU   X'F0' .                    STARTFIELD INSERT             10000000
GMRDAT   EQU   X'F1' .                    READ ATTRIBUTE INSERT         10500000
GMSBA    EQU   X'F2' .                    SBA INSERT                    11000000
GMCUR1   EQU   X'F3' .                    FIRST CURSOR INSERT           11500000
GMCUR2   EQU   X'F4' .                    SECOND CURSOR INSERT          12000000
GMINC    EQU   X'F5' .                    INC INSERT                    12500000
GMETX    EQU   X'F6' .                    ETX INSERT                    13000000
GMEOT    EQU   X'F7' .                    EOT INSERT                    13500000
GMETXEOT EQU   X'F8' .                    ETX/EOT INSERT                14000000
GMBYP    EQU   X'F9' .                    BYPASS CHAR INSERT            14500000
GMREST   EQU   X'FA' .                    RESTORE CHAR INSERT           15000000
GMCARCT  DS    X .                      QCB CARRIAGE COUNT              15500000
GMLINESV DS    H .                      FROM TSB OR DEFAULT LINE SIZE   16000000
GMLINENM EQU   GMLINESV .               DISPLAY NUMBER OF LINES         16500000
GMLNSIZE EQU   GMLINESV+1 .             DISPLAY LINE SIZE               17000000
GMSWT1   DS    X .                      SWITCH 1                        17500000
GMCUR2FL EQU   X'80' .                    SECOND CURSOR FLAG            18000000
GMCUR1FL EQU   X'40' .                    FIRST CURSOR FLAG             18500000
GMRDATFL EQU   X'20' .                    READ ATTRIBUTE FLAG           19000000
GMSFATFL EQU   X'10' .                    START FIELD FLAG              19500000
GMBYPFL  EQU   X'08' .                    BYPASS FLAG                   20000000
GMCRNLFL EQU   X'04' .                    CARRIAGE RETURN/NEW LINE FLAG 20500000
GMSBAFL  EQU   X'02' .                    SET BFR ADDRESS FLAG          21000000
GMWRATFL EQU   X'01' .                    WRITE ATTRIBUTE FLAG          21500000
GMSWT2   DS    X .                      SWITCH 2                        22000000
GMRTCD4  EQU   X'04' .                    CALCSIZE RC 4                 22500000
GMRTCD8  EQU   X'08' .                    CALCSIZE RC 8                 23000000
GMRTCD12 EQU   X'0C' .                    CALCSIZE RC 12                23500000
GMRTCD16 EQU   X'10' .                    CALCSIZE RC 16                24000000
GMRTCD40 EQU   X'28' .                    CALCSIZE RC 40                24500000
GMRTCD44 EQU   X'2C' .                    CALCSIZE RC 44                25000000
GMWFLG1  DS    X .                      TSO FLAG 1                      25500000
GMTSOMSG EQU   X'80' .                    TSO ENTRY                     26000000
GMASISCL EQU   X'60' .                    ASIS SCREEN CONTROL           26500000
GMCNTRLM EQU   X'40' .                    CONTROL MODE                  27000000
GMTSASIS EQU   X'20' .                    TSO TPUT ASIS                 27500000
GM1MSGEN EQU   X'10' .                    FIRST MSGGEN PASS SWITCH      28000000
GMFMTFL  EQU   X'08' .                    SCREEN FORMAT INFO IN BFR     28500000
GMNOLEFT EQU   X'06' .                    NO LEFT JUSTIFICATION REQUEST 29000000
GMLEFT   EQU   X'05' .                    LEFT JUSTIFICATION REQUEST    29500000
GMWFLG2  DS    X .                      TSO FLAG 2                      30000000
GMSAVX1  DS    H .                      SCREEN CURSOR ADDRESS           30500000
GMFLAG1  DS    X .                      FLAG BYTE 1                     31000000
GMTRAILR EQU   X'80' .                    TRAILER BUFFER FLAG           31500000
GMPARTMV EQU   X'40' .                    PARTIAL MOVE FLAG             32000000
GMRESTSW EQU   X'20' .                    RESTORE CHAR FLAG             32500000
GMRECALC EQU   X'10' .                    BYPASS CODE AND RESET         33000000
GMINCSW  EQU   X'04' .                    INSERT CURSOR FLAG            33500000
GMEOTSW  EQU   X'02' .                    EOT FLAG                      34000000
GMETXSW  EQU   X'01' .                    ETX FLAG                      34500000
GMFLAG2  DS    X .                      FLAG BYTE 2                     35000000
GMX3705  EQU   X'80' .                    TERMINAL ON A 3705            35500000
GMX1050  EQU   X'40' .                    DEVICE IS A 1050              36000000
GMPROMPT EQU   X'20' .                    PROMPT STRING FLAG            36500000
GMNLCRFL EQU   X'10' .                    NL/CR COUNT FLAG              37000000
GMNWLNCT EQU   X'08' .                    LINE COUNT FLAG               37500000
GMCRRDAT EQU   X'04' .                    READ ATTRIB LINE POS. FLAG    38000000
GMHDRFG  EQU   X'02' .                    FIRST BASIC UNIT FLAG         38500000
GMNOMVCT EQU   X'01' .                    NO MOVE COUNT FLAG            39000000
GMSAVX2  DS    H .                      FIRST/LAST CHARACTER            39500000
GMTOR    DS    F .                      DATA COUNT                      40000000
GMFROMR  DS    F .                      DATA COUNT MOVED                40500000
GMTSCURR DS    A .                      CURRENT TSO BUFFER              41000000
GMMSGNLN DS    H .                      LENGTH OF MSGGEN DATA           41500000
GMSBAFLG EQU   X'EF' .                    SBA FLAG                      42000000
GMCUR1FG EQU   X'EE' .                    CURSOR ONE FLAG               42500000
GMCUR2FG EQU   X'ED' .                    CURSOR TWO FLAG               43000000
GMSTFDFG EQU   X'EC' .                    START FIELD FLAG              43500000
GMWRATFG EQU   X'EB' .                    WRITE ATTRIBUTE FLAG          44000000
GMDEND   DS    D .                      DOUBLE SAVE                     44500000
GMAINLEN EQU   *-IEDGMAIN               GMAIN LENGTH                    45000000
*                                                                       45500000
         MEND                                                           46000000
*        */                                                             46500000
*%PLSGMAIN : ;                                                          47000000
*DECLARE                                                                47500000
*  1 IEDGMAIN BDY(WORD) BASED(IEDGMPTR),                                48000000
*/*                                                                  */ 48500000
*/*      TSO WORK AREA                                               */ 49000000
*/*                                                                  */ 49500000
*   2 GMTSBUFR PTR(31),                 /* TSO BFR OR MSGGEN ADDR    */ 50000000
*   2 GMTCBUFR PTR(31),                 /* TCAM SCB ADDR             */ 50500000
*   2 GMMOVED FIXED(15),                /* DATA MOVED                */ 51000000
*   2 GMLINE FIXED(15),                 /* LINE SIZE REMAINING       */ 51500000
*   2 GMBLNTH FIXED(15),                /* TSO BFR DATA SIZE         */ 52000000
*   2 GMMSGLEN FIXED(15),               /* MESSAGE SIZE              */ 52500000
*   2 GMWBUFSZ FIXED(15),               /* TCAM BFR SIZE             */ 53000000
*   2 GMSECENT CHAR(1),                 /* SPECIAL ENTRY             */ 53500000
*   2 GMCARCT CHAR(1),                  /* QCB CARRIAGE COUNT        */ 54000000
*   2 GMLINESV FIXED(15),               /* FROM TSB OR DEFAULT          54500000
*                                          LINE SIZE                 */ 55000000
*    3 GMLINENM CHAR(1),                /* DISPLAY NUMBER OF LINES   */ 55500000
*    3 GMLNSIZE CHAR(1),                /* DISPLAY LINE SIZE         */ 56000000
*   2 GMSWT1 CHAR(1),                   /* SWITCH 1                  */ 56500000
*    3 GMCUR2FL BIT(1),                   /* SECOND CURSOR FLAG      */ 57000000
*    3 GMCUR1FL BIT(1),                   /* FIRST CURSOR FLAG       */ 57500000
*    3 GMRDATFL BIT(1),                   /* READ ATTRIBUTE FLAG     */ 58000000
*    3 GMSFATFL BIT (1),                  /* START FIELD FLAG        */ 58500000
*    3 GMBYPFL BIT (1),                   /* BYPASS FLAG             */ 59000000
*    3 GMCRNLFL BIT (1),                  /* CARRIAGE RETURN/NEW        59500000
*                                            LINE FLAG               */ 60000000
*    3 GMSBAFL BIT(1),                    /* SET BFR ADDRESS FLAG    */ 60500000
*    3 GMWRATFL BIT (1),                  /* WRITE ATTRIBUTE FLAG    */ 61000000
*   2 GMSWT2 CHAR(1),                   /* SWITCH 2                  */ 61500000
*   2 GMWFLG1 CHAR(1),                  /* TSO FLAG 1                */ 62000000
*   2 GMWFLG2 CHAR(1),                  /* TSO FLAG 2                */ 62500000
*   2 GMSAVX1 FIXED(15),                /* SCREEN CURSOR ADDRESS     */ 63000000
*   2 GMFLAG1 CHAR(1),                  /* FLAG BYTE 1               */ 63500000
*    3 GMTRAILR BIT(1),                   /* TRAILER BUFFER FLAG     */ 64000000
*    3 GMPARTMV BIT(1),                   /* PARTIAL MOVE FLAG       */ 64500000
*    3 GMRESTSW BIT(1),                   /* RESTORE CHAR FLAG       */ 65000000
*    3 GMRECALC BIT (1),                  /* BYPASS CODE AND RESET   */ 65500000
*    3 *        BIT(1),                   /* UNUSED                  */ 66000000
*    3 GMINCSW  BIT(1),                   /* INSERT CURSOR FLAG      */ 66500000
*    3 GMEOTSW  BIT(1),                   /* EOT FLAG                */ 67000000
*    3 GMETXSW  BIT(1),                   /* ETX FLAG                */ 67500000
*   2 GMFLAG2 CHAR(1),                  /* FLAG BYTE 2               */ 68000000
*    3 GMX3705 BIT(1),                    /* TERMINAL ON A 3705      */ 68500000
*    3 GMX1050 BIT(1),                    /* DEVICE IS A 1050        */ 69000000
*    3 GMPROMPT BIT (1),                  /* PROMPT STRING FLAG      */ 69500000
*    3 GMNLCRFL BIT(1),                   /* NL/CR COUNT FLAG        */ 70000000
*    3 GMNWLNCT BIT(1),                   /* LINE COUNT FLAG         */ 70500000
*    3 GMCRRDAT BIT(1),                   /* READ ATTRIBUTE LINE        71000000
*                                            POSITION FLAG           */ 71500000
*                                                                       72000000
*    3 GMHDRFG BIT(1),                    /* FIRST BASIC UNIT FLAG   */ 72500000
*    3 GMNOMYCT BIT(1),                   /* NO MOVE COUNT FLAG      */ 73000000
*   2 GMSAVX2 CHAR(2),                  /* FIRST/LAST CHARACTER      */ 73500000
*   2 GMTOR PTR(31),                    /* DATA COUNT                */ 74000000
*   2 GMFROMR PTR(31),                  /* DATA COUNT MOVED          */ 74500000
*   2 GMTSCURR PTR(31),                 /* CURRENT TSO BUFFER        */ 75000000
*   2 GMMSGNLN FIXED(15),               /* LENGTH OF MSGGEN DATA     */ 75500000
*   2 GMDEND CHAR(8);                   /* DOUBLE SAVE               */ 76000000
*                                                                       76500000
* %GMAINLEN='LENGTH(IEDGMAIN)';         /* GMAIN LENGTH              */ 77000000
*/*                                                                  */ 77500000
*/*      GMAIN CONSTANTS                                             */ 78000000
*/*                                                                  */ 78500000
*DCL GMSTFD BIT(8) CONSTANT('F0'X);       /* STARTFIELD INSERT       */ 79000000
*DCL GMRDAT BIT(8) CONSTANT('F1'X);       /* READ ATTRIB INSERT      */ 79500000
*DCL GMSBA BIT(8) CONSTANT('F2'X);        /* SBA INSERT              */ 80000000
*DCL GMCUR1 BIT(8) CONSTANT('F3'X);       /* FIRST CURSOR INSERT     */ 80500000
*DCL GMCUR2 BIT(8) CONSTANT('F4'X);       /* SECOND CURSOR INSERT    */ 81000000
*DCL GMINC BIT(8) CONSTANT('F5'X);        /* INC INSERT              */ 81500000
*DCL GMETX BIT(8) CONSTANT('F6'X);      /* ETX INSERT                */ 82000000
*DCL GMEOT BIT(8) CONSTANT('F7'X);        /* EOT INSERT              */ 82500000
*DCL GMETXEOT BIT(8) CONSTANT('F8'X);     /* ETX/EOT INSERT          */ 83000000
*DCL GMBYP BIT(8) CONSTANT ('F9'X);       /* BYPASS CHAR INSERT      */ 83500000
*DCL GMREST BIT(8) CONSTANT('FA'X);       /* RESTORE CHAR INSERT     */ 84000000
*                                                                       84500000
*DCL GMRTCD4 BIT(8) CONSTANT('04'X);      /* CALCSIZE RC 4           */ 85000000
*DCL GMRTCD8 BIT(8) CONSTANT('08'X);      /* CALCSIZE RC 8           */ 85500000
*DCL GMRTCD12 BIT(8) CONSTANT('0C'X);     /* CALCSIZE RC 12          */ 86000000
*DCL GMRTCD16 BIT(8) CONSTANT('10'X);     /* CALCSIZE RC 16          */ 86500000
*DCL GMRTCD40 BIT(8) CONSTANT('28'X);     /* CALCSIZE RC 40          */ 87000000
*DCL GMRTCD44 BIT(8) CONSTANT('2C'X);     /* CALCSIZE RC 44          */ 87500000
*                                                                       88000000
*DCL GMTSOMGS BIT(8) CONSTANT('80'X);     /* TSO ENTRY               */ 88500000
*DCL GMASISCL BIT(8) CONSTANT('60'X);     /* ASIS SCREEN CONTROL     */ 89000000
*DCL GMCNTRLM BIT(8) CONSTANT('40'X);     /* CONTROL MODE            */ 89500000
*DCL GMTSASIS BIT(8) CONSTANT('20'X);     /* TSO TPUT ASIS           */ 90000000
*DCL GM1MSGEN BIT(8) CONSTANT('10'X);     /* FIRST MSGGEN PASS SW    */ 90500000
*DCL GMFMTFL BIT(8) CONSTANT('08'X);      /* SCREEN FORMAT INFO         91000000
*                                            IN BUFFER               */ 91500000
*DCL GMNOLEFT BIT(8) CONSTANT('06'X);     /* NO LEFT JUSTIF. REQ     */ 92000000
*DCL GMLEFT BIT(8) CONSTANT('05'X);       /* LEFT JUSTIF. REQ        */ 92500000
*                                                                       93000000
*DCL GMSBAFLG BIT(8) CONSTANT('EF'X);     /* SBA FLAG                */ 93500000
*DCL GMCUR1FG BIT(8) CONSTANT('EE'X);     /* CURSOR ONE FLAG         */ 94000000
*DCL GMCUR2FG BIT(8) CONSTANT('ED'X);     /* CURSOR TWO FLAG         */ 94500000
*DCL GMSTFDFG BIT(8) CONSTANT('ED'X);     /* START FIELD FLAG        */ 95000000
*DCL GMWRATFG BIT(8) CONSTANT('EB'X);     /* WRITE ATTRIBUTE FIELD   */ 95500000
*                                                                       96000000
./  ADD  SSI=62430476,NAME=TIDD
*        %GOTO PLSID;                   /* BILINGUAL HEADER             03000010
         MACRO                                                          06000010
         TIDD                                                           09000010
*                                                                       12000010
.*A000000-999999                                               @Y17XAXF 15000010
*        BALR VERSION NOT SUPPORTED                                     18000010
*                                                                       21000010
         MEND  */                                                       24000010
*%PLSID:;                                                               27000010
* DCL IDCHCKPT CHAR(2) CONSTANT('06');  /* CHECKPOINT                */ 30000010
* DCL IDMSGOOD CHAR(2) CONSTANT('M3');  /* GOOD MESSAGE MODULE       */ 33000010
* DCL IDMSGCHN CHAR(2) CONSTANT('09');  /* MESSAGE MODULE CHAIN      */ 36000010
* DCL IDBHSTLS CHAR(2) CONSTANT('MS');  /* BHSET, TRANLMT, SESSION   */ 39000010
* DCL IDRUHAND CHAR(2) CONSTANT('02');  /* REQUEST-RESPONSE UNIT        42000010
*                                          HANDLER                   */ 45000010
./  ADD  SSI=62120251,NAME=TINVLD
*        %GOTO PLSINVL;                 /*                              01000010
         MACRO                                                          02000010
         TINVLD                                                         03000010
.*A00000000-99999999                                           @Y17XAXF 04000010
IEDINVL  DSECT                                                          05000010
*                                                                       06000010
*        INVITATION LIST DSECT                                          07000010
*                                                                       08000010
INVCTL   DS    0CL4 .                   CONTROL WORD                    09000010
INVTOTNT DS    XL1 .                     TOTAL ENTRIES IN LIST          10000010
INVACTNT DS    XL1 .                     TOTAL ACTIVE ENTRIES           11000010
INVENTLG DS    XL1 .                     ENTRY LENGTH                   12000010
INVSTATS DS    XL1 .                     STATUS                         13000010
INVEOT   EQU   X'80' .                    EOT SPECIFIED                 14000010
INVOFSRT EQU   X'40' .                    OFFSETS SORTED                15000010
INVCONT  EQU   X'20' .                    CONTENTION                    16000010
*        EQU   X'10'-X'08'                RESERVED                      17000010
INVCRR   EQU   X'04' .                    CHECKPOINT RESTART            18000010
*        EQU   X'02' .                    RESERVED                      19000010
INVAUTPL EQU   X'01' .                    AUTOPOLL IN EFFECT            20000010
INVCPUID DS    0A .                     IF SEQUENCE ADDRESS             21000010
INVBFRTM DS    0CL4 .                    BUFFERED TERM FIELD            22000010
INVACTCT DS    XL1 .                      NO. ACTIVE TERM               23000010
INVUCBST DS    XL1 .                      UCB STATUS                    24000010
         DS    XL1 .                      RESERVED                      25000010
INVTRMCT DS    XL1 .                      NO TERMS ON THIS LINE         26000010
INVENTRY EQU   *                        BEGIN INVITATION LIST           27000010
*                                        ENTRIES                        28000010
INVENDL  EQU   X'FE' .                  END OF ACTIVE LIST INDICATOR    29000010
         MEND  */                                                       30000010
*%PLSINVL: ;                                                            31000010
*/*                                                                  */ 32000010
*/*      INVITATION LIST DSECT                                       */ 33000010
*/*                                                                  */ 34000010
* DECLARE                                                               35000010
* 1 IEDINVL  BASED(RINVL),                                              36000010
*  2 INVCTL   CHAR(4),                  /* CONTROL WORD              */ 37000010
*   3 INVTOTNT FIXED(8),                /*  TOTAL ENTRIES IN LIST    */ 38000010
*   3 INVACTNT FIXED(8),                /*  TOTAL ACTIVE ENTRIES     */ 39000010
*   3 INVENTLG FIXED(8),                /*  ENTRY LENGTH             */ 40000010
*   3 INVSTATS FIXED(8),                /*  STATUS                   */ 41000010
*    4 INVEOT   BIT(1),                 /*   EOT SPECIFIED           */ 42000010
*    4 INVOFSRT BIT(1),                 /*   OFFSETS SORTED          */ 43000010
*    4 INVCONT  BIT(1),                 /*   CONTENTION              */ 44000010
*    4 *        BIT(2),                 /*   RESERVED                */ 45000010
*    4 INVCRR   BIT(1),                 /*   CHECKPOINT RESTART      */ 46000010
*    4 *        BIT(1),                 /*   RESERVED                */ 47000010
*    4 INVAUTPL BIT(1),                 /*   AUTOPOLL IN EFFECT      */ 48000010
*  2 INVCPUID PTR(31),                  /* IF SEQUENCE ADDRESS       */ 49000010
*   3 INVBFRTM CHAR(4),                 /*  BUFFERED TERM FIELD      */ 50000010
*    4 INVACTCT FIXED(8),               /*   NO. ACTIVE TERM         */ 51000010
*    4 INVUCBST BIT(8),                 /*   UCB STATUS              */ 52000010
*    4 *        BIT(8),                 /*   RESERVED                */ 53000010
*    4 INVTRMCT FIXED(8),               /*   NO TERMS ON THIS LINE   */ 54000010
*  2 INVENTRY CHAR(*);                  /* BEGIN INVITATION LIST        55000010
*                                          ENTRIES                   */ 56000010
* DCL INVENDL  BIT(8) CONSTANT('FE'X);  /* END OF ACTIVE LIST INDICATOR 57000010
*                                                                    */ 58000010
./  ADD  SSI=60241434,NAME=TIOBD
         MACRO                                                          02000020
         TIOBD                                                          04000020
         SPACE                                                          06000020
IEDQIOB  DSECT                                                          08000020
IOBFLAG1 DS    C                                                        10000020
IOBFLAG2 DS    C                                                        12000020
IOBSENS0 DS    C                                                        14000020
IOBSENS1 DS    C                                                        16000020
IOBECBCC DS    C .                      COMPLETION CODE                 18000020
IOBECBPT DS    AL3 .                    ADDR OF ECB                     20000020
IOBFLAG3 DS    C .                      I/O ERROR FLAGS                 22000020
IOBCSW   DS    CL7 .                    CSW                             24000020
IOBSIOCC DS    C .                      SIO CONDITION CODES             26000020
IOBSTART DS    AL3 .                    ADDR OF CHANNEL PROGRAM         28000020
         DS    C .                      RESERVED                        30000020
IOBDCBPT DS    AL3 .                    ADDR OF DCB                     32000020
         DS    C .                      OP CODE                         34000020
IOBRESTR DS    AL3 .                    RESTART ADDR OF IOS             36000020
IOBINCAM DS    H .                      BLOCK COUNT                     38000020
IOBERRCT DS    H .                      NO. OF ERROR RETRIES            40000020
IOBSEEK  DS    CL8 .                    MBBCCHHR                        42000020
*                                                                       44000020
*                       END OF IOB                                      46000020
*                                                                       48000020
IOBXECB  DS    F .                      ECB                             50000020
IOBBUSYN EQU   X'40' .                  BUSY BIT OF AN ECB              52000020
IOBXCC   DS    H .                      CURRENT ARM POSITION - CYL      54000020
IOBXRETQ DS    AL3 .                    ADDR OF Q OF CPB READY FOR      56000020
*                                         DISK END APPENDAGE FOR RETRY  58000020
         ORG   *-1 .                    LOW BIT OF PREVIOUS ADDR REDEF  60000020
IOBXLOCK DS    0X .                     FLAG BIT - LOCKED DOOR          62000020
IOBXLOCN EQU   X'01' .                  FORBIDS DISK END APPENDAGE      64000020
*                                         TO RETRY                      66000020
IOBXLOCF EQU   X'FF'-IOBXLOCN .         UNLOCKED, RETRY PERMITTED       68000020
IOBXNEWQ DS    A .                      ADDR OF Q OF CPBS BEING BUILT   70000020
IOBEND   EQU   *                                                        72000020
         SPACE 2                                                        74000020
         MEND                                                           76000020
./  ADD  SSI=73120369,NAME=TIOSBED
         MACRO                                                          00050011
         TIOSBED                                                        00100011
.*A-000000-999999                                              @OZ26164 00150011
         SPACE                                                          00200011
*        MAPPING FOR THE EXTENSION FOR AN IOSB USED FOR A MESSAGE       00250011
*        QUEUES DISK DATA SET                                           00300011
         SPACE                                                          00350011
.*       UPDATED   09/10/77                                             00400011
.*CHANGE ACTIVITY = AS FOLLOWS:                                         00450011
.*                                                                      00500011
         SPACE                                                          00550011
IOSBE    DSECT                                                          00600011
IOSBEENT DS    XL1                      ENTRY FLAG                      00650011
IOSBESIO EQU   X'28'                    ENTRY FOR START I/O             00700011
IOSBEIOS DS    AL3                      ADDRESS OF IOSB                 00750011
IOSBEFLG DS    XL1                      FLAG BYTE                       00800011
IOSBEEOL EQU   X'80'                    END OF PARM LIST                00850011
IOSBERDY EQU   X'40'                    IOSBE READY FOR                 00900011
*                                       NEW I/O OPERATION               00950011
IOSBEBUS EQU   X'FF'-IOSBERDY           IOSBE BUSY - CANNOT             01000011
*                                       ACCEPT NEW I/O                  01050011
IOSBECPR EQU   X'20'                    CCW'S ARE REAL                  01100011
IOSBECPV EQU   X'FF'-IOSBECPR           CCW'S ARE VIRTUAL               01150011
IOSBENRQ EQU   X'10'                    QUEUE TYPE                      01200011
*                                         1 = NON-REUS QUEUES           01250011
*                                         0 = REUS QUEUES               01300011
IOSBECPB DS    AL3                      ADDRESS OF CPB                  01350011
IOSBEXCC DS    H                        ARM POSITION                    01400011
IOSBERET DS    XL3                      RETRY QUEUE                     01450011
IOSBENEW DS    AL3                      NEW QUEUE OF CPB'S              01500011
IOSBELCK DS    XL1                      TEST AND SET BYTE USED TO       01550011
*                                       SYNCHRONIZE RETRIES             01600011
         DS    XL7                      RESERVED                        01650011
IOSBELEN EQU   *-IOSBE                  LENGTH OF IOSBE                 01700011
         MEND                                                           01750011
./  ADD  SSI=60840005,NAME=TMHTABD
*        %GOTO PLSMHTAB;                /* BILINGUAL HEADER             03000010
         MACRO                                                          06000010
         TMHTABD                                                        09000010
         SPACE                                                          12000010
.* CHANGE ACTIVITY AS FOLLOWS:                                          15000010
.*A000000-999999                                               @Y17XAXU 18000010
         SPACE                                                          21000010
IEDMHTD DSECT                                                           24000010
*                                                                       27000010
*        DSECT FOR MH TABLE                                             30000010
*                                                                       33000010
MHTABEND DS    0XL1 .                   FLAG FIELD                      36000010
MHFLGE   EQU   X'FF'                    END OF TABLE INDICATOR          39000010
MHNAME   DS    CL8 .                    MH NAME                         42000010
MHENTRY  DS    A .                      MH ENTRY ADDRESS                45000010
MHTABLEN EQU   *-IEDMHTD .              LENGTH OF MH TABLE ENTRY        48000010
         SPACE 2                                                        51000010
         MEND                           */                              54000010
*%PLSMHTAB : ;                                                          57000010
*DECLARE                                                                60000010
*  1 IEDMHTD BDY(WORD) BASED(IEDQMHTP),                                 63000010
*/*                                                                  */ 66000010
*/*      DSECT FOR MH TABLE                                          */ 69000010
*/*                                                                  */ 72000010
*   2 MHNAME CHAR(8),                   /* MH NAME                   */ 75000010
*    3 MHTABEND CHAR(1),                /* FLAG FIELD                */ 78000010
*   2 MHENTRY PTR(31);                  /* MH ENTRY ADDRESS          */ 81000010
* %MHTABLEN='LENGTH(IEDMHTD)';          /* LEN OF MH TABLE ENTRY     */ 82000010
*DCL MHFLGE BIT(8) CONSTANT('FF'X);     /* END OF TABLE INDICATOR    */ 84000010
*                                                                       93000010
*%MHEND: ;                              /* END OF MH TABLE           */ 96000010
*                                                                       99000010
./  ADD  SSI=62470483,NAME=TMODD
*        %GOTO PLSMODD;                 /*                              00700010
         MACRO                                                          01400010
         TMODD                                                          02100010
.*A000000-999999                                               @Y17XAXF 02800010
IEDQMOD  DSECT                                                          03500010
*                                                                       04200010
*        MODE DEVICE DEPENDENT FIELDS                                   04900010
*                                                                       05600010
MODLNG   DS    XL1                      LENGTH OF MODE BYTE FIELDS      06300010
*                                        IN THE TTE DEVICE DEPENDENT    07000010
*                                        FIELDS                         07700010
MODCUR   DS    0XL2                     CURRENT MODE IN NCP             08400010
MODCUR1  DS    XL1                      CURRENT MODE BYTE 1             09100010
*        EQU   X'80'                     RESERVED                       09800010
MODCWERP EQU   X'40'                     OVERRIDE WRITE TEXT MODE ERPS  10500010
MODCRLGW EQU   X'20'                     REJECT LEADING GRAPHICS ON     11200010
*                                         WRITE OPERATIONS              11900010
MODCEIBD EQU   X'10'                     EIB DELETION(NON-TRANS-        12600010
*                                         PARENT ONLY)                  13300010
*        EQU   X'08'                     RESERVED                       14000010
MODCITFL EQU   X'04'                     INHIBIT TIME FILL/INHIBIT      14700010
*                                         WACK LINES                    15400010
MODCEMLC EQU   X'02'                     EMBEDDED LINE CONTROL(NON-     16100010
*                                         TRANSPARENT) INTERMEDIATE     16800010
*                                         CONTROL CHAR INSERTION        17500010
MODCCTXT EQU   X'01'                     CRITICAL TEXT                  18200010
MODCUR2  DS    XL1                      CURRENT MODE 2ND BYTE           18900010
*        EQU   X'80'                     RESERVED                       19600010
MODCRERP EQU   X'40'                     OVERRIDE READ TEXT MODE ERPS   20300010
MODCRLGR EQU   X'20'                     REJECT LEADING GRAPHICS        21000010
*                                         ON READ OPERATIONS            21700010
MODCEIBJ EQU   X'10'                     EIB INSERTION                  22400010
MODCINTO EQU   X'10'                     INHIBIT TEXT TIME OUTS         23100010
MODCSUBB EQU   X'08'                     SUB-BLOCKING(INPUT)            23800010
MODCINTE EQU   X'04'                     INTERRUPT ENABLED              24500010
MODCMNTR EQU   X'02'                     ACTIVATE MONITOR TASK          25200010
MODCMNTP EQU   X'01'                     0-AUTOMATICALLY DEACTIVATE     25900010
*                                          MONITOR                      26600010
*                                        1-PERPETUAL MONITOR            27300010
MODNEW   DS    0XL2                     NEW MODE IN NCP                 28000010
MODNEW1  DS    XL1                      NEW MODE BYTE 1                 28700010
*        EQU   X'80'                     RESERVED                       29400010
MODNWERP EQU   X'40'                     OVERRIDE WRITE TEXT MODE ERPS  30100010
MODNRLGW EQU   X'20'                     REJECT LEADING GRAPHICS ON     30800010
*                                         WRITE OPERATIONS              31500010
MODNEIBD EQU   X'10'                     EIB DELETION(NON-TRANS-        32200010
*                                         PARENT ONLY)                  32900010
*        EQU   X'08'                     RESERVED                       33600010
MODNITFL EQU   X'04'                     INHIBIT TIME FILL/INHIBIT      34300010
*                                         WACK LINES                    35000010
MODNEMLC EQU   X'02'                     EMBEDDED LINE CONTROL(NON-     35700010
*                                         TRANSPARENT) INTERMEDIATE     36400010
*                                         CONTROL CHAR INSERTION        37100010
MODNCTXT EQU   X'01'                     CRITICAL TEXT                  37800010
MODNEW2  DS    XL1                      NEW MODE 2ND BYTE               38500010
*        EQU   X'80'                     RESERVED                       39200010
MODNRERP EQU   X'40'                     OVERRIDE READ TEXT MODE ERPS   39900010
MODNRLGR EQU   X'20'                     REJECT LEADING GRAPHICS        40600010
*                                         ON READ OPERATIONS            41300010
MODNEIBJ EQU   X'10'                     EIB INSERTION                  42000010
MODNINTO EQU   X'10'                     INHIBIT TEXT TIME OUTS         42700010
MODNSUBB EQU   X'08'                     SUB-BLOCKING(INPUT)            43400010
MODNINTE EQU   X'04'                     INTERRUPT ENABLED              44100010
MODNMNTR EQU   X'02'                     ACTIVATE MONITOR TASK          44800010
MODNMNTP EQU   X'01'                     0-AUTOMATICALLY DEACTIVATE     45500010
*                                          MONITOR                      46200010
*                                        1-PERPETUAL MONITOR            46900010
         MEND  */                                                       47600010
*%PLSMODD : ;                                                           48300010
*DCL 1 IEDQMOD  BASED(RMOD),                                            49000010
*/*                                                                  */ 49700010
*/*      MODE DEVICE DEPENDENT FIELDS                                */ 50400010
*/*                                                                  */ 51100010
*      2 MODLNG   FIXED(8),             /* LENGTH OF MODE BYTE FIELDS   51800010
*                                        IN THE TTE DEVICE DEPENDENT    52500010
*                                        FIELDS                      */ 53200010
*      2 MODCUR   CHAR(2),              /* CURRENT MODE IN NCP       */ 53900010
*        3 MODCUR1  BIT(8),             /* CURRENT MODE BYTE 1       */ 54600010
*          4 *        BIT(1),           /*  RESERVED                 */ 55300010
*          4 MODCWERP BIT(1),           /*  OVERIDE WRT TXT MODE ERPS*/ 56000010
*          4 MODCRLGW BIT(1),           /*  REJECT LEADING GRAPHICS ON  56700010
*                                           WRITE OPERATIONS         */ 57400010
*          4 MODCEIBD BIT(1),           /*  EIB DELETION(NON-TRANS-     58100010
*                                           PARENT ONLY)             */ 58800010
*          4 *        BIT(1),           /*  RESERVED                 */ 59500010
*          4 MODCITFL BIT(1),           /*  INHIBIT TIME FILL/INHIBIT   60200010
*                                           WACK LINES               */ 60900010
*          4 MODCEMLC BIT(1),           /*  EMBEDDED LINE CONTROL(NON-  61600010
*                                           TRANSPARENT) INTERMEDIATE   62300010
*                                           CONTROL CHAR INSERTION   */ 63000010
*          4 MODCCTXT BIT(1),           /*  CRITICAL TEXT            */ 63700010
*        3 MODCUR2  BIT(8),             /* CURRENT MODE 2ND BYTE     */ 64400010
*          4 *        BIT(1),           /*  RESERVED                 */ 65100010
*          4 MODCRERP BIT(1),           /*  OVERIDE READ TXT MDE ERPS*/ 65800010
*          4 MODCRLGR BIT(1),           /*  REJECT LEADING GRAPHICS     66500010
*                                           ON READ OPERATIONS       */ 67200010
*          4 MODCEIBJ BIT(1),           /*  EIB INSERTION            */ 67900010
*            5 MODCINTO BIT(1),         /*   INHIBIT TEXT TIME OUTS  */ 68600010
*          4 MODCSUBB BIT(1),           /*  SUB-BLOCKING(INPUT)      */ 69300010
*          4 MODCINTE BIT(1),           /*  INTERRUPT ENABLED        */ 70000010
*          4 MODCMNTR BIT(1),           /*  ACTIVATE MONITOR TASK    */ 70700010
*          4 MODCMNTP BIT(1),           /*  0-AUTOMATICALLY DEACTIVATE  71400010
*                                             MONITOR                   72100010
*                                           1-PERPETUAL MONITOR      */ 72800010
*      2 MODNEW   CHAR(2),              /* NEW MODE IN NCP           */ 73500010
*        3 MODNEW1  BIT(8),             /* NEW MODE BYTE 1           */ 74200010
*          4 *        BIT(1),           /*  RESERVED                 */ 74900010
*          4 MODNWERP BIT(1),           /*  OVERIDE WRT TXT MODE ERPS*/ 75600010
*          4 MODNRLGW BIT(1),           /*  REJECT LEADING GRAPHICS ON  76300010
*                                           WRITE OPERATIONS         */ 77000010
*          4 MODNEIBD BIT(1),           /*  EIB DELETION(NON-TRANS-     77700010
*                                           PARENT ONLY)             */ 78400010
*          4 *        BIT(1),           /*  RESERVED                 */ 79100010
*          4 MODNITFL BIT(1),           /*  INHIBIT TIME FILL/INHIBIT   79800010
*                                           WACK LINES               */ 80500010
*          4 MODNEMLC BIT(1),           /*  EMBEDDED LINE CONTROL(NON-  81200010
*                                           TRANSPARENT) INTERMEDIATE   81900010
*                                           CONTROL CHAR INSERTION   */ 82600010
*          4 MODNCTXT BIT(1),           /*  CRITICAL TEXT            */ 83300010
*        3 MODNEW2  BIT(8),             /* NEW MODE 2ND BYTE         */ 84000010
*          4 *        BIT(1),           /*  RESERVED                 */ 84700010
*          4 MODNRERP BIT(1),           /*  OVERIDE READ TXT MDE ERPS*/ 85400010
*          4 MODNRLGR BIT(1),           /*  REJECT LEADING GRAPHICS     86100010
*                                           ON READ OPERATIONS       */ 86800010
*          4 MODNEIBJ BIT(1),           /*  EIB INSERTION            */ 87500010
*            5 MODNINTO BIT(1),         /*   INHIBIT TEXT TIME OUTS  */ 88200010
*          4 MODNSUBB BIT(1),           /*  SUB-BLOCKING(INPUT)      */ 88900010
*          4 MODNINTE BIT(1),           /*  INTERRUPT ENABLED        */ 89600010
*          4 MODNMNTR BIT(1),           /*  ACTIVATE MONITOR TASK    */ 90300010
*          4 MODNMNTP BIT(1);           /*  0-AUTOMATICALLY DEACTIVATE  91000010
*                                             MONITOR                   91700010
*                                           1-PERPETUAL MONITOR      */ 92400010
./  ADD  SSI=61260104,NAME=TMSKD
*        %GOTO PLSMSK;                  /* BILINGUAL HEADER             01000010
         MACRO                                                          02000010
         TMSKD                                                          03000010
         SPACE                                                          04000010
.* CHANGE ACTIVITY AS FOLLOWS:                                          05000010
.*A-000000-999999                                              @Y17XANU 06000010
IEDMSK   DSECT                                                          07000010
*                                                                       08000010
*        OPERATOR CONTROL TCHNG MASK DSECT                              09000010
*                                                                       10000010
MSKNUM   DS    H .                 NUMBER OF MASKS                      11000010
MSKMASK  DS    0XL2 .              PROTECTION MASK                      12000010
MSK1     DS    XL1 .                    MASK BYTE 1                     13000010
MSKBYTE1 EQU   X'FF' .                   USED TO CHECK IF BYTES 4-7     14000010
*                                        OF TTE ARE PROTECTED           15000010
MSKCNT   EQU   X'80' .                   CHECK TO ALLOW TLIST COUNT     17000010
*                                        MODIFICATION                   18000010
MSKLIST  EQU   X'40' .                   CHECK TO ALLOW TLIST ENTRIES   19000010
*                                        MODIFICATION                   20000010
*        EQU   X'20'-X'01' .             RESERVED                       20300010
MSK2     DS    XL1 .                    MASK BYTE 2                     20600010
MSKBYTE2 EQU   X'F0' .                   USED TO CHECK IF BYTES 8-F     21000010
*                                        OF TTE ARE PROTECTED           22000010
*        EQU   X'80'-X'10' .             RESERVED                       23000010
MSKOPT   EQU   X'08' .                   USED TO CHECK IF OPTION        23500010
*                                        FIELDS ARE PROTECTED           24000010
*                                        (MSKBYTE2)                     25000010
MSKDVDP  EQU   X'04' .                   USED TO CHECK IF DEVICE        26000010
*                                        DEPENDENT FIELDS ARE PROTECTED 27000010
*        EQU   X'02'-X'01' .             RESERVED                       27500010
*                                                                       28000010
*        THIS DSECT CONSISTS OF 9 MASKS, REPRESENTING 9 TTE TYPES,      29000010
*        IN THE FOLLOWING ORDER:                                        30000010
*                                                                       31000010
*              1 - 270X TERMINAL (DIAL, NON DIAL, LOG)                  32000010
*              2 - 3705 BSC/SS TERMINAL                                 33000010
*              3 - PU                                                   34000010
*              4 - LU                                                   35000010
*              5 - SSCP                                                 36000010
*              6 - NCP                                                  37000010
*              7 - 3705 LINE                                            38000010
*              8 - LIST                                                 39000010
*              9 - TPROCESS                                             40000010
*                                                                       41000010
MSKLEN   EQU   *-MSKMASK .              LENGTH OF MASK ENTRY            42000010
         MEND                                                           43000010
*        */                                                             44000010
*%PLSMSK: ;                                                             45000010
*DECLARE 1 IEDMSK BDY(WORD) BASED(IEDMSKP),                             46000010
*/*                                                                  */ 47000010
*/*      OPERATOR CONTROL TCHNG MASK DSECT                           */ 48000010
*/*                                                                  */ 49000010
*   2 MSKNUM FIXED(15),                 /* NUMBER OF MASKS           */ 50000010
*   2 MSKMASK CHAR(2),                  /* PROTECTION MASK           */ 51000010
*    3 MSK1 CHAR(1),                    /* MASK BYTE 1               */ 52000010
*     4 MSKCNT BIT(1),                   /* CHECK TO ALLOW TLIST COUNT  54000010
*                                           MODIFICATION             */ 55000010
*     4 MSKLIST BIT(1),                  /* CHECK TO ALLOW TLIST        56000010
*                                           ENTRIES MODIFICATION     */ 57000010
*     4 *       BIT(6),                  /* RESERVED                 */ 57300010
*    3 MSK2 CHAR(1),                    /* MASK BYTE 2               */ 57600010
*     4 *       BIT(4),                  /* RESERVED                 */ 58000010
*     4 MSKOPT  BIT(1),                  /* USED TO CHECK IF OPTION     59000010
*                                           FIELDS ARE PROTECTED        60000010
*                                           (MSKBYTE2)               */ 61000010
*     4 MSKDVDP BIT(1),                  /* USED TO CHECK IF DEVICE     62000010
*                                           DEPENDENT FIELDS ARE        63000010
*                                           PROTECTED                */ 64000010
*     4 *       BIT(2);                  /* RESERVED                 */ 65000010
*                                                                       66000010
* %MSKLEN='LENGTH(MSKMASK)';            /* LENGTH OF MASK ENTRY      */ 67000010
*                                                                       68000010
*/*                                                                  */ 69000010
*/*      CONSTANTS (MSK1)                                            */ 70000010
*/*                                                                  */ 71000010
*DCL MSKBYTE1 BIT(8) CONSTANT('FF'X);   /* USED TO CHECK IF BYTES 4-7   72000010
*                                          OF TTE ARE PROTECTED      */ 73000010
*/*                                                                  */ 74000010
*/*      CONSTANTS (MSK2)                                            */ 75000010
*/*                                                                  */ 76000010
*DCL MSKBYTE2 BIT(8) CONSTANT('F0'X);   /* USED TO CHECK IF BYTES 8-F   77000010
*                                          OF TTE ARE PROTECTED      */ 78000010
*/*      THIS DSECT CONSISTS OF 9 MASKS, REPRESENTING 9 TTE TYPES,   */ 79000010
*/*      IN THE FOLLOWING ORDER:                                     */ 80000010
*/*                                                                  */ 81000010
*/*            1 - 270X TERMINAL (DIAL, NON DIAL, LOG)               */ 82000010
*/*            2 - 3705 BSC/SS TERMINAL                              */ 83000010
*/*            3 - PU                                                */ 84000010
*/*            4 - LU                                                */ 85000010
*/*            5 - SSCP                                              */ 86000010
*/*            6 - NCP                                               */ 87000010
*/*            7 - 3705 LINE                                         */ 88000010
*/*            8 - LIST                                              */ 89000010
*/*            9 - TPROCESS                                          */ 90000010
*/*                                                                  */ 91000010
./  ADD  SSI=62120492,NAME=TNATD
*        %GOTO PLSNAT;                  /* BILINGUAL HEADER             03000010
         MACRO                                                          06000010
         TNATD                                                          09000010
         SPACE                                                          12000010
.* CHANGE ACTIVITY AS FOLLOWS:                                          15000010
.*A-000000-999999                                              @Y17XAXU 18000010
         SPACE                                                          21000010
IEDNATD  DSECT                                                          24000010
*                                                                       27000010
*        DSECT FOR NETWORK ADDRESS TABLE (NAT)                          30000010
*                                                                       33000010
NATODAF  DS    AL2 .                    NETWORK ADDRESS ENTRY           36000010
NATLEN   EQU   *-IEDNATD .              LENGTH OF NAT ENTRY             39000010
         SPACE 2                                                        42000010
         MEND                           */                              45000010
*%PLSNAT : ;                                                            48000010
*DECLARE                                                                51000010
*  1 IEDNATD BDY(WORD) BASED(IEDQNATP),                                 54000010
*/*                                                                  */ 57000010
*/*      DSECT FOR NETWORK ADDRESS TABLE                             */ 60000010
*/*                                                                  */ 63000010
*   2 NATODAF BIT(16);                  /* NETWORK ADDRESS ENTRY     */ 66000010
* %NATLEN='LENGTH(IEDNATD)';            /* LENGTH OF NAT ENTRY       */ 69000010
*                                                                       72000010
*%NATEND: ;                                                             75000010
*                                                                       78000010
./  ADD  SSI=62710406,NAME=TNRAD
*        %GOTO PLSNRA;                  /* BILINGUAL HEADER             00100010
         MACRO                                                          00200010
         TNRAD                                                          00300010
.*A000000-999999                                               @Y17XAXF 00400010
*                                                                       00500010
*        ASSEMBER VERSION OF DSECT NOT SUPPORTED                        00600010
*                                                                       00700010
         MEND  */                                                       00800010
*%PLSNRA:;                                                              00900010
*/*                                                                  */ 01000010
*/*      NEW DSECT FOR 3705 RESTART GETMAIN AREA                     */ 01100010
*/*                                                                  */ 01200010
* DECLARE                                                               01300010
* 1 IEDNRA BASED(RNRA),                                                 01400010
*  2 NRACURR  PTR(31),                  /*RESTART GETMAIN AREA       */ 01500010
*  2 NRASIZE  FIXED(32),                /*GETMAIN AREA SIZE          */ 01600010
*  2 NRAR1PTR PTR(31),                  /*READ1 AREA PTR             */ 01700010
*  2 NRAR2PTR PTR(31),                  /*READ2 AREA PTR             */ 01800010
*  2 NRAREAD  CHAR(*);                  /*READ AREA                  */ 01900010
./  ADD  SSI=60241443,NAME=TOPCD
         MACRO                                                          01000020
         TOPCD                                                          02000020
IEDQOPC  DSECT                                                          03000020
.*             VERSION DATED JULY 24, 1970                              04000020
OPCINPUT DS    A .                      ADDRESS OF INPUT DATA           05000020
OPCAVTAD DS    A .                      ADDRESS OF TCAM AVT             06000020
OPCDOUBL DS    D .                      DOUBLEWORD WORK AREA            07000020
OPCWORK  DS    A .                      FULLWORD WORK AREA              08000020
OPCEPS   DS    8X .                     EPLOC FOR C1                    09000020
         DS     3X                                                      10000020
OPCCOUNT DS    FL1 .                    COUNT OR RETURN CODE     STCAM4 11000010
OPCSAVE1 DS    18F .                    IEDQCA SAVE AREA                12000020
OPCSAVE2 DS    0FL10 .                  PARTIAL SAVE - WORK AREA STCAM4 12400010
         DS    8F .                                              STCAM4 12800010
OPCDATA  DS    F .                                               STCAM4 13200010
         DS    F .                                               STCAM4 13600010
OPCPPL   DS    8X .                     POST PARAMETER LIST - AQCTL     14000020
OPCSCAN  DS    A .                      ADDR OF IEDQCA02 - SCAN         15000020
OPCERMSG DS    49C .                    CANCEL COMMAND MESSAGE          16000020
OPCBITSW DS    X .                      OP CTL BIT SWITCHES             17000020
OPCCONSN EQU   X'80' .                  SOURCE IS CONSOLE               18000020
OPCMPPN  EQU   X'40' .                  SOURCE IS APPLICATION PROG      19000020
OPCMCPN  EQU   X'20' .                  SOURCE IS MSG CONTROL           20000020
OPCPROCN EQU   X'10' .                  PROCESS BIT                     21000020
OPCFRSTN EQU   X'08' .                  FIRST-TIME BIT                  23000020
OPCLCLN  EQU   X'04' .                  LOCAL WAIT BIT                  25000020
OPCQUCKN EQU   X'02' .                  ON - CLOSEDOWN IS QUICK         27000020
OPCTEMPN EQU   X'01' .                  WORK BIT                        29000020
OPCPROCF EQU   X'EF' .                                           STCAM4 29300010
OPCFRSTF EQU   X'F7' .                                           STCAM4 29600010
OPCCLCLF EQU   X'FB' .                                           STCAM4 29900010
OPCFLSHF EQU   X'FD' .                  OFF-FLUSH CLOSEDOWN      STCAM4 30200010
OPCTEMPF EQU   X'FE' .                                           STCAM4 30500010
         DS    X .                      ONE-BYTE WORK AREA - IEDQCA     31000020
OPCCKBIT DS    X .                      CHECKPOINT/RESTART BITS         32000020
OPCRSTN  EQU   X'80' .                  RESTART IN PROGRESS             33000020
OPCCKPTN EQU   X'40' .                  CHECKPOINT TO BE DONE           35000020
OPCINVN  EQU   X'20' .                  CHECKPOINT FOR INVLISTS         37000020
OPCRSTF  EQU   X'7F' .                                           STCAM4 37500010
OPCCKPTF EQU   X'BF' .                                           STCAM4 38000010
OPCINVF  EQU   X'DF' .                                           STCAM4 38500010
OPCCKELE DS    0CL32 .                  COMMON INPUT AREA        STCAM4 38590010
OPCED    DS    CL1 .                                             STCAM4 38680010
OPCIND   DS    FL1 .                                             STCAM4 38770010
OPCBIT1  DS    XL1 .                                             STCAM4 38860010
OPCBIT2  DS    XL1 .                                             STCAM4 38950010
OPCLEN   DS    FL1 .                                             STCAM4 39040010
OPCRLN   DS    CL3 .                                             STCAM4 39130010
OPCTNME  DS    CL8 .                                             STCAM4 39220010
OPCVBCD1 DS    CL1 .                                             STCAM4 39310010
OPCVBCD2 DS    CL1 .                                             STCAM4 39400010
OPCFLG   DS    XL1 .                                             STCAM4 39490010
OPCINFO  DS    XL1 .                                             STCAM4 39580010
OPCSNSE  DS    XL2 .                                             STCAM4 39670010
OPCOTHR  DS    CL2 .                                             STCAM4 39760010
OPCOPFLD DS    CL8 .                                             STCAM4 39850010
OPCMISC  DS    0X .                     MISCELLANEOUS DATA - IEDQCA     40000020
*                                                                       41000020
*              OPERATOR CONTROL EQUATES                                 42000020
*                                                                       43000020
OPCFOXES EQU   X'FF' .                                           STCAM4 44000010
OPCOSMOD EQU   X'44' .                  OS VERB CODE FOR MODIFY  STCAM4 45000010
OPCFIXT  EQU   X'2A' .                  1ST ENTRY OFFSET IN TNT  STCAM4 46000010
OPCTXTLN EQU   X'20' .                  LENGTH OF CIB            STCAM4 47000010
OPCREG1  EQU   X'18' .                  OFFSET TO REG1 IN S.A.   STCAM4 48000010
OPCFLUSH EQU   X'11' .                  FLUSH HALT CODE          STCAM4 49000010
OPCQUICK EQU   X'10' .                  QUICK HALT CODE          STCAM4 50000010
OPCTEN   EQU   X'0A' .                                           STCAM4 51000010
OPCNINE  EQU   X'09' .                                           STCAM4 52000010
OPCEIGHT EQU   X'08' .                  DOUBLE-WORD OFFSET       STCAM4 53000010
OPCSEVEN EQU   X'07' .                                           STCAM4 54000010
OPCSIX   EQU   X'06' .                                           STCAM4 55000010
OPCFIVE  EQU   X'05' .                                           STCAM4 56000010
OPCFOUR  EQU   X'04' .                  FULLWORD OFFSET          STCAM4 57000010
OPCTHREE EQU   X'03' .                                           STCAM4 58000010
OPCTWO   EQU   X'02' .                  HALFWORD OFFSET          STCAM4 59000010
OPCONE   EQU   X'01' .                  BYTE OFFSET, INITIAL CT. STCAM4 60000010
OPCZERO  EQU   X'00' .                                           STCAM4 61000010
         MEND                                                           79000020
./  ADD  SSI=60241446,NAME=TOPCTL
         MACRO                                                          10000020
         TOPCTL                                                         20000020
         SVC   104 .                    TCAM OPERATOR CONTROL ROUTINE   30000020
         MEND                                                           40000020
./  ADD  SSI=71080528,NAME=TPEBD
         MACRO                                                          03000006
         TPEBD                                                          06000006
IEDQPEB  DSECT                          PROCESS EXTENSION BLOCK         09000006
*                                                                       12000006
PEBLINK  DS    A                        LINK FIELD OF NEXT PEB          15000006
*                                       IN CHAIN                        18000006
PEBRCB   DS    2F                       RCB FOR TERMINATOR              21000006
PEBASID  DS    F                        ASID OF APP. PGM. TASK          24000006
PEBFLG   DS    0X                       A.P. ABEND; NO CMPOST           27000006
PEBASCB  DS    A                        ADDRESS OF ASCB FOR THIS        30000006
*                                       APPLICATION PROGRAM             33000006
PEBTCB   DS    A                        ADDRESS OF TCB FOR THIS         36000006
*                                       APPLICATION PROGRAM             39000006
PEBPCB   DS    A                        ADDRESS OF ASSOCIATED PCB       42000006
PEBPEWA  DS    F                        PEWA ADDR IF A.P. TERMINATING   42600006
PEBFLAG  DS    X                        PEB FLAG                        43200006
PEBTERM  EQU   X'80'                    A.P. IS TERMINATING             43800006
PEBCLOSE EQU   X'10'                    APPL PROG HAS POSTED            44400006
*                                       ELEMENT TO IEDQEU               44500006
PEBSPARE DS    3X                       UNUSED                          44600006
PEBECBA  DS    4X                       ECB ADDR FOR A.P. CLOSE         44700006
PEBEND   DS    0X                       SIZE OF                         45000006
PEBSIZE  EQU   PEBEND-IEDQPEB           PEB                             48000006
         MEND                                                           51000006
./  ADD  SSI=82370271,NAME=TPECBD
         MACRO                                                          03000006
         TPECBD                                                         06000006
*C150000                                                       @OZ07830 07000000
*A570000                                                       @OZ18744 07050000
IEDQPECB DSECT                          PROCESS ECB                     09000006
*                                                                       12000006
PECBECB  DS    F                        ELEMENT CONTROL BLOCK  @OZ07830 15000000
*                                       USED BY SVC 102 FOR A.P.        18000006
PECBPARM DS    F                        PARAMETER LIST FOR SVC          21000006
*                                       102                             24000006
PECBSAVE DS    A                        ADDRESS OF USER'S SAVE          27000006
*                                       AREA ON GET,PUT,OR POINT        30000006
PECBPUTF DS    FL1                      PUT FLAG                        33000006
FIRSTPUT EQU   X'01'                    FIRST TIME PUT/LOCATE           36000006
PECBRET  DS    AL3                      ADDRESS OF USER'S               39000006
*                                       RETURN ON CHECK                 42000006
PECBERR  DS    0F                       ERROR CODE                      45000006
PECBSTAT DS    20X                      STATUS FOR SYNAD                48000006
         ORG   PECBSTAT                                                 48500006
PECBSA   DS    18F                      SAVE AREA FOR A.P. CK/PT        49500006
PECBFLAG EQU   PECBSTAT+4               FLAG FOR CHECKPOINT AND         51000006
*                                       MESSAGE STATUS                  54000006
PECBSAVA EQU   PECBSTAT+4               SAVE AREA FOR EXITS             57000006
PECBOPTC DS    FL1                      X'40' DELETE=YES TPDATE@OZ18744 57050000
PECBDTSA DS    AL3                      USER DTSA - TPDATE     @OZ18744 57100000
PECBEND  DS    0X                       END OF BLOCK                    60000006
PECBSIZE EQU   PECBEND-IEDQPECB         SIZE OF PECB                    63000006
         MEND                                                           66000006
./  ADD  SSI=71640512,NAME=TPF1D
*        %GOTO PF1PLS;                  /* BILINGUAL HEADER             01000000
         MACRO                                                          02000000
         TPF1D                                                          03000000
.*A000000-999999                                               @Y17XAXF 04000000
IEDPF1   DSECT                                                          05000000
*                                                                       06000000
*        DSECT FOR BUFFER PREFIX                                        07000000
*                                                                       08000000
PF1RH    DS    CL3 .                    RH                              09000000
PF1FLAGS DS    CL1 .                    FLAG BYTE                       10000000
PF1FIDI  EQU   X'80' .                   FID INDICATOR                  11000000
PF1EXPI  EQU   X'40' .                   EXPIDITED/NORMAL INDICATOR     12000000
*PF1FORM       BITS 2&3                  DESCRIBES 2ND WORD OF PREFIX   13000000
PF1PTRI  EQU   X'20' .                    PF1SEQP IS PRESENT            14000000
PF1IDI   EQU   X'10' .                    PF1SEQID ONLY IS PRESENT      15000000
PF1SEQRI EQU   X'30'                      PF1SEQID AND PF1RULEN PRESENT 16000000
*        EQU   X'08'-X'01' .             RESERVED                       17000000
PF1WORD2 DS    0AL4 .                   2ND WORD FORMATED AS INDICATED  18000000
*                                        IN PF1FORM                     19000000
PF1SEQP  DS    0AL4 .                   PTR TO AN AREA INTO WHICH THE   20000000
*                                        ASSIGNED SEQ# WILL BE          21000000
*                                        STORED(FID1 ONLY)              22000000
PF1SEQID DS    CL2 .                    FOR FID1 - SEQ# OR ID           23000000
*                                           FID0 - IND                  24000000
PF1RULEN DS    CL2 .                    FOR FID1 ONLY - CONTAINS LENGTH 25000000
*                                        OF RU(DATA) ON 0 LENGTH ERROR  26000000
*                                        BUFFERS                        27000000
PF1LEN   EQU   *-IEDPF1 .               LENGTH OF THIS PREFIX           28000000
         MEND                                                           29000000
*        */                                                             30000000
*%PF1PLS:;                                                              31000000
*DECLARE                                                                32000000
*  1 IEDPF1 BASED BDY(WORD),                                            33000000
*/*                                                                  */ 34000000
*/*      DSECT FOR BUFFER PREFIX                                     */ 35000000
*/*                                                                  */ 36000000
*    2 PF1RH    CHAR(3),                /* RH                        */ 37000000
*    2 PF1FLAGS CHAR(1),                /* FLAG BYTE                 */ 38000000
*      3 PF1FIDI BIT(1),                /*  FID INDICATOR            */ 39000000
*      3 PF1EXPI BIT(1),                /*  EXPEDITED/NORMAL IND     */ 40000000
*      3 PF1FORM BIT(2),                /*  DESCRIBES 2ND WORD OF PF1*/ 41000000
*      3 *       BIT(4),                /*  RESERVED                 */ 42000000
*    2 PF1WORD2 PTR(32),                /* 2ND WORD FORMATED AS      */ 43000000
*                                       /*  INDICATED IN PF1FORM     */ 44000000
*      4 PF1SEQP  PTR(32),              /* PTR TO AN AREA INTO WHICH */ 45000000
*                                       /*  THE ASSIGNED SEQ# WILL BE*/ 46000000
*                                       /*  STORED(FID1 ONLY)        */ 47000000
*        5 PF1SEQID BIT(16),            /* FOR FID1 - SEQ# OR ID     */ 48000000
*                                       /*     FID0 - IND            */ 49000000
*        5 PF1RULEN BIT(16);            /* FOR FID1 ONLY - CONTAINS  */ 50000000
*                                       /*  LEN OF RU(DATA) ON 0     */ 51000000
*                                       /*  LENGTH ERROR BUFFERS     */ 52000000
* %PF1LEN='LENGTH(IEDPF1)';             /* LENGTH OF THIS PREFIX     */ 53000000
*/* PF1FORM VALUES                                                   */ 54000000
* DCL PF1IDI   BIT(2) CONSTANT('01'B);  /* PF1SEQP IS PRESENT        */ 55000000
* DCL PF1PTRI  BIT(2) CONSTANT('10'B);  /* PF1SEQID ONLY IS PRESENT  */ 56000000
* DCL PF1SEQRI BIT(2) CONSTANT('11'B);  /* PF1SEQID & PF1RULEN ARE   */ 57000000
./  ADD  SSI=61050127,NAME=TPIU0D
*        %GOTO PIU0PLS;                /* BILINGUAL HEADER              03000010
         MACRO                                                          06000010
         TPIU0D                                                         09000010
.*A000000-999999                                               @Y17XAXF 12000010
IEDPIU0  DSECT                                                          15000010
*                                                                       18000010
*        FORMAT OF FIDO PIU                                             21000010
*                                                                       24000010
PIU0TH   DS    CL10 .                   TH AREA                         27000010
PIU0RH   DS    CL3 .                    RH AREA                         30000010
PIU0PAD  DS    CL1 .                    FID0 PAD BYTE                   33000010
PIU0PAD0 EQU   X'00' .                   PAD CONSTANT                   36000010
PIU0RU   EQU   * .                      START OF RU DATA                39000010
PIU0LEN  EQU   *-IEDPIU0                LEN OF PIU                      42000010
         MEND                                                           45000010
*        */                                                             48000010
*%PIU0PLS:;                                                             51000010
*DECLARE                                                                54000010
*  1 IEDPIU0 BASED BDY(BYTE),                                           57000010
*/*                                                                  */ 60000010
*/*      FORMAT OF FID0 PIU                                          */ 63000010
*/*                                                                  */ 66000010
*   2 PIU0TH   CHAR(10),                /* TH AREA                   */ 69000010
*   2 PIU0RH   CHAR(3),                 /* RH AREA                   */ 72000010
*   2 PIU0PAD  CHAR(1),                 /* FID0 PAD BYTE             */ 75000010
*   2 PIU0RU   CHAR(0);                 /* START OF RU AREA          */ 78000010
*%PIU0LEN='LENGTH(IEDPIU0)';            /* LENGTH OF PIU             */ 81000010
* DCL PIU0PAD0 BIT(8) CONSTANT('00'X);  /* FID0 PAD CONSTANT         */ 84000010
./  ADD  SSI=60710712,NAME=TPLRQD
*        %GOTO PLSPLRQ;                 /* BILINGUAL HEADER             02000010
         MACRO                                                          04000010
         TPLRQD                                                         06000010
         SPACE                                                          08000010
.* CHANGE ACTIVITY AS FOLLOWS:                                          10000010
.*A-000000-999999                                              @Y17XAXU 12000010
IEDPLRQ  DSECT                                                          14000010
*                                                                       16000010
*        DSECT FOR REQUEST PARAMETER LIST                               18000010
*                                                                       20000010
PLRQBFR  DS    A .                      BUFFER ADDRESS                  22000010
PLRQOAF  DS    H .                      ORIGIN TNT OFFSET               24000010
PLRQDAF  DS    H .                      DESTINATION TNT OFFSET          26000010
PLRQLNTH DS    XL1 .                    LENGTH OF COMMAND CODE          28000010
PLRQCMD  DS    0CL3 .                   COMMAND CODE                    30000010
PLRQCMD1 DS    CL1 .                    COMMAND CODE - BYTE 1           32000010
PLRQCMD2 DS    CL1 .                    COMMAND CODE - BYTE 2           34000010
PLRQCMD3 DS    CL1 .                    COMMAND CODE - BYTE 3           36000010
PLRQLEN  EQU   *-IEDPLRQ .              LENGTH OF P-LIST                38000010
         MEND                                                           40000010
*        */                                                             42000010
*%PLSPLRQ: ;                                                            44000010
*DECLARE 1 IEDPLRQ BDY(WORD) BASED(IEDPLRQP),                           46000010
*/*                                                                  */ 48000010
*/*      DSECT FOR REQUEST PARAMETER LIST                            */ 50000010
*/*                                                                  */ 52000010
*   2 PLRQBFR    PTR(31),               /* BUFFER ADDRESS            */ 54000010
*   2 PLRQOAF    FIXED(15),             /* ORIGIN TNT OFFSET         */ 56000010
*   2 PLRQDAF    FIXED(15),             /* DESTINATON TNT OFFSET     */ 58000010
*   2 PLRQLNTH   FIXED(8),              /* LENGTH OF COMMAND CODE    */ 60000010
*   2 PLRQCMD    CHAR(3),               /* COMMAND CODE              */ 62000010
*    3 PLRQCMD1  CHAR(1),               /* COMMAND CODE - BYTE 1     */ 64000010
*    3 PLRQCMD2  CHAR(1),               /* COMMAND CODE - BYTE 2     */ 66000010
*    3 PLRQCMD3  CHAR(1);               /* COMMAND CODE - BYTE 3     */ 68000010
*                                                                       70000010
* %PLRQLEN='LENGTH(IEDPLRQ)';           /* LENGTH OF PLIST           */ 72000010
./  ADD  SSI=62470491,NAME=TRDYD
*        %GOTO PLSRDY;                  /*                              02000010
         MACRO                                                          04000010
         TRDYD                                                          06000010
.*A000000-999999                                               @Y17XAXF 08000010
*                                                                       10000010
*        FORMAT OF READY MACRO GENERATION                               12000010
*                                                                       14000010
IEDRDY   DSECT                                                          16000010
RDYGMMA  DS    A                        GOOD MORNING MESSAGE            18000010
*                                        ROUTINE ADDRESS                20000010
RDYRSMA  DS    A                        RESTART MESSAGE                 22000010
*                                        ROUTINE ADDRESS                24000010
RDYPURGA DS    A                        PURGE EXIT ROUTINE              26000010
*                                        ADDRESS                        28000010
RDYPRIA  DS    A                        PRIORITY EXIT ROUTINE           30000010
*                                        ADDRESS                        32000010
RDYFLAGS DS    XL1                      FLAG BYTE                       34000010
RDYOPEND EQU   X'80'                     OPENCHK=OPEN SPECIFIED         36000010
RDYOPENI EQU   X'40'                     OPENCHK=IDLE SPECIFIED         38000010
*        EQU   X'20'-X'01'               RESERVED                       40000010
         DS    XL3                      RESERVED                        42000010
         MEND  */                                                       44000010
*%PLSRDY : ;                                                            46000010
*/*                                                                  */ 48000010
*/*      FORMAT OF READY MACRO GENERATION                            */ 50000010
*/*                                                                  */ 52000010
* DECLARE                                                               54000010
* 1 IEDRDY BASED(AVTRDYA),                                              56000010
*  2 RDYGMMA  PTR(31),                  /* GOOD MORNING MESSAGE         58000010
*                                          ROUTINE ADDRESS           */ 60000010
*  2 RDYRSMA  PTR(31),                  /* RESTART MESSAGE              62000010
*                                          ROUTINE ADDRESS           */ 64000010
*  2 RDYPURGA PTR(31),                  /* PURGE EXIT ROUTINE           66000010
*                                          ADDRESS                   */ 68000010
*  2 RDYPRIA  PTR(31),                  /* PIORITY EXIT ROUTINE         70000010
*                                          ADDRESS                   */ 72000010
*  2 RDYFLAGS BIT(8),                   /* FLAG BYTE                 */ 74000010
*   3 RDYOPEND BIT(1),                  /*  OPENCHK=OPEN SPECIFIED   */ 76000010
*   3 RDYOPENI BIT(1),                  /*  OPENCHK=IDLE SPECIFIED   */ 78000010
*   3 *        BIT(6),                  /*  RESERVED                 */ 80000010
*  2 *       CHAR(3);                   /* RESERVED                 */  82000010
./  ADD  SSI=10630647,NAME=TRQED
*        %GOTO PLSRQE;                                                  00050028
*/***************************************************************@N1A*/ 00100028
*/*                                                              @N1A*/ 00150028
*/* $MAC(TRQED) COMP(X@) PROD(TCAM):                             @N1A*/ 00200028
*/*                                                              @N1A*/ 00250028
*/* COPYRIGHT = 5735-RC3 COPYRIGHT IBM CORP. 1981                @N1A*/ 00300028
*/*    LICENSED MATERIAL - PROGRAM PROPERTY OF IBM               @N1A*/ 00350028
*/*    REFER TO COPYRIGHT INSTRUCTIONS FORM NUMBER G120-2083.    @N1A*/ 00400028
*/*                                                              @N1A*/ 00450028
*/* STATUS = ACF/TCAM VERSION 2 RELEASE 4                        @N1A*/ 00500028
*/*                                                              @N1A*/ 00550028
*/* CHANGE ACTIVITY =                                            @N1A*/ 00600028
*/* A000000,999999                                           @Y17XAXF*/ 00650028
*/* $N1=LF       JTC2412  80.10.17 098061:                       @N1A*/ 00700028
*/***************************************************************@N1A*/ 00750028
*                                   /* BILINGUAL HEADER                 00800028
         MACRO                                                          06000000
         TRQED                                                          09000000
IEDRQE   DSECT                                                     @N1A 09050028
RQEUCB   DS    A                       ADDRESS OF UCB              @N1A 09100028
RQETCB   DS    XL1                     TASK ID                     @N1A 09150028
RQEIOB   DS    AL3                     ADDRESS OF IOB              @N1A 09200028
RQEPR    DS    XL1                     PRIORITY                    @N1A 09250028
RQEDEB   DS    AL3                     ADDRESS OF DEB              @N1A 09300028
RQEKEY   DS    XL1                     REQUESTER'S PROTECTION KEY  @N1A 09350028
RQETCBAD DS    AL3                     ADDRESS OF TCB              @N1A 09400028
RQEHDR   DS    A                       CCW TRANSLATION FLAGS AND   @N1A 09450028
*                                         HEADER ADDRESS           @N1A 09500028
         MEND  */                                                       24000000
*%PLSRQE:;                                                              27000000
*/*                                                                  */ 30000000
*/*      RQE PREFIX DSECT                                            */ 33000000
*/*                                                                  */ 36000000
* DECLARE                                                               39000000
* 1 IEDRQE BASED(RRQE),                                                 42000000
*  2 RQEUCB   PTR(31),                  /* ADDRESS OF UCB        @N1C*/ 42050028
*  2 RQETCB   FIXED(8),                 /* TASK ID                   */ 51000000
*  2 RQEIOB   PTR(24),                  /* ADDRESS OF IOB            */ 54000000
*  2 RQEPR    FIXED(8),                 /* PRIORITY                  */ 57000000
*  2 RQEDEB   PTR(24),                  /* ADDRESS OF DEB            */ 60000000
*  2 RQEKEY   FIXED(8),                 /* REQUESTER'S PROTECTION KEY*/ 63000000
*  2 RQETCBAD PTR(24),                  /* ADDRESS OF TCB            */ 66000000
*  2 RQEHDR   PTR(31);                  /* CCW TRANSLATION FLAGS AND    69000000
*                                          HEADER ADDRESS            */ 72000000
./  ADD  SSI=60840020,NAME=TSATD
*        %GOTO PLSSAT;                  /* BILINGUAL HEADER             03000010
         MACRO                                                          06000010
         TSATD                                                          09000010
         SPACE                                                          12000010
.* CHANGE ACTIVITY AS FOLLOWS:                                          15000010
.*A000000-999999                                               @Y17XAXU 18000010
         SPACE                                                          21000010
IEDSATD  DSECT                                                          24000010
*                                                                       27000010
*        DSECT FOR SUBAREA TABLE (SAT)                                  30000010
*                                                                       33000010
SATRNLCB DS    A .                      IMMEDIATE 3705 LCB              36000010
SATRNRVT DS    A .                      ADDRESS OF 3705 RVT             39000010
SATLEN   EQU   *-IEDSATD                LENGTH OF SAT ENTRY             42000010
         SPACE 2                                                        45000010
         MEND                           */                              48000010
*%PLSSAT : ;                                                            51000010
*DECLARE                                                                54000010
*  1 IEDSATD BDY(WORD) BASED(IEDQSATP),                                 57000010
*/*                                                                  */ 60000010
*/*      DSECT FOR SUBAREA TABLE (SAT)                               */ 63000010
*/*                                                                  */ 66000010
*   2 SATRNLCB PTR(31),                 /* IMMEDIATE 3705 LCB        */ 69000010
*   2 SATRNRVT PTR(31);                 /* 3705 RVT ADDRESS          */ 72000010
* %SATLEN='LENGTH(IEDSATD)';            /* LENGTH OF SAT ENTRY       */ 75000010
*                                                                       78000010
*%SATEND: ;                                                             81000010
*                                                                       84000010
./  ADD  SSI=70210322,NAME=TSBTD
*        %GOTO PLSSBT;                  /* BILINGUAL HEADER             01000010
         MACRO                                                          02000010
         TSBTD                                                          03000010
IEDQSBTD DSECT                                                          04000010
.* A000000-999999                                              @YM07020 05000010
SBTFLAGS DS    X                        FUNCTION FLAGS                  06000010
SBTECBN  EQU   X'80'                    REQUEST ECB POST WHEN COMPLETE  07000010
SBTBFRTN EQU   X'40'                    RETURN BFR CONTAINING PARM      08000010
*                                        LIST TO BFR RETURN WHEN        09000010
*                                        COMPLETE                       10000010
SBTOI    EQU   X'20'                    PERFORM OR FUNCTION             11000010
SBTNI    EQU   X'10'                    PERFORM AND FUNCTION            12000010
*              X'08'-X'01'              RESERVED                        13000010
SBTQCBA  DS    AL3                      QCB ADDRESS                     14000010
SBTPRI   DS    X                        PRIORITY                        15000010
SBTLINK  DS    AL3                      LINK FIELD                      16000010
         DS    A                        BUFFER TIC FIELD                17000010
SBTDATA  DS    X                        BIT CONFIGURATION FOR OR/AND    18000010
*                                        FUNCTION                       19000010
SBTADDR  DS    AL3                      ADDRESS OF BYTE FOR OR/AND      20000010
*                                        FUNCTION                       21000010
SBTECB   DS    A                        OPTIONAL ECB FOR POST           22000010
         MEND  ,   */                                                   23000010
*%PLSSBT:  ;                                                            24000010
*DECLARE                                /* IEDQSBT PARAMETER LIST    */ 25000010
*  1 IEDQSBTD  BASED(IEDQSBTR),         /* PARM LIST                 */ 26000010
*   2 SBTFLAGS     BIT(8),              /* FUNCTION FLAGS            */ 27000010
*    3 SBTECBN      BIT(1),             /* REQUEST ECB POST WHEN        28000010
*                                          COMPLETE                  */ 29000010
*    3 SBTBFRTN     BIT(1),             /* RETURN BFR CONTAINING PARM   30000010
*                                          LIST TO BFR RETURN WHEN      31000010
*                                          COMPLETE                  */ 32000010
*    3 SBTOI        BIT(1),             /* PERFORM OR FUNCTION       */ 33000010
*    3 SBTNI        BIT(1),             /* PERFORM AND FUNCTION      */ 34000010
*    3 *            BIT(4),             /* RESERVED                  */ 35000010
*                                                                       36000010
*   2 SBTQCBA      PTR(24),             /* QCB ADDRESS               */ 37000010
*                                                                       38000010
*   2 SBTPRI       CHAR(1),             /* PRIORITY                  */ 39000010
*   2 SBTLINK      PTR(24),             /* LINK FIELD                */ 40000010
*                                                                       41000010
*   2 *            PTR(31),             /* BUFFER TIC FIELD          */ 42000010
*                                                                       43000010
*   2 SBTDATA      BIT(8),              /* BIT CONFIGURATION FOR        44000010
*                                          OR/AND FUNCTION           */ 45000010
*   2 SBTADDR      PTR(24),             /* ADDRESS OF BYTE FOR          46000010
*                                          OR/AND FUNCTION           */ 47000010
*   2 SBTECB       PTR(31);             /* OPTIONAL ECB FOR POST     */ 48000010
*                                                                       49000010
*                                                                       50000010
./  ADD  SSI=61970031,NAME=TSOECDD
*        %GOTO PLSTSOEC;       /*                                       01000010
         MACRO                                                          02000010
         TSOECDD                                                        04000010
*   ENTRY FROM SEND SCHEDULER OR DESTINATION SCHEDULER ON QCB POST      05000010
TSOA01   EQU   1                                                        12000010
*   ENTRY FROM SEND SCHEDULER ON PLCB POST                              13000010
TSOA02   EQU   2                                                        16000010
*   ENTRY FROM RECEIVE SCHEDULER ON PLCB POST                           17000010
TSOA03   EQU   3                                                        20000010
         MEND  */                                                       20200010
*%PLSTSOEC : ;                                                          20400010
*/*  ENTRY FROM SEND SCHEDULER OR DESTINATION SCHEDULER ON QCB POST  */ 20600010
* DCL TSOA01   FIXED(8) CONSTANT(1);                                    20800010
*/*  ENTRY FROM SEND SCHEDULER ON PLCB POST                          */ 21000010
* DCL TSOA02   FIXED(8) CONSTANT(2);                                    21200010
*/*  ENTRY FROM RECEIVE SCHEDULER ON PLCB POST                       */ 21400010
* DCL TSOA03   FIXED(8) CONSTANT(3);                                    21600010
./  ADD  SSI=70110500,NAME=TSTMHD
*        %GOTO STMHPLS;                 /* BILINGUAL HEADER             01000010
         MACRO                                                          02000010
         TSTMHD &DSECT=YES                                              03000010
.*A000000-999999                                               @Y17XAXF 04000010
         AIF   ('&DSECT' EQ 'YES').STMH001   IS DSECT STATEMENT REQ?    05000010
IEDSTMH  DS    0F                                                       06000010
         AGO   .STMH002                                                 07000010
.STMH001 ANOP                                                           08000010
IEDSTMH  DSECT                                                          09000010
         DS    0F                                                       10000010
.STMH002 ANOP                                                           11000010
*                                                                       12000010
*        DSECT FOR STARTMH GENERATION                                   13000010
*                                                                       14000010
STMHALT  DS    AL4 .               ALTERNATE MH ADDR                    15000010
STMHFLG2 DS    XL1 .               MH FLAGS                             16000010
STMHLCIN EQU   X'80' .                  LINE CONTROL IN                 17000010
STMHCONT EQU   X'40' .                  CONT= SPECIFIED                 18000010
STMHSTC  EQU   X'20' .                  CONT= OR STOP= SPECIFIED OPTION 19000010
STMHCONV EQU   X'10' .                  CONV= SPECIFIED                 20000010
STMHCOP  EQU   X'08' .                  CONV= SPECIFIED OPTION FIELD    21000010
STMHLOG  EQU   X'04' .                  LOGICAL= SPECIFIED              22000010
STMHLOP  EQU   X'02' .                  LOGICAL= SPECIFIED 2ND OPTION   23000010
STMHTSFG EQU   X'01' .                  TSO FLAG                        24000010
STMHTSO  DS    AL3 .               TSO REENTRY ADDR                     25000010
STMHLENG DS    AL1 .               PARAMETER LIST LENGTH                26000010
STMHSTCB DS    AL3 .               STCB ADDRESS                         27000010
STMHAEIX DS    XL1 .               OFFSET TO LOCOPT IF REQ              28000010
STMHLMDO EQU   X'02' .              LMD SPECIFIED IN OPTION             29000010
STMHLMD  EQU   X'01' .              LMD SPECIFIED                       30000010
STMHROUT DS    AL3 .               ADDRESS OF STARTMH STCB              31000010
STMHLOPO DS    AL1 .               POINTER TO LOGICAL= OPTION           32000010
STMHLMOP DS    0AL1 .              OPTION FIELD INDEX                   33000010
STMHCOPO DS    AL1 .               POINTER TO CONV= OPTION              34000010
STMHOPT  EQU   * .                 START OF OPTION POINTERS             35000010
STMHLEN  EQU   *-IEDSTMH .         LENGTH OF DSECT                      36000010
         MEND                                                           37000010
*                                                                    */ 38000010
*%STMHPLS:;                                                             39000010
*        %IF STMHLEN¬=''                /* IS DCL STATEMENT REQUIRED */ 40000010
*          %THEN %GOTO STMHPLS1;                                        41000010
*DECLARE                                                                42000010
*  1 IEDSTMH  BASED BDY(WORD),                                          43000010
*        %GOTO STMHPLS2;                                                44000010
*%STMHPLS1:;                                                            45000010
*    2 IEDSTMH  CHAR(9) BDY(WORD),                                      46000010
*%STMHPLS2:;                                                            47000010
*/*                                                                  */ 48000010
*/*      DSECT FOR STARTMH GENERATION                                */ 49000010
*/*                                                                  */ 50000010
*      3 STMHALT  PTR(31),              /* ALTENTAE MH ADDR          */ 51000010
*      3 STMHFLG2 CHAR(1),              /* MH FLAGS                  */ 52000010
*        4 STMHLCIN BIT(1),             /*   LINE CONTROL IN         */ 53000010
*        4 STMHCONT BIT(1),             /*   CONT= SPECIFIED         */ 54000010
*        4 STMHSTC  BIT(1),             /*   CONT= OR STOP= SPEC OPT */ 55000010
*        4 STMHCONV BIT(1),             /*   CONV= SPECIFIED         */ 56000010
*        4 STMHCOP  BIT(1),             /*   CONV= SPECIFIED OPT FLD */ 57000010
*        4 STMHLOG  BIT(1),             /*   LOGICAL= SPECIFIED      */ 58000010
*        4 STMHLOP  BIT(1),             /*   LOGICAL= SPEC 2ND OPTION*/ 59000010
*        4 STMHTSFG BIT(1),             /*   TSO FLAG                */ 60000010
*      3 STMHTSO PTR(24),               /* TSO REENTRY ADDR          */ 61000010
*      3 STMHLENG CHAR(1),              /* PARAMETER LIST LENGTH     */ 62000010
*      3 STMHSTCB PTR(24),              /* STCB ADDRESS              */ 63000010
*      3 STMHAEIX BIT(8),               /* OFFSET TO LOCOPT IF REQ   */ 64000010
*        4 *        BIT(6),             /*  RESERVED                 */ 65000010
*        4 STMHLMDO BIT(1),             /*  LMD SPEC IF OPTION       */ 66000010
*        4 STMHLMD  BIT(1),             /*  LMD SPECIFIED            */ 67000010
*      3 STMHROUT PTR(24),              /* ADDR OF STARTMH STCB      */ 68000010
*      3 STMHLOPO PTR(8),               /* PTR TO LOGICAL OPTION     */ 69000010
*      3 STMHLMOP PTR(8),               /* OPTION FIELD INDEX        */ 70000010
*        4 STMHCOPO PTR(8),             /*  PTR TO CONV= OPT         */ 71000010
*      3 STMHOPT CHAR(0);               /* START OF OPTION FLD PTRS  */ 72000010
* %STMHLEN='LENGTH(IEDSTMH)';           /* LEN OF DSECT              */ 73000010
./  ADD  SSI=70110504,NAME=TTCDSD
*        %GOTO PLSTCDS;           /* BILINGUAL HEADER                   01000010
         MACRO                                                          02000010
         TTCDSD                                                         03000010
         SPACE                                                          04000010
.* CHANGE ACTIVITY AS FOLLOWS:                                          05000010
.*A000000-999999                                               @Y17XAX0 05500010
         SPACE                                                          07000010
IEDTCDSD DSECT                                                          08000010
*                                                                       09000010
*        3705 RESOURCE CDS MAP                                          10000010
*                                                                       11000010
TCDSUCB  DS    CL4 .              CHANNEL ADDRESS                       12000010
TCDSFLG1 DS    XL1 .              TERMINAL FLAGS                        13000010
TCDSFEAT DS    XL1 .              FEATURE FLAG                          14000010
TCDSASCI EQU   X'80' .            ASCII CODE                            15000010
TCDSCLS  DS    XL1 .              CLASS                                 16000010
TCDSCL37 EQU   X'44' .            3705 RESOURCE CLASS                   17000010
TCDSTYP  DS    XL1 .              TYPE                                  18000010
TCDSTY37 EQU   X'20' .            3705 RESOURCE TYPE                    19000010
TCDSCNT  DS    XL1 .              CDS BYTE COUNT                        20000010
TCDSSNA  EQU   X'18' .            CDS BYTE COUNT FOR LU                 21000010
TCDSLINK EQU   X'24' .            CDS BYTE COUNT FOR LINK               22000010
TCDSFLG2 DS    XL1 .              FLAGS                                 22500010
TCDSSEC  EQU   X'0A'              SECURITY FLAGS                        24000010
         DS    XL2 .              RESERVED                              25000010
TCDSNAM  DS    CL8 .              3705 RESOURCE SYMBOLIC NAME           26000010
         DS    0XL4 .             RESERVED                              27000010
*        END OF 3767/3770 CDS MAP                                       28000010
*        LINE CDS MAPPING CONTINUES BELOW                               29000010
TCDSFXAR DS    XL1 .              OLTT CONTROL PROGRAM FIXED AREA LEN   30000010
TCDSFXLN EQU   X'10' .            LENGTH                                31000010
TCDSFLG3 DS    XL1 .              RESERVED                              32000010
TCDSFLG4 DS    XL1 .              RESERVED                              33000010
         DS    XL1 .              RESERVED                              34000010
TCDSDAF  DS    XL2 .              NETWORK ADDRESS                       35000010
         DS    XL2 .              RESERVED                              36000010
TCDSDEVT DS    XL1 .              DEVICE TYPE                           37000010
TCDSDVT  EQU   X'E0' .            LINE TYPE                             38000010
TCDSLNC  DS    XL1 .              LINE CONTROL                          39000010
TCDSLNCD DS    XL1 .              LINE CODE                             40000010
         DS    XL5 .              RESERVED                              41000010
         SPACE 2                                                        42000010
         MEND                     */                                    43000010
*%PLSTCDS : ;                                                           44000010
*DECLARE                                                                45000010
*  1 IEDTCDSD BDY(BYTE) BASED,                                          46000010
*/*                                                                  */ 47000010
*/*      3705 RESOURCE CDS MAP                                       */ 48000010
*/*                                                                  */ 49000010
*   3 TCDSUCB CHAR(4),            /* CHANNEL ADDRESS                 */ 50000010
*   3 TCDSFLG1 CHAR(1),           /* TERMINAL FLAGS                  */ 51000010
*   3 TCDSFEAT CHAR(1),           /* FEATURE FLAG                    */ 52000010
*   3 TCDSCLS CHAR(1),            /* CLASS                           */ 53000010
*   3 TCDSTYP CHAR(1),            /* TYPE                            */ 54000010
*   3 TCDSCNT CHAR(1),            /* CDS BYTE COUNT                  */ 55000010
*   3 TCDSFLG2 CHAR(1),           /* FLAGS                           */ 56000010
*   3 * CHAR(2),                  /* RESERVED                        */ 57000010
*   3 TCDSNAM CHAR(8),            /* 3705 RESOURCE SYMBOLIC NAME     */ 58000010
*   3 * CHAR(4),                  /* RESERVED                        */ 59000010
*/*      END OF 3767/3770 CDS MAP                                    */ 60000010
*/*      LINE CDS MAPPING CONTINUES BELOW                            */ 61000010
*    4 TCDSFXAR CHAR(1),          /* OLTT CONTROL PROGRAM FIXED AREA    62000010
*                                    LENGTH                          */ 63000010
*    4 TCDSFLG3 CHAR(1),          /* RESERVED                        */ 64000010
*    4 TCDSFLG4 CHAR(1),          /* RESERVED                        */ 65000010
*    4 * CHAR(1),                 /* RESERVED                        */ 66000010
*   3 TCDSDAF CHAR(2),            /* NETWORK ADDRESS                 */ 67000010
*   3 * CHAR(2),                  /* RESERVED                        */ 68000010
*   3 TCDSDEVT CHAR(1),           /* DEVICE TYPE                     */ 69000010
*   3 TCDSLNC CHAR(1),            /* LINE CODE                       */ 70000010
*   3 TCDSLNCD CHAR(1),           /* LINE CODE                       */ 71000010
*   3 * CHAR(5);                  /* RESERVED                        */ 72000010
*DECLARE TCDSASCI BIT(8) CONSTANT('80'X); /*ASCII CODE               */ 73000010
*DECLARE TCDSCL37 BIT(8) CONSTANT('44'X); /* 3705 RESOURCE CLASS     */ 74000010
*DECLARE TCDSTY37 BIT(8) CONSTANT('20'X); /* 3705 RESOURCE TYPE      */ 75000010
*DECLARE TCDSLINK BIT(8) CONSTANT('24'); /* LINK CDS BYTE COUNT      */ 76000010
*DECLARE TCDSSNA BIT(8) CONSTANT('18'X); /* LU CDS BYTE COUNT        */ 77000010
*DECLARE TCDSSEC BIT(8) CONSTANT('0A'X); /* SECURITY FLAGS           */ 78000010
*DECLARE TCDSFXLN BIT(8) CONSTANT('10'X); /* FIXED AREA LENGTH       */ 79000010
*DECLARE TCDSDVT BIT(8) CONSTANT('E0'X); /* LINE TYPE                */ 80000010
*%TCDSEND: ;                                                            81000010
./  ADD  SSI=91240388,NAME=TTECB
         MACRO                                                          07000020
         TTECB                                                          08000020
         SPACE                                                          10000020
*                                                                       15000020
*        TEST EVENT CONTROL BLOCK                                       20000020
*                                                                       25000020
TTECB    DSECT                                                          30000020
TECBFDCT DS    XL1           NUMBER OF EVENT FIELDS                     35000000
TECBFDLN DS    XL1           LENGTH OF EVENT FIELDS                     40000000
TECBSNLN DS    H             LENGTH OF SENSE FIELD                      45000000
TECBFLGS DS    BL1           FLAGS                                      50000000
TECBSNCT DS    XL1           NUMBER OF SENSE FIELDS                     55000000
TECBSNOC DS    XL1           NUMBER OF SENSES OCCURRED                  60000000
TECBEVOC DS    XL1           NUMBER OF EVENTS OCCURRED                  65000000
TECBFD01 DS    F             1ST EVENT FIELD                            70000000
         MEND                                                           80000020
./  ADD  SSI=01300086,NAME=TTPD
         MACRO                                                          01000020
         TTPD                                                           02000000
.*                                                                      02500000
.* $MAC(TTPD) COMP(I@) PROD(TCAM):                                 $11A 02550026
.********   CHANGE ACTIVITY   **********                                03000000
.*A660000                                                      @OY14057 03500000
.* $11=OZ44243  ETC2302 80.05.08 613706:                           $11A 03550026
*                                                                       04000020
TPWREOT  EQU   X'01' .                  EOT FOR SELECTION               05000020
*                                                                       06000020
TPOPEN   EQU   X'02' .                  OPEN TP OP CODE                 07000020
*                                                                       08000020
TPWRPOLL EQU   X'03' .                  WRITE POLLING CHARCTERS         09000020
*                                                                       10000020
TPRDRESP EQU   X'04' .                  READ RESPONSE TO POLLING        11000020
*                                                                       12000020
TPWRPAD  EQU   X'05' .                  WRITE PADS                      13000020
*                                                                       14000020
TPENABLE EQU   X'06' .                  ENABLE ON DIAL LINE             15000020
*                                                                       16000020
TPWRAD   EQU   X'07' .                  WRITE ADDRESSING SEQUENCE       17000020
*                                                                       18000020
TPRDRSPD EQU   X'08' .                  READ RESPONSE TO ADDRESSING     19000020
*                                                                       20000020
TPWREOA  EQU   X'09' .                  WRITE EOA SEQUENCE              21000020
*                                                                       22000020
TPRDRPEB EQU   X'0A' .                  READ RESPONSE TO EOB-NONBSC     23000020
*                                                                       24000020
TPWRCPU  EQU   X'0B' .                  WRITE CPU ID                    25000020
*                                                                       26000020
TPRDENQ  EQU   X'0C' .                  READ ENQ                        27000020
*                                                                       28000020
TPWRENQ  EQU   X'0D' .                  WRITE ENQ                       29000020
*                                                                       30000020
TPRSPENQ EQU   X'0E' .                  READ RESPONSE TO ENQ            31000020
*                                                                       32000020
TPWRDLET EQU   X'0F' .                  WRITE DLE EOT                   33000020
*                                                                       34000020
TPRDID   EQU   X'10' .                  READ ID                         35000020
*                                                                       36000020
TPNULL   EQU   X'11' .                  NON READ WRITE CCW'S FOR        37000020
*                                         WHICH NO INTERRUPTED IS       38000020
*                                         ANTICIPATED                   39000020
*                                                                       40000020
TPBREAK  EQU   X'12' .                 BREAK TP-CD                      41000020
*                                                                       42000020
TPENQAD  EQU   X'13' .                  ENQ AFTER SELECTION RESPONSE    43000020
*                                                                       44000020
TPRDLC   EQU   X'14' .                  READ LCOUT                      45000020
*                                                                       46000020
TPWRACK  EQU   X'15' .                  WRITE RESPONSE PRIOR TO TEXT    47000020
*                                                                       48000020
TPWRAKNK EQU   X'16' .                  WRITE RESPNSE                   49000020
*                                                                       50000020
TPWRTONE EQU   X'17' .                  WRITE TONE WTTA BSC             51000020
*                                                                     * 52000020
TPRDIDNQ EQU   X'18' .                  BSC READ ID ENQ                 53000020
*                                                                       54000020
TPRDIDAK EQU   X'1A' .                 BSC READ ID ACK                  55000020
*                                                                       56000020
TPRESET  EQU   X'1C' .                  ABORT FOR SEND/RECEIVE          57000020
*                                                                       58000020
TPTWXID  EQU   X'1E' .                  READ TWX ID                     59000020
*                                                                       60000020
TPBUFEOT EQU   X'20' .                  BUFF. TERM RESET AFTER BLK      61000020
*                                                                       62000020
TPCLOSE  EQU   X'22' .                  CLOSE SDR RECORDING             63000020
*                                                                       64000020
TPRSPAD  EQU   X'24' .                  RESET AFTER SLECTION            65000020
*                                                                       66000020
TPEAU    EQU   X'26'                    WRITE ERASE ALL        @OY14057 66100000
*                                         UNPROTECTED          @OY14057 66200000
*                                                              @OY14057 66300000
TPRSPMG  EQU   X'28'                    RD RESP MSGEN 2260R    @OY14057 66400000
*                                                              @OY14057 66500000
TPRS3270 EQU   X'2A'                    RESET AFTER 3270       @OY14057 66600000
*                                         POLLING ERROR        @OY14057 66700000
*$11A                                                                   66750026
TPSPEOT  EQU   X'2C'                    SPECIAL WRITE EOT          $11A 66800026
*$11A                                                                   66850026
TPRDSKIP EQU   X'51' .                  READ SKIP LOOP                  67000020
*                                                                       68000020
TPWRIDLE EQU   X'53' .                  WRITE IDLES LLOP                69000020
*                                                                       70000020
TPDLESTX EQU   X'57' .                  WRITE DLE STX                   71000020
*                                                                       72000020
TPDLEETX EQU   X'59' .                  WRITE DLE ETB (ETX)             73000020
*                                                                       74000020
TPENQRSP EQU   X'5B' .                  ENQ IN RESPONSE TO TEXT         75000020
*                                                                       76000020
TPTEXT   EQU   X'FF' .                  TEXT CCW                        77000020
         MEND                                                           78000020
./  ADD  SSI=62890495,NAME=TTSWD
*        %GOTO PLSTSW;                  /* BILINGUAL HEADER             00002010
         MACRO                                                          00004010
         TTSWD                                                          00006010
.*A000000-999999                                               @Y17XAXF 00008010
IEDQTSW  DSECT                                                          00010010
*                                                                       00012010
*        TSO WORK AREA                                                  00014010
*                                                                       00016010
TSWTSBFR DS    A .                      TSO BFR OR MSGGEN ADDR          00018010
TSWTCBFR DS    A .                      TCAM BFR OR SCB MSGGEN ADDR     00020010
TSWMOVED DS    H .                      NUMBER BYTES DATA MOVED         00022010
TSWLINE  DS    H .                      NUMBER BYTES REMAINING ON LINE  00024010
TSWTSBSZ DS    H .                      TSO BFR DATA SIZE               00026010
TSWMSGSZ DS    H .                      MESSAGE SIZE                    00028010
TSWTCBSZ DS    H .                      TCAM BFR SIZE                   00030010
TSWFCD   DS    X .                      3270 FUNCTION CODES             00032010
TSWSTFD  EQU   X'F0' .                   START FIELD INSERT             00034010
TSWRDAT  EQU   X'F1' .                   READ ATTRIBUTE INSERT          00036010
TSWSBA   EQU   X'F2' .                   SBA INSERT                     00038010
TSWCUR1  EQU   X'F3' .                   FIRST CURSOR INSERT            00040010
TSWCUR2  EQU   X'F4' .                   SECOND CURSOR INSERT           00042010
TSWINC   EQU   X'F5' .                   INC ORDER INSERT               00044010
TSWETX   EQU   X'F6' .                   ETX INSERT                     00046010
TSWEOT   EQU   X'F7' .                   EOT INSERT                     00048010
TSWETXOT EQU   X'F8' .                   ETX/EOT INSERT                 00050010
TSWBYP   EQU   X'F9' .                   BYPASS CHAR INSERT             00052010
TSWRES   EQU   X'FA' .                   RESTORE CHAR INSERT            00054010
TSWCARCT DS    X .                      CARRIAGE POSITION               00056010
TSWTSLNS DS    0H .                     TSB OR DEFAULT LINE SIZE        00058010
TSWLNN   DS    X .                      NUMBER OF LINES FOR DISPLAYS    00060010
TSWLNSZ  DS    X .                      LINE SIZE FOR DISPLAYS          00062010
TSWSWT1  DS    X .                      SWITCH 1                        00064010
TSWC2F   EQU   X'80' .                   SECOND CURSOR FLAG             00066010
TSWC1F   EQU   X'40' .                   FIRST CURSOR FLAG              00068010
TSWRDAF  EQU   X'20' .                   READ ATTRIBUTE FLAG            00070010
TSWSFF   EQU   X'10' .                   START FIELD FLAG               00072010
TSWBYPF  EQU   X'08' .                   BYPASS CHAR FLAG               00074010
TSWCRNLF EQU   X'04' .                   CARRIAGE RETURN/NEW LINE FLAG  00076010
TSWSBAF  EQU   X'02' .                   SET BUFFER ADDRESS FLAG        00078010
TSWWRAF  EQU   X'01' .                   WRITE ATTRIBUTE FLAG           00080010
TSWSWT2  DS    X .                      SWITCH 2                        00082010
TSWRC4   EQU   4 .                       CALCSIZE RC 4                  00084010
TSWRC8   EQU   8 .                       CALCSIZE RC 8                  00086010
TSWRC12  EQU   12 .                      CALCSIZE RC 12                 00088010
TSWRC16  EQU   16 .                      CALCSIZE RC 16                 00090010
TSWRC40  EQU   40 .                      CALCSIZE RC 40                 00092010
TSWRC44  EQU   44 .                      CALCSIZE RC 44                 00094010
TSWFLG1  DS    X .                      TSO FUNCTION FLAGS 1            00096010
TSWTSMSG EQU   X'80' .                   TSO MESSAGE                    00098010
TSWSASIS EQU   X'60' .                   ASIS SCREEN CONTROL            00100010
TSWCTL   EQU   X'40' .                   CONTROL MODE EDIT              00102010
TSWASIS  EQU   X'20' .                   ASIS EDIT                      00104010
TSWMSGN1 EQU   X'10' .                   FIRST MSGGEN SWITCH            00106010
TSWFMTI  EQU   X'08' .                   SCREEN FORMAT IN BFR           00108010
TSWNLEFT EQU   X'06' .                   NO LEFT JUSTIFICATION REQ      00110010
TSWLEFT  EQU   X'05' .                   LEFT JUSTIFICATION REQ         00112010
TSWFLG2  DS    X .                      TSO FUNCTION FLAGS 2            00114010
*        EQU   X'80'-'02'                RESERVED              @YM06885 00114510
TSWNROOM EQU   X'01' .                   NO ROOM IN TCAM BFR   @YM06885 00115010
*                                          FOR EDIT            @YM06885 00115510
TSWCURSV DS    H .                      SCREEN CURSOR ADDRESS           00116010
TSWEFLG1 DS    X .                      EDIT FLAGS 1                    00118010
TSWTRLR  EQU   X'80' .                   TRAILER BUFFER FLAG            00120010
TSWPRTMV EQU   X'40' .                   PARTIAL MOVE FLAG              00122010
TSWRESF  EQU   X'20' .                   RESTORE CHAR FLAG              00124010
TSWRECAL EQU   X'10' .                   BYPASS CODE AND RESET          00126010
TSWSYN   EQU   X'08' .                   SYN CHARS INSERTED    @YM06885 00128010
TSWINCF  EQU   X'04' .                   INSERT CURSOR FLAG             00130010
TSWEOTF  EQU   X'02' .                   EOT FLAG                       00132010
TSWETXF  EQU   X'01' .                   ETX FLAG                       00134010
TSWEFLG2 DS    X .                      EDIT FLAG 2                     00136010
TSW3705  EQU   X'80' .                   TERMINAL ON 3705               00138010
TSW1050  EQU   X'40' .                   TERMINAL IS 1050               00140010
TSWPRMPT EQU   X'20' .                   PROMPT STRING FLAG             00142010
TSWNLCRF EQU   X'10' .                   NL/CR COUNT FLAG               00144010
TSWLNCT  EQU   X'08' .                   LINE COUNT FLAG                00146010
TSWRDAP  EQU   X'04' .                   READ ATTRIBUTE LINE POS. FLAG  00148010
TSWHDRF  EQU   X'02' .                   FIRST BASIC UNIT FLAG          00150010
TSWNMVCT EQU   X'01' .                   NO MOVE COUNT FLAG             00152010
TSWFIRST DS    X .                      FIRST CHARACTER                 00154010
TSWLAST  DS    X .                      LAST CHARACTER                  00156010
TSWTOCT  DS    F .                      TO DATA COUNT                   00158010
TSWFRCT  DS    F .                      FROM DATA COUNT                 00160010
TSWTSCUR DS    F .                      CURRENT TSO BUFFER              00162010
TSWMSGNL DS    H .                      LENGTH OF MSGGEN DATA           00164010
TSWSBAI  EQU   X'EF' .                   SBA ALREADY INCLUDED           00166010
TSWCUR1I EQU   X'EE' .                   CUR1 ALREADY INCLUDED          00168010
TSWCUR2I EQU   X'ED' .                   CUR2 ALREADY INCLUDED          00170010
TSWSFI   EQU   X'EC' .                   START FIELD ALREADY INCLUDED   00172010
TSWWRAI  EQU   X'EB' .                   WRITE ATTRIBUTE INCLUDED       00174010
TSWDSAV  DS    D .                      DOUBLE WORD SAVE                00176010
TSWDCT   DS    CL6 .                    DCT ENTRY                       00176210
TSWLEN   EQU   *-IEDQTSW .              TSO WORKAREA LENGTH             00178010
         MEND  */                                                       00180010
*%PLSTSW:;                                                              00182010
* DECLARE                                                               00184010
*  1 IEDQTSW  BASED(RTSW),                                              00186010
*/*                                                                  */ 00188010
*/*      TSO WORK AREA                                               */ 00190010
*/*                                                                  */ 00192010
*   2 TSWTSBFR PTR(31),                 /* TSO BFR OR MSGGEN ADDR    */ 00194010
*   2 TSWTCBFR PTR(31),                 /* TCAM BFR OR SCB MSGGEN ADDR  00196010
*                                                                    */ 00198010
*   2 TSWMOVED FIXED(16),               /* NUMBER BYTES DATA MOVED   */ 00200010
*   2 TSWLINE  FIXED(16),               /* NUMBER BYTES REMAINING ON    00202010
*                                          LINE                      */ 00204010
*   2 TSWTSBSZ FIXED(16),               /* TSO BFR DATA SIZE         */ 00206010
*   2 TSWMSGSZ FIXED(16),               /* MESSAGE SIZE              */ 00208010
*   2 TSWTCBSZ FIXED(16),               /* TCAM BFR SIZE             */ 00210010
*   2 TSWFCD   BIT(8),                  /* 3270 FUNCTION CODES       */ 00212010
*   2 TSWCARCT FIXED(8),                /* CARRIAGE POSITION         */ 00214010
*   2 TSWTSLNS FIXED(16),               /* TSB OR DEFAULT LINE SIZE  */ 00216010
*    3 TSWLNN   FIXED(8),               /* NUM OF LINES FOR DISPLAYS */ 00218010
*    3 TSWLNSZ  FIXED(8),               /* LINE SIZE FOR DISPLAYS    */ 00220010
*   2 TSWSWT1  BIT(8),                  /* SWITCH 1                  */ 00222010
*    3 TSWC2F   BIT(1),                 /* SECOND CURSOR FLAG        */ 00224010
*    3 TSWC1F   BIT(1),                 /* FIRST CURSOR FLAG         */ 00226010
*    3 TSWRDAF  BIT(1),                 /* READ ATTRIBUTE FLAG       */ 00228010
*    3 TSWSFF   BIT(1),                 /* START FIELD FLAG          */ 00230010
*    3 TSWBYPF  BIT(1),                 /* BYPASS CHAR FLAG          */ 00232010
*    3 TSWCRNLF BIT(1),                 /* CARR RETURN/NEW LINE FLAG */ 00234010
*    3 TSWSBAF  BIT(1),                 /* SET BUFFER ADDRESS FLAG   */ 00236010
*    3 TSWWRAF  BIT(1),                 /* WRITE ATTRIBUTE FLAG      */ 00238010
*   2 TSWSWT2  BIT(8),                  /* SWITCH 2                  */ 00240010
*   2 TSWFLG1  BIT(8),           /* TSO FUNCTION FLAGS 1      @YM06885*/00242010
*    3 TSWTSMSG  BIT(1),         /* TSO MESSAGE               @YM06885*/00242210
*    3 TSWSCCTL  BIT(2),         /* SCREEN CONTROL            @YM06885*/00242410
*     4 TSWCTL   BIT(1),         /* CONTROL MODE EDIT         @YM06885*/00242610
*     4 TSWASIS BIT(1),          /* ASIS EDIT                 @YM06885*/00242810
*    3 TSWMSGN1  BIT(1),         /* FIRST MSGGEN SWITCH       @YM06885*/00243010
*    3 TSWFMTI   BIT(1),         /* SCREEN FORMAT IN BFR      @YM06885*/00243210
*    3 TSWJUSTI  BIT(3),         /* JUSTIFICATION FLAGS       @YM06885*/00243410
*   2 TSWFLG2  BIT(8),           /* TSO FUNCTION FLAGS 2      @YM06885*/00244010
*    3 *         BIT(7),         /* RESERVED                  @YM06885*/00244510
*    3 TSWNROOM  BIT(1),         /* NO ROOM IN TCAM BFR       @YM06885*/00245010
*                                /*   FOR EDIT                @YM06885*/00245510
*   2 TSWCURSV FIXED(16),               /* SCREEN CURSOR ADDRESS     */ 00246010
*   2 TSWEFLG1 BIT(8),                  /* EDIT FLAGS 1              */ 00248010
*    3 TSWTRLR  BIT(1),                 /* TRAILER BUFFER FLAG       */ 00250010
*    3 TSWPRTMV BIT(1),                 /* PARTIAL MOVE FLAG         */ 00252010
*    3 TSWRESF  BIT(1),                 /* RESTORE CHAR FLAG         */ 00254010
*    3 TSWRECAL BIT(1),                 /* BYPASS CODE AND RESET     */ 00256010
*    3 TSWSYN   BIT(1),                 /* SYN CHARS INSERTED @YM06885*/00258010
*    3 TSWINCF  BIT(1),                 /* INSERT CURSOR FLAG        */ 00260010
*    3 TSWEOTF  BIT(1),                 /* EOT FLAG                  */ 00262010
*    3 TSWETXF  BIT(1),                 /* ETX FLAG                  */ 00264010
*   2 TSWEFLG2 BIT(8),                  /* EDIT FLAG 2               */ 00266010
*    3 TSW3705  BIT(1),                 /* TERMINAL ON 3705          */ 00268010
*    3 TSW1050  BIT(1),                 /* TERMINAL IS 1050          */ 00270010
*    3 TSWPRMPT BIT(1),                 /* PROMPT STRING FLAG        */ 00272010
*    3 TSWNLCRF BIT(1),                 /* NL/CR COUNT FLAG          */ 00274010
*    3 TSWLNCT  BIT(1),                 /* LINE COUNT FLAG           */ 00276010
*    3 TSWRDAP  BIT(1),                 /* READ ATTRIBUTE LINE POS.     00278010
*                                          FLAG                      */ 00280010
*    3 TSWHDRF  BIT(1),                 /* FIRST BASIC UNIT FLAG     */ 00282010
*    3 TSWNMVCT BIT(1),                 /* NO MOVE COUNT FLAG        */ 00284010
*   2 TSWFIRST CHAR(1),                 /* FIRST CHARACTER           */ 00286010
*   2 TSWLAST  CHAR(1),                 /* LAST CHARACTER            */ 00288010
*   2 TSWTOCT  FIXED(31),               /* TO DATA COUNT             */ 00290010
*   2 TSWFRCT  FIXED(31),               /* FROM DATA COUNT           */ 00292010
*   2 TSWTSCUR FIXED(31),               /* CURRENT TSO BUFFER        */ 00294010
*   2 TSWMSGNL FIXED(16),               /* LENGTH OF MSGGEN DATA     */ 00296010
*   2 TSWDSAV  CHAR(8),                 /* DOUBLE WORD SAVE          */ 00298010
*   2 TSWDCT   CHAR(6);                 /* DCT ENTRY                 */ 00298210
*%TSWLEN='LENGTH(IEDQTSW)';             /* TSO WORKAREA LENGTH       */ 00300010
*                                                                       00302010
*/*                                                                  */ 00304010
*/*      TSWFCD VALUES                                               */ 00306010
*/*                                                                  */ 00308010
* DCL TSWSTFD  BIT(8) CONSTANT('F0'X);  /* START FIELD INSERT        */ 00310010
* DCL TSWRDAT  BIT(8) CONSTANT('F1'X);  /* READ ATTRIBUTE INSERT     */ 00312010
* DCL TSWSBA   BIT(8) CONSTANT('F2'X);  /* SBA INSERT                */ 00314010
* DCL TSWCUR1  BIT(8) CONSTANT('F3'X);  /* FIRST CURSOR INSERT       */ 00316010
* DCL TSWCUR2  BIT(8) CONSTANT('F4'X);  /* SECOND CURSOR INSERT      */ 00318010
* DCL TSWINC   BIT(8) CONSTANT('F5'X);  /* INC ORDER INSERT          */ 00320010
* DCL TSWETX   BIT(8) CONSTANT('F6'X);  /* ETX INSERT                */ 00322010
* DCL TSWEOT   BIT(8) CONSTANT('F7'X);  /* EOT INSERT                */ 00324010
* DCL TSWETXOT BIT(8) CONSTANT('F8'X);  /* ETX/EOT INSERT            */ 00326010
* DCL TSWBYP   BIT(8) CONSTANT('F9'X);  /* BYPASS CHAR INSERT        */ 00328010
* DCL TSWRES   BIT(8) CONSTANT('FA'X);  /* RESTORE CHAR INSERT       */ 00330010
*/*                                                                  */ 00332010
*/*      TSWSWT2 VALUES                                              */ 00334010
*/*                                                                  */ 00336010
* DCL TSWRC4   FIXED(8) CONSTANT(4);    /* CALCSIZE RC 4             */ 00338010
* DCL TSWRC8   FIXED(8) CONSTANT(8);    /* CALCSIZE RC 8             */ 00340010
* DCL TSWRC12  FIXED(8) CONSTANT(12);   /* CALCSIZE RC 12            */ 00342010
* DCL TSWRC16  FIXED(8) CONSTANT(16);   /* CALCSIZE RC 16            */ 00344010
* DCL TSWRC40  FIXED(8) CONSTANT(40);   /* CALCSIZE RC 40            */ 00346010
* DCL TSWRC44  FIXED(8) CONSTANT(44);   /* CALCSIZE RC 44            */ 00348010
*/*                                                                  */ 00350010
*/*     TSWSCCTL VALUES                                       @YMO6885*/00352010
*/*                                                                  */ 00354010
* DCL TSWSASIS BIT(2) CONSTANT('11'B);  /* ASIS SCREEN CNTRL  @YM06885*/00358010
*/*                                                                  */ 00358510
*/*     TSWJUSTI VALUES                                       @YM06885*/00359010
*/*                                                                  */ 00359510
* DCL TSWNLEFT BIT(3) CONSTANT('110'B); /*NO LEFT JUSTIFY RQD @YM06885*/00368010
* DCL TSWLEFT  BIT(3) CONSTANT('101'B); /* LEFT JUSTIFY REQD  @YM06885*/00370010
*/*                                                                  */ 00372010
*/*      TSWMSGNL VALUES                                             */ 00374010
*/*                                                                  */ 00376010
* DCL TSWSBAI  BIT(8) CONSTANT('EF'X);  /* SBA ALREADY INCLUDED      */ 00378010
* DCL TSWCUR1I BIT(8) CONSTANT('EE'X);  /* CUR1 ALREADY INCLUDED     */ 00380010
* DCL TSWCUR2I BIT(8) CONSTANT('ED'X);  /* CUR2 ALREADY INCLUDED     */ 00382010
* DCL TSWSFI   BIT(8) CONSTANT('EC'X);  /* START FIELD  INCLUDED     */ 00384010
* DCL TSWWRAI  BIT(8) CONSTANT('EB'X);  /* WRITE ATTRIBUTE INCLUDED  */ 00386010
./  ADD  SSI=71440462,NAME=TTTCD
*   %GOTO PLSTTTCD;               /* BILINGUAL HEADER                   01000000
         MACRO                                                          02000000
         TTTCD                                                          03000000
.*A000000-999999                                               @Y17XAXV 04000000
.*C160000,630000-640000                                        @G36XRXV 04500010
*                                 ... TOTE/TCAM CONTROL BLOCKS ...      05000000
IEDTTCD  DSECT                                                          06000000
TTCSTOFF EQU   LCBRCQCB-IEDQLCB         OFFSET INTO LCB OF LCBRCQCB     07000000
         ORG   IEDTTCD+L'LCBRCQCB                                       08000000
*                                                                       09000000
TTCSVCPL DS    0F                       SVC 102 PARM LIST               10000000
TTCSVCW1 DS    0A                       WORD 1                          11000000
TTCPCODE DS    CL1                      POST CODE                       12000000
TTCFIRST DS    AL3                      ADDR OF FIRST ELEMENT           13000000
TTCSVCW2 DS    0A                       WORD 2                          14000000
TTCLAST  DS    AL4                      ADDR OF LAST ELEMENT            15000000
TTCCHAIN EQU   X'B4'                    CHAIN AQCTL POST       @G36XRXV 16000010
*                                                                       17000000
         ORG   IEDTTCD+LCBSTAT1-LCBRCQCB DISPLACEMENT TO NEXT LCB FLDS  18000000
         ORG   IEDTTCD+LCBSCBA-LCBRCQCB+L'LCBSCBA LOCATION PAST LCB     19000000
*                                       FIELDS                          20000000
*                                                                       21000000
TTCQCB   DS    0F                       QCB                             22000000
TTCQBFLG DS    CL1                      QCB FLAG FIELD - X'02 INDICATES 23000000
*                                        ECB POST TO DISPATCHER         24000000
TTCQBELC DS    AL3                      QCB ELEMENT CHAIN POINTER       25000000
TTCQBECB DS    1F                       QCB ECB                         26000000
TTCQSTCB DS    1F                       QCB STCB CHAIN                  27000000
*                                                                       28000000
TTCSCB   DS    0F                       SCB START                       29000000
         MEND                     */                                    30000000
*%PLSTTTCD:;                                                            31000000
*/*                                                                  */ 32000000
*/*                                 ... TOTE/TCAM CONTROL BLOCKS ... */ 33000000
*/*                                                                  */ 34000000
*   DCL                                                                 35000000
*     1 IEDTTCD BASED (IEDTTCP),                                        36000000
*       2 * CHAR(*);                /* LENGTH OF LCBRCQCB FIELD      */ 37000000
*   DCL                                                                 38000000
*     1 IEDTTCPL BASED(ADDR(IEDTTCD)+LENGTH(LCBRCQCB)),                 39000000
*       2 TTCSVCPL BDY(WORD),       /* SVC 102 PARM LIST             */ 40000000
*         3 TTCSVCW1,               /* WORD 1                        */ 41000000
*           4 TTCPCODE CHAR(1),     /* POST CODE                     */ 42000000
*           4 TTCFIRST PTR(24),     /* ADDR OF FIRST ELEMENT         */ 43000000
*         3 TTCSVCW2 PTR(31),       /* WORD 2                        */ 44000000
*           4 TTCLAST PTR(31),      /* ADDR OF LAST ELEMENT          */ 45000000
*       2 * CHAR(*);                /* DISPLACEMENT OF NEXT LCB         46000000
*                                   FIELDS                           */ 47000000
*   DCL                                                                 48000000
*     1 IEDTTCFD BASED(ADDR(IEDTTCD)+(ADDR(LCBSTAT1)-ADDR(LCBRCQCB))),  49000000
*                                   /* START OF LCB FIELDS USED      */ 50000000
*       2 * CHAR(*);                                                    51000000
*   DCL                                                                 52000000
*     1 IEDTTCQB BASED(ADDR(IEDTTCD)+(ADDR(LCBSCBA)-ADDR(LCBRCQCB))+    53000000
*                      LENGTH(LCBSCBA)), /*LOCATION PAST LCB FIELDS  */ 54000000
*       2 TTCQCB BDY(WORD),         /* QCB                           */ 55000000
*         3 TTCQBFLG CHAR(1),       /* QCB FLAG FIELD - X'02'           56000000
*                                   INDICATES ECB POST TO DISPATCHER */ 57000000
*         3 TTCQBELC PTR(24),       /* QCB ELEMENT CHAIN POINTER     */ 58000000
*         3 TTCQBECB BIT(32),       /* QCB ECB                       */ 59000000
*         3 TTCQSTCB PTR(31),       /* QCB STCB POINTER              */ 60000000
*       2 TTCSCB CHAR(0) BDY(WORD); /* SCB START                     */ 61000000
*   DCL                                                                 62000000
*     TTCCHAIN BIT(8) CONSTANT('B4'X);/* POST CODE FOR CHAIN SVC 102    63000010
*                                   POST @G36XRXV                    */ 66000010
./  ADD  SSI=62710432,NAME=TXALKD
*        %GOTO PLSXALK;                                              /* 00004010
         MACRO                                                          00008010
         TXALKD                                                         00012010
.*A000000-999999                                               @Y17XAXG 00016010
*                       ... ACTIVATE LINK ...                           00020010
IEDXALKD DSECT                                                          00024010
XALKCMD  DS    0XL5                     ACTIVATE LINK COMMAND           00028010
XALKCODE DS    0XL3                     COMMAND CODE                    00032010
XALKNETS DS    XL1                      NETWORK SERVICES                00036010
XALKCONF DS    XL1                      CONFIGURATION SERVICES          00040010
XALKREQ  DS    XL1                      ACTIVATE LINK REQUEST           00044010
XALKADDR DS    XL2                      NETWORK ADDRESS OF LINK         00048010
         MEND                                                        */ 00052010
*%PLSXALK : ;                                                           00056010
*DECLARE                                                                00060010
*  1 IEDXALKD BASED(XALKPTR),                                           00064010
*    2 XALKCMD CHAR(5),                  /* ACTIVATE LINK COMMAND    */ 00068010
*     3 XALKCODE CHAR(3),                /* COMMAND CODE             */ 00072010
*      4 XALKNETS BIT(8),                /* NETWORK SERVICES         */ 00076010
*      4 XALKCONF BIT(8),                /* CONFIGURATION SERVICES   */ 00080010
*      4 XALKREQ BIT(8),                 /* ACTIVATE LINK REQUEST    */ 00084010
*     3 XALKADDR BIT(16);                /* NETWORK ADDRESS OF LINK  */ 00088010
*/*                                                                  */ 00092010
./  ADD  SSI=62470507,NAME=TXBFLD
*        %GOTO PLSBFLD;                 /*                              03000010
         MACRO                                                          06000010
         TXBFLD                                                         09000010
*        NO ASSEMBLER VERSION FOR THIS DSECT                            12000010
         MEND  */                                                       15000010
*%PLSBFLD:;                                                             18000010
*/*                                                                  */ 21000010
*/*      BIND FAILURE REQUEST DSECT                                  */ 24000010
*/*                                                                  */ 27000010
*DCL 1 IEDXBFLD BASED(XBFLPTR),          /* BIND FAILED              */ 30000010
*     2 XBFLCMD ,                                                       33000010
*      3 XBFLCODE CHAR(3),               /* COMMAND CODE             */ 36000010
*        4 XBFLNETS CHAR(1),             /* NETWORK SERVICES         */ 39000010
*        4 XBFLSESS CHAR(1),             /* SESSION SERVICES         */ 42000010
*        4 XBFLREQ CHAR(1),              /* BIND FAILED REQUEST      */ 45000010
*      3 XBFLSNS CHAR(4),                /* SENSE                    */ 48000010
*      3 XBFLRSN CHAR(1),                /* REASON                   */ 51000010
*      3 XBFLKEY CHAR(1),                /* KEY                      */ 54000010
*      3 XBFLPNA CHAR(2),                /* PRIMARY LU ID            */ 57000010
*      3 XBFLSNA CHAR(2);                /* SECONDARY LU ID          */ 60000010
./  ADD  SSI=62230592,NAME=TXCOND
*        %GOTO PLSXCON;                                              /* 00100010
         MACRO                                                          00200010
         TXCOND                                                         00300010
.*A000000-999999                                               @Y17XAXG 00400010
*                       ... CONTACT ...                                 00500010
IEDXCOND DSECT                                                          00600010
XCONCMD  DS    0XL5                     CONTACT COMMAND                 00700010
XCONCODE DS    0XL3                     COMMAND CODE                    00800010
XCONNETS DS    XL1                      NETWORK SERVICES                00900010
XCONCONF DS    XL1                      CONFIGURATION SERVICES          01000010
XCONREQ  DS    XL1                      CONTACT REQUEST                 01100010
XCONADDR DS    XL2                      NETWORK ADDRESS OF PU           01200010
         MEND                                                        */ 01300010
*%PLSXCON : ;                                                           01400010
*DECLARE                                                                01500010
*  1 IEDXCOND BASED(XCONPTR),                                           01600010
*    2 XCONCMD CHAR(5),                  /* CONTACT COMMAND          */ 01700010
*     3 XCONCODE CHAR(3),                /* COMMAND CODE             */ 01800010
*      4 XCONNETS CHAR(1),               /* NETWORK SERVICES         */ 01900010
*      4 XCONCONF CHAR(1),               /* CONFIGURATION SERVICES   */ 02000010
*      4 XCONREQ CHAR(1),                /* CONTACT REQUEST          */ 02100010
*     3 XCONADDR CHAR(2);                /* NETWORK ADDRESS OF PU    */ 02200010
*/*                                                                  */ 02300010
./  ADD  SSI=62710411,NAME=TXDLKD
*        %GOTO PLSXDLK;                                              /* 00100010
         MACRO                                                          00200010
         TXDLKD                                                         00300010
.*A000000-999999                                               @Y17XAXG 00400010
*                       ... DEACTIVATE LINK ...                         00500010
IEDXDLKD DSECT                                                          00600010
XDLKCMD  DS    0XL5                     DEACTIVATE LINK COMMAND         00700010
XDLKCODE DS    0XL3                     COMMAND CODE                    00800010
XDLKNETS DS    XL1                      NETWORK SERVICES                00900010
XDLKCONF DS    XL1                      CONFIGURATION SERVICES          01000010
XDLKREQ  DS    XL1                      DEACTIVATE LINK REQUEST         01100010
XDLKADDR DS    XL2                      NETWORK ADDRESS OF LINK         01200010
         MEND                                                        */ 01300010
*%PLSXDLK : ;                                                           01400010
*DECLARE                                                                01500010
*  1 IEDXDLKD BASED(XDLKPTR),                                           01600010
*    2 XDLKCMD CHAR(5),                  /* DEACTIVATE LINK COMMAND  */ 01700010
*     3 XDLKCODE CHAR(3),                /* COMMAND CODE             */ 01800010
*      4 XDLKNETS CHAR(1),               /* NETWORK SERVICES         */ 01900010
*      4 XDLKCONF CHAR(1),               /* CONFIGURATION SERVICES   */ 02000010
*      4 XDLKREQ CHAR(1),                /* DEACTIVATE LINK REQUEST  */ 02100010
*     3 XDLKADDR CHAR(2);                /* NETWORK ADDRESS OF LINK  */ 02200010
*/*                                                                  */ 02300010
./  ADD  SSI=62470562,NAME=TXDPUD
*        %GOTO PLSXDPU;                                              /* 03000010
         MACRO                                                          06000010
         TXDPUD                                                         09000010
.*A000000-999999                                               @Y17XAXG 12000010
*               ... DEACTIVATE PU ...                                   15000010
IEDXDPUD DSECT                                                          18000010
XDPUCMD  DS    0XL2                     DACTPU COMMAND                  21000010
XDPUCODE DS    XL1                      COMMAND CODE                    24000010
XDPUTYPE DS    XL1                      TYPE DEACTIVATION               27000010
         MEND                                                        */ 30000010
*%PLSXDPU : ;                                                           33000010
*DECLARE                                                                36000010
*  1 IEDXDPUD  BASED(XDPUPTR),                                          39000010
*    2 XDPUCMD CHAR(2),                  /* DACTPU COMMAND           */ 42000010
*     3 XDPUCODE BIT(8),                 /* COMMAND CODE             */ 45000010
*     3 XDPUTYPE BIT(8);                 /* TYPE DEACTIVATION        */ 48000010
*/*                                                                  */ 51000010
./  ADD  SSI=62470563,NAME=TXDSCD
*        %GOTO PLSXDSC;                                              /* 03000010
         MACRO                                                          06000010
         TXDSCD                                                         09000010
.*A000000-999999                                               @Y17XAXG 12000010
*                       ... DISCONTACT ...                              15000010
IEDXDSCD DSECT                                                          18000010
XDSCCMD  DS    0XL5                     DISCONTACT COMMAND              21000010
XDSCCODE DS    0XL3                     COMMAND CODE                    24000010
XDSCNETS DS    XL1                      NETWORK SERVICES                27000010
XDSCCONF DS    XL1                      CONFIGURATION SERVICES          30000010
XDSCREQ  DS    XL1                      DISCONTACT REQUEST              33000010
XDSCADDR DS    XL2                      NETWORK ADDRESS OF PU           36000010
         MEND                                                        */ 39000010
*%PLSXDSC : ;                                                           42000010
*DECLARE                                                                45000010
*  1 IEDXDSCD BASED(XDSCPTR),                                           48000010
*    2 XDSCCMD CHAR(5),                  /* DISCONTACT COMMAND       */ 51000010
*     3 XDSCCODE CHAR(3),                /* COMMAND CODE             */ 54000010
*      4 XDSCNETS CHAR(1),               /* NETWORK SERVICES         */ 57000010
*      4 XDSCCONF CHAR(1),               /* CONFIGURATION SERVICES   */ 60000010
*      4 XDSCREQ CHAR(1),                /* DISCONTACT REQUEST       */ 63000010
*     3 XDSCADDR CHAR(2);                /* NETWORK ADDRESS OF PU    */ 66000010
*/*                                                                  */ 69000010
./  ADD  SSI=63170604,NAME=TXEXTD
*   %GOTO PLSXEXT;                /* BILINGUAL HEADER                   02000010
         MACRO                                                          04000010
         TXEXTD                                                         06000010
.*A000000-999999                                               @Y17XAXV 07000010
*                      ... EXECUTE TEST ...                             08000010
IEDXEXTD DSECT                                                          10000010
XEXTCODE DS    0XL3                     COMMAND CODE (FID1)             12000010
XEXTNETS DS    XL1                      NETWORK SERVICES                14000010
XEXTMAIN DS    XL1                      MAINTENANCE SERVICES            16000010
XEXTREQ  DS    XL1                      EXECUTE TEST  REQUEST           18000010
XEXTADDR DS    XL2                      NETWORK ADDRESS                 20000010
XEXTPBDU DS    0XL4                     PARTIAL BASIC DATA UNIT         22000010
XEXTCMD0 DS    XL1                      FID0 COMMAND                    24000010
XEXTMODF DS    XL1                      MODIFIER                        26000010
XEXTSYSR DS    XL1                      SYSTEM RESPONSE                 28000010
XEXTEXTR DS    XL1                      EXTENDED RESPONSE               30000010
XEXTEND  EQU   *                        END OF EXECUTE TEST COMMAND     32000010
XEXTTEXT EQU   *                        INTERPRETIVE COMMANDS TEXT      34000010
         MEND           */                                              36000010
*%PLSXEXT:;                                                             38000010
*/*                                                                  */ 40000010
*/*                          ... EXECUTE TEST ...                    */ 42000010
*/*                                                                  */ 44000010
*   DCL                                                                 46000010
*     1 IEDXEXTD BASED(IEDXEXTP),                                       48000010
*       2 XEXTCODE CHAR(3),       /*COMMAND CODE (FID1)*/               50000010
*         3 XEXTNETS CHAR(1),     /*NETWORK SERVICES*/                  52000010
*         3 XEXTMAIN CHAR(1),     /*MAINTENANCE SERVICES*/              54000010
*         3 XEXTREQ  CHAR(1),     /*EXECUTE TEST REQUEST*/              56000010
*       2 XEXTADDR BIT(16),       /*NETWORK ADDRESS*/                   58000010
*       2 XEXTPBDU CHAR(4),       /*PARTIAL BASIC DATA UNIT*/           60000010
*         3 XEXTCMD0 CHAR(1),     /*FID0 COMMAND*/                      62000010
*         3 XEXTMODF CHAR(1),     /*MODIFIER*/                          64000010
*         3 XEXTSYSR CHAR(1),     /*SYSTEM RESPONSE*/                   66000010
*         3 XEXTEXTR CHAR(1),     /*EXTENDED RESPONSE*/                 68000010
*       2 XEXTEND CHAR(0);        /*END OF EXECUTE TEST COMMAND*/       70000010
*   DCL                                                                 72000010
*     XEXTTEXT CHAR(*) DEF(XEXTEND);/*INTERPRETIVE COMMANDS TEXT*/      74000010
./  ADD  SSI=62130021,NAME=TXNPLD
*        %GOTO PLSXNPL;                                              /* 00100010
         MACRO                                                          00200010
         TXNPLD                                                         00300010
.*A000000-999999                                               @Y17XAXG 00400010
*              ... CHANGE NEGATIVE POLL LIMIT ...                       00500010
IEDXNPLD DSECT                                                          00600010
XNPLCMD  DS    0XL6                     CHANGE NEGATIVE POLL LIMIT      00700010
XNPLCODE DS    0XL3                     COMMAND CODE                    00800010
XNPLNETS DS    XL1                      NETWORK SERVICES                00900010
XNPLPRE  DS    XL1                      PRE SNA CODE                    01000010
XNPLREQ  DS    XL1                      NEG POLL LIM REQUEST            01100010
XNPLADDR DS    XL2                      NETWORK ADDRESS OF PU           01200010
XNPLVAL  DS    XL1                      NEW VALUE FOR NEG POLL LIMIT    01300010
         MEND                                                        */ 01400010
*%PLSXNPL : ;                                                           01500010
*DECLARE                                                                01600010
*  1 IEDXNPLD BASED(XNPLPTR),                                           01700010
*    2 XNPLCMD,                          /* CHANGE NEGATIVE POLL        01800010
*                                           LIMIT COMMAND            */ 01900010
*     3 XNPLCODE CHAR(3),                /* COMMAND CODE             */ 02000010
*      4 XNPLNETS CHAR(1),               /* NETWORK SERVICES         */ 02100010
*      4 XNPLPRE  CHAR(1),               /* PRE SNA CODE             */ 02200010
*      4 XNPLREQ CHAR(1),                /* NEG POLL LIM REQUEST     */ 02300010
*     3  XNPLADDR CHAR(2),               /* NETWORK ADDRESS OF PU    */ 02400010
*     3  XNPLVAL  CHAR(1);               /* NEW VAL FOR NEG POLL LIM */ 02500010
*/*                                                                  */ 02600010
./  ADD  SSI=10630646,NAME=TXRTDD
*   %GOTO PLSXRTD;                /* BILINGUAL HEADER                   02000000
         MACRO                                                          04000000
         TXRTDD                                                         06000000
.*A000000-999999                                               @Y17XAXV 07000000
*                      ... RECORD TEST DATA ...                         08000000
IEDXRTDD DSECT                                                          10000000
XRTDCODE DS    0XL3                     COMMAND CODE (FID1)             12000000
XRTDNETS DS    XL1                      NETWORK SERVICES                14000000
XRTDMAIN DS    XL1                      MAINTENANCE SERVICES            16000000
XRTDREQ  DS    XL1                      RECORD TEST DATA REQUEST        18000000
XRTDADDR DS    XL2                      NETWORK ADDRESS                 20000000
XRTDPBDU DS    0XL4                     PARTIAL BASIC DATA UNIT         22000000
XRTDCMD0 DS    XL1                      FID0 COMMAND                    24000000
XRTDMODF DS    XL1                      MODIFIER                        26000000
XRTDSYSR DS    XL1                      SYSTEM RESPONSE                 28000000
XRTDEXTR DS    XL1                      EXTENDED RESPONSE               30000000
XRTDEND  EQU   *                        END OF RECORD TEST DATA COMMAND 32000000
XRTDTEXT EQU   *                        INTERPRETIVE COMMANDS TEXT      34000000
         MEND           */                                              36000000
*%PLSXRTD:;                                                             38000000
*/*                                                                  */ 40000000
*/*                          ... RECORD TEST DATA ...                */ 42000000
*/*                                                                  */ 44000000
*   DCL                                                                 46000000
*     1 IEDXRTDD BASED(IEDXRTDP),                                       48000000
*       2 XRTDCODE CHAR(3),       /*COMMAND CODE (FID1)*/               50000000
*         3 XRTDNETS CHAR(1),     /*NETWORK SERVICES*/                  52000000
*         3 XRTDMAIN CHAR(1),     /*MAINTENANCE SERVICES*/              54000000
*         3 XRTDREQ  CHAR(1),     /*RECORD TEST DATA REQUEST*/          56000000
*       2 XRTDADDR BIT(16),       /*NETWORK ADDRESS*/                   58000000
*       2 XRTDPBDU CHAR(4),       /*PARTIAL BASIC DATA UNIT*/           60000000
*         3 XRTDCMD0 CHAR(1),     /*FID0 COMMAND*/                      62000000
*         3 XRTDMODF CHAR(1),     /*MODIFIER*/                          64000000
*         3 XRTDSYSR CHAR(1),     /*SYSTEM RESPONSE*/                   66000000
*         3 XRTDEXTR CHAR(1),     /*EXTENDED RESPONSE*/                 68000000
*       2 XRTDEND CHAR(0);        /*END OF RECORD TEST DATA COMMAND*/   70000000
*   DCL                                                                 72000000
*     XRTDTEXT CHAR(*) DEF(XRTDEND);/*INTERPRETIVE COMMANDS TEXT*/      74000000
./  ADD  SSI=62470566,NAME=TXSEPD
*        %GOTO PLSXSEP;                                              /* 03000010
         MACRO                                                          06000010
         TXSEPD                                                         09000010
.*A000000-999999                                               @Y17XAXG 12000010
*                       ... SWITCH TO EP ...                            15000010
IEDXSEP  DSECT                                                          18000010
XSEPCMD  DS    0XL3                     SWITCH TO EP COMMAND            21000010
XSEPCODE DS    XL1                      COMMAND CODE                    24000010
XSEPADDR DS    XL2                      NETWORK ADDRESS OF LINE         27000010
         MEND  */                                                       30000010
*%PLSXSEP : ;                                                           33000010
*DECLARE                                                                36000010
*  1 IEDXSEPD BASED(XSEPPTR),                                           39000010
*    2 XSEPCMD,                          /* SWITCH TO EP COMMAND     */ 42000010
*     3 XSEPCODE CHAR(1),                /* COMMAND CODE             */ 45000010
*     3 XSEPADDR CHAR(2);                /* NETWORK ADDRESS OF LINE  */ 48000010
*/*                                                                  */ 51000010
./  ADD  SSI=62470567,NAME=TXSNDD
*        %GOTO PLSXSND;                 /*                              03000010
         MACRO                                                          06000010
         TXSNDD                                                         09000010
*        NO ASSEMBLER VERSION FOR THE DSECT                             12000010
         MEND  */                                                       15000010
*%PLSXSND:;                                                             18000010
*/*                                                                  */ 21000010
*/*      SESSION ENDED REQUEST DSECT                                 */ 24000010
*/*                                                                  */ 27000010
*DCL 1 IEDXSNDD BASED(XSNDPTR),          /* SESSION ENDED            */ 30000010
*      2 XSNDCMD,                                                       33000010
*       3 XSNDCODE CHAR(3),              /* COMMAND CODE             */ 36000010
*         4 XSNDNETS CHAR(1),            /* NETWORK SERVICES         */ 39000010
*         4 XSNDSESS CHAR(1),            /* SESSION SERVICES         */ 42000010
*         4 XSNDREQ  CHAR(1),            /* SESSION ENDED REQUEST    */ 45000010
*       3 XSNDKEY  CHAR(1),              /* KEY                      */ 48000010
*       3 XSNDPNA  CHAR(2),              /* PRIMARY LU ID            */ 51000010
*       3 XSNDSNA  CHAR(2);              /* SECONDARY LU ID          */ 54000010
./  ADD  SSI=62530891,NAME=TXSNLD
*        %GOTO PLSXSNL;                                              /* 03000010
         MACRO                                                          06000010
         TXSNLD                                                         09000010
.*A000000-999999                                               @Y17XAXG 12000010
*              ... CHANGE SESSION LIMIT ...                             15000010
IEDXSNLD DSECT                                                          18000010
XSNLCMD  DS    0XL6                     CHANGE SESSION LIMIT            21000010
XSNLCODE DS    0XL3                     COMMAND CODE                    24000010
XSNLNETS DS    XL1                      NETWORK SERVICES                27000010
XSNLPRE  DS    XL1                      RE SNA CODE                     30000010
XSNLREQ  DS    XL1                      SESSION LIMIT REQUEST           33000010
XSNLADDR DS    XL2                      NETWORK ADDRESS                 36000010
XSNLVAL  DS    XL1                      NEW VALUE FOR SESSION LIMIT     39000010
         MEND                                                        */ 42000010
*%PLSXSNL : ;                                                           45000010
*DECLARE                                                                48000010
*  1 IEDXSNLD BASED(XSNLPTR),                                           51000010
*    2 XSNLCMD,                          /* CHANGE SESSION LIMIT        54000010
*                                           COMMAND                  */ 57000010
*     3 XSNLCODE CHAR(3),                /* COMMAND CODE             */ 60000010
*      4 XSNLNETS CHAR(1),               /* NETWORK SERVICES         */ 63000010
*      4 XSNLPRE  CHAR(1),               /* PRE SNA CODE             */ 66000010
*      4 XSNLREQ CHAR(1),                /* SESSION LIMIT REQUEST    */ 69000010
*     3  XSNLADDR CHAR(2),               /* NETWORK ADDRESS          */ 72000010
*     3  XSNLVAL  CHAR(1);               /* NEW VAL FOR SESSION LIMIT*/ 75000010
*/*                                                                  */ 78000010
./  ADD  SSI=62470568,NAME=TXSNPD
*        %GOTO PLSXSNP;                                              /* 03000010
         MACRO                                                          06000010
         TXSNPD                                                         09000010
.*A000000-999999                                               @Y17XAXG 12000010
*                       ... SWITCH TO NCP ...                           15000010
IEDXSNPD DSECT                                                          18000010
XSNPCMD  DS    0XL3                     SWITCH TO NCP COMMAND           21000010
XSNPCODE DS    XL1                      COMMAND CODE                    24000010
XSNPADDR DS    XL2                      NETWORK ADDRESS OF LINE         27000010
         MEND                                                        */ 30000010
*%PLSXSNP : ;                                                           33000010
*DECLARE                                                                36000010
*  1 IEDXSNPD BASED(XSNPPTR),                                           39000010
*    2 XSNPCMD,                          /* SWITCH TO NCP COMMAND    */ 42000010
*     3 XSNPCODE CHAR(1),                /* COMMAND CODE             */ 45000010
*     3 XSNPADDR CHAR(2);                /* NETWORK ADDRESS OF LINE  */ 48000010
*/*                                                                  */ 51000010
./  ADD  SSI=62470575,NAME=TXSSPD
*        %GOTO PLSXSSP;                                              /* 03000010
         MACRO                                                          06000010
         TXSSPD                                                         09000010
.*A000000-999999                                               @Y17XAXG 12000010
*              ... CHANGE SERVICE SEEKING PAUSE ...                     15000010
IEDXSSPD DSECT                                                          18000010
XSSPCMD  DS    0XL5                     CHANGE SERVICE SEEKING PAUSE    21000010
*                                       COMMAND                         24000010
XSSPCODE DS    0XL3                     COMMAND                         27000010
XSSPNETS DS    XL1                      NETWORK SERVICES                30000010
XSSPPRE  DS    XL1                      PRE SNA CODE                    33000010
XSSPREQ  DS    XL1                      SERV SEEK PAUSE REQUEST         36000010
XSSPADDR DS    XL2                      NETWORK ADDRESS OF PU           39000010
XSSPVAL  DS    XL1                      VEW VALUE FOR SERV SEEK PAUSE   42000010
         MEND                                                        */ 45000010
*%PLSXSSP : ;                                                           48000010
*DECLARE                                                                51000010
*  1 IEDXSSPD BASED(XSSPPTR),                                           54000010
*    2 XSSPCMD,                          /* CHANGE SERVICE SEEKING      57000010
*                                           PAUSE COMMAND            */ 60000010
*     3 XSSPCODE CHAR(3),                /* COMMAND CODE             */ 63000010
*      4 XSSPNETS CHAR(1),               /* NETWORK SERVICES         */ 66000010
*      4 XSSPPRE  CHAR(1),               /* PRE SNA CODE             */ 69000010
*      4 XSSPREQ CHAR(1),                /* SERV SEEK PAUSE REQUEST  */ 72000010
*     3 XSSPADDR CHAR(2),                /* NETWORK ADDRESS OF PU    */ 75000010
*     3 XSSPVAL  CHAR(1);                /* NEW VAL FOR SERV SEEK PAU*/ 78000010
*/*                                                                  */ 81000010
./  ADD  SSI=62470578,NAME=TXSSTD
*        %GOTO PLSXSST;                 /*                              03000010
         MACRO                                                          06000010
         TXSSTD                                                         09000010
*        NO ASSEMBLER VERSION FOR THE DSECT                             12000010
         MEND  */                                                       15000010
*%PLSXSST:;                                                             18000010
*/*                                                                  */ 21000010
*/*      SESSION STARTED REQUEST DSECT                               */ 24000010
*/*                                                                  */ 27000010
*DCL 1 IEDXSSTD BASED(XSSTPTR),          /* SESSION STARTED          */ 30000010
*      2 XSSTCMD,                                                       33000010
*       3 XSSTCODE CHAR(3),              /* COMMAND CODE             */ 36000010
*         4 XSSTNETS CHAR(1),            /* NETWORK SERVICES         */ 39000010
*         4 XSSTSESS CHAR(1),            /* SESSION SERVICES         */ 42000010
*         4 XSSTREQ  CHAR(1),            /* SESSION STARTED REQUEST  */ 45000010
*       3 XSSTKEY  CHAR(1),              /* KEY                      */ 48000010
*       3 XSSTPNA  CHAR(2),              /* PRIMARY LU ID            */ 51000010
*       3 XSSTSNA  CHAR(2);              /* SECONDARY LU ID          */ 54000010
./  ADD  SSI=62720341,NAME=TXUNBD
*        %GOTO PLSXUNB;                                              /* 03000010
         MACRO                                                          06000010
         TXUNBD                                                         09000010
.*A000000-999999                                               @Y17XAXG 12000010
*                       ... UNBIND ...                                  15000010
IEDXUNBD DSECT                                                          18000010
XUNBCMD  DS    0XL2                     UNBIND COMMAND                  21000010
XUNBCODE DS    XL1                      COMMAND CODE                    24000010
XBNDTYPE DS    XL1                      TYPE ACTIVATION                 27000010
         MEND                                                        */ 30000010
*%PLSXUNB : ;                                                           33000010
*DECLARE                                                                36000010
*  1 IEDXUNBD BASED(XUNBPTR),                                           39000010
*    2 XUNBCMD CHAR(2),                  /* UNBIND COMMAND           */ 42000010
*     3 XUNBCODE CHAR(1),                /* COMMAND CODE             */ 45000010
*     3 XBNDTYPE CHAR(1);                /* TYPE ACTIVATION          */ 48000010
*/*                                                                  */ 51000010
