./  ADD  SSI=81640094,NAME=IGE0001H
         TITLE '3851 ERP LOAD 1 (IGE0001H) VS2'                         00050003
         MACRO                                                          00060003
         DATEM                                                          00070003
         LCLC  &FILL                                                    00080003
&FILL    SETC  'CL8'.''''.'&SYSDATE'.''''                               00090003
         DC    &FILL                                                    00092003
         MEND                                                           00094003
IGE0001H START X'00'                                                    00100003
*                                                                       00150003
***************************************************************@Y30LB10 00200003
*                                                              @Y30LB10 00250003
*01 MODULE-NAME = IGE0001H                                     @Y30LB10 00300003
*                                                              @Y30LB10 00350003
*01 DESCRIPTIVE NAME = 3851 ERROR RECOVERY PROCEDURES          @Y30LB10 00400003
*                                                              @Y30LB10 00450003
*01 COPYRIGHT = NONE                                           @Y30LB10 00500003
*                                                              @Y30LB10 00550003
*01 STATUS = VS2 REL 3.0 VERSION 1.                            @Y30LB10 00600003
*                                                              @Y30LB10 00650003
*01 FUNCTION =                                                 @Y30LB10 00700003
*   THE ERP WILL TEST STATUS AND SENSE BITS BY PRIORITY AND    @Y30LB10 00750003
*   DO THE ACTION DESCRIBED BY THE HARDWARE ERROR RECOVERY     @Y30LB10 00800003
*   PROCEDURES.                                                @Y30LB10 00810003
*                                                              @Y30LB10 00850003
*01 NOTES                                                      @Y30LB10 00900003
*                                                              @Y30LB10 00950003
*02    DEPENDENCIES =                                          @Y30LB10 01000003
*      THE ABNORMAL END APPENDAGE WILL CALL THE ERP FOR COND   @Y30LB10 01050003
*      CODE 3.                                                 @Y30LB10 01100003
*                                                              @Y30LB10 01150003
*02    RESTRICTIONS = NONE                                     @Y30LB10 01160003
*                                                              @Y30LB10 01300003
*02    REGISTER CONVENTIONS =                                  @Y30LB10 01350003
*      REG0      0    WORK REG                                 @Y30LB10 01400003
*      IOSBPTR   1    IOSB POINTER                             @Y30LB10 01450003
*      REG2      2    WORK REG                                 @Y30LB10 01500003
*      REG3      3    WORK REG                                 @Y30LB10 01550003
*      CSDPTR    3    CSD POINTER                              @Y30LB10 01600003
*      CVTXTN    4    CVT EXTENTION POINTER                    @Y30LB10 01650003
*      CVTREG    5    CVT POINTER                              @Y30LB10 01700003
*      EWAPTR    6    EWA POINTER                              @Y30LB10 01750003
*      PRIUCB    7    ADDRESS OF PRIMARY UCB                   @Y30LB10 01800003
*      REG7      7    WORK REG FOR IOSGEN MACRO                @Y30LB10 01810003
*      ALTUCB    8    ADDRESS OF ALTERNATE UCB                 @Y30LB10 01850003
*      CCWPTR    9    ADDRESS OF CCW IN ERROR                  @Y30LB10 01900003
*      CTLPTR    10   SSC CONTROL BLOCK POINTER                @Y30LB10 01950003
*      BASEREG   11   BASE REG                                 @Y30LB10 02000003
*      REGC      12   WORK REG                                 @Y30LB10 02050003
*      REGD      13   WORK REG                                 @Y30LB10 02100003
*      BALRREG   14   BRANCH REG                               @Y30LB10 02150003
*      REGF      15   WORK REG                                 @Y30LB10 02200003
*                                                              @Y30LB10 02250003
*02    PATCH LABEL = ERPMAINT                                  @Y30LB10 02300003
*                                                              @Y30LB10 02350003
*01 MODULE TYPE = LOAD MODULE                                  @Y30LB10 02400003
*                                                              @Y30LB10 02450003
*02    PROCESSER = ASSEMBLER XF                                @Y30LB10 02500003
*                                                              @Y30LB10 02550003
*02    MODULE SIZE = 4096 BYTES                                @Y30LB10 02600003
*                                                              @Y30LB10 02650003
*02    ATTRIBUTES = RE-ENTRANT, PRIVILEGED                     @Y30LB10 02700003
*                                                              @Y30LB10 02750003
*01 ENTRY POINT = IGE0001H                                     @Y30LB10 02800003
*                                                              @Y30LB10 02850003
*02    PURPOSE =                                               @Y30LB10 02900003
*      1. INITIAL CALL OF THE ERP FOR A ERROR CONDITION.       @Y30LB10 02950003
*      2. RETURN FROM A ERP RETRY SIO.                         @Y30LB10 03000003
*                                                              @Y30LB10 03050003
*02    LINKAGE = IOS WILL CALL THE ERP WITH REG 1 = POINTER    @Y30LB10 03100003
*      TO IOSB AND REG 15 = BASE ADDRESS OF THE MODULE.        @Y30LB10 03150003
*                                                              @Y30LB10 03200003
*01 INPUT = CONTROL BLOCKS 'IOSB', 'EWA' AND THE 'UCB' WILL    @Y30LB10 03250003
*   BE INITIALIZED BY IOS PRIOR TO ENTRY.                      @Y30LB10 03300003
*                                                              @Y30LB10 03350003
*01 OUTPUT = NONE                                              @Y30LB10 03400003
*                                                              @Y30LB10 03450003
*01 EXIT NORMAL = IOSB FLAGS 'ERR' AND 'EX' WILL BE SET TO;    @Y30LB10 03500003
*   1. 'ERR' = 1, 'EX' = 1 TO DO A ERP RETRY SIO.              @Y30LB10 03550003
*   2. 'ERR' = 0, 'EX' = 1 TO EXIT PERMANENT ERROR.            @Y30LB10 03600003
*   3. 'ERR' = 0, 'EX' = 0 TO EXIT RECOVERED ERROR.            @Y30LB10 03650003
*   EXIT TO;                                                   @Y30LB10 03660003
*   XCTL TO WTO (IGE0025C) TO PRINT MESSAGES.                  @Y30LB10 03670003
*   XCTL TO OBR (IGE0025F) TO RECORD ON SYS1.LOGREC.           @Y30LB10 03680003
*   SVC-15, SVC-3 RETURN TO IOS.                               @Y30LB10 03690003
*                                                              @Y30LB10 03700003
*01 EXIT ERROR = NONE                                          @Y30LB10 03750003
*                                                              @Y30LB10 03800003
*01 EXTERNAL REFERENCES =                                      @Y30LB10 03850003
*                                                              @Y30LB10 03900003
*02    ROUTINES = SVC 35 (WRITE TO OPERATOR SVC), IGE0025C     @Y30LB10 03950003
*      (SYSTEM WTO ROUTINE) AND IGE0025F (OBR ROUTINE).        @Y30LB10 04000003
*                                                              @Y30LB10 04050003
*02    DATA AREAS = NONE                                       @Y30LB10 04100003
*                                                              @Y30LB10 04150003
*02    CONTROL BLOCKS = CVT, UCB, IOSB, EWA AND IEZSSC.        @Y30LB10 04200003
*                                                              @Y30LB10 04250003
*01 TABLES = NONE                                              @Y30LB10 04300003
*                                                              @Y30LB10 04350003
*01 MACROS = WTO AND TIME.                                     @Y30LB10 04400003
*                                                              @Y30LB10 04450003
*01 CHANGE ACTIVITY = Y30LB10                                  @Y30LB10 04500003
*   CHANGE FOR DCR 184                                         @YD00184 04550003
*   CHANGE FOR WTO                                             @ZA00663 04560003
*   CHANGE FOR ICBR BIT TEST BEFORE HOST READY                 @ZM31093 04572003
*   CHANGE FOR ICBI BIT TEST BEFORE HOST INIT.                 @ZM31094 04574003
*   CHANGE TO LOG ALL COMMAND REJECT'S MESSAGE CODE 6          @ZM31098 04576003
*   CHANGE TO SUPPORT FCR 378                                  @ZM31108 04578003
*   CHANGE FOR CHAN. RESTART                                   @ZUP0988 04578403
*   CHANGE FOR ERROR PRIORITY TESTING                          @OZ00682 04578803
*   CHANGE FOR AS12579  CORRECT ALT PATH ADDRESS               @OZ05073 04580003
*   CHANGE TO SUPPORT INT REQ OR ENV DATA DURRING SWAP         @OZ00688 04582003
*   CHANGE FOR FCR450. HANDLE DIAG CCWS AS NORMAL CCWS.        @ZA05140 04584003
*   CHANGE TO CORRECT CCW PTR IF ERROR AFTER SUSPEND           @ZA05141 04586003
*   CHANGE TO ADD NOOP CCW + PREVENT SWAP CCWS BEING DESTROYED @ZA05142 04588003
*   ADD FICHE FLAGS TO FORMAT SENSE HOOK CODE                  @Y40LB02 04588403
*   CHANGE FORMAT 0, MSG CODE 06, TERM 3F DESTINATION          @ZA09552 04592003
*   CHANGE FORMAT 0, MSG CODE 06, TERM 25 DESTINATION          @ZA10999 04594003
*   CHANGE TO EXIT PERM ERROR ON INCORRECT LENGTH ERROR     *  @OZ11017 04596003
*   CHANGE TO LOG ALL 06XX ERRORS AND EXIT PERM ERROR          @ZA13053 04598003
*   ON PROTECTION OR PROGRAM CHECK                             @ZA13053 04598403
*   CHANGE TO HANDLE ERRORS DURING IPL                         @ZA13054 04598803
*   PROPERLY HANDLE CHAINING OF 06-26 WHEN 26 IS               @ZA13055 04599203
*   UNIT CHECKED                                               @ZA13055 04599603
*   CHANGE FOR FCR 588 ADD FORMAT1 AS VALID SUU FORMAT         @ZA14725 04616403
*   DELETE 06CA AND 06CB REASON CODES (PTM  VS44017)           @G24LB22 04626400
*   ATTACHED PROCESSOR SUPPORT                                 @G24LB05 04636400
*   CHANGE FOR IOSINTRP MACRO                                  @ZA20273 04638424
*   CHANGE 23 06/16/77  SWAP ON 0630 ERR                       @ZA24432 04640424
*   CHANGE 24 10/20/77  ADD ASSOCAITE COMMAND ON INIT OF MP    @ZA28260 04640824
*   CHANGE 25 11/22/77  LEAVE UCB ONLINE ON A MOD 0630 ERR     @ZA27590 04641224
*   CHANGE 26 02/10/78  FIX INVALID SWAP CODE IN PTF UZ13257   @ZA30113 04641424
*   CHANGE 27 06/02/78  LCH POINTER NOT SWAPPED DURING MSC SWAP@ZA32810 04641524
**************************************************************@Y30LB10  04641603
         EJECT                                                          04650003
*                                                              @Y30LB10 04700003
*              GENERAL REGISTER EQUATES                        @Y30LB10 04750003
*                                                              @Y30LB10 04800003
REG0     EQU   0                       WORK REG                @Y30LB10 04850003
IOSBPTR  EQU   1                       IOSB POINTER            @Y30LB10 04900003
REG2     EQU   2                       WORK REG                @Y30LB10 04950003
REG3     EQU   3                       WORK REG                @Y30LB10 05000003
SAVEPTR  EQU   4                       USER START SAVE POINTER @ZM30721 05100003
CVTREG   EQU   5                       CVT POINTER             @Y30LB10 05150003
EWAPTR   EQU   6                       EWA POINTER             @Y30LB10 05200003
PRIUCB   EQU   7                       PRIMARY UCB POINTER     @Y30LB10 05250003
REG7     EQU   7                       IOSGEN MACRO WORK REG   @Y30LB10 05260003
ALTUCB   EQU   8                       ALTERNATE UCB POINTER   @Y30LB10 05300003
CCWPTR   EQU   9                       USER CCW POINTER        @Y30LB10 05350003
CTLPTR   EQU   10                      SSC CTL BLOCK POINTER   @Y30LB10 05400003
BASEREG  EQU   11                      BASE REG                @Y30LB10 05450003
REGC     EQU   12                      WORK REG                @Y30LB10 05500003
REGD     EQU   13                      WORK REG                @Y30LB10 05550003
BALRREG  EQU   14                      BR REG                  @Y30LB10 05600003
REGF     EQU   15                      WORK REG                @Y30LB10 05650003
         EJECT                                                          05700003
***************************************************************@Y30LB10 05710003
*  EWA3SAV - SET ON WHEN THE ERP MUST DO I/O TO A CCW BUILT    @Y30LB10 05720003
*  IN THE ERP FOR RECOVERY. THE USER FAILING CCW ADDRESS IS    @Y30LB10 05730003
*  SAVED PRIOR TO THE I/O AND RESTORED ON THE NEXT ERP         @Y30LB10 05740003
*  ENTRY.                                                      @Y30LB10 05742003
*                                                              @Y30LB10 05744003
*  EWA3SWAP - SET ON WHEN UCB'S HAVE BEEN SWAPPED TO NOTE THE  @Y30LB10 05746003
*  ERP IS IN THE SWAP FUNCTION.                                @Y30LB10 05748003
*                                                              @Y30LB10 05749703
*  EWA3CCH - USED AS THE CCH ERROR COUNTER.                    @Y30LB10 05749803
*                                                              @Y30LB10 05754003
*                                                              @Y30LB10 05766603
*  EWA3MSC - SET ON WHEN A SWAP IS CAUSED BY THE MSC           @Y30LB10 05768603
*                                                              @Y30LB10 05770603
***************************************************************@Y30LB10 05772603
* NOTINIT - SET ON WHEN THE ERP DETECTS THE MSC IS NOT         @Y30LB10 05774603
*  INITIALIZED AND WILL ISSUE THE SWITCH CCW,S WITHOUT         @Y30LB10 05775003
*  SWITCHING THE UCB,S.                                        @Y30LB10 05775403
***************************************************************@Y30LB10 05782603
*                                                              @Y30LB10 05783003
*        IOSB FLAG C BIT MEANINGS                              @Y30LB10 05783303
*        EWA   EWAFLAG3 3851 FLAG BIT MEANINGS                 @Y30LB10 05850003
EWA3SAVE EQU   X'80'                   ERP USER CCW SAVE FLAG  @Y30LB10 05900003
EWA3SWAP EQU   X'40'                   ERP SWAP IN PROCESS     @Y30LB10 05950003
NOTINIT  EQU   X'20'                   MSC NOT INITIALIZED FLG @ZM30721 06000003
EWA3CCH  EQU   X'10'                   ERP CCH ERROR CNTR      @Y30LB10 06050003
SPARE    EQU   X'08'                   UNUSED BIT POSITION     @ZA05141 06100003
EWA3MSC  EQU   X'02'                   MSC SWITCH              @YD00155 06110003
         SPACE 1                                                        06150003
*         ERROR COUNTER THREE EQUATES                          @YD00155 06160003
SECENTRY EQU   X'80'                   SECOND ENTRY TO ERP     @YD00155 06170003
SECERR   EQU   X'40'                   SECOND CC=3 ERROR       @YD00155 06180003
TRDERR   EQU   X'20'                   THIRD CC=3 ERROR        @YD00155 06190003
         SPACE 1                                                        06192003
*        ALTERNATE UCB OFFSETS                                 @Y30LB10 06200003
ALTSTAT  EQU   3                       UCBSTAT EQUATE          @Y30LB10 06250003
ALTFLA   EQU   6                       UCBFLA EQUATE           @Y30LB10 06300003
ALTCHAN  EQU   4                       UCBCHAN EQUATE          @Y30LB10 06350003
ALTLCI   EQU   10                      UCBLCI  EQUATE          @ZA32810 06370024
ALTNAME  EQU   13                      UCBNAME EQUATE          @Y30LB10 06400003
         SPACE   3                                                      06450003
*        GENERAL PROGRAM EQUATES                               @Y30LB10 06500003
A3OP     EQU   X'A3'                   SUSPEND OP CODE         @Y30LB10 06550003
NOOP     EQU   X'03'                   NOP CCW OP CODE         @ZM31093 06560003
C0       EQU   0                       COUNT OF 0              @Y30LB10 06600003
C1       EQU   1                       COUNT OF 1              @Y30LB10 06650003
C2       EQU   2                       COUNT OF 2              @Y30LB10 06700003
C3       EQU   3                       COUNT OF 3              @Y30LB10 06750003
C4       EQU   4                       COUNT OF 4              @Y30LB10 06800003
C5       EQU   5                       COUNT OF 5              @ZA28260 06810024
C7       EQU   7                       COUNT OF 7              @Y30LB10 06850024
C8       EQU   8                       COUNT OF 8              @Y30LB10 06890024
C10      EQU   10                      COUNT OF 10             @YD00156 06930024
C12      EQU   12                      COUNT OF 12             @ZA28260 06970024
C24      EQU   24                      COUNT OF 24             @Y30LB10 07050003
C32      EQU   32                      COUNT OF 32             @Y30LB10 07100003
C37      EQU   37                      COUNT OF 37             @Y30LB10 07200003
C48      EQU   48                      COUNT OF 48             @Y30LB10 07300003
C57      EQU   57                      COUNT OF 57             @YD00156 07320003
C62      EQU   62                      COUNT OF 62             @YD00156 07330003
C63      EQU   63                      COUNT OF 63             @YD00156 07340003
CCC      EQU   X'04'                   CHANNEL CONTROL CHK     @Y30LB10 07350003
CDC      EQU   X'08'                   CHANNEL DATA CHK        @Y30LB10 07400003
CEE      EQU   X'EE'                   INVALID OP CODE FOR ERP @YD00155 07410003
CHN      EQU   X'01'                   CHAINING CHECK          @Y30LB10 07450003
CMDCHN   EQU   X'40'                   COMMAND CHAIN FLAG      @Y30LB10 07500003
COD41    EQU   X'41'                   COMPLETION CODE 41      @Y30LB10 07550003
CUBZY    EQU   X'50'                   STS MOD AND BUSY BITS   @Y30LB10 07600003
CEDEUC   EQU   X'0E'                   CH END,DEV END,UNIT CK  @OZ00688 07610003
EOT      EQU   X'FF'                   END OF TABLE INDICATOR  @Y30LB10 07650003
EXEC     EQU   X'87'                   EXECUTE COMND OP CODE   @Y30LB10 07700003
FIFTEEN  EQU   15                      SVC 15 CODE             @Y30LB10 07750003
FIVE     EQU   X'05'                   COUNT OF 5              @Y30LB10 07800003
ICC      EQU   X'02'                   INTERFACE CONTROL CHK   @Y30LB10 07850003
ILI      EQU   X'40'                   INCORRECT LENGTH        @Y30LB10 07900003
INTCOD44 EQU   X'44'                   INTERCEPT CODE 44       @Y30LB10 07950003
INTCOD7E EQU   X'7E'                   INTERCEPT CODE 7E       @Y30LB10 08000003
LOC10    EQU   16                      ADDR OF CVT             @Y30LB10 08050003
NOTON    EQU   8                       BR ZERO CODE            @Y30LB10 08150003
NONSNS   EQU   X'0A'                   SNS EXPECTED TO BE 0    @OZ00682 08160003
OBRRTN   EQU   256                     OBR RTN CALL CODE       @Y30LB10 08200003
OF       EQU   X'0F'                   MASK OF  ZERO-FOX       @Y30LB10 08250003
OPERSWAP EQU   X'FF'                   OP CODE OF X'FF'        @Y30LB10 08300003
PGM      EQU   X'20'                   PROGRAM CHK             @Y30LB10 08350003
PROT     EQU   X'10'                   PROTECTION CHK          @Y30LB10 08400003
SNSOP    EQU   X'04'                   OP CODE FOR SENSE       @Y30LB10 08450003
SUSPEND  EQU   X'06'                   DEV END + UNIT CHK      @Y30LB10 08500003
READBL   EQU   X'06'                   READ COMMAND            @ZA13055 08510003
THREE    EQU   3                       SVC 3 CODE              @Y30LB10 08550003
TIC      EQU   X'08'                   OP CODE OF TIC COMND    @Y30LB10 08600003
MSCOPVAR EQU   X'80'                   UCB OPER VARY FLAG      @YD00155 08610003
UNCK     EQU   X'02'                   UNIT CHK                @Y30LB10 08650003
WTORTN   EQU   253                     WTO RTN CALL CODE       @Y30LB10 08700003
X40      EQU   X'40'                   HEX BYTE OF 40          @Y30LB10 08750003
ZERO     EQU   X'00'                   BYTE OF ZERO            @Y30LB10 08800003
FSLD3RTN EQU   3018                    LD1 FS RTN CALL CODE    @Y40LB02 08810002
         EJECT                                                          08850003
         USING IOSB,IOSBPTR            USING REG 1             @Y30LB10 08900003
         USING EWA,EWAPTR              USING REG 6             @Y30LB10 08950003
         USING UCB,PRIUCB              USING REG 7             @Y30LB10 09000003
         USING CVTMAP,CVTREG           USING REG 5             @Y30LB10 09050003
         USING CVTXTNT2,CTLPTR         USING REG 10            @ZM30721 09100003
         USING *,BASEREG               USING REG 11            @Y30LB10 09250003
*******************                                            @Y30LB10 09300003
*  SET UP REGS FOR BASE AND CONTROL BLOCK POINTERS.            @Y30LB10 09350003
*  GET CCW IN ERROR ADDRESS.                                   @Y30LB10 09400003
*******************                                            @Y30LB10 09450003
ERR000   EQU   *                                               @Y30LB10 09500003
         LR    BASEREG,REGF            GET BASE REG            @Y30LB10 09550003
         B     ERR001                                          @ZM31108 09600003
         DC    C'IGE0001H'                                     @ZM31108 09650003
         DATEM                                                          09660003
ERR001   EQU   *                                               @Y30LB10 09700003
         L     PRIUCB,IOSUCB           GET UCB ADDR            @Y30LB10 09750003
         SH    PRIUCB,H512             POINT TO PREFIX         @Y30LB10 09800003
         L     EWAPTR,IOSERP           GET EWA ADDR            @Y30LB10 09850003
         L     CCWPTR,IOSCC            GET ERROR CCW ADDR      @Y30LB10 09900003
         LA    CCWPTR,C0(CCWPTR)       ZERO HI ORDER BYTE      @Y30LB10 09950003
         TM    IOSCC,IOSCC3            IS IT A COND CODE 3 ?   @ZM31108 09960003
         BO    ERR002                  YES CC-3 CCW OK AS IS   @ZM31108 09970003
         SH    CCWPTR,H8               POINT TO ERROR CCW      @Y30LB10 10000003
ERR002   EQU   *                                               @ZM31108 10010003
         L     CVTREG,LOC10            GET ADR OF CVT          @Y30LB10 10050003
         L     CTLPTR,CVTEXT2          GET ADDR OF CVT EXT     @Y30LB10 10100003
         L     CTLPTR,CVTICB           GET ADDR OF SSC CTL BLK @Y30LB10 10150003
         DROP  CTLPTR                  DROP REG 10             @ZM30721 10160003
         USING ICB2SSCB,CTLPTR         USING REG 10            @ZM30721 10170003
         L     ALTUCB,ICBAUCB          GET ADDR OF ALT UCB     @Y30LB10 10200003
         EJECT                                                          10750003
*******************                                            @Y30LB10 10800003
*  INSURE THAT MSG AND LOG ARE ZEROED                          @Y30LB10 10850003
*  SET SECOND ERP ENTRY SWITCH ON                              @Y30LB10 10860003
*******************                                            @Y30LB10 10900003
ERR010   EQU   *                                               @Y30LB10 10950003
         NI    IOSFLB,X'FF'-IOSMSG-IOSLOG  ZERO LOG AND MSG    @Y30LB10 11000003
         OI    EWACNTR3,SECENTRY  SET 2ND ENTRY SWITCH         @ZM31108 11010003
         SPACE 1                                                        11050003
*******************                                            @Y30LB10 11100003
*  IS THIS THE FIRST ENTRY TO THE ERP                          @Y30LB10 11150003
*  IF YES CLEAR ALL ERP FLAGS EXCEPT LOOP. RESET THE ERROR     @Y30LB10 11200003
*  COUNTERS AND SET THE ERP IN CONTROL.                        @Y30LB10 11250003
*******************                                            @Y30LB10 11300003
         TM    IOSFLA,IOSERR           1ST ENTRY TO ERP        @Y30LB10 11350003
         BO    ERR020                  BR NO                   @Y30LB10 11400003
*********                                                      @Y30LB10 11450003
         MVI   EWAFLG3,ZERO           CLR ALL                  @Y30LB10 11500003
         XC    EWACNTR2(C2),EWACNTR2   ZERO ERP COUNTERS       @ZM02150 11510003
ERR020   EQU   *                                               @Y30LB10 11600003
         OI    IOSFLA,IOSERR+IOSEX     SET ERP IN CONTROL      @Y30LB10 11650003
         SPACE 1                                                        11700003
*******************                                            @Y30LB10 11750003
*  IS UNIT CHECK ON. IF YES, WE HAVE SENSE AND A ERR CONDITION.@Y30LB10 11800003
*******************                                            @Y30LB10 11850003
         TM    IOSTSA,UNCK             IS UNIT CHK ON          @Y30LB10 11900003
         BO    ERR040                  BR YES                  @Y30LB10 11950003
         SPACE 1                                                        12000003
*******************                                            @Y30LB10 12050003
*  IF UNIT CHK IS NOT ON, DO WE HAVE A CONTROL UNIT BUSY COND. @Y30LB10 12100003
*  IF YES GO TO REISSUE THE OPERATION.                         @Y30LB10 12150003
*******************                                            @Y30LB10 12200003
         TM    IOSTSA,CUBZY            IS IT CU BUSY           @Y30LB10 12250003
         BO    ERR2000                 BR YES TO EXIT          @Y30LB10 12300003
         SPACE 1                                                        12350003
*******************                                            @Y30LB10 12400003
*  WE DONT HAVE UNIT CHECK OR A CU BUSY SO ZERO THE SENSE AREA.@Y30LB10 12450003
*******************                                            @Y30LB10 12500003
ERR030   EQU   *                                               @Y30LB10 12550003
         XC    EWASNS(C32),EWASNS      ZERO SENSE AREA         @Y30LB10 12600003
         SPACE 1                                                        12650003
*******************                                            @Y30LB10 12700003
*  DID WE SAVE THE USER CCW ADDRESS. IF YES, RESTORE THE IOSB  @Y30LB10 12750003
*  WITH THAT ADDRESS.                                          @Y30LB10 12800003
*******************                                            @Y30LB10 12850003
ERR040   EQU   *                                               @Y30LB10 12900003
         TM    EWAFLG3,EWA3SAVE        DID WE SAVE USERS CCW   @Y30LB10 12950003
         BZ    ERR050                  BR NO                   @Y30LB10 13000003
         L     REG2,UCBDEV+C4          GET SAVED CCW ADDR      @Y30LB10 13050003
         ST    REG2,IOSVST             STORE VIRT ADDR         @Y30LB10 13100003
         LRA   REG2,C0(REG2)           CONVERT TO REAL         @Y30LB10 13150003
         ST    REG2,IOSRST             STORE REAL ADDR         @Y30LB10 13200003
         NI    EWAFLG3,X'FF'-EWA3SAVE  SET SAVE FLAG OFF       @Y30LB10 13250003
         SPACE 1                                                        13300003
*******************                                            @Y30LB10 13350003
*  IF SWAP IS ON WE ARE RETURNING FROM ISSUEING THE INVALID OP @Y30LB10 13400003
*  CODE OF X'EE' OR THE SWITCH CCW'S, GO TO SWITCH CODE.       @Y30LB10 13450003
*  IF LOOP IS ON WE HAVE ISSUED THE SWITCH CCW,S FOR THE       @Y30LB10 13500003
*  MSC NOT BEING INITIALIZED ONCE AND WILL GO TO PERM ERR.     @Y30LB10 13510003
*******************                                            @Y30LB10 13550003
ERR050   EQU   *                                               @Y30LB10 13600003
         TM    EWAFLG3,NOTINIT+EWA3SWAP IS MSC INITALIZED      @ZA24432 13610024
         BC    5,ERR600                BR IF ONES OR MIXED     @ZA24432 13620024
         EJECT                                                          13850003
********************                                           @Y30LB10 13900003
*  IS IT A INTERCEPT CONDITION. IF YES GO TO PERM ERR          @Y30LB10 13950003
********************                                           @Y30LB10 14000003
         CLI   IOSCOD,INTCOD7E         IS IT A INTERCEPT       @Y30LB10 14050003
         BE    ERR440                  BR YES TO PERM ERR      @Y30LB10 14100003
         SPACE 1                                                        14150003
*******************                                            @Y30LB10 14200003
*  WAS THE CSW ADDRESS ZERO. IF YES, GO TO PERMANENT ERROR.    @Y30LB10 14250003
*******************                                            @Y30LB10 14300003
ERR060   EQU   *                                               @Y30LB10 14350003
         LTR   CCWPTR,CCWPTR           IS CCW ADDR ZERO        @Y30LB10 14400003
         BM    ERR500                  BR YES                  @Y30LB10 14450003
         SPACE 1                                                        14500003
*******************                                            @Y30LB10 14550003
*  IF COMMAND CHAINING, DID THE CCW STRING BREAK IN A          @Y30LB10 14600003
*  DIFFERENT SPOT. IF YES, RESET THE ERROR COUNTERS AND SAVE   @Y30LB10 14650003
*  THE NEW CCW IN ERROR ADDRESS.                               @Y30LB10 14700003
*  DO NOT CHANGE ANYTHING IF IT IS A INTERFACE SUSPEND COND    @ZA05141 14702003
*  OR AN 'A3' COMMAND                                          @ZA05141 14710003
*******************                                            @Y30LB10 14750003
         C     CCWPTR,IOSVST           CHAIN BREAK IN NEW SPOT @Y30LB10 14800003
         BE    ERR070                  BR NO                   @Y30LB10 14850003
         CLI   C0(CCWPTR),A3OP         TEST FOR 'A3' CMD       @ZA05141 14900003
         BE    ERR070                  BRANCH IF A3            @ZA05141 14950003
         CLI   C0(CCWPTR),READBL       TEST FOR '06' CMD       @ZA05141 14960003
         BE    ERR070                  BRANCH IF 06            @ZA05141 14970003
ERR065   EQU   *                                               @YD00154 14996003
         NI    EWAFLG3,X'FF'-EWA3CCH  CLR CCH CNTR             @Y30LB10 15000003
         MVI   EWACNTR2,ZERO           CLR ERR CNTR            @Y30LB10 15050003
         ST    CCWPTR,IOSVST           STORE NEW ADDR IN VIRT  @Y30LB10 15100003
         LRA   REG2,C0(CCWPTR)         GET REAL ADDR           @Y30LB10 15150003
         ST    REG2,IOSRST             STORE IN REAL           @Y30LB10 15200003
         SPACE 1                                                        15250003
*******************                                            @Y30LB10 15600003
*    IS IT COND CODE 3.                                        @YD00155 15610003
*    IF YES AND ITS THE 1ST TIME, TRY ONCE MORE FOR ALT PATH   @YD00155 15620003
*   RETRY. IF ITS THE 2ND TIME GO TO SWITCH THE MSC;S          @YD00155 15630003
*******************                                            @Y30LB10 15700003
ERR070   EQU   *                                               @ZA05141 15710003
         TM    IOSCC,IOSCC3            IS IT COND CODE 3       @Y30LB10 15750003
         BNO   ERR071                  BR NO TO CCC, ICC       @OZ00682 15800003
         TM    EWACNTR3,SECERR         IS IT 2ND ERR           @YD00155 15810003
         BO    ERR565                  BR YES TO SWITCH        @ZA00663 15820003
         OI    EWACNTR3,SECERR         NO, SET 2ND ERR         @YD00155 15830003
         B     ERR2000                 GO RETRY                @YD00155 15840003
         SPACE 1                                                        15890003
*******************                                            @Y30LB10 15892003
*  IS IT A CCH (ICC/CCC) ERROR. IF YES, GO TO CCH CODE.        @Y30LB10 15894003
*******************                                            @Y30LB10 15896003
ERR071   TM    IOSTSB,ICC+CCC          IS IT CCH ERR           @Y30LB10 15898003
         BNZ   ERR300                  BR YES TO CCH CODE      @Y30LB10 15898403
         SPACE 1                                                        15898803
*******************                                            @Y30LB10 15899203
*  IS IT CHANNEL DATA CHECK . IF YES, GO RETRY.                @OZ00682 15899603
*******************                                            @OZ00682 15899903
         TM    IOSTSB,CDC              CHAN DATA CK ?          @OZ00682 15900003
         BNZ   ERR400                  BR YES CDC              @OZ00682 15903203
*******************                                            @Y30LB10 15903302
*  IS IT UNUSED SENSE BITS???                                  @OZ00682 15903402
*******************                                            @OZ00682 15903502
         TM    EWOSNS0,NONSNS          ARE UNUSED SENSE ON?    @OZ00682 15903603
         BNZ   ERR500                  SET PERM ,LOG, & MSG ON @OZ00682 15904002
         SPACE 1                                                        15905203
*******************                                            @Y30LB10 15906703
* IS IT A COMMAND REJECT. IF YES, CONTINUE.                    @Y30LB10 15910003
*******************                                            @Y30LB10 16100003
ERR072   EQU   *                                               @YD00155 16110003
         TM    EWOSNS0,EWOCREJ         IS IT COMND REJ         @Y30LB10 16150003
         BZ    ERR080                  BR NO                   @Y30LB10 16200003
         SPACE 1                                                        16250003
* IF ITS NOT FORMAT 0, GO TO PERM                              @OZ00682 16302003
         TM    EWOSNS3,EWOFOR0         IS IT FORMAT 0          @Y30LB10 16310003
         BZ    ERR078                  BR NO                   @OZ00682 16320003
         SPACE 1                                                        16320103
* IF ITS MSG '02' GO ISSUE THE SWITCH CCW,S WITHOUT SWITCHING  @YD00155 16320203
*  THE UCB,S.                                                  @YD00155 16320303
         CLI   EWOSNS11,EWOMSG02       IS IT MSG 02            @YD00155 16323103
         BE    ERR545                  BR YES TO SW            @YD00155 16325103
         SPACE 1                                                        16326003
* IS IT A INTERFACE SUSPEND, MSG X'0B'                         @ZM02150 16328803
* IF ITS MSG X'0B' AND ERR IN ERP, GO TO SUSPEND NORMAL.       @ZM02150 16331603
* IF ITS MSG X'0B' AND USER ERR, GO TO SUSPEND 1ST CCW.        @ZM02150 16334403
         CLI   EWOSNS11,EWOMSG0B       IS IT MSG '0B'          @ZM02150 16337203
         BNE   ERR075                  BR NO                   @ZM02150 16340003
         TM    EWACNTR3,SECENTRY       THIS 1ST ENTRY TO ERP   @ZM02150 16342003
         BO    ERR205                  BR NO TO SUSPEND        @ZM02150 16344003
         LRA   REG3,C0(CCWPTR)         GET ADR OF ERR CCW      @ZM02150 16346003
         B     ERR210                  BR TO SUSPEND           @ZM02150 16350003
         SPACE 1                                                        16352003
ERR075   EQU   *                                               @YD00133 16360003
*  IF ITS MSG CODE '0A' ITS A SWAP CONDITION                   @YD00155 16365203
         CLI   EWOSNS11,EWOMSG0A       IS IT MSG '0A'          @YD00155 16367203
         BE    ERR550                  BR YES TO SWAP          @YD00155 16367603
         SPACE 1                                                        16369203
* IF MSG 1,2,3 OR 4, CALL PERM ERR, PRT MSG WITH NO LOG        @YD00133 16372803
         CLI   EWOSNS11,EWOMSG04       IS IT MSG 1,2,3,4       @YD00133 16376403
         BNH   ERR495                  BR IF YES               @YD00133 16380003
         SPACE 1                                                        16380403
* IF ITS NOT MSG 6 CALL PERM ERR, PRT MSG WITH LOG             @YD00133 16382003
         CLI   EWOSNS11,EWOMSG06       IS IT MSG 6             @YD00133 16390003
         BNE   ERR500                  BR NO                   @YD00133 16392003
         SPACE 1                                                        16392103
* MSG 6- IF CODE IS FOR SWAP, GO TO SWAP CODE.                 @YD00155 16392203
*        IF CODE IS NOT '80', PERM ERR, PRT MSG WITH LOG       @ZM31098 16456503
         CLI   EWOSNS12,EWOCOD80       IS IT FOR SWAP          @YD00155 16466503
         BE    ERR550                  BR YES TO SWAP          @YD00155 16473003
         CLI   EWOSNS12,EWOCOD30       IS IT FOR SWAP          @ZA24432 16483024
         BE    ERR550                  BR YES TO SWAP          @ZA24432 16493024
         CLI   EWOSNS12,EWOCOD25       IS IT TERM CODE 25      @ZA13053 16523003
         BE    ERR500                  BR TO LOG IT WITH MSG   @ZA13053 16573003
         CLI   EWOSNS12,EWOCOD2D       IS IT TERM CODE 2D      @ZA13053 16575003
         BE    ERR500                  BR TO LOG IT WITH MSG   @ZA13053 16577003
         CLI   EWOSNS12,EWOCOD3F       IS IT TERM CODE 3F      @ZA28260 16579024
         BE    ERR500                  BR TO LOG IT WITH MSG   @ZA28260 16580024
         CLI   EWOSNS12,EWOCOD57       IS IT TERM CODE 57      @ZA28260 16581024
         BE    ERR077                  BR TO TEST FOR MP       @ZA28260 16582024
         CLI   EWOSNS12,EWOCODCA       IS IT TERM CODE CA      @G24LB22 16589924
         BE    ERR510                  BR TO LOG IT            @G24LB22 16591924
         CLI   EWOSNS12,EWOCODCB       IS IT TERM CODE CB      @G24LB22 16593924
         BE    ERR510                  BR TO LOG IT            @G24LB22 16595924
         CLI   EWOSNS12,EWOCODC0       IS IT TERM CODE C0      @YD00155 16597924
         BNL   ERR500                  BR TO LOG IT WITH MSG   @ZA13053 16599924
         B     ERR510                  BR TO LOG THE REST      @ZA13053 16601924
ERR077   EQU   *                                               @ZA28260 16602324
         TM    ICBFG1,ICBR             IS READY SET            @ZA28260 16602724
         BO    ERR510                  BR YES TO LOG IT        @ZA28260 16603124
ERR078   EQU   *                                                        16603924
         NI    IOSFLA,X'FF'-IOSERR     SET TO PERMANENT ERR    @OZ00682 16605903
         B     EXIT                    PERM ERR, NO MSG OR LOG @OZ00682 16615903
         SPACE 1                                                        16625903
*******************                                            @Y30LB10 16950003
ERR080   EQU   *                                               @Y30LB10 16960003
*  IS IT A SENSE FAILURE. IF YES CALL THE EQ CHK A PERM ERR.   @Y30LB10 17000003
*******************                                            @Y30LB10 17050003
ERR090   EQU   *                                               @Y30LB10 17100003
         TM    EWOSNS0,EWOEQU          IS IT EQ CHK            @Y30LB10 17150003
         BZ    ERR100                  BR NO                   @Y30LB10 17200003
         CLI   C0(CCWPTR),SNSOP        IS IT A SNS OP CODE     @Y30LB10 17250003
         BE    ERR500                  BR YES TO PERM ERR      @Y30LB10 17300003
         SPACE 1                                                        17750003
ERR100   EQU   *                                               @ZM31108 17760003
*******************                                            @Y30LB10 17800003
*  IS IT HOST RETRY. IF YES RETRY THE OPERATION.               @Y30LB10 17850003
*******************                                            @Y30LB10 17900003
         TM    EWOSNS0,EWOHRET         IS IT HOST RETRY        @Y30LB10 17950003
         BO    ERR530                  BR YES TO RETRY         @ZM31108 18000003
         SPACE 1                                                        18050003
*******************                                            @Y30LB10 18400003
*  IS IT INTERVENTION REQUIRED OR ENVIROMENTAL DATA. IF YES,   @Y30LB10 18450003
*  GO SEE IF IT IS A SUSPEND CONDITION.                        @Y30LB10 18500003
*******************                                            @Y30LB10 18550003
ERR120   EQU   *                                               @Y30LB10 18600003
         TM    EWOSNS0,EWOINT+EWOENV   INT REQ OR ENV DATA     @Y30LB10 18650003
         BNZ   ERR200                  BR IF EITHER ON         @Y30LB10 18700003
         SPACE 1                                                        18750003
*******************                                            @Y30LB10 18800003
*  IS IT EQUIPMENT CHECK OR BUS OUT. IF YES, GO ATTEMPT A      @Y30LB10 18850003
*  RETRY.                                                      @Y30LB10 18900003
*******************                                            @Y30LB10 18950003
         TM    EWOSNS0,EWOEQU+EWOBUSO  EQ CHK OR BUS OUT       @Y30LB10 19000003
         BNZ   ERR400                  BR IF EITHER ON         @Y30LB10 19050003
         SPACE 1                                                        19100003
*******************                                            @Y30LB10 19150003
*  IS IT CHAINING CHECK. IF YES, GO RETRY.                     @OZ00682 19200003
*******************                                            @Y30LB10 19300003
         TM    IOSTSB,CHN              IS IT CHAINING CHK?     @OZ00682 19350003
         BNZ   ERR400                  BR YES CHAINING CHK     @OZ00682 19360003
         SPACE 1                                                        19450003
*******************                                            @Y30LB10 19500003
*  IS IT PROGRAM CHECK, PROTECTION CHECK OR INCORRECT LENGTH.  @Y30LB10 19550003
*  IS YES, GO TO PERMANENT ERROR.                              @Y30LB10 19600003
*******************                                            @Y30LB10 19650003
         TM    IOSTSB,PGM+PROT+ILI     PGM CK, PROT CK         @ZA13053 19700003
         BNZ   ERR078                  BR IF ANY BIT ON        @ZA13053 19750003
         SPACE 1                                                        19800003
*******************                                            @Y30LB10 19850003
*  NO ERRORS HAVE BEEN FOUND. IF UNIT CHK IS ON,               @Y30LB10 19900003
*  GO TO PERM ERROR.                                           @Y30LB10 19950003
*******************                                            @Y30LB10 20000003
         TM    IOSTSA,UNCK             IS UNIT CHK ON          @Y30LB10 20050003
         BO    ERR500                  BR YES TO PERM ERR      @Y30LB10 20100003
         SPACE 1                                                        20150003
*******************                                            @Y30LB10 20200003
*  NO STATUS OR SENSE ERRORS HAVE BEEN FOUND. CALL THE         @Y30LB10 20250003
*  ERROR RECOVERED AND EXIT THE ERP.                           @Y30LB10 20300003
*******************                                            @Y30LB10 20350003
ERR130   EQU   *                                               @Y30LB10 20400003
         MVI   EWAFLG3,ZERO           CLR ERP FLAGS            @Y30LB10 20450003
         XC    EWACNTR2(C2),EWACNTR2   ZERO ERR CNTRS          @Y30LB10 20460003
         NI    IOSFLA,X'FF'-IOSERR-IOSEX  SET ERR RECOVERED    @Y30LB10 20550003
         B     ERR2000                 BR TO EXIT              @Y30LB10 20600003
         EJECT                                                          20650003
*******************                                            @Y30LB10 20700003
*  IS IT A SUSPEND CONDITION (DEV END + UNIT CHK ONLY).        @Y30LB10 20750003
*  IF NO, GO CHECK FURTHER. IF YES, BUILD THE SUSPEND CCW.     @Y30LB10 20800003
*  IF THE COMMAND WAS CHAINED, TIC TO THE NEXT USER CCW.       @Y30LB10 20850003
*  IF NO CHAINING, ISSUE THE 'A3' UNCHAINED.                   @Y30LB10 20860003
*******************                                            @Y30LB10 20950003
ERR200   EQU   *                                               @Y30LB10 21000003
         CLI   IOSTSA,SUSPEND          IS IT A SUSPEND COND    @Y30LB10 21050003
         BNE   ERR240                  BR NO                   @Y30LB10 21100003
ERR205   EQU   *                                               @ZM02150 21102003
         LRA   REG3,C8(CCWPTR)         GET ADR OF ERR CCW+8    @ZM02150 21104003
ERR210   EQU   *                                               @Y30LB10 21110003
         OI    EWAFLG3,EWA3SAVE        SET SAVE ON             @ZA05141 21150003
         MVC   EWOCCW3(C8),CCWSUS1     MOVE SUSPEND CCW TO EWA @ZM02151 21200003
         LRA   REG2,C0(CCWPTR)         GET REAL ERR CCW ADR    @Y30LB10 21250003
         ST    REG2,EWOCCW3            ERR CCW ADR IN A3 CMD   @ZM02151 21300003
         MVC   UCBDEV+C4(C4),IOSVST    SAVE USER CCW ADR       @Y30LB10 21400003
         LA    REG2,EWOCCW1            GET VIRT ADR OF CCWS    @Y30LB10 21450003
         ST    REG2,IOSVST             PUT IN IOSB             @Y30LB10 21500003
         LRA   REG2,EWOCCW1            GET REAL CCW ADDR       @Y30LB10 21550003
         ST    REG2,IOSRST             SET IN IOSB START FIELD @Y30LB10 21600003
         TM    C4(CCWPTR),CMDCHN       IS ERR CCW CHAINED      @ZM02151 21650003
         BO    ERR217                  BRANCH YES              @ZA05142 21660003
         MVC   EWOCCW2(C8),CCWNOOP     MOVE IN NOOP CCW        @ZA05142 21670003
         B     ERR235                                          @ZA05142 21680003
ERR217   EQU   *                                               @ZA05142 21690003
         CLI   C0(CCWPTR),A3OP         WAS A3 FAILING CMD?     @ZA05142 21692003
         BE    ERR235                  BR TO BUILD A3 ONLY     @ZA05142 21694003
         CLI   C8(CCWPTR),TIC          IS CCW+8 A TIC          @Y30LB10 21700003
         BNE   ERR230                  BR NO                   @ZM02151 21900003
ERR220   EQU   *                                               @Y30LB10 21950003
         L     REG3,C8(CCWPTR)         GET THE TIC TO ADR      @ZM02151 22000003
ERR230   EQU   *                                               @Y30LB10 22050003
         ST    REG3,EWOCCW2            TIC TO ADR IN SUS TIC   @ZM02151 22100003
         MVI   EWOCCW2,TIC             TIC OP CODE BACK IN CCW @ZM02151 22150003
         MVC   EWOCCW2+C4(C4),CCWEND   MOVE RIGHT HALF OF CCW  @ZM02151 22152003
         SPACE 1                                                        22200003
ERR235   EQU   *                                               @Y30LB10 22210003
         MVI   EWOCCW3,A3OP            SET A3 OP CODE IN CCW   @ZM02151 22210403
         MVC   EWOCCW1(C8),EWOCCW3     MOVE CCWS TO START ADR  @ZM02151 22212003
         TM    EWOSNS0,EWOCREJ         IS IT COMND REJ         @Y30LB10 22220003
         BO    ERR520                  BR YES                  @Y30LB10 22230003
         SPACE 1                                                        22240003
*******************                                            @Y30LB10 22250003
*  IS IT INTERVENTION REQUIRED. IF YES, GO TO PRINT MSG        @Y30LB10 22300003
*  AND RETRY. IF NO, ITS ENVIROMENTAL DATA, GO RECORD          @Y30LB10 22350003
*  AND RETRY.                                                  @Y30LB10 22400003
*******************                                            @Y30LB10 22450003
ERR240   EQU   *                                               @Y30LB10 22500003
         TM    EWOSNS0,EWOINT          IS IT INT REQ           @Y30LB10 22550003
         BNO   ERR410                  BR NO                   @ZM31108 22600003
         OI    IOSFLB,IOSLOG           SET LOG ON              @ZM31108 22650003
         B     WTOOUT                  YES INT REQ,EXIT WTO    @ZM31108 22660003
         EJECT                                                          22700003
*******************                                            @Y30LB10 22750003
*  CCH CODE.                                                   @Y30LB10 22800003
*  IS THIS THE SECOND TIME FOR THIS ERROR. IF YES, GO TO       @Y30LB10 22850003
*  PERMANENT ERROR.                                            @Y30LB10 22900003
*******************                                            @Y30LB10 22950003
ERR300   EQU   *                                               @Y30LB10 23000003
         TM    EWAFLG3,EWA3CCH        2ND TIME FOR THIS ERR    @Y30LB10 23050003
         BO    ERR380                  BR YES                  @Y30LB10 23100003
         SPACE 1                                                        23150003
*******************                                            @Y30LB10 23200003
*  WAS ERROR ON A TIO, HIO OR IS THE NO RETRY BIT ON IN ERPIB. @Y30LB10 23250003
*  IF ANY, GO TO PERMANENT ERROR.                              @Y30LB10 23300003
*******************                                            @Y30LB10 23350003
         TM    EWARGFG1,EWACTIO+EWACHIO+EWANORTY   HIO,TIO OR? @Y30LB10 23400003
         BNZ   ERR380                  BR IF ANY BITS ON       @Y30LB10 23450003
         SPACE 1                                                        23500003
*******************                                            @Y30LB10 23550003
*  WAS THE ERROR ON A INTERRUPT OR A COND CODE 1. IF NEITHER   @Y30LB10 23600003
*  OR BOTH, GO TO PERMANENT ERROR.                             @Y30LB10 23650003
*******************                                            @Y30LB10 23700003
         TM    EWARGFG1,EWACSIO+EWACINT  ERR ON SIO OR INTERR  @Y30LB10 23750003
         BO    ERR380                  BR BOTH ON              @Y30LB10 23800003
         BZ    ERR380                  BR NEITHER ON           @Y30LB10 23850003
         SPACE 1                                                        23900003
*******************                                            @Y30LB10 23950003
*  IS IT A COND CODE 1. IF YES, THE CCW CAN BE RESTARTED SO    @Y30LB10 24000003
*  BYPASS SOME ERROR TESTING.                                  @Y30LB10 24050003
*******************                                            @Y30LB10 24100003
         TM    IOSCC,IOSCC1            IS IT COND CODE 1       @Y30LB10 24150003
         BO    ERR330                  BR YES                  @Y30LB10 24200003
         SPACE 1                                                        24250003
*******************                                            @Y30LB10 24300003
*  ARE VALIDITY BITS ALL ON. IF ANY OFF, GO TO PERM ERROR.     @Y30LB10 24350003
*******************                                            @Y30LB10 24400003
         TM    EWAXCSW1,EWACSQV+EWACUNS+EWACCMD SEQ,STS,CMD OK @Y30LB10 24450003
         BNO   ERR380                  BR IF ANY OFF           @Y30LB10 24500003
         SPACE 1                                                        24550003
*******************                                            @Y30LB10 24600003
*  ONLY TERM CODES OF 0 OR 1 ARE RETRIABLE. IF TERM CODE IS    @Y30LB10 24650003
*  2 OR 3 GO TO PERM ERROR.                                    @Y30LB10 24700003
*******************                                            @Y30LB10 24750003
ERR330   EQU   *                                               @Y30LB10 24800003
         TM    EWAXCSW2,EWATER3        IS TERM CODE 3          @Y30LB10 24850003
         BO    ERR380                   BR YES                 @Y30LB10 24900003
         TM    EWAXCSW2,EWATER2        IS TERM CODE 2          @Y30LB10 24950003
         BO    ERR380                  BR YES                  @Y30LB10 25000003
         SPACE 1                                                        25050003
*******************                                            @Y30LB10 25100003
*  ONLY  SEQ CODE OF 1,2 OR 3 ARE RETRIABLE. IF IT IS SEQ      @Y30LB10 25150003
*  CODE 0,4,5,6 OR 7 GO TO PERM ERROR.                         @Y30LB10 25200003
*******************                                            @Y30LB10 25250003
         TM    EWAXCSW2,EWASEQ4        IS SEQ CODE 4,5,6,7     @Y30LB10 25300003
         BO    ERR380                  BR YES                  @Y30LB10 25350003
         TM    EWAXCSW2,EWASEQ7        IS SEQ CODE 0           @Y30LB10 25400003
         BZ    ERR380                  BR YES                  @Y30LB10 25450003
         SPACE 1                                                        25500003
*******************                                            @Y30LB10 25550003
*  ZERO THE ERPIB, SET THE CCH COUNTER BIT ON AND GO TO        @Y30LB10 25600003
*  RETRY THE OPERATION.                                        @Y30LB10 25650003
*******************                                            @Y30LB10 25700003
ERR360   EQU   *                                               @Y30LB10 25750003
         XC    EWAERPIB(C8),EWAERPIB   ZERO ERPIB              @Y30LB10 25800003
         OI    EWAFLG3,EWA3CCH        SET CCH CNTR ON          @Y30LB10 25850003
         B     ERR2000                 BR                      @Y30LB10 25900003
         SPACE 1                                                        25950003
*******************                                            @Y30LB10 26000003
*  ZERO THE ERPIB AND GO TO PERM ERROR.                        @Y30LB10 26050003
*******************                                            @Y30LB10 26100003
ERR380   EQU   *                                               @Y30LB10 26150003
         XC    EWAERPIB(C8),EWAERPIB   ZERO ERPIB              @Y30LB10 26200003
         B     ERR500                  BR                      @Y30LB10 26250003
         EJECT                                                          26300003
*******************                                            @Y30LB10 26350003
*  IS THE ERROR COUNTER = 5. IF NO, GO ATTEMPT A RETRY.        @Y30LB10 26400003
*  IF YES, SEE IF A SWAP IS REQUIRED.                          @Y30LB10 26450003
*******************                                            @Y30LB10 26500003
ERR400   EQU   *                                               @Y30LB10 26550003
         CLI   EWACNTR2,FIVE           IS ERR EQUAL TO FIVE    @Y30LB10 26600003
         BE    ERR470                  BR YES                  @Y30LB10 26650003
         SPACE 1                                                        26700003
*******************                                            @Y30LB10 26750003
*  STEP THE ERROR COUNTER BY ONE.                              @Y30LB10 26800003
*******************                                            @Y30LB10 26850003
         IC    REG2,EWACNTR2           GET ERR CNTR            @Y30LB10 26900003
         LA    REG2,C1(REG2)           STEP BY ONE             @Y30LB10 26950003
         STC   REG2,EWACNTR2           PUT BACK                @Y30LB10 27000003
         SPACE 1                                                        27050003
*******************                                            @Y30LB10 27100003
*  IS IT EQ CHK OR ENVIROMENTAL DATA. IF NEITHER GO RETRY.     @Y30LB10 27150003
*  IF EITHER GO CHECK FOR CEM AND SUU.                         @Y30LB10 27200003
*******************                                            @Y30LB10 27250003
ERR410   EQU   *                                               @Y30LB10 27300003
         TM    EWOSNS0,EWOENV          IS IT ENV DATA          @Y30LB10 27350003
         BO    ERR420                  BR YES                  @Y30LB10 27400003
         TM    EWOSNS0,EWOEQU          IS IT EQ CHK            @Y30LB10 27450003
         BZ    ERR2000                 NO TO EXIT SVC 15 RETRY @Y30LB10 27500003
         SPACE 1                                                        27550003
*******************                                            @Y30LB10 27600003
*  IF NOT CEM GO TO RETRY. IF CEM                              @ZA28260 27650024
*  THE ERP WILL PRINT THE MESSAGE. THEN GO RETRY.              @ZA28260 27690024
*******************                                            @Y30LB10 27730024
         TM    EWOSNS1,EWOCEM          IS CE MSG ON            @ZA28260 27770024
         BZ    ERR530                  BR IF NEITHER ON        @ZM31108 27810024
         MVC   EWOMSG(C37),WTOMSG      MOVE MSG TO EWA         @ZA28260 27850024
         MVC   EWOWTOB(C3),MSGCEM      MOVE CEM TO MSG         @ZA28260 27890024
         BAL   REG3,MSG100             GO PRT CEM MSG          @ZA28260 27930024
         B     ERR520                  TO WTO TO PRT EQ CK MSG @Y30LB10 27970024
         SPACE 1                                                        28010024
*******************                                            @Y30LB10 28050024
*  IS IT SUU. IF SO ERP WILL PRINT SUU THEN GO RETRY.          @ZA28260 28090024
*******************                                            @Y30LB10 28130024
ERR420   EQU   *                                               @Y30LB10 28170024
         TM    EWOSNS1,EWOSUU+EWOCEM   IS IT SUU OR CEM        @ZA28260 28210024
         BZ    ERR530                  IF OFF GO TO RETRY      @ZA28260 28260024
         B     ERR520                  IF EITHER ON GO TO WTO  @ZA28260 28310024
         SPACE 1                                                        28600003
*******************                                            @Y30LB10 28650003
*  SET INTERCEPT TO PERM ERROR.                                @Y30LB10 28700003
********************                                           @Y30LB10 28750003
ERR440   EQU   *                                               @Y30LB10 28800003
         MVI   IOSCOD,INTCOD44         SET INTERCEPT PERM ERR  @Y30LB10 28850003
         SPACE 1                                                        28900003
*********************                                          @Y30LB10 28950003
*  SET PERMANENT ERROR ON                                      @Y30LB10 29000003
*********************                                          @Y30LB10 29050003
ERR450   EQU   *                                               @Y30LB10 29100003
         NI    IOSFLA,X'FF'-IOSERR     SET PERM ERR            @Y30LB10 29150003
         B     ERR530                  SET LOG ON & EXIT OBR   @ZM31108 29160003
         SPACE 1                                                        29200003
*******************                                            @Y30LB10 29650003
*  IS IT EQUIPMENT CHECK OR BUS OUT. IF EITHER, SET UP TO      @Y30LB10 29700003
*  GO TO THE SWAP CODE. IF NEITHER  EXIT PERM ERROR.           @Y30LB10 29750003
*******************                                            @Y30LB10 29800003
ERR470   EQU   *                                               @Y30LB10 29850003
         TM    EWOSNS0,EWOEQU+EWOBUSO  EQ CHK OR BUS OUT       @Y30LB10 29900003
         BZ    ERR500                  BR IF NEITHER ON        @Y30LB10 29950003
         SPACE 1                                                        30000003
*******************                                            @Y30LB10 30050003
*  SET MSG ON. IF CEM ON GO PRINT CEM MESSAGE.                 @Y30LB10 30100003
*******************                                            @Y30LB10 30150003
         OI    IOSFLB,IOSMSG           SET MSG ON              @Y30LB10 30200003
         MVC   EWOMSG(C37),WTOMSG      MOVE MSG TO EWA         @ZA28260 30210024
         MVC   EWOWTOB(C3),MSGCEM      MOVE CEM TO MSG         @ZA28260 30220024
         BAL   REG3,MSG100             GO PRT CEM MSG          @ZA28260 30230024
         SPACE 1                                                        30300003
********************                                           @Y30LB10 30600003
*  IT IS EQ CHK OR BUSOUT AND WE WANT TO SWAP                           30650003
*******************                                            @Y30LB10 30800003
ERR480   EQU   *                                               @Y30LB10 30850003
         B     ERR560                  BR TO SWAP              @YD00155 31200003
         SPACE 1                                                        31250003
*********************                                          @YD00133 32310003
* SET TO PERMANENT ERROR, SET MSG ON, GO TO WTO                @YD00133 32320003
********************                                           @YD00133 32330003
ERR495   EQU   *                                               @YD00133 32340003
         OI    IOSFLB,IOSMSG           SET MSG ON              @YD00133 32342003
         NI    IOSFLA,X'FF'-IOSERR     SET PERM ERR            @YD00133 32344003
         B     EXIT                    GO TO WTO               @ZM31108 32348003
         SPACE 1                                                        32348403
*******************                                            @Y30LB10 32350003
*  SET MSG ON.                                                 @Y30LB10 32400003
*******************                                            @Y30LB10 32450003
ERR500   EQU   *                                               @Y30LB10 32500003
         OI    IOSFLB,IOSMSG           SET MSG ON              @Y30LB10 32550003
         SPACE 1                                                        32600003
*******************                                            @Y30LB10 32650003
*  SET ERP TO PERMANENT ERROR.                                 @Y30LB10 32700003
*******************                                            @Y30LB10 32750003
ERR510   EQU   *                                               @Y30LB10 32800003
         NI    IOSFLA,X'FF'-IOSERR SET ERR TO PERMANENT        @Y30LB10 32850003
         B     ERR530                  BR                      @Y30LB10 32900003
         SPACE 1                                                        32950003
*******************                                            @Y30LB10 33000003
*  SET MSG ON.                                                 @Y30LB10 33050003
*******************                                            @Y30LB10 33100003
ERR520   EQU   *                                               @Y30LB10 33150003
         OI    IOSFLB,IOSMSG           SET MSG ON              @Y30LB10 33200003
         SPACE 1                                                        33250003
*******************                                            @Y30LB10 33300003
*  SET LOG ON.                                                 @Y30LB10 33350003
*******************                                            @Y30LB10 33400003
ERR530   EQU   *                                               @Y30LB10 33450003
         OI    IOSFLB,IOSLOG           SET LOG ON              @Y30LB10 33500003
         SPACE 1                                                        33550003
*******************                                            @Y30LB10 33600003
*  GO TO COMMON EXIT ROUTINE.                                  @ZM31108 33650003
*******************                                            @Y30LB10 33700003
         B     EXIT                                            @ZM31108 33850003
         SPACE 1                                                        33900003
********************                                           @YD00155 33910003
*  THE MSC IS NOT INITIALIZIED. SET FLAG AND GO TO ISSUE THE   @YD00155 33912003
*  SWITCH CCW,S WITHOUT SWITCHING THE UCB,S.                   @YD00155 33914003
********************                                           @YD00155 33920003
ERR545   EQU   *                                               @YD00155 33930003
         OI    IOSFLB,IOSMSG+IOSLOG    SET MSG & LOG ON        @YD00155 33940002
         OI    EWAFLG3,NOTINIT         SET MSC NOT INIT ON     @ZM30721 33942003
         MVI   EWACNTR2,C0             ZERO ERR CNTR           @ZM30721 33944003
         NI    EWACNTR3,X'FF'-SECERR   SET OFF 2ND ERR         @ZM30721 33944403
         B     ERR660                  GO ISSUE CCW,S          @ZM30721 33944803
         SPACE 1                                                        33946003
********************                                           @YD00155 33948003
*  SET MSC SWITCH ON                                           @YD00155 33948403
********************                                           @YD00155 33949203
ERR550   EQU   *                                               @YD00155 33949603
ERR555   EQU   *                                               @YD00155 33978603
         OI    EWAFLG3,EWA3MSC         SET MSC SW ON           @YD00155 33980603
         SPACE 1                                                        33982603
ERR560   EQU   *                                               @Y30LB10 34200003
         OI    IOSFLB,IOSMSG           SET MSG ON              @YD00155 34210003
ERR565   EQU   *                                               @YD00155 34220003
         OI    IOSFLB,IOSLOG           SET LOG ON              @YD00155 34230003
ERR570   EQU   *                                               @YD00155 34240003
         B     ERR600                  GO TO SWITCH CODE       @YD00155 34242003
         EJECT                                                          34350003
*******************                                            @Y30LB10 35350003
*  COMPLETE THE ERROR MESSAGE. AND DO A WTO.                   @Y30LB10 35400003
*******************                                            @Y30LB10 35450003
MSG100   EQU   *                                               @Y30LB10 35500003
       TM   CVTOPTA,CVTNIP             SEE IF ITS IPL TIME     @ZA13054 35550003
         BO    NOMSG                   BRANCH IF SO            @ZA13054 35552003
         UNPK  EWOWORK1(C4),EWACHA(C3) GET DEV ADDRESS         @OZ05073 35560003
         TR    EWOWORK1(C3),TRTABLE-240 MAKE IT PRINTABLE      @OZ05073 35570003
         MVC   EWOWTOA(C3),EWOWORK1    MOVE DEV ADR TO MSG     @OZ05073 35580003
         SPACE 1                                                        35600003
         LR    REG2,IOSBPTR            SAVE IOSB REG           @Y30LB10 35650003
         TIME  DEC                                             @Y30LB10 35700003
         LR    IOSBPTR,REG2            RESTORE REG 1           @Y30LB10 35750003
         SPACE 1                                                        35800003
         ST    REG0,EWOWORK1           STORE TIME IN EWA       @Y30LB10 35850003
         OI    EWOWORK1+C3,OF          SET IN SIGN             @Y30LB10 35900003
         UNPK  EWOWORK1(C7),EWOWORK1(C4) UNPACK TO PRTABLE HEX @Y30LB10 35950003
         MVC   EWOWTOC(C2),EWOWORK1    MOVE IN HOUR            @YD00156 36000003
         MVC   EWOWTOE(C2),EWOWORK1+C2  MOVE MINS TO MSG       @YD00156 36050003
         MVC   EWOWTOF(C2),EWOWORK1+C4  MOVE SECS TO MSG       @YD00156 36100003
         SPACE 1                                                        36150003
         LR    REG2,IOSBPTR            SAVE REG 1              @YD00156 36200003
         LA    IOSBPTR,EWOMSG          ADDR OF MESSAGE         @YD00156 36250003
         WTO   MF=(E,(1))                                      @YD00156 36300003
         LR    IOSBPTR,REG2            RESTORE REG 1           @YD00156 36350003
         SPACE 1                                                        36400003
NOMSG    EQU   *                                               @ZA13054 36410003
         BR    REG3                    RETURN TO CALLER        @Y30LB10 36450003
         EJECT                                                          36500003
************************************************************** @Y30LB10 36510003
************************************************************** @Y30LB10 36520003
*        CONTROL UNIT SWAP CODE                                @Y30LB10 36550003
*                                                              @Y30LB10 36600003
************************************************************** @Y30LB10 36610003
************************************************************** @Y30LB10 36620003
*  IF 'SWAP' IS ON;                                            @YD00155 36630003
*    IF THE CCW OP CODE IS 'EE' GO SWITCH THE UCB,S            @YD00155 36640003
*    IF THE CCW OP CODE IS NOT 'EE' GO CHK FOR SWITCH ERRS.    @YD00155 36642003
*  IF 'SWAP' IS NOT ON;                                        @YD00155 36644003
*    IF 'LOOP' IS ON GO ISSUE THE SWITCH CCW,S.                @YD00155 36646003
*    IF 'LOOP' IS OFF GO ISSUE THE INVALID OP CCW.             @YD00155 36648003
********************                                           @YD00155 36648403
ERR600   EQU   *                                               @Y30LB10 36650003
         TM    CVTOPTA,CVTNIP          IS NIP IN CONTROL       @ZA28260 36651424
         BO    ERR890                  BR YES                  @ZA28260 36652124
         LR    REGD,PRIUCB             GET PRIMARY UCB ADDR    @ZA24432 36653624
         AH    REGD,H512               ADD HEX 200 TO UCB ADDR @ZA24432 36654824
         CLR   REGD,ALTUCB             IS IT BACKUP MSC        @ZA24432 36656224
         BE    ERR510                  BR YES TO PREM ERROR    @ZA24432 36657624
         TM    EWAFLG3,NOTINIT         IS MSC INITIALIZED      @ZA24432 36659024
         BO    ERR700                  BR NO SET               @ZM31094 36660424
         TM    ICBFG1,ICBI             HAS MSSC SET INIT ON?   @ZM31094 36661824
         BNO   ERR450                  BR NO SET               @ZM31094 36663224
         TM    EWAFLG3,EWA3SWAP        ARE WE IN SWAP NOW      @YD00155 36664624
         BZ    ERR603                  BR NO CHK FOR LOOP      @YD00155 36666024
         CLI   C0(CCWPTR),CEE          IS IT INVALID OP        @YD00155 36667424
         BE    ERR610                  BR YES TO ISSUE CCWS    @YD00155 36668824
         B     ERR700                  BR NO CHK FOR ERRS      @YD00155 36670224
ERR603   EQU   *                                               @YD00155 36671624
         MVI   EWACNTR2,C0             ZERO ERR CNTR           @YD00155 36673024
         NI    EWACNTR3,X'FF'-SECERR   SET OFF 2ND ERR         @YD00155 36674424
         SPACE 1                                                        36675824
*******************                                            @YD00155 36677224
*  WE MUST SWAP SO WE WILL INSURE THAT THE MSG AND LOGGING     @YD00155 36678624
*  REQUIRED IS DONE BEFOR THE UCBS ARE SWAPPED.                @YD00155 36680003
*  WE ISSUE A ERP CCW WITH OP CODE OF X'EE' TO FORCE A RETURN  @YD00155 36694003
*  FROM WTO/OBR.                                               @YD00155 36696003
*  WE WILL EXIT THRU OBR/WTO AND IOS WILL CALL US BACK BECAUSE @YD00155 36698003
*  THE ERP IS STILL IN CONTROL. THE ERP WILL                   @YD00155 36698403
*  LOOK FOR THE LOOP BIT ON WHEN IT IS CALLED AND GO           @YD00155 36698803
*  TO DO THE SWAP.                                             @YD00155 36699203
*******************                                            @YD00155 36699603
ERR605   EQU   *                                               @YD00155 36699703
         OI    EWAFLG3,EWA3SAVE+EWA3SWAP  SET SAVE+SWAP        @YD00155 36709703
         MVC   EWOCCW1(C8),CCWERP      MOVE ERP CCW TO EWA     @YD00155 36719703
         MVC   UCBDEV+C4(C4),IOSVST    SAVE USERS CCW ADDR     @YD00155 36728603
         LA    REG2,EWOCCW1            GET VIRT ADR OF ERP CCW @YD00155 36730603
         ST    REG2,IOSVST             STORE IN IOSB           @YD00155 36732603
         LRA   REG2,EWOCCW1            GET REAL ADDR OF ERP CCW@YD00155 36733003
         ST    REG2,IOSRST             STORE IN IOSB           @YD00155 36733103
         B     EXIT                    BR     TO WTO           @ZM31108 36883103
         SPACE 1                                                        37250003
********************                                           @Y30LB10 37300003
*  IS THE ALERNATE CONTROL UNIT 'GENED', 'ONLINE' AND 'READY'. @Y30LB10 37350003
*  BRANCH IF NOT TO PRINT 'SWAP IMPOSSIBLE'.                   @Y30LB10 37400003
********************                                           @Y30LB10 37450003
ERR610   EQU   *                                               @Y30LB10 37500003
         LTR   ALTUCB,ALTUCB           IS ALT UCB GENED        @Y30LB10 37550003
         BZ    ERR850                  BR NO                   @Y30LB10 37600003
         TM    ALTSTAT(ALTUCB),UCBONLI  IS ALT UCB ONLINE      @Y30LB10 37650003
         BZ    ERR850                  BR NO TO PRT MSG        @Y30LB10 37700003
         TM    ALTFLA(ALTUCB),UCBNRY    IS ALT UCB READY       @Y30LB10 37750003
         BO    ERR850                  BR NO TO PRT MSG        @Y30LB10 37800003
         SPACE 1                                                        37850003
********************                                           @Y30LB10 37900003
*  SET 'SWAP IN PROCESS' ON.                                   @Y30LB10 37950003
********************                                           @Y30LB10 38000003
         OI    EWAFLG3,EWA3SWAP SET SWAP IN PROCESS ON         @Y30LB10 38050003
         SPACE 1                                                        38100003
********************                                           @Y30LB10 38150003
*  FIND THE ALTERNATE AND PRIMARY UCB SLOTS IN THE UCB LOOKUP  @Y30LB10 38200003
*  TABLE. SWAP THE CONTENTS OF THESE SLOTS.                    @Y30LB10 38250003
********************                                           @Y30LB10 38300003
         L     REG2,CVTILK2            GET ADR OF LOOKUP TABLE @Y30LB10 38350003
         LR    REGD,PRIUCB             GET PRIMARY UCB ADDR    @Y30LB10 38450003
         AH    REGD,H512               ADD HEX 200 TO UCB ADDR @Y30LB10 38500003
         SPACE 1                                                        38550003
********************                                           @Y30LB10 38600003
*  FIND UCB LOOKUP SLOT FOR ALTERNATE FIRST                    @Y30LB10 38650003
********************                                           @Y30LB10 38750003
ERR620   EQU   *                                               @Y30LB10 38800003
         CLM   ALTUCB,C3,C0(REG2)      'TO' UCB LOOKUP SLOT    @Y30LB10 38850003
         BNE   ERR630                  BR NO CHK NEXT          @YD00137 38860003
         STH   REGD,C0(REG2)           STORE PRI IN ALT SLOT   @YD00137 39120003
         B     ERR640                  GO CHK NEXT SLOT        @YD00137 39130003
         SPACE 1                                                        39150003
********************                                           @Y30LB10 39200003
*  FIND UCB LOOKUP SLOT FOR PRIMARY NOW                        @Y30LB10 39250003
********************                                           @Y30LB10 39350003
ERR630   EQU   *                                               @Y30LB10 39400003
         CLM   REGD,C3,C0(REG2)       'FROM' UCB LOOKUP SLOT   @Y30LB10 39450003
         BNE   ERR640                  BR NO CHK NEXT          @YD00137 39460003
         STH   ALTUCB,C0(REG2)         STORE ALT IN PRI SLOT   @YD00137 39720003
********************                                           @YD00137 39730003
*  STEP TO NEXT SLOT AND TEST FOR END OF TABLE                 @YD00137 39732003
********************                                           @YD00137 39734003
ERR640   EQU   *                                               @YD00137 39736003
         LA    REG2,C2(REG2)           STEP TO NEXT SLOT       @Y30LB10 39740003
         TM    C1(REG2),EOT            IS IT END OF TABLE      @Y30LB10 39742003
         BNO   ERR620                  BR NO TO NEXT TEST      @YD00137 39742403
         SPACE 1                                                        39750003
********************                                           @Y30LB10 40150003
*  SWAP THE FOLLOWING CONTENTS OF THE PRIMARY AND ALTERNATE    @Y30LB10 40200003
*  UCBS. 'UCBNAME' (DEVICE ADDR IN BCD) AND 'UCBCHAN' (DEVICE  @Y30LB10 40250003
*  ADDR IN HEX).                                               @Y30LB10 40300003
********************                                           @Y30LB10 40350003
ERR650   EQU   *                                               @Y30LB10 40400003
         LH    REGC,UCBCHAN           GET HEX CUU OF PRIMARY   @Y30LB10 40450003
         LH    REGD,ALTCHAN(ALTUCB)  GET HEX CUU OF ALTERNATE  @Y30LB10 40500003
         STH   REGC,ALTCHAN(ALTUCB)  SWAP PRIMARY AND ALTERNATE@Y30LB10 40550003
         STH   REGD,UCBCHAN            UCB HEX CUU ADDRS       @Y30LB10 40600003
         IC    REGC,UCBLCI             GET LCH INDEX           @ZA32810 40610024
         IC    REGD,ALTLCI(ALTUCB)     GET ALT LCH INDEX       @ZA32810 40620024
         STC   REGC,ALTLCI(ALTUCB)     SAVE OLD LCI INDEX      @ZA32810 40630024
         STC   REGD,UCBLCI             SAVE NEW LCI INDEX      @ZA32810 40640024
         MVC   EWOWORK1(C3),UCBNAME    SAVE PRIMARY UCB BCD CUU@Y30LB10 40650003
         MVC   UCBNAME(C3),ALTNAME(ALTUCB)  ALT BCD CUU TO     @Y30LB10 40700003
         MVC   ALTNAME(C3,ALTUCB),EWOWORK1                     @Y30LB10 40750003
         SPACE 1                                                        40850003
***************************************************************@Y30LB10 40900003
***************************************************************@Y30LB10 40950003
*  PRINT MESSAGE;                                              @Y30LB10 41000003
*  'SYS SWITCH FROM XXX TO ZZZ STARTED, XXX OFFLINE'           @YD00156 41010003
*  'MSC SWITCH FROM XXX TO ZZZ STARTED, XXX OFFLINE'           @YD00156 41012003
*  ZZZ IS THE 'NEW' PRIMARY DEVICE                             @Y30LB10 41100003
*  XXX IS THE 'NEW' ALTERNATE DEVICE.                          @Y30LB10 41150003
********************                                           @Y30LB10 41200003
         MVC   EWOMSG(C63),WTOMSGD     MOVE MSG TO EWA         @YD00156 41250003
         MVC   EWOWTOK(C3),ALTNAME(ALTUCB)  ALT UCB CUU TO MSG @YD00156 41350003
         NI    ALTSTAT(ALTUCB),X'FF'-UCBONLI  NEW ALT OFFLINE  @YD00155 41354403
         BAL   REGC,SWAPMSG            GO PRT MSG              @YD00156 41360003
         SPACE 1                                                        41600003
********************                                           @Y30LB10 41650003
*  MOVE THE 4 'SWAP' CCWS TO THE EWA AND SET UP TO SIO TO      @ZA05142 41700003
*  THEM. THE CCWS ARE CHAINED 'SWITCH', INITIALIZE', 'HOST     @Y30LB10 41750003
*  READY FOR MESSAGES', AND 'NOOP'                             @ZA05142 41800003
********************                                           @Y30LB10 41850003
ERR660   EQU   *                                               @Y30LB10 41900003
         OI    EWAFLG3,EWA3SAVE+EWA3SWAP  SET SAVE+SWAP        @YD00155 41910003
         MVC   UCBDEV+C4(C4),IOSVST    SAVE USER VIRT ADR      @Y30LB10 42000003
         MVC   EWOCCW1(C24),CCWSW      MOVE SWAP CCWS TO EWA   @ZA05142 42050024
         MVC   EWOINIT(C4),INIT        MOVE INIT DATA TO EWA   @Y30LB10 42100003
         MVC   EWOHRM(C4),HRM          MOVE HRM DATA TO EWA    @Y30LB10 42150003
         LRA   REG2,EWOINIT            REAL ADDR OF INIT DATA  @Y30LB10 42200003
         ST    REG2,EWOCCW2            STORE ADDR IN CCW       @Y30LB10 42250003
         MVI   EWOCCW2,EXEC            RESTORE CCW OP CODE     @Y30LB10 42300003
         LRA   REG2,EWOHRM             REAL ADDR OF HRM DATA   @Y30LB10 42350003
         ST    REG2,EWOCCW3            STORE ADDR IN CCW       @Y30LB10 42400003
         MVI   EWOCCW3,EXEC            RESTORE CCW OP CODE     @Y30LB10 42450003
         LA    REG2,EWOCCW1            GET ADR OF 1ST SWAP CCW @Y30LB10 42500003
         ST    REG2,IOSVST             VIRT CCW ADR IN IOSB    @Y30LB10 42550003
         LRA   REG2,C0(REG2)           GET REAL ADR            @Y30LB10 42600003
         ST    REG2,IOSRST             REAL CCW ADR IN IOSB    @Y30LB10 42650003
         TM    ICBFG1,ICBR             HAS MSSC SET READY ON?  @ZM31093 42652003
         BO    ERR670                  BR YES READY IS SET     @ZM31093 42654003
         MVI   EWOCCW3,NOOP            MAKE HRM CCW NOP        @ZM31093 42656003
ERR670   EQU   *                                               @ZM31093 42658003
*******************                                            @Y30LB10 42660003
*  SET THE INITIALIZE COMMAND DATA UP FOR SINGLE CPU OR        @Y30LB10 42670003
*  MP COUPLED CPUS. USED FOR SWAPS.                            @Y30LB10 42680003
*******************                                            @Y30LB10 42690003
         TM    ICBFG1,ICBMSCMP         IS THIS MP              @G24LB05 42698142
         BZ    EXIT                    BR NO                   @G24LB05 42698442
         MVI   EWOINIT+C2,X40          SET COUPLED MP BIT ON   @Y30LB10 42698803
         MVC   EWOCCW4(C8),EWOCCW3     MOVE LAST CCW DOWN 1    @ZA28260 42740624
         MVC   EWOCCW3(C8),CCWASSOC    PUT ASSOC CCW IN CHAIN  @ZA28260 42750624
         LRA   REG2,EWOASSOC           GET ADDR OF ASSOC ORDER @ZA28260 42760624
         ST    REG2,EWOCCW3            PUT ADDR OF ORDER IN CCW@ZA28260 42770624
         MVI   EWOCCW3,EXEC            RESTORE OP CODE         @ZA28260 42780624
         MVC   EWOASSOC(C12),ASSOC     MOVE ASSOC ORDER TO EWO @ZA28260 42790624
         MVC   EWOASSOC+C4(C5),ICBCPUID PUT CPUID IN ORDER     @ZA28260 42800624
         B     EXIT                    SVC 15-3 EXIT           @ZM31108 42866424
         SPACE 1                                                        42908224
         EJECT                                                          42950003
********************                                           @Y30LB10 43000003
*  HAVE WE COMPLETED THE SWAP WITHOUT ERROR.                   @Y30LB10 43050003
*  IS IT CONDITION CODE 3 OR UNIT CHECK.                       @Y30LB10 43100003
*  BRANCH YES, TO HANDLE SWAP FAILURE.                         @Y30LB10 43150003
********************                                           @Y30LB10 43200003
ERR700   EQU   *                                               @Y30LB10 43250003
         TM    IOSCC,IOSCC3            IS IT COND CODE 3       @Y30LB10 43300003
         BNO   ERR710                  BR NO TO ERR CHK        @YD00155 43350003
         TM    EWACNTR3,SECERR         HAVE WE TRIED ONCE      @YD00155 43360003
         BO    ERR705                  BR YES                  @YD00155 43370003
         OI    EWACNTR3,SECERR         SET COUNT ON            @YD00155 43380003
         B     ERR660                  BR TO REISSUE           @YD00155 43390003
ERR705   EQU   *                                               @YD00155 43392003
         TM    EWACNTR3,TRDERR         IS IT THE 3RD ERR       @YD00155 43394003
         BO    ERR890                  BR YES TO PERM ERR      @YD00155 43396003
         OI    EWACNTR3,TRDERR         SET COUNT ON            @YD00155 43398003
         B     ERR800                  BR TO PRT MSG           @YD00155 43398403
ERR710   EQU   *                                               @Y30LB10 43400003
         CLC   IOSTSA(C2),STATOK       CSW STATUS CHAN-DEV END @Y30LB10 43450003
         BE    ERR713                  BR OK TO SWAP END MSG   @OZ00688 43500003
         TM    IOSTSA,X'FF'-CEDEUC     IS IT C.E.-D.E.-U.C.?   @OZ00688 43510003
         BNZ   ERR800                  ONES OR MIXED TO ERR CK @OZ00688 43530003
         TM    IOSTSB,X'FF'            ANY CH STATUS ON?       @OZ00688 43542003
         BNZ   ERR800                  ONES OR MIXED TO ERR CK @OZ00688 43544003
         TM    IOSTSA,UNCK             IS UNIT CHECK ON?       @OZ00688 43546003
         BZ    ERR800                  NO UNIT CHECK TO ERR CK @OZ00688 43548003
         TM    EWOSNS0,EWOCREJ+EWOHRET IS HOST RETRY OR        @OZ00688 43548403
*                                      COMMAND REJECT ON?      @OZ00688 43548803
         BNZ   ERR800                  ONES OR MIXED TO ERR CK @OZ00688 43549603
         TM    EWOSNS0,EWOINT+EWOENV   IS IT INT. REQ. OR ENV. @OZ00688 43549703
         BZ    ERR800                  BR NO TO ERR CK.        @OZ00688 43549803
         OI    EWAFLG3,EWA3SAVE        SET SAVE ON             @OZ00688 43549903
         ST    CCWPTR,IOSVST          PUT V START ADDR IN IOSB @OZ00688 43566603
         LRA   REG2,C0(CCWPTR)         CONVERT TO REAL         @OZ00688 43576603
         ST    REG2,IOSRST            PUT R START ADDR IN IOSB @OZ00688 43578603
         CLI   IOSTSA,SUSPEND          IS IT D.E. + U.C. ONLY? @OZ00688 43580603
         BNE   ERR240                  GO SET UP FOR MSG & LOG @OZ00688 43582603
         MVI   0(CCWPTR),A3OP          SET A3 IN CCW           @OZ00688 43583003
         B     ERR240                  GO SET UP FOR MSG & LOG @OZ00688 43583103
         SPACE 1                                                        43583303
***************************************************************@Y30LB10 43600003
***************************************************************@Y30LB10 43650003
*  PRINT MESSAGE;                                              @Y30LB10 43700003
*  'SYS SWITCH FROM XXX TO ZZZ ENDED'                          @YD00156 43710003
*  'MSC SWITCH FROM XXX TO ZZZ ENDED'                          @YD00156 43712003
*  XXX IS THE 'NEW' ALTERNATE DEVICE                           @YD00156 43730003
*  ZZZ IS THE 'NEW' PRIMARY DEVICE.                            @YD00156 43800003
********************                                           @Y30LB10 43850003
ERR713   TM    EWAFLG3,NOTINIT         IS MSC INITIALIZED      @OZ00688 43860003
         BNO   ERR715                  BR YES                  @ZM30721 43870003
         NI    EWAFLG3,X'FF'-NOTINIT   SET FLAG - MSC NOT INIT @ZM30721 43880003
         NI    EWAFLG3,X'FF'-EWA3SWAP  SET SWAP OFF            @ZM30721 43890003
         B     ERR730                  BR                      @ZM30721 43892003
ERR715   EQU   *                                               @ZM30721 43894003
         MVC   EWOMSG(C48),WTOMSGA     MOVE MSG TO EWA         @YD00156 43900003
         BAL   REGC,SWAPMSG            GO PRT MSG              @YD00156 43950003
         SPACE 1                                                        44200003
********************                                           @Y30LB10 44900003
*  GO TO DO A SVC 15, SVC 3.                                   @Y30LB10 44950003
********************                                           @Y30LB10 45000003
ERR730   EQU   *                                               @Y30LB10 45050003
         MVI   EWACNTR2,C1            SET ERR CNTR TO 1        @Y30LB10 45100003
         B     ERR900                  BR TO EXIT              @YD00155 45200003
         EJECT                                                          45250003
***************************************************************@Y30LB10 46100003
***************************************************************@Y30LB10 46150003
*  PRINT MESSAGE;                                              @Y30LB10 46200003
*  'SYS SWITCH FROM XXX TO ZZZ FAILED, ZZZ OFFLINE'            @YD00156 46210003
*  'MSC SWITCH FROM XXX TO ZZZ FAILED, ZZZ OFFLINE'            @YD00156 46212003
*  XXX IS THE 'NEW' ALTERNATE DEVICE                           @YD00156 46270003
*  ZZZ IS THE 'NEW' PRIMARY DEVICE.                            @Y30LB10 46300003
********************                                           @Y30LB10 46350003
ERR800   EQU   *                                               @YD00155 46400003
         TM    EWAFLG3,NOTINIT         IS MSC INITIALIZED      @ZM30721 46410003
         BO    ERR810                  BR YES NOT INIT         @ZM30721 46420003
         MVC   EWOMSG(C62),WTOMSGC     MOVE MSG TO EWA         @YD00156 46450003
         MVC   EWOWTOJ(C3),UCBNAME     MOVE DEV ADDR TO MSG    @YD00156 46500003
         BAL   REGC,SWAPMSG            GO PRT MSG              @YD00156 46550003
*                                                              @Y30LB10 46800003
         NI    UCBSTAT,X'FF'-UCBONLI   SET PRIMARY UCB OFFLINE @Y30LB10 46810003
         TM    IOSCC,IOSCC3            COND CODE 3             @YD00155 46820003
         BNO   ERR810                  BR NO                   @YD00155 46830003
         MVI   IOSCOD,COD41            SET COMP CODE TO 41     @YD00155 46840003
         B     ERR814                  BR ON                   @YD00155 46842003
ERR810   EQU   *                                               @YD00155 46844003
         OI    IOSFLB,IOSMSG+IOSLOG    SET MSG + LOG ON        @YD00155 46846003
ERR814   EQU   *                                               @YD00155 46849903
         NI    IOSFLA,X'FF'-IOSERR     SET PERM ERR            @YD00155 46850003
         B     EXIT                    GO XCTL TO WTO          @ZM31108 46900003
***************************************************************@Y30LB10 47350003
***************************************************************@Y30LB10 47400003
*  PRINT MESSAGE;                                              @Y30LB10 47450003
*  'SYS SWITCH FROM AAA TO BBB, BBB NOT AVAIL'                 @YD00156 47460003
*  'SYS SWITCH FROM AAA TO ALT, ALT NOT AVAIL'                 @YD00156 47470003
*  'MSC SWITCH FROM AAA TO BBB, BBB NOT AVAIL'                 @YD00156 47472003
*  'MSC SWITCH FROM AAA TO ALT, ALT NOT AVAIL'                 @YD00156 47474003
*  AAA IS THE 'CURRENT' PRIMARY DEVICE                         @YD00156 47492003
*  BBB IS THE 'CURRENT' ALTERNATE DEVICE                       @YD00156 47494003
*  IF THE ALTERNATE IS NOT GENED THE ZZZ WILL BE 'ALT'         @Y30LB10 47550003
*******************                                            @Y30LB10 47600003
ERR850   EQU   *                                               @Y30LB10 47650003
         MVC   EWOMSG(C57),WTOMSGB     MOVE MSG TO EWA         @YD00156 47700003
         MVC   EWOWTOE(C3),UCBNAME     SET IN PRI ADR          @YD00156 47750003
ERR860   EQU   *                                               @YD00156 48000003
         MVC   EWOWTOI(C3),MSGALT      MOVE 'ALT' TO MSG       @YD00156 48050003
         MVC   EWOWTOG(C3),MSGALT      MOVE 'ALT' TO MSG       @YD00156 48060003
         LTR   ALTUCB,ALTUCB           IS ALT UCB AVALI        @Y30LB10 48100003
         BZ    ERR870                  BR IF NOT GENED         @Y30LB10 48150003
         MVC   EWOWTOI(C3),ALTNAME(ALTUCB)   MOVE ALT DEV ADDR @YD00156 48200003
         MVC   EWOWTOG(C3),ALTNAME(ALTUCB)   MOVE ALT DEV ADDR @YD00156 48210003
ERR870   EQU   *                                               @Y30LB10 48250003
         BAL   REGC,SWAPSVC            GO PRT MSG              @YD00156 48260003
         CLI   EWOSNS11,EWOMSG06       IS IT MSG CODE 06       @ZA27590 48290024
         BNE   ERR880                  BRANCH NO               @ZA27590 48320024
         CLI   EWOSNS12,EWOCOD30       IS IT ERROR CODE 30     @ZA27590 48350024
         BNE   ERR880                  BRANCH NO               @ZA27590 48380024
         LTR   ALTUCB,ALTUCB           IS ALT UCB AVAILABLE    @ZA27590 48410024
         BZ    ERR890                  BR IF NOT GENNED        @ZA27590 48440024
         SPACE 1                                                        48500003
*******************                                            @Y30LB10 48550003
*  SET PRIMARY UCB 'OFFLINE'                                   @Y30LB10 48600003
*  SET 'PERMANENT ERROR' IN IOSB                               @Y30LB10 48650003
*******************                                            @Y30LB10 48800003
ERR880   EQU   *                                               @Y30LB10 48850003
         NI    UCBSTAT,X'FF'-UCBONLI   SET PRI UCB OFFLINE     @Y30LB10 49000003
ERR890   EQU   *                                               @Y30LB10 49050003
         NI    IOSFLA,X'FF'-IOSERR     SET TO PERM ERR         @Y30LB10 49100003
         SPACE 3                                                        49102003
ERR900   EQU   *                                               @YD00155 49104003
         NI    EWAFLG3,X'FF'-EWA3SWAP-EWA3CCH                  @YD00155 49110003
         NI    EWAFLG3,X'FF'-NOTINIT   SET FLAG - MSC NOT INIT @ZM30721 49120003
         EJECT                                                          49200003
EXIT     TM    IOSFLB,IOSMSG           IS MSG ON ?             @ZM31108 49210003
         BO    WTOOUT                  YES TO TO WTO           @ZM31108 49220003
         TM    IOSFLB,IOSLOG           IS LOG ON ?             @ZM31108 49230003
         BO    OBROUT                  YES TO TO OBR           @ZM31108 49240003
         B     ERR2000                 GO TO SVC 15-3 EXIT     @ZM31108 49242003
*******************                                            @Y30LB10 49250003
*  OBR EXIT                                                    @ZM31108 49300003
*******************                                            @Y30LB10 49350003
OBROUT   EQU   *                                               @ZM31108 49360003
         LA    REGD,OBRRTN             GET OBR CODE            @ZM31108 49370003
         B     XCTLOUT                 GO TO OBR               @ZM31108 49380003
*******************                                            @Y30LB10 49390003
*  WTO EXIT                                                    @ZM31108 49392003
*******************                                            @Y30LB10 49394003
WTOOUT   EQU   *                                               @ZM31108 49396003
         LA    REGD,WTORTN             GET WTO CODE            @ZM31108 49398003
*******************                                            @Y40LB02 49398103
*  IF ITS FORMAT 0 - GO TO FORMAT SENSE XCTL                   @Y40LB02 49398203
*******************                                            @Y40LB02 49398303
         TM    EWOSNS3,EWOFOR0         IS IT FORMAT 0?         @Y40LB02 49398403
         BO    ERR1100                 BRANCH YES              @Y40LB02 49401424
*******************                                            @Y40LB02 49404603
*  IF ITS FORMAT 3 - GO TO FORMAT SENSE XCTL                   @Y40LB02 49407003
*******************                                            @Y40LB02 49409403
         TM    EWOSNS3,EWOFOR3         IS IT FORMAT 3?         @Y40LB02 49411803
         BO    ERR1100                 BRANCH YES              @Y40LB02 49414203
*******************                                            @Y40LB02 49416603
         TM    EWOSNS3,EWOFOR4         IS IT FORMAT 4?         @Y40LB02 49419003
         BO    ERR1100                 BRANCH YES              @Y40LB02 49421403
*******************                                            @Y40LB02 49423803
*  IF ITS FORMAT 5 - GO TO FORMAT SENSE XCTL                   @Y40LB02 49426203
*******************                                            @Y40LB02 49428603
         TM    EWOSNS3,EWOFOR5         IS IT FORMAT 5?         @Y40LB02 49431003
         BO    ERR1100                 BRANCH YES              @Y40LB02 49433403
*******************                                            @Y40LB02 49435403
*  IF ITS FORMAT 1 - GO TO FORMAT SENSE XCTL                   @ZA14725 49435503
*******************                                            @ZA14725 49435603
         TM    EWOSNS3,EWOFOR1         IS IT FORMAT 1?         @ZA14725 49435703
         BO    ERR1100                 BRANCH YES              @ZA14725 49442103
         SPACE 1                                                        49448803
XCTLOUT  EQU   *                                               @Y30LB10 49455203
*******************                                                     49461603
****************************************************************        49468003
*    SYSTEM WTO/OBR XCTL                                                49474403
****************************************************************        49480803
         BAL   REG3,ERR3000            GO TEST FOR QUISCE      @YD00136 49487203
         L     BALRREG,CVTXTLER        GET XCTL RTN ADDR       @Y30LB10 49493603
         BR    BALRREG                 XCTL TO NEXT RTN        @Y30LB10 49500003
         SPACE 4                                                        49550003
************************************************************** @Y40LB02 49560003
*    FORMAT SENSE XCTL                                         @Y40LB02 49570003
*************************************************************  @Y40LB02 49580003
ERR1100  BAL   REG3,ERR3000            GO TEST FOR QUISCE      @Y40LB02 49590003
         LA    REGD,FSLD3RTN           FMT SNS ROUTING ID      @Y40LB02 49592003
         L     BALRREG,CVTXTLER        GET XCTL RTN ADDR       @Y40LB02 49594003
         BR    BALRREG                 XCTL TO NEXT RTN        @Y40LB02 49596003
***************************************************************@X04AC10 49598002
*******************                                            @Y30LB10 49600003
*  EXIT SVC-15  SVC-3                                          @Y30LB10 49650003
*******************                                            @Y30LB10 49700003
ERR2000  EQU   *                                               @Y30LB10 49750003
         BAL   REG3,ERR3000            GO TEST FOR QUISCE      @YD00136 49760003
         SVC   FIFTEEN                                         @Y30LB10 49800003
         SVC   THREE                                           @Y30LB10 49850003
         SPACE 3                                                        49860003
*********************                                          @YD00136 49870003
* IF ERP IS EXITING PERMANENT OR RECOVERED ERROR AND THE       @YD00136 49880003
* DRIVER IS EXCP THEN SET THE QUISCE BITS IN THE IOSB AND      @YD00136 49886903
* UCB OFF.                                                     @YD00136 49890703
*********************                                          @YD00136 49892603
ERR3000  EQU   *                                               @YD00136 49894503
         LR    REGC,REGD               SAVE REG 13             @YD00136 49896403
         LA    REGD,EWOMSG             SAVE AREA FOR IOSGEN    @YD00136 49898303
         TM    IOSFLA,IOSERR+IOSEX     ERP IN CONTROL          @YD00136 49900203
         BO    ERR3010                 BR YES                  @YD00136 49902103
         TM    IOSOPT,IOSQISCE         IS QUISCE ON?           @ZUP0988 49904003
         BZ    ERR3010                 BR NO                   @YD00136 49905903
         NI    IOSOPT,X'FF'-IOSQISCE   SET IOSB QUISCE BIT OFF @YD00136 49907803
         L     REG2,IOSUCB             GET UCB ADDRESS         @ZA00663 49909703
         IOSGEN  UCBFLG,UCB=(REG2),VAR=OFF,TABLE=UCBQISCE      @ZA00663 49909903
         SR    REG7,REG7               ZERO REGISTER           @ZUP0988 49912303
         L     REG2,IOSUCB             GET UCB ADDRESS         @ZUP0988 49922303
         IOSINTRP UCB=(REG2),BRANCH=YES                        @ZA20273 49925924
ERR3010  EQU   *                                               @YD00136 49928603
         LR    REGD,REGC               RESTORE REG 13          @YD00136 49930603
         BR    REG3                    RETURN                  @YD00136 49932603
         EJECT                                                          49933303
********************                                           @YD00156 49935303
*  SET PRIMARY DEVICE ADDRESS IN MSG AT 'ZZZ' AND ALTERNATE    @YD00156 49937303
*  DEVICE ADDRESS IN MSG AT 'XXX'.                             @YD00156 49939303
********************                                           @YD00156 49941303
SWAPMSG  EQU   *                                               @YD00156 49943303
         MVC   EWOWTOG(C3),UCBNAME     SET IN PRI DEV ADDR     @YD00156 49949903
         MVC   EWOWTOE(C3),ALTNAME(ALTUCB)  SET IN ALT DEV ADR @YD00156 49978603
         SPACE 1                                                        49979003
********************                                           @YD00156 49979403
*  SET EITHER 'SYS SWITCH' OR 'MSC SWITCH' IN MSG              @YD00156 49979503
********************                                           @YD00156 49980203
SWAPSVC  EQU   *                                               @YD00156 49980603
         MVC   EWOWTOA(C10),MSGSYS     SET IN ' SYS SWAP'      @YD00156 49982203
SWAP010  EQU   *                                               @YD00156 49982303
         TM    EWAFLG3,EWA3MSC         IS IT A MSC SWITCH      @YD00156 49982403
         BZ    SWAP020                 BR NO                   @YD00156 49982503
         MVC   EWOWTOA(C10),MSGMSC     MOVE MSC TO MSG         @YD00156 49989203
SWAP020  EQU   *                                               @YD00156 49991203
         LR    REG2,IOSBPTR            SAVE REG 1              @YD00156 49996403
         LA    IOSBPTR,EWOMSG          ADDR OF MESSAGE         @YD00156 50003103
         WTO   MF=(E,(1))                                      @YD00156 50009803
         LR    IOSBPTR,REG2            RESTORE REG 1           @YD00156 50016503
         BR    REGC                    RETURN TO CALLER        @YD00156 50023203
         EJECT                                                          50029903
*--------------------------------------------------------------@Y30LB10 50036603
CCWSW    CCW   X'44',0,X'60',1                                 @Y30LB10 50043303
CCWINIT  CCW   X'87',INIT,X'60',4                              @Y30LB10 50050003
CCWHRM   CCW   X'87',HRM,X'20',4                               @ZA28260 50100024
CCWASSOC CCW   X'87',ASSOC,X'60',12                            @ZA28260 50120024
CCWNOOP  CCW   X'03',0,X'20',1                                 @ZA28260 50140024
CCWERP   CCW   X'EE',0,X'00',0                                 @ZM30721 50160024
*--------------------------------------------------------------@Y30LB10 50180024
INIT     DC    X'10000000'                                     @Y30LB10 50200024
ASSOC    DC    X'2C0080000000000000000000'                     @ZA28260 50220024
HRM      DC    X'20000000'                                     @Y30LB10 50300003
*--------------------------------------------------------------@Y30LB10 50350003
CCWSUS1  CCW   X'A3',0,X'60',1                                 @ZA05142 50400003
CCWEND   DC    X'00000001'        2ND HALF OF TIC CCW          @ZM02151 50450003
*--------------------------------------------------------------@Y30LB10 50500003
         DS    0F                                              @Y30LB10 50550003
H8       DC    H'8'                                            @Y30LB10 50650003
H512     DC    H'512'                                          @Y30LB10 50700003
STATOK   DC    X'0C00'                                         @Y30LB10 50750003
TRTABLE  DC    CL16'0123456789ABCDEF'                          @OZ05073 50760003
*--------------------------------------------------------------@Y30LB10 50800003
         DS    0F                                              @Y30LB10 50850003
WTOMSGA  DS    0F                                              @Y30LB10 50900003
         DC    AL2(MSGENDA-MSGNOA)                             @Y30LB10 50950003
         DC    X'8000'                                         @Y30LB10 51000003
MSGNOA   DC    C'IEA000I YYYYYYYYYY FROM XXX TO ZZZ ENDED'     @YD00156 51010024
         DC    X'10004040'                                     @Y30LB10 51100003
MSGENDA  EQU   *                                               @Y30LB10 51150003
*--------------------------------------------------------------@Y30LB10 51200003
*                                                              @Y30LB10 51250003
WTOMSGB  DS    0F                                              @Y30LB10 51300003
         DC    AL2(MSGENDB-MSGNOB)                             @Y30LB10 51350003
         DC    X'8000'                                         @Y30LB10 51400003
MSGNOB   DC    C'IEA000I ZA27590YYY FROM AAA TO BBB, '         @YD00156 51410024
         DC    C'BBB NOT AVAIL'                                @YD00156 51420003
         DC    X'10004040'                                     @Y30LB10 51500003
MSGENDB  EQU   *                                               @Y30LB10 51550003
*--------------------------------------------------------------@Y30LB10 51600003
WTOMSGC  DS    0F                                              @Y30LB10 51650003
         DC    AL2(MSGENDC-MSGNOC)                             @Y30LB10 51700003
         DC    X'8000'                                         @Y30LB10 51750003
MSGNOC   DC    C'IEA000I YYYYYYYYYY FROM XXX TO ZZZ FAILED, '  @YD00156 51760024
         DC    C'ZZZ OFFLINE'                                  @YD00156 51770003
         DC    X'10004040'                                     @Y30LB10 51850003
MSGENDC  EQU   *                                               @Y30LB10 51900003
*--------------------------------------------------------------@Y30LB10 51950003
*                                                              @Y30LB10 52000003
WTOMSGD  DS    0F                                              @Y30LB10 52050003
         DC    AL2(MSGENDD-MSGNOD)                             @Y30LB10 52100003
         DC    X'8000'                                         @Y30LB10 52150003
MSGNOD   DC    C'IEA000I ZA27590YYY FROM XXX TO ZZZ STARTED, ' @YD00156 52160024
         DC    C'XXX OFFLINE'                                  @YD00156 52170003
         DC    X'10004040'                                     @Y30LB10 52250003
MSGENDD  EQU   *                                               @Y30LB10 52300003
*--------------------------------------------------------------@Y30LB10 52350003
*                                                              @Y30LB10 52400003
WTOMSG   DS    0F                                              @Y30LB10 52450003
         DC    AL2(MSGEND-MSGNO)                               @Y30LB10 52500003
         DC    X'8000'                                         @Y30LB10 52550003
MSGNO    DC    C'IEA000I '                                     @Y30LB10 52600003
MSGTXTA  DC    C'XXX ZZZ'                                      @Y30LB10 52650003
MSGTXTB  DC    C',,,,,,'                                       @Y30LB10 52700003
MSGTXTC  DC    C'XX.XX.XX'                                     @Y30LB10 52750003
ROUTE    DC    X'10004040'                                     @Y30LB10 52800003
MSGEND   EQU   *                                               @Y30LB10 52850003
*--------------------------------------------------------------@Y30LB10 52900003
MSGALT   DC    C'ALT '                                         @Y30LB10 52950003
MSGCEM   DC    C'CEM '                                         @Y30LB10 53050003
MSGSYS   DC    C'SYS SWITCH'                                   @YD00156 53160003
MSGMSC   DC    C'MSC SWITCH'                                   @YD00156 53170003
*--------------------------------------------------------------@Y30LB10 53200003
ERPMAINT EQU   *                                               @Y30LB10 53250003
         DC    AL2(MAINTEND-ERPMAINT)                          @Y30LB10 53300003
         ORG   ERR000+4080                                     @Y30LB10 53350003
         DC    C'IGE0001H //END//'                             @Y30LB10 53400003
MAINTEND EQU   *                                               @Y30LB10 53450003
         EJECT                                                          53500003
         IECDIOSB                                                       53550003
         EJECT                                                          53600003
         IECDERWA                                                       53650003
         SPACE 3                                                        53700003
*//////////////////////////////////////////////////////////////@Y30LB10 53750003
*                                                              @Y30LB10 53800003
*//////////////////////////////////////////////////////////////@Y30LB10 53850003
         ORG   EWAIERP                                         @Y30LB10 53900003
EWOSNS   DS    XL32                    3851 SENSE              @Y30LB10 53950003
         ORG   EWOSNS                                          @Y30LB10 54000003
EWOSNS0  DS    XL1                     SENSE BYTE 0            @Y30LB10 54050003
EWOCREJ  EQU   X'80'                   COMMAND REJECT          @Y30LB10 54100003
EWOINT   EQU   X'40'                   INTERVENTION REQUIRED   @Y30LB10 54150003
EWOBUSO  EQU   X'20'                   BUS OUT CHECK           @Y30LB10 54200003
EWOEQU   EQU   X'10'                   EQUIPMENT CHECK         @Y30LB10 54250003
EWO4     EQU   X'08'                   SPARE                   @Y30LB10 54300003
EWOHRET  EQU   X'04'                   HOST RETRY              @Y30LB10 54350003
EWOPERR  EQU   X'02'                   PERMANENT ERROR         @Y30LB10 54400003
EWOENV   EQU   X'01'                   ENVIROMENTAL DATA       @Y30LB10 54450003
EWOSNS1  DS    XL1                     SENSE BYTE 1            @Y30LB10 54500003
EWOCEM   EQU   X'80'                   CE MESSAGE              @Y30LB10 54550003
EWOSUU   EQU   X'40'                   SUBSYSTEM UNIT UNUSABLE @Y30LB10 54600003
EWOSNS2  DS    XL1                     SENSE BYTE 2            @Y30LB10 54650003
EWOSNS3  DS    XL1                     SENSE BYTE 3            @Y30LB10 54700003
EWOFOR0  EQU   X'80'                   FORMAT 0                @Y30LB10 54710003
EWOFOR1  EQU   X'40'                   FORMAT 1                @Y30LB10 54750003
EWOFOR2  EQU   X'20'                   FORMAT 2                @Y30LB10 54800003
EWOFOR3  EQU   X'10'                   FORMAT 3                @Y30LB10 54810002
EWOFOR4  EQU   X'08'                   FORMAT 4                @Y30LB10 54820002
EWOFOR5  EQU   X'04'                   FORMAT 5                @Y30LB10 54830002
EWOSNS4  DS    XL1                     SENSE BYTE 4            @Y30LB10 54850003
EWOSNS5  DS    XL1                     SENSE BYTE 5            @Y30LB10 54900003
EWOSNS6  DS    XL1                     SENSE BYTE 6            @Y30LB10 54950003
EWOSNS7  DS    XL1                     SENSE BYTE 7            @Y30LB10 55000003
EWOSNS8  DS    XL1                     SENSE BYTE 8            @Y30LB10 55050003
EWOSNS9  DS    XL1                     SENSE BYTE 9            @Y30LB10 55100003
EWOSNS10 DS    XL1                     SENSE BYTE 10           @Y30LB10 55150003
EWOSNS11 DS    XL1                     SENSE BYTE 11           @Y30LB10 55200003
EWOMSG02 EQU   X'02'                   MESSAGE '02'            @YD00133 55200403
EWOMSG04 EQU   X'04'                   MESSAGE '04'            @YD00133 55202003
EWOMSG06 EQU   X'06'                   MESSAGE '06'            @YD00133 55204003
EWOMSG0A EQU   X'0A'                   MESSAGE '0A'            @YD00133 55206003
EWOMSG0B EQU   X'0B'                   MESSAGE '0B'            @Y30LB10 55210003
EWOSNS12 DS    XL1                     SENSE BYTE 12           @Y30LB10 55250003
EWOCOD25 EQU   X'25'                   CODE '25'               @ZA10999 55250403
EWOCOD2D EQU   X'2D'                   CODE '2D'               @ZA13053 55250803
EWOCOD3F EQU   X'3F'                   CODE '3F'               @ZA09552 55252003
EWOCOD57 EQU   X'57'                   CODE '57'               @ZA28260 55254024
EWOCOD80 EQU   X'80'                   CODE '80'               @YD00133 55260003
EWOCOD30 EQU   X'30'                   CODE '30'               @ZA24432 55262024
EWOCOD8F EQU   X'8F'                   CODE '8F'               @YD00133 55270003
EWOCODC0 EQU   X'C0'                   CODE 'C0'               @YD00133 55280003
EWOCODCA EQU   X'CA'                   CODE 'CA'               @G24LB22 55290042
EWOCODCB EQU   X'CB'                   CODE 'CB'               @G24LB22 55292042
EWOSNS13 DS    XL1                     SENSE BYTE 13           @Y30LB10 55300003
EWOSNS14 DS    XL1                     SENSE BYTE 14           @Y30LB10 55350003
EWOSNS15 DS    XL1                     SENSE BYTE 15           @Y30LB10 55400003
EWOSNS16 DS    XL1                     SENSE BYTE 16           @Y30LB10 55450003
EWOSNS17 DS    XL1                     SENSE BYTE 17           @Y30LB10 55500003
EWOSNS18 DS    XL1                     SENSE BYTE 18           @Y30LB10 55550003
EWOSNS19 DS    XL1                     SENSE BYTE 19           @Y30LB10 55600003
EWOSNS20 DS    XL1                     SENSE BYTE 20           @Y30LB10 55650003
EWOSNS21 DS    XL1                     SENSE BYTE 21           @Y30LB10 55700003
EWOSNS22 DS    XL1                     SENSE BYTE 22           @Y30LB10 55750003
EWOSNS23 DS    XL1                     SENSE BYTE 23           @Y30LB10 55800003
EWOSNS24 DS    XL1                     SENSE BYTE 24           @Y30LB10 55850003
EWOSNS25 DS    XL1                     SENSE BYTE 25           @Y30LB10 55900003
EWOSNS26 DS    XL1                     SENSE BYTE 26           @Y30LB10 55950003
EWOSNS27 DS    XL1                     SENSE BYTE 27           @Y30LB10 56000003
EWOSNS28 DS    XL1                     SENSE BYTE 28           @Y30LB10 56050003
EWOSNS29 DS    XL1                     SENSE BYTE 29           @Y30LB10 56100003
EWOSNS30 DS    XL1                     SENSE BYTE 30           @Y30LB10 56150003
EWOSNS31 DS    XL1                     SENSE BYTE 31           @Y30LB10 56200003
*                                                              @Y30LB10 56250003
EWOMSG   DS    XL63                    ERP MSG AREA            @DCRXXXX 56800003
         ORG   EWOMSG                                          @Y30LB10 56850003
EWOWTO   DS    XL12                    ERP MSG                 @Y30LB10 56900003
EWOWTOA  DS    XL4                     ERP MSG                 @Y30LB10 56950003
EWOWTOB  DS    XL9                     ERP MSG                 @Y30LB10 57000003
EWOWTOC  DS    XL2                     ERP MSG                 @Y30LB10 57050003
EWOWTOD  DS    XL1                     ERP MSG                 @Y30LB10 57100003
EWOWTOE  DS    XL3                     ERP MSG                 @Y30LB10 57150003
EWOWTOF  DS    XL4                     ERP MSG                 @Y30LB10 57200003
EWOWTOG  DS    XL3                     ERP MSG                 @Y30LB10 57250003
EWOWTOH  DS    XL2                     ERP MSG                 @ZM02153 57300003
EWOWTOI  DS    XL7                     ERP MSG                 @ZM02153 57310003
EWOWTOJ  DS    XL1                     ERP MSG                 @DCRXXXX 57320003
EWOWTOK  DS    XL11                    ERP MSG                 @DCRXXXX 57330003
EWOWTORT DS    XL4                     ERP MSG                 @Y30LB10 57350003
*                                                              @Y30LB10 57400003
EWOSPARE DS    XL1                     EWA SPARE               @ZM02153 57450003
EWOWORK1 DS    XL4                     ERP WORK AREA 1         @ZA05142 57452024
EWOWORK2 DS    XL4                     ERP WORK AREA 2         @ZA05142 57454024
         ORG   EWOMSG                                          @ZA05142 57460024
EWOCCWS  DS    XL32                    ERP CCWS                @ZA05142 57470003
         ORG   EWOCCWS                                         @ZA05142 57480003
EWOCCW1  DS    XL8                     ERP CCW 1               @ZA05142 57490003
EWOCCW2  DS    XL8                     ERP CCW 2               @ZA05142 57492003
EWOCCW3  DS    XL8                     ERP CCW 3               @ZA05142 57494003
EWOCCW4  DS    XL8                     ERP CCW 4               @ZA05142 57496003
EWOINIT  DS    XL4                     INIT CCW DATA           @ZA05142 57498803
EWOASSOC DS    XL12                    ASSOC CCW DATA          @ZA28260 57498924
EWOHRM   DS    XL4                     HRM CCW DATA            @ZA05142 57499124
RSVD     DS    XL44                    EWO SPARE               @ZA28260 57499324
EWOEND   EQU   *                       EWA END                 @Y30LB10 57500003
         EJECT                                                          57550003
         IEFUCBOB                      PREFIX=YES,LIST=YES              57600003
         EJECT                                                          57650003
         CVT   DSECT=YES,LIST=NO                                        57700003
         EJECT                                                          57750003
         IEZSSC                                                         57800003
         EJECT                                                          57800403
         IHAPSA                                                         57860003
         EJECT                                                          57870003
         IHALCCA                                                        57930003
         EJECT                                                          57940003
         IECDIRT                                                        57942003
         EJECT                                                          57942403
         IECDIOCM                                                       57944003
         EJECT                                                          57946003
         IECDIOCX                                                       57948003
         END                                                            57950003
./  ADD  SSI=81530074,NAME=IGE0301H
         TITLE 'IGE0301H:  VS2 FORMAT SENSE MODULE - LOAD 1            *00001000
                        '                                               00002000
IGE0301H CSECT                                                          00003000
@MAINENT DS   0H                                              @Z40LB02  00004000
         USING *,REGF                                         @Z40LB02  00005000
         B     @PROLOG                                        @Z40LB02  00006000
         DC    C'IGE0301H &SYSDATE'                           @Z40LB02  00007000
         DROP  REGF                                           @Z40LB02  00008000
         DS    0H                                             @Z40LB02  00009000
@PROLOG  BALR  BASEREG,0                                      @Z40LB02  00010000
@PSTART  DS    0H                                             @Z40LB02  00011000
         USING @DATD,REGC                                     @Z40LB02  00012000
         USING @PSTART,BASEREG                                @Z40LB02  00013000
*   CVTPTR=CVTLOC;                  /* SETUP CVT POINTER     @Z40LB02*/ 00014000
         L     CVTPTR,CVTLOC                                       0188 00015000
*   IOCOMPTR=CVTIXAVL;              /* SETUP IOCOM PTR       @Z40LB02*/ 00016000
         L     IOCOMPTR,CVTIXAVL(,CVTPTR)                          0189 00017000
*   EWAPTR=REGD;                    /* SAVE REG 13           @Z40LB02*/ 00018000
*                                                                  0190 00019000
         LR    EWAPTR,REGD                                         0190 00020000
*   /*****************************************************************/ 00021000
*   /*                                                               */ 00022000
*   /* GET LOCAL LOCK TO PROTECT FRR STACK FOR CORE MGR      @Z40LB02*/ 00023000
*   /* REGISTERS 11,12,13,14 ARE DESTROYED BY SETLOCK        @Z40LB02*/ 00024000
*   /* REG 13 MUST BE SAVE BEFORE SETLOCK IS ISSUED          @Z40LB02*/ 00025000
*   /* SO THAT IOS CORE MANAGER WILL HAVE A VALID            @Z40LB02*/ 00026000
*   /* SAVEAREA ADDRESS IN REG 13.                           @Z40LB02*/ 00027000
*   /*                                                               */ 00028000
*   /*****************************************************************/ 00029000
*                                                                  0191 00030000
*   GEN REFS(PSALITA);                                             0191 00031000
*                                                                  0191 00032000
*                                                         /*@Z40LB02*/  00033000
GETLOCK SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                        **00034000
               RELATED=(IECVSMGR,IGE0301H(FREELOCK))                    00035000
*   /*****************************************************************/ 00036000
*   /*                                                               */ 00037000
*   /* SET UP FOR AND GO TO STORAGE MANGER TO GET 160 BYTE   @Z40LB02*/ 00038000
*   /* BLOCK IN WHICH TO BUILD MESSAGE                       @Z40LB02*/ 00039000
*   /* REG 13 MUST POINT TO IOS SAVE AREA AS SPECIFIED       @Z40LB02*/ 00040000
*   /* IN REG 13 UPON ENTRY TO THIS MODULE                   @Z40LB02*/ 00041000
*   /* REGB-1ST 4 BITS MAY BE 1000,2000,3000, OR 4000        @Z40LB02*/ 00042000
*   /* THIS NUMBER REPRESENT THE NUMBER OF BLOCKS            @Z40LB02*/ 00043000
*   /* DESIRED FROM THE CORE MANAGER. BITS 4 AND 5           @Z40LB02*/ 00044000
*   /* WILL CONTAIN THE ASID(FILLED IN BY THIS MODULE).      @Z40LB02*/ 00045000
*   /* BITS 6 AND 7 WILL ALWAYS CONTAIN AN INDES OF 20.      @Z40LB02*/ 00046000
*   /*                                                               */ 00047000
*   /*****************************************************************/ 00048000
*                                                                  0192 00049000
*   REGD=EWAPTR;                    /* RESTORE REG 13        @Z40LB02*/ 00050000
         LR    REGD,EWAPTR                                         0192 00051000
*   REGB='10000020'X;               /* R11=# BLKS & ASID     @Z40LB02*/ 00052000
         L     REGB,@CF02080                                       0193 00053000
*   REGF=IOCORMGT;                  /* ADDR OF IOS           @Z40LB02   00054000
*                                      STORAGE MANAGER       @Z40LB02*/ 00055000
         L     REGF,IOCORMGT(,IOCOMPTR)                            0194 00056000
*   GEN REFS(IOSASID);                                             0195 00057000
        ICM   REGB,6,IOSASID(IOSBPTR) GET ASID IN REG11                 00058000
        BALR  BALRREG,REGF            GO GET STORAGE                    00059000
*   FSWAPTR=REGB;                   /* SET UP POINTER TO     @Z40LB02   00060000
*                                      STORAGE AREA          @Z40LB02*/ 00061000
         LR    FSWAPTR,REGB                                        0196 00062000
*   EWAPTR=REGD;                    /* SAVE REG 13           @Z40LB02*/ 00063000
*                                                                  0197 00064000
         LR    EWAPTR,REGD                                         0197 00065000
*   /*****************************************************************/ 00066000
*   /*                                                               */ 00067000
*   /* FREE LOCAL LOCK JUST GOTTEN FOR STORAGE MANAGER SINCE @Z40LB02*/ 00068000
*   /* NO SVC'S CAN BE ISSUED WHILE IT IS HELD.              @Z40LB02*/ 00069000
*   /* REGISTER 13 MUST BE SAVED BEFORE RELEASING LOCAL      @Z40LB02*/ 00070000
*   /* LOCK                                                  @Z40LB02*/ 00071000
*   /*                                                               */ 00072000
*   /*****************************************************************/ 00073000
*                                                                  0198 00074000
*   GEN REFS(PSALITA);                                             0198 00075000
*                                                         /*@Z40LB02*/  00076000
FREELOCK SETLOCK RELEASE,TYPE=LOCAL,                                  **00077000
               RELATED=(IECVSMGR,IGE0301H(GETLOCK))                     00078000
         LA    REGC,DATASTOR(,FSWAPTR)   DATA AREA ADDR       @Z40LB02  00079000
*   REGD=EWAPTR;                    /* RESTORE REG 13        @Z40LB02*/ 00080000
         LR    REGD,EWAPTR                                         0199 00081000
*   RFY                                                            0200 00082000
*    (REGB,                                                        0200 00083000
*     BALRREG) UNRSTD;                                             0200 00084000
*   SAVER1=IOSBPTR;                                                0201 00085000
         ST    IOSBPTR,SAVER1(,FSWAPTR)                            0201 00086000
*   SAVR12=REGC;                    /* SAVE REG 12           @Z40LB02*/ 00087000
         ST    REGC,SAVR12(,FSWAPTR)                               0202 00088000
*   UCBPTR=IOSUCB;                  /* PRIMARY UCB           @Z40LB02*/ 00089000
         L     UCBPTR,IOSUCB(,IOSBPTR)                             0203 00090000
*   EWAPTR=IOSERP;                  /* EWA POINTER           @Z40LB02*/ 00091000
         L     EWAPTR,IOSERP(,IOSBPTR)                             0204 00092000
*   SNSPTR=ADDR(EWASNS);            /* ADDR OF SENSE DATA    @Z40LB02*/ 00093000
         LA    SNSPTR,EWASNS(,EWAPTR)                              0205 00094000
*   ICBPTR=CVTICB;                  /* SET UP POINTER TO     @Z40LB02   00095000
*                                      MSSC CONTL BLOCK      @Z40LB02*/ 00096000
         L     @14,CVTEXT2(,CVTPTR)                                0206 00097000
         L     @14,CVTICB(,@14)                                    0206 00098000
         LR    ICBPTR,@14                                          0206 00099000
*   SRBPTR=IOSSRB;                  /* SETUP SRB POINTER     @Z40LB02*/ 00100000
         MVC   SRBPTR(4,FSWAPTR),IOSSRB(IOSBPTR)                   0207 00101000
*   VVIPTR=ICBVVICB;                /* MSVC POINTER          @Z40LB02*/ 00102000
         MVC   VVIPTR(4,FSWAPTR),ICBVVICB(@14)                     0208 00103000
*   FSEXIT=OFF;                     /* INIT EXIT SWITCH      @Z40LB02*/ 00104000
         NI    FSEXIT(FSWAPTR),B'01111111'                         0209 00105000
*   MSGNUM=C0;                      /* INIT MSG INDEX        @Z40LB02*/ 00106000
         MVI   MSGNUM(FSWAPTR),X'00'                               0210 00107000
*   MSGBLT=OFF;                     /* INIT MSG SWITCH       @Z40LB02*/ 00108000
         NI    MSGBLT(FSWAPTR),B'10111111'                         0211 00109000
*   MSGNUM=C0;                      /* INIT MSG INDEX        @Z40LB02*/ 00110000
         MVI   MSGNUM(FSWAPTR),X'00'                               0212 00111000
*   CHAR2INP=MASKSSID&EWOSSID;      /* MASK FOR SSID VALUE   @Z40LB02*/ 00112000
         MVC   CHAR2INP(2,FSWAPTR),MASKSSID                        0213 00113000
         NC    CHAR2INP(2,FSWAPTR),EWOSSID(SNSPTR)                 0213 00114000
*   RFY                                                            0214 00115000
*    (EWAPTR,                                                      0214 00116000
*     ICBPTR) UNRSTD;                                              0214 00117000
*                                                                  0214 00118000
*   /*****************************************************************/ 00119000
*   /*                                                               */ 00120000
*   /* THE FOLLOWING CODE WILL CHECK THE SENSE DATA TO FIND  @Z40LB02*/ 00121000
*   /* WHICH FORMAT(0 OR 3) WAS SPECIFIED. BASED ON THE      @ZA09552*/ 00122000
*   /* FORMAT SPECIFICATION, OTHER SPECIFIC FLDS OF THE SNSE @Z40LB02*/ 00123000
*   /* DATA WILL BE CHECKED TO DETERMINE MESSAGE CODE,       @ZA09552*/ 00124000
*   /* SUU, TERMINATION CODE, ETC. AFTER DETERMINATION       @Z40LB02*/ 00125000
*   /* HAS BEEN MADE THE APPROPRIATE ROUTINE WILL BE CALLED  @Z40LB02*/ 00126000
*   /* TO PROCESS DATA FOR THE MESSAGE.                      @Z40LB02*/ 00127000
*   /* FORMAT 4 AND 5 ARE CHECKED FOR SUU ONLY.              @ZA09552*/ 00128000
*   /*                                                               */ 00129000
*   /*****************************************************************/ 00130000
*                                                                  0215 00131000
*                                                                  0215 00132000
*   /*****************************************************************/ 00133000
*   /*                                                               */ 00134000
*   /* CHECK FOR MSS UNIT UNUSABLE CONDITION-ICB503E MSG     @Z40LB02*/ 00135000
*   /*                                                               */ 00136000
*   /*****************************************************************/ 00137000
*                                                                  0215 00138000
*   IF(SUU=ON&FSEXIT=OFF) THEN      /* CHECK FOR SUU         @Z40LB02*/ 00139000
         TM    SUU(SNSPTR),B'01000000'                             0215 00140000
         BNO   @RF00215                                            0215 00141000
         TM    FSEXIT(FSWAPTR),B'10000000'                         0215 00142000
         BNZ   @RF00215                                            0215 00143000
*     IF(EWOMSGCD¬=MSG09|EWOSNS12¬=C8) THEN/*                @ZA29152*/ 00144000
         CLI   EWOMSGCD(SNSPTR),X'09'                              0216 00145000
         BNE   @RT00216                                            0216 00146000
         CLI   EWOSNS12(SNSPTR),8                                  0216 00147000
         BE    @RF00216                                            0216 00148000
@RT00216 DS    0H                                                  0217 00149000
*       DO;                                                        0217 00150000
*         MSGNUM=C4;                /* SET MESSAGE INDEX     @Z40LB02*/ 00151000
         MVI   MSGNUM(FSWAPTR),X'04'                               0218 00152000
*         FSEXIT=ON;                /* SET EXIT SWITCH       @Z40LB02*/ 00153000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0219 00154000
*       END;                                                       0220 00155000
*                                                                  0220 00156000
*   /*****************************************************************/ 00157000
*   /*                                                               */ 00158000
*   /* CHECK FOR FORMAT 0 MSG CODE 07 MESSAGES               @Z40LB02*/ 00159000
*   /*                                                               */ 00160000
*   /*****************************************************************/ 00161000
*                                                                  0221 00162000
*   IF(FORMAT0=ON&FSEXIT=OFF) THEN  /* WAS IT FORMAT 0?      @Z40LB02*/ 00163000
@RF00216 DS    0H                                                  0221 00164000
@RF00215 TM    FORMAT0(SNSPTR),B'10000000'                         0221 00165000
         BNO   @RF00221                                            0221 00166000
         TM    FSEXIT(FSWAPTR),B'10000000'                         0221 00167000
         BNZ   @RF00221                                            0221 00168000
*     DO;                                                          0222 00169000
*       IF EWOMSGCD=MSG07 THEN      /* MESSAGE 07?           @Z40LB02*/ 00170000
         CLI   EWOMSGCD(SNSPTR),X'07'                              0223 00171000
         BNE   @RF00223                                            0223 00172000
*         DO;                                                      0224 00173000
*           IF EWOSNS12=TERMC02 THEN                               0225 00174000
*                                                                  0225 00175000
         CLI   EWOSNS12(SNSPTR),X'02'                              0225 00176000
         BNE   @RF00225                                            0225 00177000
*             /*******************************************************/ 00178000
*             /*                                                     */ 00179000
*             /* IF TERM CODE 02 THEN STRIPES AVAIL ZERO-ICB501E MSG */ 00180000
*             /*                                             @ZA16133*/ 00181000
*             /*                                                     */ 00182000
*             /*******************************************************/ 00183000
*                                                                  0226 00184000
*             DO;                                                  0226 00185000
*               FSEXIT=ON;          /* SET EXIT SWITCH       @Z40LB02*/ 00186000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0227 00187000
*               MSGNUM=C2;          /* SET MESSAGE NUMBER    @Z40LB02*/ 00188000
         MVI   MSGNUM(FSWAPTR),X'02'                               0228 00189000
*             END;                                                 0229 00190000
*           ELSE                                                   0230 00191000
*             IF EWOSNS12=TERMC03 THEN                             0230 00192000
*                                                                  0230 00193000
         B     @RC00225                                            0230 00194000
@RF00225 CLI   EWOSNS12(SNSPTR),X'03'                              0230 00195000
         BNE   @RF00230                                            0230 00196000
*               /*****************************************************/ 00197000
*               /*                                                   */ 00198000
*               /* IF TERM CODE 03 THEN CART LOAD FAILURE-ICB502E MSG*/ 00199000
*               /*                                           @Z40LB02*/ 00200000
*               /*                                                   */ 00201000
*               /*****************************************************/ 00202000
*                                                                  0231 00203000
*               DO;                                                0231 00204000
*                 FSEXIT=ON;        /* SET EXIT SWITCH       @Z40LB02*/ 00205000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0232 00206000
*                 MSGNUM=C3;        /* SET MESSAGE NUMBER    @Z40LB02*/ 00207000
         MVI   MSGNUM(FSWAPTR),X'03'                               0233 00208000
*               END;                                               0234 00209000
*             ELSE                                                 0235 00210000
*               IF EWOSNS12=TERMC01|EWOSNS12=TERMC04 THEN          0235 00211000
*                                                                  0235 00212000
         B     @RC00230                                            0235 00213000
@RF00230 CLI   EWOSNS12(SNSPTR),X'01'                              0235 00214000
         BE    @RT00235                                            0235 00215000
         CLI   EWOSNS12(SNSPTR),X'04'                              0235 00216000
         BNE   @RF00235                                            0235 00217000
@RT00235 DS    0H                                                  0236 00218000
*                 /***************************************************/ 00219000
*                 /*                                                 */ 00220000
*                 /* IF TERM CODE 01/04 THEN PERM WRITE ERR-ICB509E  */ 00221000
*                 /* MSG                                     @ZA30102*/ 00222000
*                 /*                                                 */ 00223000
*                 /***************************************************/ 00224000
*                                                                  0236 00225000
*                 DO;                                              0236 00226000
*                   FSEXIT=ON;      /* SET EXIT SWITCH       @Z40LB02*/ 00227000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0237 00228000
*                   MSGNUM=C9;      /* SET MESSAGE NUMBER    @Z40LB02*/ 00229000
         MVI   MSGNUM(FSWAPTR),X'09'                               0238 00230000
*                 END;                                             0239 00231000
*         END;                                                     0240 00232000
*       ELSE                                                       0241 00233000
*                                                                  0241 00234000
*         /***********************************************************/ 00235000
*         /*                                                         */ 00236000
*         /* CHECK FOR FORMAT 0 MSG CODE 09 MESSAGES         @ZA13486*/ 00237000
*         /*                                                         */ 00238000
*         /***********************************************************/ 00239000
*                                                                  0241 00240000
*         IF(EWOMSGCD=MSG09&EWOSNS12>C0&EWOSNS12<C9) THEN          0241 00241000
*                                                                  0241 00242000
         B     @RC00223                                            0241 00243000
@RF00223 CLI   EWOMSGCD(SNSPTR),X'09'                              0241 00244000
         BNE   @RF00241                                            0241 00245000
         CLI   EWOSNS12(SNSPTR),0                                  0241 00246000
         BNH   @RF00241                                            0241 00247000
         CLI   EWOSNS12(SNSPTR),9                                  0241 00248000
         BNL   @RF00241                                            0241 00249000
*           /*********************************************************/ 00250000
*           /*                                                       */ 00251000
*           /* MSS CARTRIDGE INACCESSIBLE MESSAGE-ICB504E MSG        */ 00252000
*           /*                                               @Z40LB02*/ 00253000
*           /*                                                       */ 00254000
*           /*********************************************************/ 00255000
*                                                                  0242 00256000
*           DO;                                                    0242 00257000
*             FSEXIT=ON;            /* SET EXIT SWITCH       @Z40LB02*/ 00258000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0243 00259000
*             MSGNUM=C5;            /* SET MESSAGE NUM       @Z40LB02*/ 00260000
         MVI   MSGNUM(FSWAPTR),X'05'                               0244 00261000
*           END;                                                   0245 00262000
*         ELSE                                                     0246 00263000
*                                                                  0246 00264000
*           /*********************************************************/ 00265000
*           /*                                                       */ 00266000
*           /* CHECK FOR FORMAT 0 MSG CODE 0C TERM CODE 02   @Z40LB02*/ 00267000
*           /*                                                       */ 00268000
*           /*********************************************************/ 00269000
*                                                                  0246 00270000
*           IF EWOMSGCD=MSG0C THEN                                 0246 00271000
         B     @RC00241                                            0246 00272000
@RF00241 CLI   EWOMSGCD(SNSPTR),X'0C'                              0246 00273000
         BNE   @RF00246                                            0246 00274000
*             IF EWOSNS12=TERMC02 THEN                             0247 00275000
*                                                                  0247 00276000
         CLI   EWOSNS12(SNSPTR),X'02'                              0247 00277000
         BNE   @RF00247                                            0247 00278000
*               /*****************************************************/ 00279000
*               /*                                                   */ 00280000
*               /* CARTRIDGE EXIT STATION FULL COND-ICB505A MSG      */ 00281000
*               /*                                           @Z40LB02*/ 00282000
*               /*                                                   */ 00283000
*               /*****************************************************/ 00284000
*                                                                  0248 00285000
*               DO;                                                0248 00286000
*                 FSEXIT=ON;        /* SET EXIT SWITCH       @Z40LB02*/ 00287000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0249 00288000
*                 MSGNUM=C6;        /* SET MESSAGE NUM       @Z40LB02*/ 00289000
         MVI   MSGNUM(FSWAPTR),X'06'                               0250 00290000
*               END;                                               0251 00291000
*             ELSE                                                 0252 00292000
*               ;                                                  0252 00293000
*                                                                  0252 00294000
@RF00247 DS    0H                                                  0253 00295000
*       /*************************************************************/ 00296000
*       /*                                                           */ 00297000
*       /* CHECK FOR FORMAT 0 MSG CODE 08 MESSAGES           @Z40LB02*/ 00298000
*       /*                                                           */ 00299000
*       /*************************************************************/ 00300000
*                                                                  0253 00301000
*       IF EWOMSGCD=MSG08 THEN                                     0253 00302000
*                                                                  0253 00303000
@RF00246 DS    0H                                                  0253 00304000
@RC00241 DS    0H                                                  0253 00305000
@RC00223 CLI   EWOMSGCD(SNSPTR),X'08'                              0253 00306000
         BNE   @RF00253                                            0253 00307000
*         /***********************************************************/ 00308000
*         /*                                                         */ 00309000
*         /* STAGE WITH ERROR MESSAGE-ICB500E MSG            @Z40LB02*/ 00310000
*         /*                                                         */ 00311000
*         /***********************************************************/ 00312000
*                                                                  0254 00313000
*         DO;                                                      0254 00314000
*           FSEXIT=ON;              /* SET EXIT SWITCH       @Z40LB02*/ 00315000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0255 00316000
*           MSGNUM=C1;              /* SET MESSAGE NUM       @Z40LB02*/ 00317000
         MVI   MSGNUM(FSWAPTR),X'01'                               0256 00318000
*         END;                                                     0257 00319000
*       ELSE                                                       0258 00320000
*                                                                  0258 00321000
*         /***********************************************************/ 00322000
*         /*                                                         */ 00323000
*         /* CHECK FOR MESSAGE CODE 06-ICB510A MESSAGE       @Z40LB02*/ 00324000
*         /*                                                         */ 00325000
*         /***********************************************************/ 00326000
*                                                                  0258 00327000
*         IF EWOMSGCD=MSG06 THEN    /* MESSAGE 06?           @Z40LB02*/ 00328000
         B     @RC00253                                            0258 00329000
@RF00253 CLI   EWOMSGCD(SNSPTR),X'06'                              0258 00330000
         BNE   @RF00258                                            0258 00331000
*           IF EWOSNS12=TERMCC9 THEN                               0259 00332000
*                                                                  0259 00333000
         CLI   EWOSNS12(SNSPTR),X'C9'                              0259 00334000
         BNE   @RF00259                                            0259 00335000
*             /*******************************************************/ 00336000
*             /*                                                     */ 00337000
*             /* IF TERM CODE C9 THEN TABLE VERIFICATION-ICB510A MSG */ 00338000
*             /*                                             @Z40LB02*/ 00339000
*             /*                                                     */ 00340000
*             /*******************************************************/ 00341000
*                                                                  0260 00342000
*             DO;                                                  0260 00343000
*               FSEXIT=ON;          /* SET EXIT SWITCH       @Z40LB02*/ 00344000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0261 00345000
*               MSGNUM=C10;         /* SET MESSAGE NUMBER    @Z40LB02*/ 00346000
         MVI   MSGNUM(FSWAPTR),X'0A'                               0262 00347000
*             END;                                                 0263 00348000
*           ELSE                                                   0264 00349000
*             IF EWOSNS12=TERMC3F THEN                             0264 00350000
*                                                                  0264 00351000
         B     @RC00259                                            0264 00352000
@RF00259 CLI   EWOSNS12(SNSPTR),X'3F'                              0264 00353000
         BNE   @RF00264                                            0264 00354000
*               /*****************************************************/ 00355000
*               /*                                                   */ 00356000
*               /* IF TERM CODE 3F THEN TABLE PACK FAILURE-ICB506A   */ 00357000
*               /* MSG                                       @ZA09552*/ 00358000
*               /*                                                   */ 00359000
*               /*****************************************************/ 00360000
*                                                                  0265 00361000
*               DO;                                                0265 00362000
*                 FSEXIT=ON;        /* SET EXIT SWITCH       @ZA09552*/ 00363000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0266 00364000
*                 MSGNUM=C7;        /* SET MSG NUMBER        @ZA09552*/ 00365000
         MVI   MSGNUM(FSWAPTR),X'07'                               0267 00366000
*               END;                                               0268 00367000
*             ELSE                                                 0269 00368000
*               IF EWOSNS12=TERMCC0 THEN                           0269 00369000
*                                                                  0269 00370000
         B     @RC00264                                            0269 00371000
@RF00264 CLI   EWOSNS12(SNSPTR),X'C0'                              0269 00372000
         BNE   @RF00269                                            0269 00373000
*                 /***************************************************/ 00374000
*                 /*                                                 */ 00375000
*                 /* IF TERM CODE C0 THEN NO TABLE ENTRY             */ 00376000
*                 /* SPACE-ICB513E MSG                       @Z40LB02*/ 00377000
*                 /*                                                 */ 00378000
*                 /***************************************************/ 00379000
*                                                                  0270 00380000
*                 DO;                                              0270 00381000
*                   FSEXIT=ON;      /* SET EXIT SWITCH       @Z40LB02*/ 00382000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0271 00383000
*                   MSGNUM=C13;     /* SET MESSAGE NUMBER    @Z40LB02*/ 00384000
         MVI   MSGNUM(FSWAPTR),X'0D'                               0272 00385000
*                 END;                                             0273 00386000
*               ELSE                                               0274 00387000
*                 IF EWOSNS12=TERMCCE THEN                         0274 00388000
*                                                                  0274 00389000
         B     @RC00269                                            0274 00390000
@RF00269 CLI   EWOSNS12(SNSPTR),X'CE'                              0274 00391000
         BNE   @RF00274                                            0274 00392000
*                   /*************************************************/ 00393000
*                   /*                                               */ 00394000
*                   /* IF TERM CODE CE THEN NO FREE CELLS IN         */ 00395000
*                   /* MSF-ICB512E MSG                       @Z40LB02*/ 00396000
*                   /*                                               */ 00397000
*                   /*************************************************/ 00398000
*                                                                  0275 00399000
*                   DO;                                            0275 00400000
*                     FSEXIT=ON;    /* SET EXIT SWITCH       @Z40LB02*/ 00401000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0276 00402000
*                     MSGNUM=C12;   /* SET MESSAGE NUMBER    @Z40LB02*/ 00403000
         MVI   MSGNUM(FSWAPTR),X'0C'                               0277 00404000
*                   END;                                           0278 00405000
*                 ELSE                                             0279 00406000
*                   IF EWOSNS12=TERMC45 THEN                       0279 00407000
*                                                                  0279 00408000
         B     @RC00274                                            0279 00409000
@RF00274 CLI   EWOSNS12(SNSPTR),X'45'                              0279 00410000
         BNE   @RF00279                                            0279 00411000
*                     /***********************************************/ 00412000
*                     /*                                             */ 00413000
*                     /* IF TERM CODE 45 THEN NO DASD SPACE-ICB516E  */ 00414000
*                     /* MSG                                 @ZA16133*/ 00415000
*                     /*                                             */ 00416000
*                     /***********************************************/ 00417000
*                                                                  0280 00418000
*                     DO;                                          0280 00419000
*                       FSEXIT=ON;  /* SET EXIT SWITCH       @Z40LB02*/ 00420000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0281 00421000
*                       MSGNUM=C16; /* SET MESSAGE NUMBER    @ZA16133*/ 00422000
         MVI   MSGNUM(FSWAPTR),X'10'                               0282 00423000
*                     END;                                         0283 00424000
*                   ELSE                                           0284 00425000
*                     IF EWOSNS12=TERMC25 THEN                     0284 00426000
*                                                                  0284 00427000
         B     @RC00279                                            0284 00428000
@RF00279 CLI   EWOSNS12(SNSPTR),X'25'                              0284 00429000
         BNE   @RF00284                                            0284 00430000
*                       /*********************************************/ 00431000
*                       /*                                           */ 00432000
*                       /* IF TERM CODE 25 THEN UNTHREADABLE         */ 00433000
*                       /* CART-ICB517E MSG                  @ZA16133*/ 00434000
*                       /*                                           */ 00435000
*                       /*********************************************/ 00436000
*                                                                  0285 00437000
*                       DO;                                        0285 00438000
*                         FSEXIT=ON;/* SET EXIT SWITCH       @ZA16133*/ 00439000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0286 00440000
*                         MSGNUM=C17;/* SET MESSAGE NUMBER   @ZA16133*/ 00441000
         MVI   MSGNUM(FSWAPTR),X'11'                               0287 00442000
*                       END;                                       0288 00443000
*                     ELSE                                         0289 00444000
*                       IF EWOSNS12=TERMC2D THEN                   0289 00445000
*                                                                  0289 00446000
         B     @RC00284                                            0289 00447000
@RF00284 CLI   EWOSNS12(SNSPTR),X'2D'                              0289 00448000
         BNE   @RF00289                                            0289 00449000
*                         /*******************************************/ 00450000
*                         /*                                         */ 00451000
*                         /* IF TERM CODE 2D THEN EXIT STATION FULL  */ 00452000
*                         /* -ICB505A MSG                    @ZA13052*/ 00453000
*                         /*                                         */ 00454000
*                         /*******************************************/ 00455000
*                                                                  0290 00456000
*                         DO;                                      0290 00457000
*                           FSEXIT=ON;/* SET EXIT SWITCH     @ZA13052*/ 00458000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0291 00459000
*                           MSGNUM=C6;/* SET MESSAGE NUMBER  @ZA13052*/ 00460000
         MVI   MSGNUM(FSWAPTR),X'06'                               0292 00461000
*                         END;                                     0293 00462000
*                       ELSE                                       0294 00463000
*                         ;         /*                       @ZA16133*/ 00464000
@RF00289 DS    0H                                                  0295 00465000
*         ELSE                      /*                       @ZA16133*/ 00466000
*                                                                  0295 00467000
*           /*********************************************************/ 00468000
*           /*                                                       */ 00469000
*           /* MESSAGE CODE 0, CEM ON,FMT ZERO- LAST ONLINE MSS      */ 00470000
*           /*                                               @ZA16133*/ 00471000
*           /* UNIT FAILED, ICB515E MESSAGE                  @ZA16133*/ 00472000
*           /*                                                       */ 00473000
*           /*********************************************************/ 00474000
*                                                                  0295 00475000
*           IF(EWOMSGCD=MSG00&CEM=ON) THEN/*                 @ZA16133*/ 00476000
         B     @RC00258                                            0295 00477000
@RF00258 CLI   EWOMSGCD(SNSPTR),X'00'                              0295 00478000
         BNE   @RF00295                                            0295 00479000
         TM    CEM(SNSPTR),B'10000000'                             0295 00480000
         BNO   @RF00295                                            0295 00481000
*             DO;                   /*                       @ZA16133*/ 00482000
*               FSEXIT=ON;          /* SET THE EXIT SWITCH   @ZA16133*/ 00483000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0297 00484000
*               MSGNUM=C15;         /* SET THE MESSAGE NUMBER      0298 00485000
*                                                            @ZA16133*/ 00486000
         MVI   MSGNUM(FSWAPTR),X'0F'                               0298 00487000
*             END;                  /*                       @ZA16133*/ 00488000
*     END;                          /*                       @ZA16133*/ 00489000
@RF00295 DS    0H                                                  0300 00490000
@RC00258 DS    0H                                                  0300 00491000
@RC00253 DS    0H                                                  0301 00492000
*   IF(FORMAT3=ON&FSEXIT=OFF) THEN  /* FORMAT 3?             @Z40LB02*/ 00493000
@RF00221 TM    FORMAT3(SNSPTR),B'00010000'                         0301 00494000
         BNO   @RF00301                                            0301 00495000
         TM    FSEXIT(FSWAPTR),B'10000000'                         0301 00496000
         BNZ   @RF00301                                            0301 00497000
*     IF RECON=ON THEN              /* RECONF ACCESSOR       @Z40LB02*/ 00498000
*                                                                  0302 00499000
         TM    RECON(SNSPTR),B'01000000'                           0302 00500000
         BNO   @RF00302                                            0302 00501000
*       /*************************************************************/ 00502000
*       /*                                                           */ 00503000
*       /* CARTRIDGE STORE HAS RECONFIGURED-ICB507E          @Z40LB02*/ 00504000
*       /*                                                           */ 00505000
*       /*************************************************************/ 00506000
*                                                                  0303 00507000
*       DO;                                                        0303 00508000
*         MSGNUM=C8;                /* MESSAGE INDEX         @Z40LB02*/ 00509000
         MVI   MSGNUM(FSWAPTR),X'08'                               0304 00510000
*         FSEXIT=ON;                /* SET EXIT SWITCH       @Z40LB02*/ 00511000
         OI    FSEXIT(FSWAPTR),B'10000000'                         0305 00512000
*       END;                                                       0306 00513000
*   RFY                                                            0307 00514000
*    (REGD) RSTD;                   /* RESTRICT REG 13       @Z40LB02*/ 00515000
@RF00302 DS    0H                                                  0307 00516000
@RF00301 DS    0H                                                  0308 00517000
*   IF FSEXIT=ON THEN               /* EXIT SWITCH SET?      @Z40LB02*/ 00518000
         TM    FSEXIT(FSWAPTR),B'10000000'                         0308 00519000
         BNO   @RF00308                                            0308 00520000
*     DO;                                                          0309 00521000
*                                                                  0309 00522000
*       /*************************************************************/ 00523000
*       /*                                                           */ 00524000
*       /* IF THE VVIALCON FIELD OF THE MSVC CONTROL BLOCK IS        */ 00525000
*       /*                                                   @Z40LB02*/ 00526000
*       /* NON ZERO, THEN THE ALTERNATE CONSOLE PROCESSING IS        */ 00527000
*       /*                                                   @Z40LB02*/ 00528000
*       /* ACCOMPLISHED. THE VALUE IS PLACED IN THE EWO EXT TO       */ 00529000
*       /*                                                   @Z40LB02*/ 00530000
*       /* BE USED IN THE NEXT LOAD MODULE.                  @Z40LB02*/ 00531000
*       /*                                                           */ 00532000
*       /*************************************************************/ 00533000
*                                                                  0310 00534000
*       IF VVIALCON¬=ZERO THEN                                     0310 00535000
         L     @14,VVIPTR(,FSWAPTR)                                0310 00536000
         CLI   VVIALCON(@14),0                                     0310 00537000
         BE    @RF00310                                            0310 00538000
*         ALTCON=LIBROUT;           /* INIT WORKAREA TO      @Z40LB02   00539000
*                                      '8000'X               @Z40LB02*/ 00540000
         MVC   ALTCON(2,FSWAPTR),LIBROUT                           0311 00541000
*       IF VVIALCON>C1 THEN         /* ROUTING CODE 1?       @Z40LB02*/ 00542000
@RF00310 L     @14,VVIPTR(,FSWAPTR)                                0312 00543000
         CLI   VVIALCON(@14),1                                     0312 00544000
         BNH   @RF00312                                            0312 00545000
*         DO I=1 TO VVIALCON-C1;    /* START SHIFT           @Z40LB02*/ 00546000
         LA    @14,1                                               0313 00547000
         B     @DE00313                                            0313 00548000
@DL00313 DS    0H                                                  0314 00549000
*           ALTCON=ALTCON/C2;       /* SHIFT RIGHT ONE       @Z40LB02   00550000
*                                      BIT AT A TIME         @Z40LB02*/ 00551000
         SLR   @14,@14                                             0314 00552000
         ICM   @14,3,ALTCON(FSWAPTR)                               0314 00553000
         SRL   @14,1                                               0314 00554000
         STH   @14,ALTCON(,FSWAPTR)                                0314 00555000
*         END;                      /*                       @Z40LB02*/ 00556000
*                                                                  0315 00557000
         LA    @14,1                                               0315 00558000
         SLR   @11,@11                                             0315 00559000
         IC    @11,I(,FSWAPTR)                                     0315 00560000
         ALR   @14,@11                                             0315 00561000
@DE00313 STC   @14,I(,FSWAPTR)                                     0315 00562000
         L     @11,VVIPTR(,FSWAPTR)                                0315 00563000
         SLR   @08,@08                                             0315 00564000
         IC    @08,VVIALCON(,@11)                                  0315 00565000
         BCTR  @08,0                                               0315 00566000
         CR    @14,@08                                             0315 00567000
         BNH   @DL00313                                            0315 00568000
*       /*************************************************************/ 00569000
*       /*                                                           */ 00570000
*       /* TRANSLATE Y,Z AND X VALUES (DECIMAL)              @Z40LB02*/ 00571000
*       /*                                                           */ 00572000
*       /*************************************************************/ 00573000
*                                                                  0316 00574000
*       IF(MSGNUM=C2|MSGNUM=C5|MSGNUM=C9) THEN/* MSG NUM 2 ,5,9?   0316 00575000
*                                                            @Z40LB02*/ 00576000
@RF00312 CLI   MSGNUM(FSWAPTR),2                                   0316 00577000
         BE    @RT00316                                            0316 00578000
         CLI   MSGNUM(FSWAPTR),5                                   0316 00579000
         BE    @RT00316                                            0316 00580000
         CLI   MSGNUM(FSWAPTR),9                                   0316 00581000
         BNE   @RF00316                                            0316 00582000
@RT00316 DS    0H                                                  0317 00583000
*         DO;                                                      0317 00584000
*                                                                  0317 00585000
*           /*********************************************************/ 00586000
*           /*                                                       */ 00587000
*           /* TRANSLATE YVALUE                              @Z40LB02*/ 00588000
*           /*                                                       */ 00589000
*           /*********************************************************/ 00590000
*                                                                  0318 00591000
*           CHAR2INP(2)=EWOLZYX1&MASKY;/* GET Y VAL FROM SNS @Z40LB02*/ 00592000
         MVC   CHAR2INP+1(1,FSWAPTR),EWOLZYX1(SNSPTR)              0318 00593000
         NI    CHAR2INP+1(FSWAPTR),B'00011111'                     0318 00594000
*           CVD(FIXVAL,YVAL);       /* CONVERT Y TO DEC      @Z40LB02*/ 00595000
         SLR   @14,@14                                             0319 00596000
         IC    @14,FIXVAL(,FSWAPTR)                                0319 00597000
         CVD   @14,@TS00001                                        0319 00598000
         MVC   YVAL(2,FSWAPTR),@TS00001+6                          0319 00599000
*           CHAR2INP=YVAL/C16;      /* SHIFT RT 1 BYTE       @Z40LB02*/ 00600000
         SLR   @14,@14                                             0320 00601000
         ICM   @14,3,YVAL(FSWAPTR)                                 0320 00602000
         SRL   @14,4                                               0320 00603000
         STH   @14,CHAR2INP(,FSWAPTR)                              0320 00604000
*           UNPK(GENTRAN,GENTRAN(1:3));/* UNPACK Y VALUE     @Z40LB02*/ 00605000
         UNPK  GENTRAN(5,FSWAPTR),GENTRAN(3,FSWAPTR)               0321 00606000
*           GEN REFS(GENTRAN,TRTABLE,FSWAPTR);                     0322 00607000
*                                                         /*@Z40LB02*/  00608000
   TR     GENTRAN(5,FSWAPTR),TRTABLE-X'F0'  TRANSL Y VALUE    @Z40LB02  00609000
*           YVAL=GENTRAN(3:4);      /* STORE Y VALUE         @Z40LB02*/ 00610000
*                                                                  0323 00611000
         MVC   YVAL(2,FSWAPTR),GENTRAN+2(FSWAPTR)                  0323 00612000
*           /*********************************************************/ 00613000
*           /*                                                       */ 00614000
*           /* TRANSLATE Z VALUE                             @Z40LB02*/ 00615000
*           /*                                                       */ 00616000
*           /*********************************************************/ 00617000
*                                                                  0324 00618000
*           CHAR2INP(2)=EWOLZYX1&MASKZ;/* GET Z FROM SNS     @Z40LB02*/ 00619000
         MVC   CHAR2INP+1(1,FSWAPTR),EWOLZYX1(SNSPTR)              0324 00620000
         NI    CHAR2INP+1(FSWAPTR),B'00100000'                     0324 00621000
*           DO I=C1 TO C5;          /* SHIFT CONTROL         @Z40LB02*/ 00622000
         LA    @14,1                                               0325 00623000
         STC   @14,I(,FSWAPTR)                                     0325 00624000
@DL00325 DS    0H                                                  0326 00625000
*             CHAR2INP(2)=CHAR2INP(2)/C2;/* SHIFT RIGHT 1 BIT      0326 00626000
*                                                            @Z40LB02*/ 00627000
         SLR   @14,@14                                             0326 00628000
         IC    @14,CHAR2INP+1(,FSWAPTR)                            0326 00629000
         SRL   @14,1                                               0326 00630000
         STC   @14,CHAR2INP+1(,FSWAPTR)                            0326 00631000
*           END;                                                   0327 00632000
         LA    @14,1                                               0327 00633000
         SLR   @11,@11                                             0327 00634000
         IC    @11,I(,FSWAPTR)                                     0327 00635000
         ALR   @14,@11                                             0327 00636000
         STC   @14,I(,FSWAPTR)                                     0327 00637000
         CH    @14,@CH00108                                        0327 00638000
         BNH   @DL00325                                            0327 00639000
*           UNPK(GENTRAN(1:4),TRVAL3CH(2:3));/* UNPACK       @Z40LB02*/ 00640000
         UNPK  GENTRAN(4,FSWAPTR),TRVAL3CH+1(2,FSWAPTR)            0328 00641000
*           GEN REFS(TRVAL3CH,TRTABLE,FSWAPTR);                    0329 00642000
*                                                         /*@Z40LB02*/  00643000
   TR     TRVAL3CH(3,FSWAPTR),TRTABLE-X'F0'  TRANSL Y VALUE   @Z40LB02  00644000
*           ZVAL=TRVAL3CH(3);       /* STORE Z VALUE         @Z40LB02*/ 00645000
*                                                                  0330 00646000
         MVC   ZVAL(1,FSWAPTR),TRVAL3CH+2(FSWAPTR)                 0330 00647000
*           /*********************************************************/ 00648000
*           /*                                                       */ 00649000
*           /* TRANSLATE X VALUE                             @Z40LB02*/ 00650000
*           /*                                                       */ 00651000
*           /*********************************************************/ 00652000
*                                                                  0331 00653000
*           CHAR2INP(2)=XVALUE;     /* XVAL IN TRANS AREA    @Z40LB02*/ 00654000
         MVC   CHAR2INP+1(1,FSWAPTR),XVALUE(SNSPTR)                0331 00655000
*           CVD(FIXVAL,CONVERT);    /* CONVERT X TO DEC      @Z40LB02*/ 00656000
         SLR   @14,@14                                             0332 00657000
         IC    @14,FIXVAL(,FSWAPTR)                                0332 00658000
         CVD   @14,@TS00001                                        0332 00659000
         MVC   CONVERT(2,FSWAPTR),@TS00001+6                       0332 00660000
*           CHAR2INP=CONVERT/C16;   /* SHIFT RT 1 BYTE       @Z40LB02*/ 00661000
         SLR   @14,@14                                             0333 00662000
         ICM   @14,3,CONVERT(FSWAPTR)                              0333 00663000
         SRL   @14,4                                               0333 00664000
         STH   @14,CHAR2INP(,FSWAPTR)                              0333 00665000
*           UNPK(GENTRAN,GENTRAN(1:3));/* UNPACK X VALUE     @Z40LB02*/ 00666000
         UNPK  GENTRAN(5,FSWAPTR),GENTRAN(3,FSWAPTR)               0334 00667000
*           GEN REFS(GENTRAN,TRTABLE,FSWAPTR);                     0335 00668000
*                                                         /*@Z40LB02*/  00669000
   TR     GENTRAN(5,FSWAPTR),TRTABLE-X'F0' TRANSL X VALUE     @Z40LB02  00670000
*           XVAL=GENTRAN(2:4);      /* STORE X VALUE         @Z40LB02*/ 00671000
         MVC   XVAL(3,FSWAPTR),GENTRAN+1(FSWAPTR)                  0336 00672000
*         END;                      /*                       @Z40LB02*/ 00673000
*       IF(MSGNUM=C2|MSGNUM=C5|MSGNUM=>C9) THEN/* MSG        @ZA13048   00674000
*                                      NUMBER 2, 5, 9?       @ZA13048*/ 00675000
@RF00316 CLI   MSGNUM(FSWAPTR),2                                   0338 00676000
         BE    @RT00338                                            0338 00677000
         CLI   MSGNUM(FSWAPTR),5                                   0338 00678000
         BE    @RT00338                                            0338 00679000
         CLI   MSGNUM(FSWAPTR),9                                   0338 00680000
         BL    @RF00338                                            0338 00681000
@RT00338 DS    0H                                                  0339 00682000
*         DO;                       /*                       @Z40LB02*/ 00683000
*                                                                  0339 00684000
*           /*********************************************************/ 00685000
*           /*                                                       */ 00686000
*           /* TRANSLATE MSF VALUE                           @Z40LB02*/ 00687000
*           /*                                                       */ 00688000
*           /*********************************************************/ 00689000
*                                                                  0340 00690000
*           CHAR2INP(2)=EWOLZYX1&MASKMSF;/* MSF IN TRANS AREA      0340 00691000
*                                                            @Z40LB02*/ 00692000
         MVC   CHAR2INP+1(1,FSWAPTR),EWOLZYX1(SNSPTR)              0340 00693000
         NI    CHAR2INP+1(FSWAPTR),B'11000000'                     0340 00694000
*           DO I=C1 TO C6;          /* LOOP CPNTROL          @Z40LB02*/ 00695000
         LA    @14,1                                               0341 00696000
         STC   @14,I(,FSWAPTR)                                     0341 00697000
@DL00341 DS    0H                                                  0342 00698000
*             CHAR2INP(2)=CHAR2INP(2)/C2;/* SHIFT RT 1 BIT   @Z40LB02*/ 00699000
         SLR   @14,@14                                             0342 00700000
         IC    @14,CHAR2INP+1(,FSWAPTR)                            0342 00701000
         SRL   @14,1                                               0342 00702000
         STC   @14,CHAR2INP+1(,FSWAPTR)                            0342 00703000
*           END;                    /*                       @Z40LB02*/ 00704000
         LA    @14,1                                               0343 00705000
         SLR   @11,@11                                             0343 00706000
         IC    @11,I(,FSWAPTR)                                     0343 00707000
         ALR   @14,@11                                             0343 00708000
         STC   @14,I(,FSWAPTR)                                     0343 00709000
         CH    @14,@CH00081                                        0343 00710000
         BNH   @DL00341                                            0343 00711000
*           UNPK(GENTRAN(1:4),TRVAL3CH);/* UNPACK            @Z40LB02*/ 00712000
         UNPK  GENTRAN(4,FSWAPTR),TRVAL3CH(3,FSWAPTR)              0344 00713000
*           GEN REFS(TRVAL3CH,TRTABLE,FSWAPTR);                    0345 00714000
*                                                         /*@Z40LB02*/  00715000
            TR     TRVAL3CH(3,FSWAPTR),TRTABLE-X'F0'          @Z40LB02  00716000
*           MSFVAL=TRVAL3CH(3);     /* SAVE MSF VALUE        @Z40LB02*/ 00717000
         MVC   MSFVAL(1,FSWAPTR),TRVAL3CH+2(FSWAPTR)               0346 00718000
*         END;                                                     0347 00719000
*       IF MSGNUM=C8 THEN           /* MSG NUMBER 8          @ZA13048*/ 00720000
@RF00338 CLI   MSGNUM(FSWAPTR),8                                   0348 00721000
         BNE   @RF00348                                            0348 00722000
*         DO;                                                      0349 00723000
*           CHAR2INP(2)=EWOSNS2&MASKMSF2;/* MSFID IN TRANS AREA    0350 00724000
*                                                            @ZA13048*/ 00725000
         MVC   CHAR2INP+1(1,FSWAPTR),EWOSNS2(SNSPTR)               0350 00726000
         NI    CHAR2INP+1(FSWAPTR),B'00110000'                     0350 00727000
*           DO I=C1 TO C4;                                         0351 00728000
         LA    @14,1                                               0351 00729000
         STC   @14,I(,FSWAPTR)                                     0351 00730000
@DL00351 DS    0H                                                  0352 00731000
*             CHAR2INP(2)=CHAR2INP(2)/C2;/* SHIFT RT 1 BIT   @ZA13048*/ 00732000
         SLR   @14,@14                                             0352 00733000
         IC    @14,CHAR2INP+1(,FSWAPTR)                            0352 00734000
         SRL   @14,1                                               0352 00735000
         STC   @14,CHAR2INP+1(,FSWAPTR)                            0352 00736000
*           END;                                                   0353 00737000
         LA    @14,1                                               0353 00738000
         SLR   @11,@11                                             0353 00739000
         IC    @11,I(,FSWAPTR)                                     0353 00740000
         ALR   @14,@11                                             0353 00741000
         STC   @14,I(,FSWAPTR)                                     0353 00742000
         CH    @14,@CH00070                                        0353 00743000
         BNH   @DL00351                                            0353 00744000
*           MSFVAL=CHAR2INP(2)|HIMASK;/* MSFID IN OP AREA    @ZA13048*/ 00745000
         MVC   MSFVAL(1,FSWAPTR),CHAR2INP+1(FSWAPTR)               0354 00746000
         OI    MSFVAL(FSWAPTR),X'F0'                               0354 00747000
*         END;                                                     0355 00748000
*       IF(MSGNUM=>C4&MSGNUM=<C6|MSGNUM=C7|MSGNUM=C15) THEN        0356 00749000
@RF00348 CLI   MSGNUM(FSWAPTR),4                                   0356 00750000
         BL    @GL00014                                            0356 00751000
         CLI   MSGNUM(FSWAPTR),6                                   0356 00752000
         BNH   @RT00356                                            0356 00753000
@GL00014 CLI   MSGNUM(FSWAPTR),7                                   0356 00754000
         BE    @RT00356                                            0356 00755000
         CLI   MSGNUM(FSWAPTR),15                                  0356 00756000
         BNE   @RF00356                                            0356 00757000
@RT00356 DS    0H                                                  0357 00758000
*         DO;                                                      0357 00759000
*           CHAR2INP=EWOSSID&MASKSSID;/* SSID IN TRANS AREA  @Z40LB02*/ 00760000
         MVC   CHAR2INP(2,FSWAPTR),EWOSSID(SNSPTR)                 0358 00761000
         NC    CHAR2INP(2,FSWAPTR),MASKSSID                        0358 00762000
*           UNPK(GENTRAN,TRVAL3CH); /* UNPACK SSID           @Z40LB02*/ 00763000
         UNPK  GENTRAN(5,FSWAPTR),TRVAL3CH(3,FSWAPTR)              0359 00764000
*           GEN REFS(GENTRAN,TRTABLE,FSWAPTR);                     0360 00765000
*                                                         /*@Z40LB02*/  00766000
   TR    GENTRAN(5,FSWAPTR),TRTABLE-X'F0'    TRANSLATE SSID   @Z40LB02  00767000
*           SSIDAREA=GENTRAN(2:4);  /* SAVE SSID             @Z40LB02*/ 00768000
         MVC   SSIDAREA(3,FSWAPTR),GENTRAN+1(FSWAPTR)              0361 00769000
*         END;                                                     0362 00770000
*                                                                  0362 00771000
*       /*************************************************************/ 00772000
*       /*                                                           */ 00773000
*       /* SET UP MESSAGE CONSTANT AREA                      @Z40LB02*/ 00774000
*       /*                                                           */ 00775000
*       /*************************************************************/ 00776000
*                                                                  0363 00777000
*       FMTWT01=C83;                /* LENGTH OF MSG         @Z40LB02*/ 00778000
@RF00356 MVC   FMTWT01(2,FSWAPTR),@CH00311                         0363 00779000
*       FMTWT02=MCSFLG;             /* SET MSC FLAGS         @Z40LB02*/ 00780000
         MVC   FMTWT02(2,FSWAPTR),MCSFLG                           0364 00781000
*       FMTWT03='';                 /* INIT MSG TXT          @Z40LB02*/ 00782000
         MVI   FMTWT03(FSWAPTR),C' '                               0365 00783000
         MVC   FMTWT03+1(78,FSWAPTR),FMTWT03(FSWAPTR)              0365 00784000
*       FMTWT04=DESC2;              /* SET DESC CODE TO 3    @Z40LB02*/ 00785000
         MVC   FMTWT04(2,FSWAPTR),DESC2                            0366 00786000
*       FMTWT05=LIBROUT;            /* ROUTING CODE 1        @Z40LBO2*/ 00787000
*                                                                  0367 00788000
         MVC   FMTWT05(2,FSWAPTR),LIBROUT                          0367 00789000
*       /*************************************************************/ 00790000
*       /*                                                           */ 00791000
*       /* ALTERNATE CONSOLE PROCESSING                      @Z40LB02*/ 00792000
*       /*                                                           */ 00793000
*       /*************************************************************/ 00794000
*                                                                  0368 00795000
*       IF ALTCON¬=ZERO THEN        /* ALTCONS SPECD         @Z40LB02*/ 00796000
         ICM   @14,3,ALTCON(FSWAPTR)                               0368 00797000
         BZ    @RF00368                                            0368 00798000
*         DO;                       /*                       @Z40LB02*/ 00799000
*           FMTWT05=FMTWT05|ALTCON; /* ST ALTCON VALUE       @Z40LB02*/ 00800000
         OC    FMTWT05(2,FSWAPTR),ALTCON(FSWAPTR)                  0370 00801000
*         END;                      /*                       @Z40LB02*/ 00802000
*       RFY                                                        0372 00803000
*        (REG6,                                                    0372 00804000
*         BALRREG,                                                 0372 00805000
*         REGD) RSTD;                                              0372 00806000
*                                                                  0372 00807000
@RF00368 DS    0H                                                  0373 00808000
*       /*************************************************************/ 00809000
*       /*                                                           */ 00810000
*       /* THE FOLLOWING CODE SETUPS XCTL FOR NEXT MODULE    @Z40LB02*/ 00811000
*       /*                                                           */ 00812000
*       /*************************************************************/ 00813000
*                                                                  0373 00814000
*       IF MSGNUM<=C3 THEN          /* MSG INDEX <= 3        @Z40LB02*/ 00815000
         CLI   MSGNUM(FSWAPTR),3                                   0373 00816000
         BH    @RF00373                                            0373 00817000
*         CALL FSMSG123;                                           0374 00818000
         BAL   @14,FSMSG123                                        0374 00819000
*       IF MSGNUM=C5 THEN           /* MSGNUM =5             @Z40LB02*/ 00820000
@RF00373 CLI   MSGNUM(FSWAPTR),5                                   0375 00821000
         BNE   @RF00375                                            0375 00822000
*         CALL FSMSG5;                                             0376 00823000
         BAL   @14,FSMSG5                                          0376 00824000
*       IF(MSGNUM=C4|MSGNUM>C5) THEN/*                       @Z40LB02   00825000
*                                      MSGNUM =4 OR >5       @Z40LB02*/ 00826000
@RF00375 CLI   MSGNUM(FSWAPTR),4                                   0377 00827000
         BE    @RT00377                                            0377 00828000
         CLI   MSGNUM(FSWAPTR),5                                   0377 00829000
         BNH   @RF00377                                            0377 00830000
@RT00377 DS    0H                                                  0378 00831000
*         CALL FSMS4678;                                           0378 00832000
*                                                                  0378 00833000
         BAL   @14,FSMS4678                                        0378 00834000
*       /*************************************************************/ 00835000
*       /*                                                           */ 00836000
*       /* MOVE SENSE DATA INTO WORK AREA                    @Z40LB02*/ 00837000
*       /* UNPACK AND TRANSLATE 32 BYTES OF SENSE DATA       @Z40LB02*/ 00838000
*       /*                                                           */ 00839000
*       /*************************************************************/ 00840000
*                                                                  0379 00841000
*       SENSPTR8=ADDR(FMTWT03)+'0E'X;/*                      @Z40LB02*/ 00842000
@RF00377 LA    SENSPTR8,FMTWT03(,FSWAPTR)                          0379 00843000
         AH    SENSPTR8,@CH02088                                   0379 00844000
*       DO I=C1 TO C8;              /*                       @Z40LB02*/ 00845000
         LA    @11,1                                               0380 00846000
         STC   @11,I(,FSWAPTR)                                     0380 00847000
@DL00380 DS    0H                                                  0381 00848000
*         FMTRES1=SENS4;            /*                       @Z40LB02*/ 00849000
         MVC   FMTRES1(4,FSWAPTR),SENS4(SNSPTR)                    0381 00850000
*         UNPK(FMTRANL,FMTRAN);     /*                       @Z40LB02*/ 00851000
         UNPK  FMTRANL(9,FSWAPTR),FMTRAN(5,FSWAPTR)                0382 00852000
*         SENS8=FMTTRSN;            /*                       @Z40LB02*/ 00853000
         MVC   SENS8(8,REG6),FMTTRSN(FSWAPTR)                      0383 00854000
*         SENSPTR8=SENSPTR8+C8;     /*                       @Z40LB02*/ 00855000
         AH    SENSPTR8,@CH00052                                   0384 00856000
*         SNSPTR=SNSPTR+C4;         /*                       @Z40LB02*/ 00857000
         AH    SNSPTR,@CH00070                                     0385 00858000
*       END;                        /*                       @Z40LB02*/ 00859000
         LA    @11,1                                               0386 00860000
         SLR   @08,@08                                             0386 00861000
         IC    @08,I(,FSWAPTR)                                     0386 00862000
         ALR   @11,@08                                             0386 00863000
         STC   @11,I(,FSWAPTR)                                     0386 00864000
         CH    @11,@CH00052                                        0386 00865000
         BNH   @DL00380                                            0386 00866000
*       RFY                                                        0387 00867000
*         EWAPTR RSTD;              /*                       @Z40LB02*/ 00868000
*       EWAPTR=IOSERP;              /*                       @Z40LB02*/ 00869000
         L     EWAPTR,IOSERP(,IOSBPTR)                             0388 00870000
*       SNSPTR=ADDR(EWASNS);        /*                       @Z40LB02*/ 00871000
         LA    SNSPTR,EWASNS(,EWAPTR)                              0389 00872000
*       GEN REFS(FMTSNWA2,TRTABLE,FSWAPTR);                        0390 00873000
*                                                         /*@Z40LB02*/  00874000
         TR     FMTSNWA2(64,FSWAPTR),TRTABLE-X'F0' TRANSLATE 32         00875000
*                                    BYTES OF SENSE DATA                00876000
*       EWAPTR=REGD;                /* SAVE REG 13           @Z40LB02*/ 00877000
*                                                                  0391 00878000
         LR    EWAPTR,REGD                                         0391 00879000
*       /*************************************************************/ 00880000
*       /*                                                           */ 00881000
*       /* UNPACK AND TRANSLATE THE UNIT ADDRESS             @Z40LB02*/ 00882000
*       /*                                                           */ 00883000
*       /*************************************************************/ 00884000
*                                                                  0392 00885000
*       CHAR2INP=UCBCHAN&MASKSSID;  /* UCBA IN TRANS AREA    @Z40LB02*/ 00886000
         MVC   CHAR2INP(2,FSWAPTR),UCBCHAN(UCBPTR)                 0392 00887000
         NC    CHAR2INP(2,FSWAPTR),MASKSSID                        0392 00888000
*       UNPK(GENTRAN,TRVAL3CH);     /* UNPACK UCBA           @Z40LB02*/ 00889000
         UNPK  GENTRAN(5,FSWAPTR),TRVAL3CH(3,FSWAPTR)              0393 00890000
*       GEN REFS(GENTRAN,TRTABLE,FSWAPTR);                         0394 00891000
*                                                                  0394 00892000
*                                                         /*@Z40LB02*/  00893000
   TR    GENTRAN(5,FSWAPTR),TRTABLE-X'F0'    TRANSLATE UCBA   @Z40LB02  00894000
*       /*************************************************************/ 00895000
*       /*                                                           */ 00896000
*       /* BUILD MESSAGE TO WRITE THE 32 BYTES OF SENSE      @Z40LB02*/ 00897000
*       /* USED TO BUILD THE FORMATTED MESSAGE.              @Z40LB02*/ 00898000
*       /*                                                           */ 00899000
*       /*************************************************************/ 00900000
*                                                                  0395 00901000
*       MSGID11=MSGID508;           /* MESSAGE ID            @Z40LB02*/ 00902000
         MVC   MSGID11(14,FSWAPTR),MSGID508                        0395 00903000
*       MSGID11(9:11)=GENTRAN(2:4); /* UNIT ADDRESS          @Z40LB02*/ 00904000
         MVC   MSGID11+8(3,FSWAPTR),GENTRAN+1(FSWAPTR)             0396 00905000
*       FMTWT04=DESC4;              /* DESCRIPTOR CDE 4      @Z40LB02*/ 00906000
         MVC   FMTWT04(2,FSWAPTR),DESC4                            0397 00907000
*       FMTWT05=FMTWT05&ONEOFF;     /* MASK OFF RTE CDE 1    @ZA29810*/ 00908000
         NC    FMTWT05(2,FSWAPTR),ONEOFF                           0398 00909000
*       FMTWT05=FMTWT05|RTECODE;    /* ROUTE CODE OF 2       @ZA29810*/ 00910000
         OC    FMTWT05(2,FSWAPTR),RTECODE                          0399 00911000
*       DO;                         /* WTOP MF(E,FMTWT01)            */ 00912000
*         RFY                                                      0401 00913000
*           GPR01P RSTD;            /* RESTRICT REG 1                */ 00914000
*         GPR01P=ADDR(FMTWT01);     /* ADDRESS CONTROL PROGRAM LIST  */ 00915000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0402 00916000
*         SVC(35);                  /* ISSUE WTO SVC                 */ 00917000
         SVC   35                                                  0403 00918000
*         RFY                                                      0404 00919000
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */ 00920000
*       END;                        /* WTOP MF(E,FMTWT01)    @Z40LB02*/ 00921000
*       IOSBPTR=SAVER1;             /* RESTORE REG 1         @Z40LB02*/ 00922000
         L     IOSBPTR,SAVER1(,FSWAPTR)                            0406 00923000
*     END;                          /*                       @Z40LB02*/ 00924000
*   EWAPTR=REGD;                    /* SAVE R13              @VS41102*/ 00925000
@RF00308 LR    EWAPTR,REGD                                         0408 00926000
*   IF IOSMSG=ON THEN               /* IS MSG BIT ON?        @Z40LB02*/ 00927000
         TM    IOSMSG(IOSBPTR),B'00000100'                         0409 00928000
         BNO   @RF00409                                            0409 00929000
*     DO;                                                          0410 00930000
*       REGD=WTORTN;                /* SET WTO RTN IN R13    @Z40LB02*/ 00931000
         LA    REGD,253                                            0411 00932000
*     END;                                                         0412 00933000
*   ELSE                                                           0413 00934000
*     IF IOSLOG=ON THEN             /* IS LOG BIT ON?        @Z40LB02*/ 00935000
         B     @RC00409                                            0413 00936000
@RF00409 TM    IOSLOG(IOSBPTR),B'00000001'                         0413 00937000
         BNO   @RF00413                                            0413 00938000
*       DO;                                                        0414 00939000
*         REGD=OBRRTN;              /* SET OBR RTN IN R13    @Z40LB02*/ 00940000
         LA    REGD,256                                            0415 00941000
*       END;                                                       0416 00942000
*     ELSE                                                         0417 00943000
*                                                                  0417 00944000
*       /*************************************************************/ 00945000
*       /*                                                           */ 00946000
*       /* EXIT TO IOS BECAUSE OF INVALID MESSAGE REQUEST    @Z40LB02*/ 00947000
*       /*                                                           */ 00948000
*       /*************************************************************/ 00949000
*                                                                  0417 00950000
*       DO;                                                        0417 00951000
         B     @RC00413                                            0417 00952000
@RF00413 DS    0H                                                  0418 00953000
*         REGD=EWAPTR;              /* RESTORE REG 13        @Z40LB02*/ 00954000
         LR    REGD,EWAPTR                                         0418 00955000
*         CALL FSCLNUP;             /*                       @Z40LB02*/ 00956000
         BAL   @14,FSCLNUP                                         0419 00957000
*         SVC(15);                  /* SVC 15 PROCEDURE      @Z40LB02*/ 00958000
         SVC   15                                                  0420 00959000
*         SVC(3);                   /* EXIT EFFECTOR         @Z40LB02*/ 00960000
         SVC   3                                                   0421 00961000
*       END;                        /*                       @Z40LB02*/ 00962000
*   VVIPTR=REGD;                    /* SAVE XCTL VALUE       @Z40LB02*/ 00963000
@RC00413 DS    0H                                                  0423 00964000
@RC00409 ST    REGD,VVIPTR(,FSWAPTR)                               0423 00965000
*   REGD=EWAPTR;                    /* RSTOR SAVE AREA ADDR  @Z40LB02*/ 00966000
         LR    REGD,EWAPTR                                         0424 00967000
*   CALL FSCLNUP;                   /*                       @Z40LB02*/ 00968000
         BAL   @14,FSCLNUP                                         0425 00969000
*   REGD=VVIPTR;                    /* RESTORE SCTL VALUE    @Z40LB02*/ 00970000
         L     REGD,VVIPTR(,FSWAPTR)                               0426 00971000
*   BALRREG=CVTXTLER;               /* GET XCTL RTN ADDR     @Z40LB02*/ 00972000
         L     BALRREG,CVTXTLER(,CVTPTR)                           0427 00973000
*   GEN REFS(BALRREG);                                             0428 00974000
        BR   BALRREG               XCTL TO NEXT RTN                     00975000
*FSMSG123:                                                         0429 00976000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0429 00977000
*                                                                  0429 00978000
FSMSG123 DS    0H                                                  0430 00979000
*/********************************************************   @Z40LB02*/ 00980000
*/*      MODULE NAME = FSMSG123                              @Z40LB02*/ 00981000
*/*                                                          @Z40LB02*/ 00982000
*/*     DESCRIPTION NAME = FORMAT SENSE MESSAGES 1,2 AND 3   @Z40LB02*/ 00983000
*/*                                                          @Z40LB02*/ 00984000
*/*     FUNCTION = FSMSG123 WILL BUILD THE MESSAGES AND      @Z40LB02*/ 00985000
*/*                 ISSUE THE WTO MACRO FOR:                 @Z40LB02*/ 00986000
*/*                                                          @Z40LB02*/ 00987000
*/*                 (1) STAGE ERROR MESSAGE                  @Z40LB02*/ 00988000
*/*                 (2) STRIPES AVAIL ZERO(PARTS I & II)     @ZA16133*/ 00989000
*/*                 AND                                      @Z40LB02*/ 00990000
*/*                 (3) CARTRIDGE LOAD FAILURE MESSAGE       @Z40LB02*/ 00991000
*/*                                                          @Z40LB02*/ 00992000
*/*                 BEFORE GETTING CONTROL, MAINLINE CODE OF @Z40LB02*/ 00993000
*/*                 FORMAT SENSE MODULE(IGE0301H) WILL HAVE  @Z40LB02*/ 00994000
*/*                 COMPLETED THE MESSAGE DETERMINATION      @Z40LB02*/ 00995000
*/*                 AND PLACED THE MESSAGE INDEX IN THE      @Z40LB02*/ 00996000
*/*                 FORMAT SENSE WORK AREA.                  @Z40LB02*/ 00997000
*/*                                                          @Z40LB02*/ 00998000
*/*                 THE MESSAGE WILL BE BUILT AND WRITTEN    @Z40LB02*/ 00999000
*/*                 TO THE OPERATOR.  IF THE IOSMSG BIT OF   @Z40LB02*/ 01000000
*/*                 IOBFLAG3 FIELD IS SET(XCTL TO SYSTEM     @Z40LB02*/ 01001000
*/*                 WTO) IT MUST BE SET OFF TO PREVENT TWO   @Z40LB02*/ 01002000
*/*                 SENSE DATA MESSAGES FROM BEING PRINTED.  @Z40LB02*/ 01003000
*/*                 THIS ROUTINE WILL RETURN TO MAINLINE CODE@Z40LB02*/ 01004000
*/*                 TO BUILD AND PRINT SENSE MESSAGE AND     @Z40LB02*/ 01005000
*/*                 FOR APPROPRIATE EXIT PROCESSING.         @Z40LB02*/ 01006000
*/*                                                          @Z40LB02*/ 01007000
*/*                                                          @Z40LB02*/ 01008000
*/*                                                          @Z40LB02*/ 01009000
*/*      INPUT = REGISTER 1 WILL HAVE ADDRESS OF RQE.        @Z40LB02*/ 01010000
*/*                                                          @Z40LB02*/ 01011000
*/*      OUTPUT = (1)  REGISTER 1 WILL BE UNCHANGED.         @Z40LB02*/ 01012000
*/*               (2)  MESSAGES TO THE MASTER CONSOLE BY     @Z40LB02*/ 01013000
*/*               USING SVC 35.                              @Z40LB02*/ 01014000
*/*                                                          @Z40LB02*/ 01015000
*/*                                                          @Z40LB02*/ 01016000
*/*               ICB5XXE - EVENTUAL ACTION MESSAGE          @Z40LB02*/ 01017000
*/*               ICB5XXA - IMMED ACTION MESSAGE             @Z40LB02*/ 01018000
*/*                                                          @Z40LB02*/ 01019000
*/********************************************************   @Z40LB02*/ 01020000
*                                                                  0430 01021000
*   /*****************************************************************/ 01022000
*   /*                                                               */ 01023000
*   /* THE FOLLOWING DECLARES REPRESENT THE STATIC MESSAGE   @Z40LB02*/ 01024000
*   /* TEXT THAT WILL BE USED TO BUILD MESSAGES FOR (1)      @Z40LB02*/ 01025000
*   /* STAGE ERROR, (2) DEFECTIVE CARTRIDGE, (3) CARTRIDGE   @Z40LB02*/ 01026000
*   /* LOAD FAILURE, AND (5) SENSE DATA(ALL 64               @Z40LB02*/ 01027000
*   /* CHARACTERS-4 BYTES IN EACH BLOCK)                     @Z40LB02*/ 01028000
*   /*                                                               */ 01029000
*   /*****************************************************************/ 01030000
*                                                                  0430 01031000
*   DCL                                                            0430 01032000
*     MSGID500 CHAR(10) INIT('ICB500E - ');/* MESSAGE ID     @Z40LB02*/ 01033000
*   DCL                                                            0431 01034000
*     MSGID501 CHAR(10) INIT('ICB501E - ');/* MESSAGE ID     @Z40LB02*/ 01035000
*   DCL                                                            0432 01036000
*     MSGID502 CHAR(10) INIT('ICB502E - ');/* MESSAGE ID     @Z40LB02*/ 01037000
*   DCL                                                            0433 01038000
*     MSG500 CHAR(13) INIT('STAGE ERROR, ');/* ICB500E MSG   @Z40LB02*/ 01039000
*   DCL                                                            0434 01040000
*     MSG501 CHAR(24) INIT('STRIPES AVAILABLE ZERO, ');/* ICB501E  0434 01041000
*                                      MESSAGE               @ZA16133*/ 01042000
*   DCL                                                            0435 01043000
*     MSG502 CHAR(24) INIT('CARTRIDGE LOAD FAILURE, ');/*    @Z40LB02   01044000
*                                      ICB502E MESSAGE       @Z40LB02*/ 01045000
*                                                                  0435 01046000
*   /*****************************************************************/ 01047000
*   /*                                                               */ 01048000
*   /* STAGE ERROR MESSAGE SKELETON - ICB500E                @Z40LB02*/ 01049000
*   /*                                                               */ 01050000
*   /*****************************************************************/ 01051000
*                                                                  0436 01052000
*   DCL                                                            0436 01053000
*     1 MSG1 CHAR(46) DEFINED(FMTWT03),                            0436 01054000
*      2 MSGID CHAR(10),            /* MESSAGE ID            @Z40LB02*/ 01055000
*      2 MSGTEXT CHAR(13),          /* MESSAGE TEXT          @Z40LB02*/ 01056000
*      2 VOL500 CHAR(6),            /* STATIC TEXT VOLID     @Z40LB02*/ 01057000
*      2 VOLVAL CHAR(6),            /* VOLID                 @Z40LB02*/ 01058000
*      2 CYL500 CHAR(6),            /* STATIC CYL            @Z40LB02*/ 01059000
*      2 CYLVAL CHAR(4),            /* CYLINDER              @Z40LB02*/ 01060000
*      2 END500 CHAR(1);            /* BLANK                 @Z40LB02*/ 01061000
*                                                                  0436 01062000
*   /*****************************************************************/ 01063000
*   /*                                                               */ 01064000
*   /* PART I OF STRIPES AVAIL ZERO MSG SKELETON - ICB501E   @ZA16133*/ 01065000
*   /*                                                               */ 01066000
*   /*****************************************************************/ 01067000
*                                                                  0437 01068000
*   DCL                                                            0437 01069000
*     1 MSG2 CHAR(65) DEFINED(FMTWT03),                            0437 01070000
*      2 MSGID2 CHAR(10),           /* MESSAGE ID            @Z40LB02*/ 01071000
*      2 MSGTXT2 CHAR(24),          /* MESSAGE TEXT          @Z40LB02*/ 01072000
*      2 VOL501 CHAR(6),            /* STATIC TEXT VOLID     @Z40LB02*/ 01073000
*      2 VOLVAL2 CHAR(6),           /* VOLID                 @Z40LB02*/ 01074000
*      2 CSN501 CHAR(6),            /* STATIC TEXT CSN       @Z40LB02*/ 01075000
*      2 CSNVAL2 CHAR(12),          /* CSN                   @Z40LB02*/ 01076000
*      2 END501 CHAR(1);            /* BLANK                 @Z40LB02*/ 01077000
*                                                                  0437 01078000
*   /*****************************************************************/ 01079000
*   /*                                                               */ 01080000
*   /* PART II OF STRIPES AVAIL ZERO MSG SKELETON - ICB501E  @ZA16133*/ 01081000
*   /*                                                               */ 01082000
*   /*****************************************************************/ 01083000
*                                                                  0438 01084000
*   DCL                                                            0438 01085000
*     1 MSG2A CHAR(52) DEFINED(FMTWT03),                           0438 01086000
*      2 MSGID2A CHAR(10),          /* MESSAGE ID            @Z40LB02*/ 01087000
*      2 MSGTXT2A CHAR(24),         /* MSG STATIC TEXT       @Z40LB02*/ 01088000
*      2 MSF501A CHAR(4),           /* MSF STATIC TEXT       @Z40LB02*/ 01089000
*      2 MSFVAL2A CHAR(1),          /* MSF VALUE             @Z40LB02*/ 01090000
*      2 XYZ501A CHAR(6),           /* XYZ STATIC TEST       @Z40LB02*/ 01091000
*      2 XYZVAL2A CHAR(6),          /* XYZ VALUE             @Z40LB02*/ 01092000
*       3 XVAL2A CHAR(3),           /* X VALUE               @Z40LB02*/ 01093000
*       3 YVAL2A CHAR(2),           /* Y VALUE               @Z40LB02*/ 01094000
*       3 ZVAL2A CHAR(1),           /* Z VALUE               @Z40LB02*/ 01095000
*      2 END501A CHAR(1);           /*                       @Z40LB02*/ 01096000
*                                                                  0438 01097000
*   /*****************************************************************/ 01098000
*   /*                                                               */ 01099000
*   /* CARTRIDGE LOAD FAILURE MESSAGE SKELETON - ICB502E     @Z40LB02*/ 01100000
*   /*                                                               */ 01101000
*   /*****************************************************************/ 01102000
*                                                                  0439 01103000
*   DCL                                                            0439 01104000
*     1 MSG3 CHAR(65) DEFINED(FMTWT03),                            0439 01105000
*      2 MSGID3 CHAR(10),                                          0439 01106000
*      2 MSGTXT3 CHAR(24),                                         0439 01107000
*      2 VOL502 CHAR(6),            /* VOLID STATIC TXT      @Z40LB02*/ 01108000
*      2 VOLVAL3 CHAR(6),           /* VOLID                 @Z40LB02*/ 01109000
*      2 CSN502 CHAR(6),            /* CSN STATIC TEXT       @Z40LB02*/ 01110000
*      2 CSNVAL3 CHAR(12),          /* CSN                   @Z40LB02*/ 01111000
*      2 END502 CHAR(1);            /*                       @Z40LB02*/ 01112000
*   SAVE123=BALRREG;                /* SAVE REG 14           @Z40LB02*/ 01113000
         LR    SAVE123,BALRREG                                     0440 01114000
*   IF MSGNUM=C1 THEN               /* MESSAGE # ONE?        @Z40LB02*/ 01115000
*                                                                  0441 01116000
         CLI   MSGNUM(FSWAPTR),1                                   0441 01117000
         BNE   @RF00441                                            0441 01118000
*     /***************************************************************/ 01119000
*     /*                                                             */ 01120000
*     /* IF MESSAGE INDEX WAS 1, THEN BUILD STAGE ERROR      @Z40LB02*/ 01121000
*     /* MESSAGE(ICB500E).                                   @Z40LB02*/ 01122000
*     /*                                                             */ 01123000
*     /***************************************************************/ 01124000
*                                                                  0442 01125000
*     DO;                           /*                       @Z40LB02*/ 01126000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01127000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0443 01128000
*       MSGID=MSGID500;             /* PUT MSGID IN WKAREA   @Z40LB02*/ 01129000
         MVC   MSGID(10,FSWAPTR),MSGID500                          0444 01130000
*       MSGTEXT=MSG500;             /* PUT MSG IN WK AREA    @Z40LB02*/ 01131000
         MVC   MSGTEXT(13,FSWAPTR),MSG500                          0445 01132000
*       VOL500=VOLID;               /* STATIC VOLID AREA     @Z40LB02*/ 01133000
         MVC   VOL500(6,FSWAPTR),VOLID                             0446 01134000
*       VOLVAL=EWOVOLID;            /* PUT VOLID IN WKAREA   @Z40LB02*/ 01135000
         MVC   VOLVAL(6,FSWAPTR),EWOVOLID(SNSPTR)                  0447 01136000
*       CYL500=CYL;                 /* STATIC CYLINDER       @Z40LB02*/ 01137000
         MVC   CYL500(6,FSWAPTR),CYL                               0448 01138000
*       CYLIND1=EWOSNS(15:16);      /* LOAD CYL VAL          @Z40LB02*/ 01139000
         MVC   CYLIND1(2,FSWAPTR),EWOSNS+14(SNSPTR)                0449 01140000
*       UNPK(CYLINDER,CYLTRAN);     /* UNPACK CYL VALUE      @Z40LB02*/ 01141000
         UNPK  CYLINDER(5,FSWAPTR),CYLTRAN(4,FSWAPTR)              0450 01142000
*       GEN REFS(CYLTRAN,TRTABLE,FSWAPTR);                         0451 01143000
        TR    CYLTRAN(4,FSWAPTR),TRTABLE-X'F0'   TRANSLATE CYL VAL      01144000
*       CYLVAL=CYLTRAN;                                            0452 01145000
         MVC   CYLVAL(4,FSWAPTR),CYLTRAN(FSWAPTR)                  0452 01146000
*       END500=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01147000
         MVC   END500(1,FSWAPTR),MSGEND                            0453 01148000
*     END;                          /*                       @Z40LB02*/ 01149000
*   IF MSGNUM=C2 THEN               /* MESSAGE # TWO?        @Z40LB02*/ 01150000
*                                                                  0455 01151000
@RF00441 CLI   MSGNUM(FSWAPTR),2                                   0455 01152000
         BNE   @RF00455                                            0455 01153000
*     /***************************************************************/ 01154000
*     /*                                                             */ 01155000
*     /* IF MESSAGE INDEX WAS 2, THEN BUILD STRIPES AVAILABLE ZERO   */ 01156000
*     /* MESSAGE(ICB501E).                                   @ZA16133*/ 01157000
*     /*                                                             */ 01158000
*     /***************************************************************/ 01159000
*                                                                  0456 01160000
*     DO;                           /*                       @Z40LB02*/ 01161000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01162000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0457 01163000
*       MSGID2=MSGID501;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 01164000
         MVC   MSGID2(10,FSWAPTR),MSGID501                         0458 01165000
*       MSGTXT2=MSG501;             /* PUT SPEC ID IN AREA   @Z40LB02*/ 01166000
         MVC   MSGTXT2(24,FSWAPTR),MSG501                          0459 01167000
*       VOL501=VOLID;               /* STATIC VOLID AREA     @Z40LB02*/ 01168000
         MVC   VOL501(6,FSWAPTR),VOLID                             0460 01169000
*       VOLVAL2=EWOVOLID;           /* PUT VOLID IN WKAREA   @Z40LB02*/ 01170000
         MVC   VOLVAL2(6,FSWAPTR),EWOVOLID(SNSPTR)                 0461 01171000
*       CSN501=CSN;                 /* STATIC CSN IN AREA    @Z40LB02*/ 01172000
         MVC   CSN501(6,FSWAPTR),CSN                               0462 01173000
*       CSNVAL2=EWOCSN;             /* PUT CSN IN WK AREA    @Z40LB02*/ 01174000
         MVC   CSNVAL2(12,FSWAPTR),EWOCSN(SNSPTR)                  0463 01175000
*       END501=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01176000
         MVC   END501(1,FSWAPTR),MSGEND                            0464 01177000
*     END;                          /*                       @Z40LB02*/ 01178000
*   IF MSGNUM=C3 THEN               /* MESSAGE # FOUR?       @Z40LB02*/ 01179000
*                                                                  0466 01180000
@RF00455 CLI   MSGNUM(FSWAPTR),3                                   0466 01181000
         BNE   @RF00466                                            0466 01182000
*     /***************************************************************/ 01183000
*     /*                                                             */ 01184000
*     /* IF MESSAGE INDEX WAS 3, THEN BUILD CARTRIDGE LOAD   @Z40LB02*/ 01185000
*     /* FAILURE MESSAGE(ICB502E).                           @Z40LB02*/ 01186000
*     /*                                                             */ 01187000
*     /***************************************************************/ 01188000
*                                                                  0467 01189000
*     DO;                           /*                       @Z40LB02*/ 01190000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01191000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0468 01192000
*       MSGID3=MSGID502;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 01193000
         MVC   MSGID3(10,FSWAPTR),MSGID502                         0469 01194000
*       MSGTXT3=MSG502;             /* PUT MSG IN WK AREA    @Z40LB02*/ 01195000
         MVC   MSGTXT3(24,FSWAPTR),MSG502                          0470 01196000
*       VOL502=VOLID;               /* STATIC VOLID AREA     @Z40LB02*/ 01197000
         MVC   VOL502(6,FSWAPTR),VOLID                             0471 01198000
*       VOLVAL3=EWOVOLID;           /* PUT VOLID IN WKAREA   @Z40LB02*/ 01199000
         MVC   VOLVAL3(6,FSWAPTR),EWOVOLID(SNSPTR)                 0472 01200000
*       CSN502=CSN;                 /* STATIC CSN IN AREA    @Z40LB02*/ 01201000
         MVC   CSN502(6,FSWAPTR),CSN                               0473 01202000
*       CSNVAL3=EWOCSN;             /* PUT CSN IN WK AREA    @Z40LB02*/ 01203000
         MVC   CSNVAL3(12,FSWAPTR),EWOCSN(SNSPTR)                  0474 01204000
*       END502=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01205000
         MVC   END502(1,FSWAPTR),MSGEND                            0475 01206000
*     END;                          /*                       @Z40LB02*/ 01207000
*                                                                  0476 01208000
*   /*****************************************************************/ 01209000
*   /*                                                               */ 01210000
*   /* ISSUE THE EXECUTE FORM OF THE WTO MACRO TO WRITE THE  @Z40LB02*/ 01211000
*   /* MESSAGE TO THE OPERATOR.                              @Z40LB02*/ 01212000
*   /*                                                               */ 01213000
*   /*****************************************************************/ 01214000
*                                                                  0477 01215000
*   IF MSGBLT=ON THEN               /* MSG EXISTS?           @Z40LB02*/ 01216000
@RF00466 TM    MSGBLT(FSWAPTR),B'01000000'                         0477 01217000
         BNO   @RF00477                                            0477 01218000
*     DO;                                                          0478 01219000
*       DO;                         /* WTOP MF(E,FMTWT01)            */ 01220000
*         RFY                                                      0480 01221000
*           GPR01P RSTD;            /* RESTRICT REG 1                */ 01222000
*         GPR01P=ADDR(FMTWT01);     /* ADDRESS CONTROL PROGRAM LIST  */ 01223000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0481 01224000
*         SVC(35);                  /* ISSUE WTO SVC                 */ 01225000
         SVC   35                                                  0482 01226000
*         RFY                                                      0483 01227000
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */ 01228000
*       END;                        /* WTOP MF(E,FMTWT01)    @Z40LB02*/ 01229000
*       IOSBPTR=SAVER1;                                            0485 01230000
         L     IOSBPTR,SAVER1(,FSWAPTR)                            0485 01231000
*       IF MSGNUM=C2 THEN           /* MESSAGE # TWO?        @Z40LB02*/ 01232000
*                                                                  0486 01233000
         CLI   MSGNUM(FSWAPTR),2                                   0486 01234000
         BNE   @RF00486                                            0486 01235000
*         /***********************************************************/ 01236000
*         /*                                                         */ 01237000
*         /* IF MESSAGE INDEX WAS 2, THEN PART II OF MSG 2 MUST BE   */ 01238000
*         /*                                                 @Z40LB02*/ 01239000
*         /* BUILT AND WRITTEN. THE ICB501E MESSAGE HAS 2 LINES.     */ 01240000
*         /*                                                 @Z40LB02*/ 01241000
*         /*                                                         */ 01242000
*         /***********************************************************/ 01243000
*                                                                  0487 01244000
*         DO;                       /*                       @Z40LB02*/ 01245000
*           FMTWT03='';                                            0488 01246000
         MVI   FMTWT03(FSWAPTR),C' '                               0488 01247000
         MVC   FMTWT03+1(78,FSWAPTR),FMTWT03(FSWAPTR)              0488 01248000
*           MSGBLT=ON;              /* MSG EXISTS            @Z40LB02*/ 01249000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0489 01250000
*           MSGID2A=MSGID501;       /* MESSAGE ID            @Z40LB02*/ 01251000
         MVC   MSGID2A(10,FSWAPTR),MSGID501                        0490 01252000
*           MSGTXT2A=MSG501;        /* MESSAGE TEXT          @Z40LB02*/ 01253000
         MVC   MSGTXT2A(24,FSWAPTR),MSG501                         0491 01254000
*           MSF501A=MSF;            /* MSF STATIC            @Z40LB02*/ 01255000
         MVC   MSF501A(4,FSWAPTR),MSF                              0492 01256000
*           XYZ501A=XYZ;            /* XYZ STATIC            @Z40LB02*/ 01257000
         MVC   XYZ501A(6,FSWAPTR),XYZ                              0493 01258000
*           XVAL2A=XVAL;                                           0494 01259000
         MVC   XVAL2A(3,FSWAPTR),XVAL(FSWAPTR)                     0494 01260000
*           YVAL2A=YVAL;            /* Y VALUE               @Z40LB02*/ 01261000
         MVC   YVAL2A(2,FSWAPTR),YVAL(FSWAPTR)                     0495 01262000
*           ZVAL2A=ZVAL;            /* Z VALUE               @Z40LB02*/ 01263000
         MVC   ZVAL2A(1,FSWAPTR),ZVAL(FSWAPTR)                     0496 01264000
*           MSFVAL2A=MSFVAL;        /* MSF VALUE             @Z40LB02*/ 01265000
         MVC   MSFVAL2A(1,FSWAPTR),MSFVAL(FSWAPTR)                 0497 01266000
*           END501A=MSGEND;         /* TRAILING BLANK        @Z40LB02*/ 01267000
         MVC   END501A(1,FSWAPTR),MSGEND                           0498 01268000
*           DO;                     /* WTOP MF(E,FMTWT01)            */ 01269000
*             RFY                                                  0500 01270000
*               GPR01P RSTD;        /* RESTRICT REG 1                */ 01271000
*             GPR01P=ADDR(FMTWT01); /* ADDRESS CONTROL PROGRAM LIST  */ 01272000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0501 01273000
*             SVC(35);              /* ISSUE WTO SVC                 */ 01274000
         SVC   35                                                  0502 01275000
*             RFY                                                  0503 01276000
*               GPR01P UNRSTD;      /* RELEASE REG 1                 */ 01277000
*           END;                    /* WTOP MF(E,FMTWT01)    @Z40LB02*/ 01278000
*           IOSBPTR=SAVER1;                                        0505 01279000
         L     IOSBPTR,SAVER1(,FSWAPTR)                            0505 01280000
*         END;                      /*                       @Z40LB02*/ 01281000
*       IOSMSG=OFF;                                                0507 01282000
@RF00486 NI    IOSMSG(IOSBPTR),B'11111011'                         0507 01283000
*     END;                                                         0508 01284000
*                                                                  0508 01285000
*   /*****************************************************************/ 01286000
*   /*                                                               */ 01287000
*   /* THE FOLLOWING CODE SETUP XCTL TO NEXT ROUTINE         @Z40LB02*/ 01288000
*   /* XCTL WILL BE TO SYSTEM OBR OR TO IOS                  @Z40LB02*/ 01289000
*   /*                                                               */ 01290000
*   /*****************************************************************/ 01291000
*                                                                  0509 01292000
*   BALRREG=SAVE123;                                               0509 01293000
@RF00477 LR    BALRREG,SAVE123                                     0509 01294000
*   RETURN;                                                        0510 01295000
@EL00002 DS    0H                                                  0510 01296000
@EF00002 DS    0H                                                  0510 01297000
@ER00002 BR    @14                                                 0510 01298000
*   END FSMSG123;                   /*                       @Z40LB02*/ 01299000
*                                                                  0512 01300000
*/*********************************************************  @Z40LB02*/ 01301000
*/*  MODULE NAME = FSMSG5                                    @Z40LB02*/ 01302000
*/*                                                          @Z40LB02*/ 01303000
*/*  DESCRIPTION NAME = FORMAT SENSE MESSAGE 5               @Z40LB02*/ 01304000
*/*                                                          @Z40LB02*/ 01305000
*/*                                                          @Z40LB02*/ 01306000
*/*  FUNCTION = FMSG5 ROUTINE WILL BUILD THE MESSAGES AND    @Z40LB02*/ 01307000
*/*             ISSUE THE WTO MACRO FOR:                     @Z40LB02*/ 01308000
*/*                                                          @Z40LB02*/ 01309000
*/*             (1) MSS CARTRIDGE INACCESSIBLE(PARTS         @Z40LB02*/ 01310000
*/*                 1, 2, AND 3.                             @Z40LB02*/ 01311000
*/*                                                          @Z40LB02*/ 01312000
*/*             BEFORE GETTING CONTROL, MAINLINE CODE        @Z40LB02*/ 01313000
*/*             OF THIS MODULE(IGE0301H) WILL HAVE           @Z40LB02*/ 01314000
*/*             COMPLETED THE MESSAGE DETERMINATION PROCESS  @Z40LB02*/ 01315000
*/*             AND PLACED THE MESSAGE INDEX, TRANSLATED     @Z40LB02*/ 01316000
*/*             SENSE, AND  THE ALTERNATE CONSOLE VALUE      @Z40LB02*/ 01317000
*/*             IN THE FORMAT SENSE WORK AREA.               @Z40LB02*/ 01318000
*/*                                                          @Z40LB02*/ 01319000
*/*             IF THE MESSAGE INDEX IS 5, THEN              @Z40LB02*/ 01320000
*/*             THE MESSAGE WILL BE BUILT AND WRITTEN        @Z40LB02*/ 01321000
*/*             TO THE OPERATOR.  IF THE IOSMSG BIT OF       @Z40LB02*/ 01322000
*/*             IOBFLAG3 FIELD IS SET(XCTL TO SYSTEM         @Z40LB02*/ 01323000
*/*             WTO) IT MUST BE SET OFF TO PREVENT TWO       @Z40LB02*/ 01324000
*/*             SENSE DATA MESSAGES FROM BEING PRINTED.      @Z40LB02*/ 01325000
*/*             THIS ROUTINE WILL RETURN TO MAINLINE         @Z40LB02*/ 01326000
*/*             CODE TO BUILD AND PRINT SENSE MESSAGE        @Z40LB02*/ 01327000
*/*             AND FOR APPROPRIATE EXIT PROCESSING.         @Z40LB02*/ 01328000
*/*                                                          @Z40LB02*/ 01329000
*/*                                                          @Z40LB02*/ 01330000
*/*                                                          @Z40LB02*/ 01331000
*/*  INPUT = REGISTER 1 WILL HAVE ADDRESS OF RQE.            @Z40LB02*/ 01332000
*/*                                                          @Z40LB02*/ 01333000
*/*  OUTPUT = (1)  REGISTER 1 WILL BE UNCHANGED.             @Z40LB02*/ 01334000
*/*                                                          @Z40LB02*/ 01335000
*/*           (2)  MESSAGES TO THE MASTER CONSOLE BY         @Z40LB02*/ 01336000
*/*           USING SVC 35.                                  @Z40LB02*/ 01337000
*/*                                                          @Z40LB02*/ 01338000
*/*                                                          @Z40LB02*/ 01339000
*/*           ICB5XXI - INFORMATIONAL MESSAGE(ENGLISH TEXT)  @Z40LB02*/ 01340000
*/*           ICB5XXE - EVENTUAL ACTION MESSAGE(ENGLISH TEST)@Z40LB02*/ 01341000
*/*           ICB5XXA - IMMED ACTION MESSAGE(ENGLISH TEXT)   @Z40LB02*/ 01342000
*/*                                                          @Z40LB02*/ 01343000
*/*  EXIT NORMAL = REGISTERS WILL BE THE SAME AS             @Z40LB02*/ 01344000
*/*                THEY WERE UPON ENTRY.  XCTL TO SYSTEM     @Z40LB02*/ 01345000
*/*                OBR TO LOG MESSAGES(IGE0025F)  OR IOS.    @Z40LB02*/ 01346000
*/*                                                          @Z40LB02*/ 01347000
*/*  EXIT ERROR = NONE                                       @Z40LB02*/ 01348000
*/*                                                          @Z40LB02*/ 01349000
*/*                                                          @Z40LB02*/ 01350000
*/*                                                          @Z40LB02*/ 01351000
*/*******************************************************    @Z40LB02*/ 01352000
*                                                                  0512 01353000
*FSMSG5:                                                           0512 01354000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0512 01355000
*                                                                  0512 01356000
FSMSG5   DS    0H                                                  0513 01357000
*   /*****************************************************************/ 01358000
*   /*                                                               */ 01359000
*   /* THE FOLLOWING DECLARES REPRESENT THE STATIC MESSAGE   @Z40LB02*/ 01360000
*   /* TEXT THAT WILL BE USED TO BUILD MESSAGES FOR          @Z40LB02*/ 01361000
*   /* (1) DEFECTIVE CARTRIDGE, PARTS ,I, II, AND III,       @Z40LB02*/ 01362000
*   /* BLOCK)                                                @Z40LB02*/ 01363000
*   /*                                                               */ 01364000
*   /*****************************************************************/ 01365000
*                                                                  0513 01366000
*   DCL                                                            0513 01367000
*     MSGID504 CHAR(10) INIT('ICB504E - ');/* MESSAGE ID     @Z40LB02*/ 01368000
*   DCL                                                            0514 01369000
*     MSG504 CHAR(28) INIT('MSS CARTRIDGE INACCESSIBLE, ');/*      0514 01370000
*                                                            @Z40LB02   01371000
*                                      ICB504E MESSAGE       @Z40LB02*/ 01372000
*                                                                  0514 01373000
*   /*****************************************************************/ 01374000
*   /*                                                               */ 01375000
*   /* PART I - MSS CARTRIDGE INACCESSIBLE - ICB504E         @Z40LB02*/ 01376000
*   /*                                                               */ 01377000
*   /*****************************************************************/ 01378000
*                                                                  0515 01379000
*   DCL                                                            0515 01380000
*     1 MSG5 CHAR(69) DEFINED(FMTWT03),                            0515 01381000
*      2 MSGID5 CHAR(10),           /* MESSAGE ID            @Z40LB02*/ 01382000
*      2 MSGTEXT5 CHAR(28),         /* MESSAGE TEXT          @Z40LB02*/ 01383000
*      2 VOL504 CHAR(6),            /* STATIC TEXT VOLID     @Z40LB02*/ 01384000
*      2 VOLVAL5 CHAR(6),           /* VOLID                 @Z40LB02*/ 01385000
*      2 CSN504 CHAR(6),            /* STATIC TEXT CSN       @Z40LB02*/ 01386000
*      2 CSNVAL5 CHAR(12),          /* CSN                   @Z40LB02*/ 01387000
*      2 END504 CHAR(1);            /* BLANK                 @Z40LB02*/ 01388000
*                                                                  0515 01389000
*   /*****************************************************************/ 01390000
*   /*                                                               */ 01391000
*   /* PART II - MSS CARTRIDGE INACCESSIBLE - ICB504E        @Z40LB02*/ 01392000
*   /*                                                               */ 01393000
*   /*****************************************************************/ 01394000
*                                                                  0516 01395000
*   DCL                                                            0516 01396000
*     1 MSG5A CHAR(56) DEFINED(FMTWT03),                           0516 01397000
*      2 * CHAR(38),                /* MESSAGE ID            @Z40LB02*/ 01398000
*      2 MSF504A CHAR(4),           /* MSF STATIC TEXT       @Z40LB02*/ 01399000
*      2 MSFVAL5A CHAR(1),          /* MSF VALUE             @Z40LB02*/ 01400000
*      2 XYZ504A CHAR(6),           /* XYZ STATIC TEST       @Z40LB02*/ 01401000
*      2 XYZVAL5A CHAR(6),          /* XYZ VALUE             @Z40LB02*/ 01402000
*       3 XVAL5A CHAR(3),           /* X VALUE               @Z40LB02*/ 01403000
*       3 YVAL5A CHAR(2),           /* Y VALUE               @Z40LB02*/ 01404000
*       3 ZVAL5A CHAR(1),           /* Z VALUE               @Z40LB02*/ 01405000
*      2 END504A CHAR(1);           /*                       @Z40LB02*/ 01406000
*                                                                  0516 01407000
*   /*****************************************************************/ 01408000
*   /*                                                               */ 01409000
*   /* PART III - MSS CARTRIDGE INACCESSIBLE - ICB504E       @Z40LB02*/ 01410000
*   /*                                                               */ 01411000
*   /*****************************************************************/ 01412000
*                                                                  0517 01413000
*   DCL                                                            0517 01414000
*     1 MSG5B CHAR(69) DEFINED(FMTWT03),                           0517 01415000
*      2 * CHAR(38),                /* MESSAGE ID            @Z40LB02*/ 01416000
*      2 CASE504B CHAR(5),          /* CASE STATIC TEXT      @Z40LB02*/ 01417000
*      2 CASVAL5B CHAR(2),          /* CASE VALUE            @Z40LB02*/ 01418000
*      2 CASDESC CHAR(24);          /* CASE DESCRIPTION      @Z40LB02*/ 01419000
*                                                                  0517 01420000
*   /*****************************************************************/ 01421000
*   /*                                                               */ 01422000
*   /* CASE DESCRIPTIONS                                     @ZA29152*/ 01423000
*   /*                                                               */ 01424000
*   /*****************************************************************/ 01425000
*                                                                  0518 01426000
*   DCL                                                            0518 01427000
*     1 CASEDS(9) STATIC LOCAL,                                    0518 01428000
*      2 CASES CHAR(24) INIT(',EMPTY CELL ',',NON-MATCHING CART LABEL ' 01429000
*            ,',FULL CELL ',',CART STUCK IN ACCESR ',              0518 01430000
*            ',CART STUCK/ACCESR DOWN ',',INVALID XYZ ADDR ',      0518 01431000
*            ',CART UNLOAD FAILURE ',',DRD XXX MARKED SUU ',       0518 01432000
*            ',CARTRIDGE LEFT IN DRD ');                           0518 01433000
*                                                                  0518 01434000
*   /*****************************************************************/ 01435000
*   /*                                                               */ 01436000
*   /* MESSAGE LENGTH CONSTANTS-THESE CONSTANTS MUST         @Z40LB02*/ 01437000
*   /* MUST BE CHANGED IF THE MESSAGE TEXT FIELD(FMTWT03)    @Z40LB02*/ 01438000
*   /* VARIES                                                @Z40LB02*/ 01439000
*   /*                                                               */ 01440000
*   /*****************************************************************/ 01441000
*                                                                  0519 01442000
*   SAVE5=BALRREG;                  /* SAVE REG 14            @40LB02*/ 01443000
         LR    SAVE5,BALRREG                                       0519 01444000
*   IF MSGNUM=C5 THEN               /* MESSAGE # ONE?        @Z40LB02*/ 01445000
*                                                                  0520 01446000
         CLI   MSGNUM(FSWAPTR),5                                   0520 01447000
         BNE   @RF00520                                            0520 01448000
*     /***************************************************************/ 01449000
*     /*                                                             */ 01450000
*     /* IF MESSAGE INDEX WAS 5, THEN BUILD PART I OF THE    @Z40LB02*/ 01451000
*     /* CARTRIDGE INACESSIBLE MESSAGE-ICB504E               @Z40LB02*/ 01452000
*     /*                                                             */ 01453000
*     /***************************************************************/ 01454000
*                                                                  0521 01455000
*     DO;                           /*                       @Z40LB02*/ 01456000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01457000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0522 01458000
*       MSGID5=MSGID504;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 01459000
         MVC   MSGID5(10,FSWAPTR),MSGID504                         0523 01460000
*       MSGTEXT5=MSG504;            /* PUT MSG IN WK AREA    @Z40LB02*/ 01461000
         MVC   MSGTEXT5(28,FSWAPTR),MSG504                         0524 01462000
*       VOL504=VOLID;               /* STATIC VOLID AREA     @Z40LB02*/ 01463000
         MVC   VOL504(6,FSWAPTR),VOLID                             0525 01464000
*       VOLVAL5=EWOVOLID;           /* PUT VOLID IN WKAREA   @Z40LB02*/ 01465000
         MVC   VOLVAL5(6,FSWAPTR),EWOVOLID(SNSPTR)                 0526 01466000
*       CSN504=CSN;                 /* STATIC CSN IN AREA    @Z40LB02*/ 01467000
         MVC   CSN504(6,FSWAPTR),CSN                               0527 01468000
*       CSNVAL5=EWOCSN;             /* PUT CSN IN WK AREA    @Z40LB02*/ 01469000
         MVC   CSNVAL5(12,FSWAPTR),EWOCSN(SNSPTR)                  0528 01470000
*       END504=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01471000
         MVC   END504(1,FSWAPTR),MSGEND                            0529 01472000
*       DO;                         /* WTOP MF(E,FMTWT01)            */ 01473000
*         RFY                                                      0531 01474000
*           GPR01P RSTD;            /* RESTRICT REG 1                */ 01475000
*         GPR01P=ADDR(FMTWT01);     /* ADDRESS CONTROL PROGRAM LIST  */ 01476000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0532 01477000
*         SVC(35);                  /* ISSUE WTO SVC                 */ 01478000
         SVC   35                                                  0533 01479000
*         RFY                                                      0534 01480000
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */ 01481000
*       END;                        /* WTOP MF(E,FMTWT01)            */ 01482000
*       IOSBPTR=SAVER1;                                            0536 01483000
*                                                                  0536 01484000
         L     IOSBPTR,SAVER1(,FSWAPTR)                            0536 01485000
*       /*************************************************************/ 01486000
*       /*                                                           */ 01487000
*       /* MESSAGE INDEX WAS 5, THEN BUILD PART II OF THE    @Z40LB02*/ 01488000
*       /* CARTRIDGE INACESSIBLE MESSAGE-ICB504E             @Z40LB02*/ 01489000
*       /*                                                           */ 01490000
*       /*************************************************************/ 01491000
*                                                                  0537 01492000
*       FMTWT03(39:79)='';          /* MESSAGE LENGTH        @Z40LB02*/ 01493000
         MVI   FMTWT03+38(FSWAPTR),C' '                            0537 01494000
         MVC   FMTWT03+39(40,FSWAPTR),FMTWT03+38(FSWAPTR)          0537 01495000
*       MSF504A=MSF;                /* MSF STATIC            @Z40LB02*/ 01496000
         MVC   MSF504A(4,FSWAPTR),MSF                              0538 01497000
*       XYZ504A=XYZ;                /* XYZ STATIC            @Z40LB02*/ 01498000
         MVC   XYZ504A(6,FSWAPTR),XYZ                              0539 01499000
*       MSFVAL5A=MSFVAL;            /* MSF VALUE             @Z40LB02*/ 01500000
         MVC   MSFVAL5A(1,FSWAPTR),MSFVAL(FSWAPTR)                 0540 01501000
*       XVAL5A=XVAL;                /* X VALUE               @Z40LB02*/ 01502000
         MVC   XVAL5A(3,FSWAPTR),XVAL(FSWAPTR)                     0541 01503000
*       YVAL5A=YVAL;                /* Y VALUE               @Z40LB02*/ 01504000
         MVC   YVAL5A(2,FSWAPTR),YVAL(FSWAPTR)                     0542 01505000
*       ZVAL5A=ZVAL;                /* Z VALUE               @Z40LB02*/ 01506000
         MVC   ZVAL5A(1,FSWAPTR),ZVAL(FSWAPTR)                     0543 01507000
*       END504A=MSGEND;             /* TRAILING BLANK        @Z40LB02*/ 01508000
         MVC   END504A(1,FSWAPTR),MSGEND                           0544 01509000
*       DO;                         /* WTOP MF(E,FMTWT01)            */ 01510000
*         RFY                                                      0546 01511000
*           GPR01P RSTD;            /* RESTRICT REG 1                */ 01512000
*         GPR01P=ADDR(FMTWT01);     /* ADDRESS CONTROL PROGRAM LIST  */ 01513000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0547 01514000
*         SVC(35);                  /* ISSUE WTO SVC                 */ 01515000
         SVC   35                                                  0548 01516000
*         RFY                                                      0549 01517000
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */ 01518000
*       END;                        /* WTOP MF(E,FMTWT01)    @Z40LB02*/ 01519000
*       IOSBPTR=SAVER1;                                            0551 01520000
*                                                                  0551 01521000
         L     IOSBPTR,SAVER1(,FSWAPTR)                            0551 01522000
*       /*************************************************************/ 01523000
*       /*                                                           */ 01524000
*       /* MESSAGE INDEX WAS 5, THEN BUILD PART III OF THE   @Z40LB02*/ 01525000
*       /* CARTRIDGE INACESSIBLE MESSAGE-ICB504E             @Z40LB02*/ 01526000
*       /*                                                           */ 01527000
*       /*************************************************************/ 01528000
*                                                                  0552 01529000
*       FMTWT03(39:79)='';          /* MESSAGE LENGTH        @Z40LB02*/ 01530000
         MVI   FMTWT03+38(FSWAPTR),C' '                            0552 01531000
         MVC   FMTWT03+39(40,FSWAPTR),FMTWT03+38(FSWAPTR)          0552 01532000
*       CASE504B=CASE;              /* CASE STATIC TEXT      @Z40LB02*/ 01533000
         MVC   CASE504B(5,FSWAPTR),CASE                            0553 01534000
*       YTRAN3=EWOSNS12&LOMASK;     /* MASK FOR LOORD 4 BITS @Z40LB02*/ 01535000
         MVC   YTRAN3(1,FSWAPTR),EWOSNS12(SNSPTR)                  0554 01536000
         NI    YTRAN3(FSWAPTR),X'0F'                               0554 01537000
*       CASDESC=CASEDS(CHAR1INP);   /* CASE DESCRIPTION      @Z40LB02*/ 01538000
         SLR   @11,@11                                             0555 01539000
         IC    @11,CHAR1INP(,FSWAPTR)                              0555 01540000
         MH    @11,@CH00413                                        0555 01541000
         LA    @08,CASEDS-24(@11)                                  0555 01542000
         MVC   CASDESC(24,FSWAPTR),0(@08)                          0555 01543000
*       IF((EWOSNS12&LOMASK)=C8) THEN/*                      @ZA29152*/ 01544000
         LA    @11,15                                              0556 01545000
         SLR   @08,@08                                             0556 01546000
         IC    @08,EWOSNS12(,SNSPTR)                               0556 01547000
         NR    @11,@08                                             0556 01548000
         CH    @11,@CH00052                                        0556 01549000
         BNE   @RF00556                                            0556 01550000
*         DO;                       /*                       @ZA29152*/ 01551000
*           CASDESC(6:8)=SSIDAREA;  /* MOVE IN SSID          @ZA29152*/ 01552000
         MVC   CASDESC+5(3,FSWAPTR),SSIDAREA(FSWAPTR)              0558 01553000
*         END;                      /*                       @ZA29152*/ 01554000
*       UNPK(TRVAL3CH,CHAR2INP);                                   0560 01555000
@RF00556 UNPK  TRVAL3CH(3,FSWAPTR),CHAR2INP(2,FSWAPTR)             0560 01556000
*       CASVAL5B=CHAR2INP;                                         0561 01557000
         MVC   CASVAL5B(2,FSWAPTR),CHAR2INP(FSWAPTR)               0561 01558000
*       GEN REFS(CASVAL5B,TRTABLE,FSWAPTR);                        0562 01559000
      TR     CASVAL5B(2,FSWAPTR),TRTABLE-X'F0' TRANSL CASE VALUE        01560000
*       DO;                         /* WTOP MF(E,FMTWT01)            */ 01561000
*         RFY                                                      0564 01562000
*           GPR01P RSTD;            /* RESTRICT REG 1                */ 01563000
*         GPR01P=ADDR(FMTWT01);     /* ADDRESS CONTROL PROGRAM LIST  */ 01564000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0565 01565000
*         SVC(35);                  /* ISSUE WTO SVC                 */ 01566000
         SVC   35                                                  0566 01567000
*         RFY                                                      0567 01568000
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */ 01569000
*       END;                        /* WTOP MF(E,FMTWT01)    @Z40LB02*/ 01570000
*       IOSBPTR=SAVER1;                                            0569 01571000
         L     IOSBPTR,SAVER1(,FSWAPTR)                            0569 01572000
*       IOSMSG=OFF;                 /* TURN OFF MSG BIT      @Z40LB02*/ 01573000
         NI    IOSMSG(IOSBPTR),B'11111011'                         0570 01574000
*     END;                          /*                       @Z40LB02*/ 01575000
*                                                                  0571 01576000
*   /*****************************************************************/ 01577000
*   /*                                                               */ 01578000
*   /* TURN OFF THE MESSAGE BIT AND RESET REG 14.            @Z40LB02*/ 01579000
*   /* RETURN TO MAINLINE CODE                               @Z40LB02*/ 01580000
*   /*                                                               */ 01581000
*   /*****************************************************************/ 01582000
*                                                                  0572 01583000
*   BALRREG=SAVE5;                  /* RESTORE REG 14        @Z40LB02*/ 01584000
@RF00520 LR    BALRREG,SAVE5                                       0572 01585000
*   RETURN;                                                        0573 01586000
@EL00003 DS    0H                                                  0573 01587000
@EF00003 DS    0H                                                  0573 01588000
@ER00003 BR    @14                                                 0573 01589000
*   END FSMSG5;                     /*                       @Z40LB02*/ 01590000
*                                                                  0575 01591000
*/********************************************************** @Z40LB02*/ 01592000
*/*                                                          @Z40LB02*/ 01593000
*/*  MODULE NAME = FSMS4678                                  @Z40LB02*/ 01594000
*/*                                                          @Z40LB02*/ 01595000
*/*  DESCRIPTION NAME = FORMAT SENSE MESSAGES 4, 6,7 AND 8   @Z40LB02*/ 01596000
*/*                                                          @Z40LB02*/ 01597000
*/*  FUNCTION = FSMS4678 WILL BUILD THE MESSAGES AND         @Z40LB02*/ 01598000
*/*             ISSUE THE WTO MACRO FOR:                     @Z40LB02*/ 01599000
*/*                                                          @Z40LB02*/ 01600000
*/*             (1) SUBSYSTEM UNIT UNUSABLE MESSAGE          @Z40LB02*/ 01601000
*/*             (2) CARTRIDGE EXIT STATION FULL              @Z40LB02*/ 01602000
*/*             (3) MSC TABLE PACK FAILURE                   @Z40LB02*/ 01603000
*/*             (4) MSC ACCESSOR HAS FAILED                  @Z40LB02*/ 01604000
*/*             (5) STRIPES AVAILABLE ZERO                   @ZA16133*/ 01605000
*/*             (6) TABLE PACK STATUS IF ERROR AT VERIFY     @Z40LB02*/ 01606000
*/*                  TIME                                    @Z40LB02*/ 01607000
*/*             (7) NO DASD SPACE AVAILABLE                  @ZA16133*/ 01608000
*/*             (8) NO TABLE ENTRY SPACE                     @Z40LB02*/ 01609000
*/*             (9) NO FREE CELLS IN MSF                     @Z40LB02*/ 01610000
*/*             (10) UNTHREADABLE CARTRIDGE COND             @ZA16133*/ 01611000
*/*             AND                                          @Z40LB02*/ 01612000
*/*             (11) LAST ONLINE MSS UNIT FAILED             @ZA16133*/ 01613000
*/*                                                          @Z40LB02*/ 01614000
*/*             BEFORE GETTING CONTROL, MAINLINE CODE OF     @Z40LB02*/ 01615000
*/*             THIS MODULE(IGE0301H) WILL HAVE              @Z40LB02*/ 01616000
*/*             COMPLETED THE MESSAGE DETERMINATION PROCESS  @Z40LB02*/ 01617000
*/*             AND PLACED THE MESSAGE INDEX, TRANSLATED     @Z40LB02*/ 01618000
*/*             SENSE, AND  THE ALTERNATE CONSOLE VALUE      @Z40LB02*/ 01619000
*/*             IN THE FORMAT SENSE WORK AREA.               @Z40LB02*/ 01620000
*/*                                                          @Z40LB02*/ 01621000
*/*             THIS THIS ROUTINE(FSMS4678) WILL             @Z40LB02*/ 01622000
*/*             ACCESS PARAMETERS PASSED OM THE FORMAT SENSE @Z40LB02*/ 01623000
*/*             WORK AREA.                                   @Z40LB02*/ 01624000
*/*             IF THE MESSAGE INDEX IS 4, 6, OR 7 THEN      @Z40LB02*/ 01625000
*/*             THE MESSAGE WILL BE BUILT AND WRITTEN        @Z40LB02*/ 01626000
*/*             TO THE OPERATOR.  IF THE IOSMSG BIT OF       @Z40LB02*/ 01627000
*/*             IOBFLAG3 FIELD IS SET(XCTL TO SYSTEM         @Z40LB02*/ 01628000
*/*             WTO) IT MUST BE SET OFF TO PREVENT TWO       @Z40LB02*/ 01629000
*/*             SENSE DATA MESSAGES FROM BEING PRINTED.      @Z40LB02*/ 01630000
*/*             THIS ROUTINE WILL RETURN TO MAINLINE         @Z40LB02*/ 01631000
*/*             CODE TO BUILD AND PRINT SENSE MESSAGE        @Z40LB02*/ 01632000
*/*             AND FOR APPROPRIATE EXIT PROCESSING.         @Z40LB02*/ 01633000
*/*                                                          @Z40LB02*/ 01634000
*/*                                                          @Z40LB02*/ 01635000
*/*  INPUT = REGISTER 1 WILL HAVE ADDRESS OF IOSB.           @Z40LB02*/ 01636000
*/*                                                          @Z40LB02*/ 01637000
*/*  OUTPUT = (1)  REGISTER 1 WILL BE UNCHANGED.             @Z40LB02*/ 01638000
*/*                                                          @Z40LB02*/ 01639000
*/*           (2)  MESSAGES TO THE MASTER CONSOLE BY         @Z40LB02*/ 01640000
*/*           USING SVC 35.                                  @Z40LB02*/ 01641000
*/*                                                          @Z40LB02*/ 01642000
*/*                                                          @Z40LB02*/ 01643000
*/*           ICB5XXI - INFORMATIONAL MESSAGE(ENGLISH TEXT)  @Z40LB02*/ 01644000
*/*           ICB5XXE - EVENTUAL ACTION MESSAGE(ENGLISH TEST)@Z40LB02*/ 01645000
*/*           ICB5XXA - IMMED ACTION MESSAGE(ENGLISH TEXT)   @Z40LB02*/ 01646000
*/*                                                          @Z40LB02*/ 01647000
*/*********************************************************  @Z40LB02*/ 01648000
*                                                                  0575 01649000
*FSMS4678:                                                         0575 01650000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0575 01651000
*                                                                  0575 01652000
FSMS4678 DS    0H                                                  0576 01653000
*   /*****************************************************************/ 01654000
*   /*                                                               */ 01655000
*   /* THE FOLLOWING DECLARES REPRESENT THE STATIC MESSAGE   @Z40LB02*/ 01656000
*   /* TEXT THAT WILL BE USED TO BUILD MESSAGES              @Z40LB02*/ 01657000
*   /*                                                               */ 01658000
*   /*****************************************************************/ 01659000
*                                                                  0576 01660000
*   DCL                                                            0576 01661000
*     MSGID503 CHAR(10) INIT('ICB503E - ');/* MESSAGE ID     @Z40LB02*/ 01662000
*   DCL                                                            0577 01663000
*     MSGID505 CHAR(10) INIT('ICB505A - ');/* MESSAGE ID     @Z40LB02*/ 01664000
*   DCL                                                            0578 01665000
*     MSGID506 CHAR(10) INIT('ICB506A - ');/* MESSAGE ID     @Z40LB02*/ 01666000
*   DCL                                                            0579 01667000
*     MSGID507 CHAR(10) INIT('ICB507E - ');/* MESSAGE ID     @Z40LB02*/ 01668000
*   DCL                                                            0580 01669000
*     MSGID509 CHAR(10) INIT('ICB509E - ');/* MESSAGE ID     @Z40LB02*/ 01670000
*   DCL                                                            0581 01671000
*     MSGID510 CHAR(8) INIT('ICB510A ');/* MESSAGE ID        @Z40LB02*/ 01672000
*   DCL                                                            0582 01673000
*     MSGID512 CHAR(10) INIT('ICB512E - ');/* MESSAGE ID     @Z40LB02*/ 01674000
*   DCL                                                            0583 01675000
*     MSGID513 CHAR(10) INIT('ICB513E - ');/* MESSAGE ID     @Z40LB02*/ 01676000
*   DCL                                                            0584 01677000
*     MSGID515 CHAR(10) INIT('ICB515E - ');/* MESSAGE ID     @ZA16133*/ 01678000
*   DCL                                                            0585 01679000
*     MSGID516 CHAR(10) INIT('ICB516E - ');/* MESSAGE ID     @ZA16133*/ 01680000
*   DCL                                                            0586 01681000
*     MSGID517 CHAR(10) INIT('ICB517E - ');/* MESSAGE ID     @ZA16133*/ 01682000
*   DCL                                                            0587 01683000
*     MSG503 CHAR(24) INIT('MSS UNIT UNUSABLE, SSID=');/*    @Z40LB02   01684000
*                                      ICB503E MESSAGE       @Z40LB02*/ 01685000
*   DCL                                                            0588 01686000
*     MSG503A CHAR(7) INIT(', MC=C5');/*                     @Z40LB02*/ 01687000
*   DCL                                                            0589 01688000
*     MSG505 CHAR(34) INIT('CARTRIDGE EXIT STATION FULL, SSID=');/*     01689000
*                                      ICB505A MESSAGE       @Z40LB02*/ 01690000
*   DCL                                                            0590 01691000
*     MSG506 CHAR(32) INIT('PERMANENT MSC TABLE PACK FAILURE');/*  0590 01692000
*                                      ICB506A MESSAGE       @ZA09552*/ 01693000
*   DCL                                                            0591 01694000
*     MSG507 CHAR(25) INIT('MSS ACCESSOR HAS FAILED, ');/* ICB507E 0591 01695000
*                                      MESSAGE               @Z40LB02*/ 01696000
*   DCL                                                            0592 01697000
*     MSG509 CHAR(28) INIT('PERMANENT READ/WRITE ERROR, ');/* ICB509E   01698000
*                                      MESSAGE               @ZA30102*/ 01699000
*   DCL                                                            0593 01700000
*     MS509A CHAR(9) INIT(', CASE=0*');/* MORE 509 TEXT      @ZA30102*/ 01701000
*   DCL                                                            0594 01702000
*     MSG510 CHAR(63) INIT(                                        0594 01703000
*'SSID0 STATUS=**,SSID2 STATUS=**,SSID4 STATUS=**,SSID6 STATUS=**');    01704000
*                                   /* ICB510A MESSAGE       @Z40LB02*/ 01705000
*   DCL                                                            0595 01706000
*     MSG516 CHAR(23) INIT('NO DASD SPACE AVAILABLE');/* ICB516E   0595 01707000
*                                      MESSAGE               @ZA16133*/ 01708000
*   DCL                                                            0596 01709000
*     MSG512 CHAR(19) INIT('NO FREE CELL IN MSF');/* ICB512E MESSAGE    01710000
*                                                            @ZA16133*/ 01711000
*   DCL                                                            0597 01712000
*     MSG513 CHAR(37) INIT('CSN ************ NO TABLE ENTRY SPACE');    01713000
*                                   /* ICB513E MESSAGE       @ZA16133*/ 01714000
*   DCL                                                            0598 01715000
*     MSG517 CHAR(41) INIT('UNTHREADABLE CARTRIDGE, CARTRIDGE EJECTED') 01716000
*       ;                           /* ICB517E MESSAGE       @ZA16133*/ 01717000
*   DCL                                                            0599 01718000
*     MSG515 CHAR(37) INIT('LAST ONLINE MSS UNIT FAILED, SSID=XXX');    01719000
*                                   /* ICB515E MESSAGE       @ZA16133*/ 01720000
*                                                                  0600 01721000
*   /*****************************************************************/ 01722000
*   /*                                                               */ 01723000
*   /* SUBSYSTEM UNIT UNUSABLE SKELETON MESSAGE- ICB503E     @Z40LB02*/ 01724000
*   /*                                                               */ 01725000
*   /*****************************************************************/ 01726000
*                                                                  0600 01727000
*   DCL                                                            0600 01728000
*     1 MSG4 CHAR(45) DEFINED(FMTWT03),                            0600 01729000
*      2 MSGID4 CHAR(10),           /* MESSAGE ID            @Z40LB02*/ 01730000
*      2 MSGTEXT4 CHAR(24),         /* MESSAGE TEXT          @Z40LB02*/ 01731000
*      2 SSIDVAL CHAR(3),           /* TRANSLD SSID          @Z40LB02*/ 01732000
*      2 MCTEXT CHAR(7),            /* MSG CODE TEXT         @ZA25303*/ 01733000
*      2 END503 CHAR(1);            /*                       @Z40LB02*/ 01734000
*                                                                  0600 01735000
*   /*****************************************************************/ 01736000
*   /*                                                               */ 01737000
*   /* CARTRIDGE EXIT STATION FULL - ICB505A MESSAGE         @Z40LB02*/ 01738000
*   /*                                                               */ 01739000
*   /*****************************************************************/ 01740000
*                                                                  0601 01741000
*   DCL                                                            0601 01742000
*     1 MSG6 CHAR(48) DEF(FMTWT03),                                0601 01743000
*      2 MSGID6 CHAR(10),           /* MESSAGE ID            @Z40LB02*/ 01744000
*      2 MSGTEXT6 CHAR(34),         /* MESSAGE TEXT          @Z40LB02*/ 01745000
*      2 SSIDVAL6 CHAR(3),          /* SSID VALUE            @Z40LB02*/ 01746000
*      2 END505 CHAR(1);            /* BLANK                 @Z40LB02*/ 01747000
*                                                                  0601 01748000
*   /*****************************************************************/ 01749000
*   /*                                                               */ 01750000
*   /* MSC TABLE PACK FAILURE MESSAGE - ICB506A              @Z40LB02*/ 01751000
*   /*                                                               */ 01752000
*   /*****************************************************************/ 01753000
*                                                                  0602 01754000
*   DCL                                                            0602 01755000
*     1 MSG7 CHAR(43) DEFINED(FMTWT03),                            0602 01756000
*      2 MSGID7 CHAR(10),           /* MESSAGE ID            @Z40LB02*/ 01757000
*      2 MSGTEXT7 CHAR(32),         /* MESSAGE TEXT          @ZA09552*/ 01758000
*      2 END506 CHAR(1);            /* BLANK                 @Z40LB02*/ 01759000
*                                                                  0602 01760000
*   /*****************************************************************/ 01761000
*   /*                                                               */ 01762000
*   /* MSS ACCESSOR HAS FAILED SKELETON MESSAGE              @Z40LB02*/ 01763000
*   /* ICB5O7E                                               @Z40LB02*/ 01764000
*   /*                                                               */ 01765000
*   /*****************************************************************/ 01766000
*                                                                  0603 01767000
*   DCL                                                            0603 01768000
*     1 MSG8 CHAR(41) DEFINED(FMTWT03),                            0603 01769000
*      2 MSGID8 CHAR(10),           /* MESSAGE ID            @Z40LB02*/ 01770000
*      2 MSGTEXT8 CHAR(25),         /* MESSAGE TEXT          @Z40LB02*/ 01771000
*      2 MSF507 CHAR(4),            /* MSF STATIC TEXT       @Z40LB02*/ 01772000
*      2 MSFVAL7 CHAR(1),           /* MSF VALUE             @Z40LB02*/ 01773000
*      2 END507 CHAR(1);            /*                       @Z40LB02*/ 01774000
*                                                                  0603 01775000
*   /*****************************************************************/ 01776000
*   /*                                                               */ 01777000
*   /* PART I OF PERM WRITE ERR SKELETON MESSAGE-ICB509E     @ZA16133*/ 01778000
*   /*                                                               */ 01779000
*   /*****************************************************************/ 01780000
*                                                                  0604 01781000
*   DCL                                                            0604 01782000
*     1 MSG9 CHAR(69) DEF(FMTWT03),                                0604 01783000
*      2 MSGID9 CHAR(10),           /* MSG ID                @Z40LB02*/ 01784000
*      2 MSGTEXT9 CHAR(28),         /* MSG TEST              @ZA30102*/ 01785000
*      2 VOL509 CHAR(6),            /* VOLID STATIC TXT      @Z40LB02*/ 01786000
*      2 VOLVAL9 CHAR(6),           /* VOLID VALUE           @Z40LB02*/ 01787000
*      2 CSN509 CHAR(6),            /* CSN STATIC TEXT       @Z40LB02*/ 01788000
*      2 CSNVAL9 CHAR(12),          /* CSN VALUE             @Z40LB02*/ 01789000
*      2 END509 CHAR(1);            /* TRAILING BLANK        @Z40LB02*/ 01790000
*                                                                  0604 01791000
*   /*****************************************************************/ 01792000
*   /*                                                               */ 01793000
*   /* PART II OF PERM WRITE ERR SKELETON MESSAGE-ICB509E    @Z40LB02*/ 01794000
*   /*                                                               */ 01795000
*   /*****************************************************************/ 01796000
*                                                                  0605 01797000
*   DCL                                                            0605 01798000
*     1 MSG9A CHAR(69) DEF(FMTWT03),                               0605 01799000
*      2 * CHAR(38),                /* MSGID AND TXT         @ZA30102*/ 01800000
*      2 MSF509 CHAR(4),            /* MSF STATIC TXT        @Z40LB02*/ 01801000
*      2 MSFVAL9 CHAR(1),           /* MSF VALUE             @Z40LB02*/ 01802000
*      2 XYZ509 CHAR(6),            /* XYZ STATIC TXT        @Z40LB02*/ 01803000
*      2 XYZVAL9A CHAR(6),          /* XYZ VALUE             @Z40LB02*/ 01804000
*       3 XVAL9A CHAR(3),           /* X VALUE               @Z40LB02*/ 01805000
*       3 YVAL9A CHAR(2),           /* Y VALUE               @Z40LB02*/ 01806000
*       3 ZVAL9A CHAR(1),           /* Z VALUE               @Z40LB02*/ 01807000
*      2 CANO CHAR(9),              /* CASE STATIC TEXT      @ZA30102*/ 01808000
*       3 CATXT CHAR(8),            /* STATIC TEXT           @ZA30102*/ 01809000
*       3 CANR CHAR(1),             /* CASE NUMBER           @ZA30102*/ 01810000
*      2 END509A CHAR(1);           /* TRAILING BLANK        @Z40LB02*/ 01811000
*                                                                  0605 01812000
*   /*****************************************************************/ 01813000
*   /*                                                               */ 01814000
*   /* ICB510A - TABLE VERIFICATION STATUS                   @Z40LB02*/ 01815000
*   /*                                                               */ 01816000
*   /*****************************************************************/ 01817000
*                                                                  0606 01818000
*   DCL                                                            0606 01819000
*     1 MSG510A CHAR(71) DEF(FMTWT03),                             0606 01820000
*      2 MSGID51A CHAR(8),          /* MESSAGE ID            @Z40LB02*/ 01821000
*      2 MSGT51A CHAR(63),          /* MESSAGE TEXT          @Z40LB02*/ 01822000
*       3 * CHAR(13),               /* STATIC TXT            @Z40LB02*/ 01823000
*       3 STAT0 CHAR(2),            /* SSID0 STATUS          @Z40LB02*/ 01824000
*       3 * CHAR(14),               /* STATIC TXT            @Z40LB02*/ 01825000
*       3 STAT2 CHAR(2),            /* SSID2 STATUS          @Z40LB02*/ 01826000
*       3 * CHAR(14),               /* STATIC TXT            @Z40LB02*/ 01827000
*       3 STAT4 CHAR(2),            /* SSID4 STATUS          @Z40LB02*/ 01828000
*       3 * CHAR(14),               /* STATIC TXT            @Z40LB02*/ 01829000
*       3 STAT6 CHAR(2);            /* SSID6 STATUS          @Z40LB02*/ 01830000
*                                                                  0606 01831000
*   /*****************************************************************/ 01832000
*   /*                                                               */ 01833000
*   /* ICB516E - NO DASD SPACE AVAILABLE                     @ZA16133*/ 01834000
*   /*                                                               */ 01835000
*   /*****************************************************************/ 01836000
*                                                                  0607 01837000
*   DCL                                                            0607 01838000
*     1 MSG5116 CHAR(33) DEF(FMTWT03),                             0607 01839000
*      2 MGID516 CHAR(10),          /* MESSAGE ID            @Z40LB02*/ 01840000
*      2 MTXT516 CHAR(23);          /* MESSAGE TEXT          @ZA16133*/ 01841000
*                                                                  0607 01842000
*   /*****************************************************************/ 01843000
*   /*                                                               */ 01844000
*   /* NO FREE CELL IN MSF SKELETON MESSAGE - ICB512E        @OZ11018*/ 01845000
*   /*                                                               */ 01846000
*   /*****************************************************************/ 01847000
*                                                                  0608 01848000
*   DCL                                                            0608 01849000
*     1 MSG5112 CHAR(46) DEF(FMTWT03),                             0608 01850000
*      2 MID5112 CHAR(10),          /* MSG IDENTIFICATION    @Z40LB02*/ 01851000
*      2 MTXT5112 CHAR(36),         /* MSG STATIC TEXT       @OZ11018*/ 01852000
*       3 * CHAR(4),                                               0608 01853000
*       3 CSN5112 CHAR(12),         /* CSN VALUE             @Z40LB02*/ 01854000
*       3 * CHAR(1),                                               0608 01855000
*       3 STAT5112 CHAR(19);        /* STATIC TEXT           @OZ11018*/ 01856000
*                                                                  0608 01857000
*   /*****************************************************************/ 01858000
*   /*                                                               */ 01859000
*   /* NO TABLE ENTRY SPACE SKELETON MESSAGE - ICB513E       @Z40LB02*/ 01860000
*   /*                                                               */ 01861000
*   /*****************************************************************/ 01862000
*                                                                  0609 01863000
*   DCL                                                            0609 01864000
*     1 MSG5113 CHAR(47) DEF(FMTWT03),                             0609 01865000
*      2 MID5113 CHAR(10),          /* MSG IDENTIFICATION    @Z40LB02*/ 01866000
*      2 MTXT5113 CHAR(37),         /* MSG TEXT              @OZ11018*/ 01867000
*       3 * CHAR(4),                                               0609 01868000
*       3 CSN5113 CHAR(12),         /* CSN VALUE             @Z40LB02*/ 01869000
*       3 * CHAR(1),                                               0609 01870000
*       3 STAT5113 CHAR(20);        /* STATIC TEXT           @OZ11018*/ 01871000
*                                                                  0609 01872000
*   /*****************************************************************/ 01873000
*   /*                                                               */ 01874000
*   /* UNTHREADABLE CARTRIDGE SKELETON MSG - ICB517E         @ZA16133*/ 01875000
*   /*                                                               */ 01876000
*   /*****************************************************************/ 01877000
*                                                                  0610 01878000
*   DCL                                                            0610 01879000
*     1 MSG5117 CHAR(51) DEF(FMTWT03),                             0610 01880000
*      2 MID5117 CHAR(10),          /* MSG IDENTIFICATION    @ZA16133*/ 01881000
*      2 MTXT5117 CHAR(41);         /* MSG STATIC TEXT       @ZA16133*/ 01882000
*                                                                  0610 01883000
*   /*****************************************************************/ 01884000
*   /*                                                               */ 01885000
*   /* LAST ONLINE MSS UNIT HAS FAILURE-ICB515E              @ZA16133*/ 01886000
*   /*                                                               */ 01887000
*   /*****************************************************************/ 01888000
*                                                                  0611 01889000
*   DCL                                                            0611 01890000
*     1 MSG5115 CHAR(47) DEF(FMTWT03),                             0611 01891000
*      2 MID5115 CHAR(10),          /* MSG IDENTIFICATION    @ZA16133*/ 01892000
*      2 MTXT5115 CHAR(37);         /* MSG STATIC TEXT       @ZA16133*/ 01893000
*   DCL                                                            0612 01894000
*     C51 FIXED(8) CONSTANT(51);    /* CONSTANT OF 51        @Z40LB02*/ 01895000
*   DCL                                                            0613 01896000
*     SNSVALUE CHAR(1) BASED(SNSPTR);/* SSID AND STAT        @Z40LB02   01897000
*                                      IN SENSE DATA         @Z40LB02*/ 01898000
*   SAVE4678=BALRREG;               /* SAVE REG 14           @Z40LB02*/ 01899000
         LR    SAVE4678,BALRREG                                    0614 01900000
*   IF MSGNUM=C4 THEN               /* MESSAGE # FOUR?       @Z40LB02*/ 01901000
*                                                                  0615 01902000
         CLI   MSGNUM(FSWAPTR),4                                   0615 01903000
         BNE   @RF00615                                            0615 01904000
*     /***************************************************************/ 01905000
*     /*                                                             */ 01906000
*     /* IF MESSAGE INDEX WAS 4, THEN BUILD MSS UNIT UNUSABLE        */ 01907000
*     /*                                                     @Z40LB02*/ 01908000
*     /* MESSAGE(ICB503E).                                   @Z40LB02*/ 01909000
*     /*                                                             */ 01910000
*     /***************************************************************/ 01911000
*                                                                  0616 01912000
*     DO;                           /*                       @Z40LB02*/ 01913000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01914000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0617 01915000
*       MSGID4=MSGID503;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 01916000
         MVC   MSGID4(10,FSWAPTR),MSGID503                         0618 01917000
*       MSGTEXT4=MSG503;            /* PUT MSG IN WK AREA    @Z40LB02*/ 01918000
         MVC   MSGTEXT4(24,FSWAPTR),MSG503                         0619 01919000
*       SSIDVAL=SSIDAREA;           /* SSID VALUE            @Z40LB02*/ 01920000
         MVC   SSIDVAL(3,FSWAPTR),SSIDAREA(FSWAPTR)                0620 01921000
*       IF(FORMAT4=ON&EWOSNS11=HEXC5) THEN/*                 @ZA25303*/ 01922000
         TM    FORMAT4(SNSPTR),B'00001000'                         0621 01923000
         BNO   @RF00621                                            0621 01924000
         CLI   EWOSNS11(SNSPTR),X'C5'                              0621 01925000
         BNE   @RF00621                                            0621 01926000
*         DO;                       /*                       @ZA25303*/ 01927000
*           MCTEXT=MSG503A;         /*                       @ZA25303*/ 01928000
         MVC   MCTEXT(7,FSWAPTR),MSG503A                           0623 01929000
*         END;                      /*                       @ZA25303*/ 01930000
*       END503=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01931000
@RF00621 MVC   END503(1,FSWAPTR),MSGEND                            0625 01932000
*     END;                          /*                       @Z40LB02*/ 01933000
*   IF MSGNUM=C6 THEN               /* MESSAGE # SIX?        @Z40LB02*/ 01934000
*                                                                  0627 01935000
@RF00615 CLI   MSGNUM(FSWAPTR),6                                   0627 01936000
         BNE   @RF00627                                            0627 01937000
*     /***************************************************************/ 01938000
*     /*                                                             */ 01939000
*     /* IF MESSAGE INDEX WAS 6 THEN BUILD CARTRIDGE EXIT    @Z40LB02*/ 01940000
*     /* STATION FULL MESSAGE - ICB505A                      @Z40LB02*/ 01941000
*     /*                                                             */ 01942000
*     /***************************************************************/ 01943000
*                                                                  0628 01944000
*     DO;                                                          0628 01945000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01946000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0629 01947000
*       MSGID6=MSGID505;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 01948000
         MVC   MSGID6(10,FSWAPTR),MSGID505                         0630 01949000
*       MSGTEXT6=MSG505;            /* PUT MSG IN WK AREA    @Z40LB02*/ 01950000
         MVC   MSGTEXT6(34,FSWAPTR),MSG505                         0631 01951000
*       SSIDVAL6=SSIDAREA;          /* SSID VALUE            @Z40LB02*/ 01952000
         MVC   SSIDVAL6(3,FSWAPTR),SSIDAREA(FSWAPTR)               0632 01953000
*       END505=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01954000
         MVC   END505(1,FSWAPTR),MSGEND                            0633 01955000
*     END;                          /*                       @Z40LB02*/ 01956000
*                                                                  0634 01957000
*   /*****************************************************************/ 01958000
*   /*                                                               */ 01959000
*   /* CHECK FOR TABLE PACK FAILURE MESSAGE - ICB506A        @Z40LB02*/ 01960000
*   /*                                                               */ 01961000
*   /*****************************************************************/ 01962000
*                                                                  0635 01963000
*   IF MSGNUM=C7 THEN               /* MESSAGE # SEVEN?      @Z40LB02*/ 01964000
@RF00627 CLI   MSGNUM(FSWAPTR),7                                   0635 01965000
         BNE   @RF00635                                            0635 01966000
*     DO;                                                          0636 01967000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01968000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0637 01969000
*       MSGID7=MSGID506;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 01970000
         MVC   MSGID7(10,FSWAPTR),MSGID506                         0638 01971000
*       MSGTEXT7=MSG506;            /* PUT MSG IN WK AREA    @Z40LB02*/ 01972000
         MVC   MSGTEXT7(32,FSWAPTR),MSG506                         0639 01973000
*       END506=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01974000
         MVC   END506(1,FSWAPTR),MSGEND                            0640 01975000
*     END;                          /*                       @Z40LB02*/ 01976000
*   IF MSGNUM=C8 THEN                                              0642 01977000
*                                                                  0642 01978000
@RF00635 CLI   MSGNUM(FSWAPTR),8                                   0642 01979000
         BNE   @RF00642                                            0642 01980000
*     /***************************************************************/ 01981000
*     /*                                                             */ 01982000
*     /* IF MESSAGE INDEX WAS 8, THEN BUILD CARTRIDGE        @Z40LB02*/ 01983000
*     /* STORE HAS RECONFIGURED MESSAGE(ICB507E              @Z40LB02*/ 01984000
*     /*                                                             */ 01985000
*     /***************************************************************/ 01986000
*                                                                  0643 01987000
*     DO;                           /*                       @Z40LB02*/ 01988000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 01989000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0644 01990000
*       MSGID8=MSGID507;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 01991000
         MVC   MSGID8(10,FSWAPTR),MSGID507                         0645 01992000
*       MSGTEXT8=MSG507;            /* PUT MSG IN WK AREA    @Z40LB02*/ 01993000
         MVC   MSGTEXT8(25,FSWAPTR),MSG507                         0646 01994000
*       MSF507=MSF;                 /* MSF STATIC            @Z40LB02*/ 01995000
         MVC   MSF507(4,FSWAPTR),MSF                               0647 01996000
*       MSFVAL7=MSFVAL;             /* MSF VALUE             @Z40LB02*/ 01997000
         MVC   MSFVAL7(1,FSWAPTR),MSFVAL(FSWAPTR)                  0648 01998000
*       END507=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 01999000
         MVC   END507(1,FSWAPTR),MSGEND                            0649 02000000
*     END;                          /*                       @Z40LB02*/ 02001000
*   IF MSGNUM=C9 THEN               /* MESSAGE # NINE?       @Z40LB02*/ 02002000
*                                                                  0651 02003000
@RF00642 CLI   MSGNUM(FSWAPTR),9                                   0651 02004000
         BNE   @RF00651                                            0651 02005000
*     /***************************************************************/ 02006000
*     /*                                                             */ 02007000
*     /* IF MESSAGE INDEX WAS 9, THEN BUILD PART I PERMANENT @ZA16133*/ 02008000
*     /* WRITE ERROR(ICB509E).                               @ZA16133*/ 02009000
*     /*                                                             */ 02010000
*     /***************************************************************/ 02011000
*                                                                  0652 02012000
*     DO;                           /*                       @Z40LB02*/ 02013000
*       MSGBLT=ON;                  /* MSG EXISTS            @Z40LB02*/ 02014000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0653 02015000
*       MSGID9=MSGID509;            /* PUT MSGID IN WKAREA   @Z40LB02*/ 02016000
         MVC   MSGID9(10,FSWAPTR),MSGID509                         0654 02017000
*       MSGTEXT9=MSG509;            /* PUT MSG IN WK AREA    @Z40LB02*/ 02018000
         MVC   MSGTEXT9(28,FSWAPTR),MSG509                         0655 02019000
*       VOL509=VOLID;               /* LOAD VOLID            @Z40LB02*/ 02020000
         MVC   VOL509(6,FSWAPTR),VOLID                             0656 02021000
*       VOLVAL9=EWOVOLID;           /* VOLID VALUE           @Z40LB02*/ 02022000
         MVC   VOLVAL9(6,FSWAPTR),EWOVOLID(SNSPTR)                 0657 02023000
*       CSN509=CSN;                 /* LOAD CSN STATIC       @Z40LB02*/ 02024000
         MVC   CSN509(6,FSWAPTR),CSN                               0658 02025000
*       CSNVAL9=EWOCSN;             /* LOAD CSN VALUE        @Z40LB02*/ 02026000
         MVC   CSNVAL9(12,FSWAPTR),EWOCSN(SNSPTR)                  0659 02027000
*       END509=MSGEND;              /* TRAILING BLANK        @Z40LB02*/ 02028000
         MVC   END509(1,FSWAPTR),MSGEND                            0660 02029000
*     END;                          /*                       @Z40LB02*/ 02030000
*                                                                  0661 02031000
*   /*****************************************************************/ 02032000
*   /*                                                               */ 02033000
*   /* BUILD ICB510A MESSAGE - TABLE STATUS                  @Z40LB02*/ 02034000
*   /*                                                               */ 02035000
*   /*****************************************************************/ 02036000
*                                                                  0662 02037000
*   IF MSGNUM=C10 THEN                                             0662 02038000
@RF00651 CLI   MSGNUM(FSWAPTR),10                                  0662 02039000
         BNE   @RF00662                                            0662 02040000
*     DO;                                                          0663 02041000
*       MSGBLT=ON;                                                 0664 02042000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0664 02043000
*       SNSPTR=SNSPTR+C4;           /* POINT TO SSID & STAT  @Z40LB02*/ 02044000
         AH    SNSPTR,@CH00070                                     0665 02045000
*       MSGID51A=MSGID510;          /* ST MSGID IN MSG AREA  @Z40LB02*/ 02046000
         MVC   MSGID51A(8,FSWAPTR),MSGID510                        0666 02047000
*       MSGT51A=MSG510;             /* ST STATIC TEXT IN MSG @Z40LB02*/ 02048000
         MVC   MSGT51A(63,FSWAPTR),MSG510                          0667 02049000
*       DO I=C1 TO C4;              /*                       @Z40LB02*/ 02050000
         LA    @11,1                                               0668 02051000
         STC   @11,I(,FSWAPTR)                                     0668 02052000
@DL00668 DS    0H                                                  0669 02053000
*         CHAR1INP=SNSVALUE;        /* PUT STATUS IN WKAREA  @Z40LB02*/ 02054000
         MVC   CHAR1INP(1,FSWAPTR),SNSVALUE(SNSPTR)                0669 02055000
*         UNPK(TRVAL3CH,CHAR2INP);  /* UNPACK STATUS         @Z40LB02*/ 02056000
         UNPK  TRVAL3CH(3,FSWAPTR),CHAR2INP(2,FSWAPTR)             0670 02057000
*         GEN REFS(TRVAL3CH,TRTABLE,FSWAPTR);                      0671 02058000
*                                                         /*@Z40LB02*/  02059000
  TR   TRVAL3CH(3,FSWAPTR),TRTABLE-X'F0'                                02060000
*         IF I=C1 THEN                                             0672 02061000
         CLI   I(FSWAPTR),1                                        0672 02062000
         BNE   @RF00672                                            0672 02063000
*           DO;                     /*                       @Z40LB02*/ 02064000
*             STAT0=CHAR2INP;       /* STATUS FOR TP 000     @Z40LB02*/ 02065000
         MVC   STAT0(2,FSWAPTR),CHAR2INP(FSWAPTR)                  0674 02066000
*           END;                    /*                       @Z40LB02*/ 02067000
*         ELSE                                                     0676 02068000
*           IF I=C2 THEN                                           0676 02069000
         B     @RC00672                                            0676 02070000
@RF00672 CLI   I(FSWAPTR),2                                        0676 02071000
         BNE   @RF00676                                            0676 02072000
*             DO;                   /*                       @Z40LB02*/ 02073000
*               STAT2=CHAR2INP;     /* STATUS FOR TP 002     @Z40LB02*/ 02074000
         MVC   STAT2(2,FSWAPTR),CHAR2INP(FSWAPTR)                  0678 02075000
*             END;                  /*                       @Z40LB02*/ 02076000
*           ELSE                                                   0680 02077000
*             IF I=C3 THEN                                         0680 02078000
         B     @RC00676                                            0680 02079000
@RF00676 CLI   I(FSWAPTR),3                                        0680 02080000
         BNE   @RF00680                                            0680 02081000
*               DO;                                                0681 02082000
*                 STAT4=CHAR2INP;   /* STATUS FOR TP 004     @Z40LB02*/ 02083000
         MVC   STAT4(2,FSWAPTR),CHAR2INP(FSWAPTR)                  0682 02084000
*               END;                                               0683 02085000
*             ELSE                                                 0684 02086000
*               IF I=C4 THEN                                       0684 02087000
         B     @RC00680                                            0684 02088000
@RF00680 CLI   I(FSWAPTR),4                                        0684 02089000
         BNE   @RF00684                                            0684 02090000
*                 DO;                                              0685 02091000
*                   STAT6=CHAR2INP; /* STATUS FOR TP 006     @Z40LB02*/ 02092000
         MVC   STAT6(2,FSWAPTR),CHAR2INP(FSWAPTR)                  0686 02093000
*                 END;                                             0687 02094000
*         SNSPTR=SNSPTR+C1;         /* INCREM SNS POINTER    @Z40LB02*/ 02095000
@RF00684 DS    0H                                                  0688 02096000
@RC00680 DS    0H                                                  0688 02097000
@RC00676 DS    0H                                                  0688 02098000
@RC00672 AH    SNSPTR,@CH00054                                     0688 02099000
*       END;                                                       0689 02100000
         LA    @11,1                                               0689 02101000
         SLR   @08,@08                                             0689 02102000
         IC    @08,I(,FSWAPTR)                                     0689 02103000
         ALR   @11,@08                                             0689 02104000
         STC   @11,I(,FSWAPTR)                                     0689 02105000
         CH    @11,@CH00070                                        0689 02106000
         BNH   @DL00668                                            0689 02107000
*       RFY                                                        0690 02108000
*         EWAPTR RSTD;                                             0690 02109000
*       EWAPTR=IOSERP;              /* SET EWAPTR AGAIN      @Z40LB02*/ 02110000
         L     EWAPTR,IOSERP(,IOSBPTR)                             0691 02111000
*       SNSPTR=ADDR(EWASNS);        /* RESET SENSE PTR       @Z40LB02*/ 02112000
         LA    SNSPTR,EWASNS(,EWAPTR)                              0692 02113000
*     END;                                                         0693 02114000
*                                                                  0693 02115000
*   /*****************************************************************/ 02116000
*   /*                                                               */ 02117000
*   /* BUILD ICB516E MESSAGE - NO DASD SPACE AVAILABLE       @ZA16133*/ 02118000
*   /*                                                               */ 02119000
*   /*****************************************************************/ 02120000
*                                                                  0694 02121000
*   IF MSGNUM=C16 THEN                                             0694 02122000
@RF00662 CLI   MSGNUM(FSWAPTR),16                                  0694 02123000
         BNE   @RF00694                                            0694 02124000
*     DO;                                                          0695 02125000
*       MSGBLT=ON;                  /* SET MSG SWITCH        @ZA16133*/ 02126000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0696 02127000
*       FMTWT04=DESC2;              /* DESCRIPTOR CDE 2      @ZA16133*/ 02128000
         MVC   FMTWT04(2,FSWAPTR),DESC2                            0697 02129000
*       MGID516=MSGID516;           /* PUT MSG ID IN MSG AREA      0698 02130000
*                                                            @ZA16133*/ 02131000
         MVC   MGID516(10,FSWAPTR),MSGID516                        0698 02132000
*       MTXT516=MSG516;             /* PUT STATIC TXT IN MSG AREA  0699 02133000
*                                                            @ZA16133*/ 02134000
         MVC   MTXT516(23,FSWAPTR),MSG516                          0699 02135000
*     END;                                                         0700 02136000
*                                                                  0700 02137000
*   /*****************************************************************/ 02138000
*   /*                                                               */ 02139000
*   /* BUILD ICB512E MESSAGE - NO FREE CELLS IN MSF          @Z40LB02*/ 02140000
*   /*                                                               */ 02141000
*   /*****************************************************************/ 02142000
*                                                                  0701 02143000
*   IF MSGNUM=C12 THEN                                             0701 02144000
@RF00694 CLI   MSGNUM(FSWAPTR),12                                  0701 02145000
         BNE   @RF00701                                            0701 02146000
*     DO;                                                          0702 02147000
*       MSGBLT=ON;                  /* SET MSG SWITCH        @Z40LB02*/ 02148000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0703 02149000
*       FMTWT04=DESC3;              /* DESCRIPTOR CDE 3      @Z40LB02*/ 02150000
         MVC   FMTWT04(2,FSWAPTR),DESC3                            0704 02151000
*       FMTWT05=FMTWT05&ONEOFF;     /* MASK OFF RTE CDE 1    @ZA29810*/ 02152000
         NC    FMTWT05(2,FSWAPTR),ONEOFF                           0705 02153000
*       FMTWT05=FMTWT05|RTECODE;    /* ROUTE CODE OF 2       @ZA29810*/ 02154000
         OC    FMTWT05(2,FSWAPTR),RTECODE                          0706 02155000
*       MID5112=MSGID512;           /* LOAD MSG ID           @Z40LB02*/ 02156000
         MVC   MID5112(10,FSWAPTR),MSGID512                        0707 02157000
*       MTXT5112(1:17)=MSG513(1:17);/* LOAD MSG STAT TEXT    @Z40LB02*/ 02158000
         MVC   MTXT5112(17,FSWAPTR),MSG513                         0708 02159000
*       CSN5112=EWOCSN;             /* LOAD CSN IN MSG       @Z40LB02*/ 02160000
         MVC   CSN5112(12,FSWAPTR),EWOCSN(SNSPTR)                  0709 02161000
*       STAT5112=MSG512;            /* LOAD MSG STAT TEXT    @0Z11018*/ 02162000
         MVC   STAT5112(19,FSWAPTR),MSG512                         0710 02163000
*     END;                                                         0711 02164000
*                                                                  0711 02165000
*   /*****************************************************************/ 02166000
*   /*                                                               */ 02167000
*   /* BUILD ICB513E MESSAGE - NO TABLE ENTRY SPACE          @Z40LB02*/ 02168000
*   /*                                                               */ 02169000
*   /*****************************************************************/ 02170000
*                                                                  0712 02171000
*   IF MSGNUM=C13 THEN                                             0712 02172000
@RF00701 CLI   MSGNUM(FSWAPTR),13                                  0712 02173000
         BNE   @RF00712                                            0712 02174000
*     DO;                                                          0713 02175000
*       MSGBLT=ON;                  /* SET MSG SWITCH        @Z40LB02*/ 02176000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0714 02177000
*       MID5113=MSGID513;           /* LOAD MSG ID           @Z40LB02*/ 02178000
         MVC   MID5113(10,FSWAPTR),MSGID513                        0715 02179000
*       FMTWT04=DESC3;              /* DESCRIPTOR CDE 3      @Z40LB02*/ 02180000
         MVC   FMTWT04(2,FSWAPTR),DESC3                            0716 02181000
*       MTXT5113=MSG513;            /* LOAD MSG STAT TEXT    @ZA16133*/ 02182000
         MVC   MTXT5113(37,FSWAPTR),MSG513                         0717 02183000
*       CSN5113=EWOCSN;             /* LOAD CSN IN MSG       @Z40LB02*/ 02184000
         MVC   CSN5113(12,FSWAPTR),EWOCSN(SNSPTR)                  0718 02185000
*     END;                                                         0719 02186000
*                                                                  0719 02187000
*   /*****************************************************************/ 02188000
*   /*                                                               */ 02189000
*   /* BUILD ICB517E MESSAGE - UNTHREADABLE CARTRIDGE        @ZA16133*/ 02190000
*   /*                                                               */ 02191000
*   /*****************************************************************/ 02192000
*                                                                  0720 02193000
*   IF MSGNUM=C17 THEN                                             0720 02194000
@RF00712 CLI   MSGNUM(FSWAPTR),17                                  0720 02195000
         BNE   @RF00720                                            0720 02196000
*     DO;                                                          0721 02197000
*       MSGBLT=ON;                  /* SET MSG SWITCH        @Z40LB02*/ 02198000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0722 02199000
*       FMTWT04=DESC2;              /* DESCRIPTOR CDE 2      @ZA16133*/ 02200000
         MVC   FMTWT04(2,FSWAPTR),DESC2                            0723 02201000
*       MID5117=MSGID517;           /* LOAD MSG ID           @ZA16133*/ 02202000
         MVC   MID5117(10,FSWAPTR),MSGID517                        0724 02203000
*       MTXT5117=MSG517;            /* LOAD MSG STAT TEXT    @ZA16133*/ 02204000
         MVC   MTXT5117(41,FSWAPTR),MSG517                         0725 02205000
*     END;                                                         0726 02206000
*                                                                  0726 02207000
*   /*****************************************************************/ 02208000
*   /*                                                               */ 02209000
*   /* BUILD ICB515E MESSAGE - LAST ONLINE MSS UNIT          @ZA16133*/ 02210000
*   /*                                                               */ 02211000
*   /*****************************************************************/ 02212000
*                                                                  0727 02213000
*   IF MSGNUM=C15 THEN                                             0727 02214000
@RF00720 CLI   MSGNUM(FSWAPTR),15                                  0727 02215000
         BNE   @RF00727                                            0727 02216000
*     DO;                                                          0728 02217000
*       MSGBLT=ON;                  /* SET MSG SWITCH        @Z40LB02*/ 02218000
         OI    MSGBLT(FSWAPTR),B'01000000'                         0729 02219000
*       FMTWT04=DESC2;              /* DESCRIPTOR CDE 2      @ZA16133*/ 02220000
         MVC   FMTWT04(2,FSWAPTR),DESC2                            0730 02221000
*       MID5115=MSGID515;           /* LOAD MSG ID           @ZA16133*/ 02222000
         MVC   MID5115(10,FSWAPTR),MSGID515                        0731 02223000
*       MTXT5115=MSG515;            /* LOAD MSG STAT TEXT    @ZA16133*/ 02224000
         MVC   MTXT5115(37,FSWAPTR),MSG515                         0732 02225000
*       MTXT5115(35:37)=SSIDAREA;   /* LOAD MSG SSID AREA    @ZA29387*/ 02226000
         MVC   MTXT5115+34(3,FSWAPTR),SSIDAREA(FSWAPTR)            0733 02227000
*     END;                                                         0734 02228000
*                                                                  0734 02229000
*   /*****************************************************************/ 02230000
*   /*                                                               */ 02231000
*   /* THE FOLLOWING CODE SETUP XCTL TO NEXT ROUTINE         @Z40LB02*/ 02232000
*   /* XCTL WILL BE TO SYSTEM OBR OR TO IOS                  @Z40LB02*/ 02233000
*   /*                                                               */ 02234000
*   /*****************************************************************/ 02235000
*                                                                  0735 02236000
*   IF MSGBLT=ON THEN                                              0735 02237000
@RF00727 TM    MSGBLT(FSWAPTR),B'01000000'                         0735 02238000
         BNO   @RF00735                                            0735 02239000
*     DO;                                                          0736 02240000
*       DO;                         /* WTOP MF(E,FMTWT01)            */ 02241000
*         RFY                                                      0738 02242000
*           GPR01P RSTD;            /* RESTRICT REG 1                */ 02243000
*         GPR01P=ADDR(FMTWT01);     /* ADDRESS CONTROL PROGRAM LIST  */ 02244000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0739 02245000
*         SVC(35);                  /* ISSUE WTO SVC                 */ 02246000
         SVC   35                                                  0740 02247000
*         RFY                                                      0741 02248000
*           GPR01P UNRSTD;          /* RELEASE REG 1                 */ 02249000
*       END;                        /* WTOP MF(E,FMTWT01)    @Z40LB02*/ 02250000
*       IOSBPTR=SAVER1;                                            0743 02251000
         L     IOSBPTR,SAVER1(,FSWAPTR)                            0743 02252000
*       IF MSGNUM=C9 THEN           /* MESSAGE # FOUR?       @Z40LB02*/ 02253000
*                                                                  0744 02254000
         CLI   MSGNUM(FSWAPTR),9                                   0744 02255000
         BNE   @RF00744                                            0744 02256000
*         /***********************************************************/ 02257000
*         /*                                                         */ 02258000
*         /* IF MESSAGE INDEX WAS 9, THEN BUILD PART II PERMANENT    */ 02259000
*         /*                                                 @ZA16133*/ 02260000
*         /* WRITE ERROR(ICB509E).                           @ZA16133*/ 02261000
*         /*                                                         */ 02262000
*         /***********************************************************/ 02263000
*                                                                  0745 02264000
*         DO;                       /*                       @Z40LB02*/ 02265000
*           FMTWT03(38:79)='';      /* BLANKS ZA30102                */ 02266000
         MVI   FMTWT03+37(FSWAPTR),C' '                            0746 02267000
         MVC   FMTWT03+38(41,FSWAPTR),FMTWT03+37(FSWAPTR)          0746 02268000
*           MSF509=MSF;             /* STATIC MSF TXT        @Z40LB02*/ 02269000
         MVC   MSF509(4,FSWAPTR),MSF                               0747 02270000
*           MSFVAL9=MSFVAL;         /* MSF VALUE             @Z40LB02*/ 02271000
         MVC   MSFVAL9(1,FSWAPTR),MSFVAL(FSWAPTR)                  0748 02272000
*           XYZ509=XYZ;             /* XYZ STATIC TXT        @Z40LB02*/ 02273000
         MVC   XYZ509(6,FSWAPTR),XYZ                               0749 02274000
*           XVAL9A=XVAL;            /* X VALUE               @Z40LB02*/ 02275000
         MVC   XVAL9A(3,FSWAPTR),XVAL(FSWAPTR)                     0750 02276000
*           YVAL9A=YVAL;            /* LOAD Y VALUE          @Z40LB02*/ 02277000
         MVC   YVAL9A(2,FSWAPTR),YVAL(FSWAPTR)                     0751 02278000
*           ZVAL9A=ZVAL;            /* LOAD Z VALUE          @Z40LB02*/ 02279000
         MVC   ZVAL9A(1,FSWAPTR),ZVAL(FSWAPTR)                     0752 02280000
*           CANO=MS509A;            /* CASE STATIC TEXT      @ZA30102*/ 02281000
         MVC   CANO(9,FSWAPTR),MS509A                              0753 02282000
*           CANR=EWOSNS12|HIMASK;   /* PRINTABLE CASE NR     @ZA30102*/ 02283000
         MVC   CANR(1,FSWAPTR),EWOSNS12(SNSPTR)                    0754 02284000
         OI    CANR(FSWAPTR),X'F0'                                 0754 02285000
*           END509A=MSGEND;         /* TRAILING BLANK        @Z40LB02*/ 02286000
         MVC   END509A(1,FSWAPTR),MSGEND                           0755 02287000
*           DO;                     /* WTOP MF(E,FMTWT01)            */ 02288000
*             RFY                                                  0757 02289000
*               GPR01P RSTD;        /* RESTRICT REG 1                */ 02290000
*             GPR01P=ADDR(FMTWT01); /* ADDRESS CONTROL PROGRAM LIST  */ 02291000
         LA    GPR01P,FMTWT01(,FSWAPTR)                            0758 02292000
*             SVC(35);              /* ISSUE WTO SVC                 */ 02293000
         SVC   35                                                  0759 02294000
*             RFY                                                  0760 02295000
*               GPR01P UNRSTD;      /* RELEASE REG 1                 */ 02296000
*           END;                    /* WTOP MF(E,FMTWT01)    @Z40LB02*/ 02297000
*         END;                      /*                       @Z40LB02*/ 02298000
*       IOSBPTR=SAVER1;             /*                       @Z40LB02*/ 02299000
@RF00744 L     IOSBPTR,SAVER1(,FSWAPTR)                            0763 02300000
*       IOSMSG=OFF;                 /* TURN OFF MSG BIT      @Z40LB02*/ 02301000
         NI    IOSMSG(IOSBPTR),B'11111011'                         0764 02302000
*     END;                                                         0765 02303000
*   BALRREG=SAVE4678;               /* RESTORE REGISTER 14   @Z40LB02*/ 02304000
@RF00735 LR    BALRREG,SAVE4678                                    0766 02305000
*   RETURN;                                                        0767 02306000
@EL00004 DS    0H                                                  0767 02307000
@EF00004 DS    0H                                                  0767 02308000
@ER00004 BR    @14                                                 0767 02309000
*   END FSMS4678;                   /*                       @Z40LB02*/ 02310000
*                                                                  0769 02311000
*/********************************************************************/ 02312000
*/*  MODULE NAME - FSCLNUP                                           */ 02313000
*/*                                                                  */ 02314000
*/*  DESCRIPTIVE NAME - FORMAT SENSE CLEAN UP ROUTINE                */ 02315000
*/*                                                                  */ 02316000
*/*  FUNCTION - THIS SUBROUTINE WILL FREE THE 160 BYTE BLOCK OF      */ 02317000
*/*             STORAGE USED TO BUILD THE MESSAGE.  IN ORDER TO      */ 02318000
*/*             ACCOMPLISH THIS, THE LOCAL LOCK IS OBTAINED TO       */ 02319000
*/*             PROTECT THE FRR STACK.  THE LOCK IS RELEASED AFTER   */ 02320000
*/*             STORAGE AREA IS FREED.                               */ 02321000
*/********************************************************************/ 02322000
*                                                                  0769 02323000
*FSCLNUP:                                                          0769 02324000
*   PROC OPTIONS(NOSAVE,NOSAVEAREA);                               0769 02325000
FSCLNUP  DS    0H                                                  0770 02326000
*   RFY                                                            0770 02327000
*    (REG6,                                                        0770 02328000
*     REG0,                                                        0770 02329000
*     REGF,                                                        0770 02330000
*     BALRREG,                                                     0770 02331000
*     REGB) RSTD;                                                  0770 02332000
*   SAVCLUP=BALRREG;                /* SAVE REGISTER 14      @Z40LB02*/ 02333000
         LR    SAVCLUP,BALRREG                                     0771 02334000
*   GEN REFS(PSALITA);                                             0772 02335000
GETLK1 SETLOCK OBTAIN,TYPE=LOCAL,MODE=UNCOND,                         **02336000
               RELATED=(IECVSMGR,IGE0301H(FREELK1))                     02337000
*   REGD=EWAPTR;                    /* RESTORE REG 13        @Z40LB02*/ 02338000
*                                                                  0773 02339000
         LR    REGD,EWAPTR                                         0773 02340000
*   /*****************************************************************/ 02341000
*   /*                                                               */ 02342000
*   /* NOW THAT THE LOCAL LOCK IS ENGAGED WE CAN FREE THE    @Z40LB02*/ 02343000
*   /* IOS STORAGE AREA USED TO BUILD THE MESSAGE.           @Z40LB02*/ 02344000
*   /* IT IS NECESSARY TO ZERO THE FIRST WORD OF THE 160     @ZA09517*/ 02345000
*   /* BYTE AREA BEING RELEASED.                             @ZA09517*/ 02346000
*   /* REG1=ADDR OF BLOCK TO BE FREED                        @Z40LB02*/ 02347000
*   /* REG11=00000020 TO INDICATE 160 BYTE BLOCK             @Z40LB02*/ 02348000
*   /* REG13=ADDR OF SAVE AREA                               @Z40LB02*/ 02349000
*   /*                                                               */ 02350000
*   /*****************************************************************/ 02351000
*                                                                  0774 02352000
*   FMTSNWA1(1:4)=FMTSNWA1(1:4)&&FMTSNWA1(1:4);/* ZERO WORD  @ZA09517*/ 02353000
         XC    FMTSNWA1(4,FSWAPTR),FMTSNWA1(FSWAPTR)               0774 02354000
*   REGB='00000020'X;                                              0775 02355000
         LA    REGB,32                                             0775 02356000
*   REG0=IOSBPTR;                   /* SAVE REG1, IOSB ADDR@Z40LB02  */ 02357000
         LR    REG0,IOSBPTR                                        0776 02358000
*   IOSBPTR=FSWAPTR;                /* REG1 HAS ADDR OF      @Z40LB02   02359000
*                                      STORAGE AREA          @Z40LB02*/ 02360000
         LR    IOSBPTR,FSWAPTR                                     0777 02361000
*   REGF=IOCORMGT;                  /* ADDR OF STORAGE MGR   @Z40LB02*/ 02362000
         L     REGF,IOCORMGT(,IOCOMPTR)                            0778 02363000
*   GEN(BAL  BALRREG,4(REGF));      /* FREE STORAGE          @Z40LB02*/ 02364000
         BAL  BALRREG,4(REGF)                                           02365000
*   IOSBPTR=REG0;                   /* RESTORE REG 1         @Z40LB02*/ 02366000
         LR    IOSBPTR,REG0                                        0780 02367000
*   EWAPTR=REGD;                    /* RESTORE REG 13        @Z40LB02*/ 02368000
*                                                                  0781 02369000
         LR    EWAPTR,REGD                                         0781 02370000
*   /*****************************************************************/ 02371000
*   /*                                                               */ 02372000
*   /* FREE LOCAL LOCK GOTTEN FOR STORAGE MANAGER            @Z40LB02*/ 02373000
*   /*                                                               */ 02374000
*   /*****************************************************************/ 02375000
*                                                                  0782 02376000
*   GEN REFS(PSALITA);                                             0782 02377000
FREELK1 SETLOCK RELEASE,TYPE=LOCAL,                                   **02378000
               RELATED=(IECVSMGR,IGE0301H(GETLK1))                      02379000
*   REGC=SAVR12;                                                   0783 02380000
         L     REGC,SAVR12(,FSWAPTR)                               0783 02381000
*   BALRREG=SAVCLUP;                /* RESTORE REGISTER 14   @Z40LB02*/ 02382000
         LR    BALRREG,SAVCLUP                                     0784 02383000
*   RETURN;                                                        0785 02384000
@EL00005 DS    0H                                                  0785 02385000
@EF00005 DS    0H                                                  0785 02386000
@ER00005 BR    @14                                                 0785 02387000
*   END FSCLNUP;                    /*                       @Z40LB02*/ 02388000
@PB00005 DS    0H                                                  0786 02389000
*   END IGE0301H                                                   0787 02390000
*                                                                  0787 02391000
*/* THE FOLLOWING INCLUDE STATEMENTS WERE FOUND IN THIS PROGRAM.     */ 02392000
*/*%INCLUDE SYSLIB  (IEZSENSE)                                       */ 02393000
*/*%INCLUDE SYSLIB  (IEZFMSWA)                                       */ 02394000
*/*%INCLUDE SYSLIB  (IEZVVICB)                                       */ 02395000
*/*%INCLUDE SYSLIB  (CVT     )                                       */ 02396000
*/*%INCLUDE SYSLIB  (IECDIOSB)                                       */ 02397000
*/*%INCLUDE SYSLIB  (EWAMAP  )                                       */ 02398000
*/*%INCLUDE SYSLIB  (IEZSSC  )                                       */ 02399000
*/*%INCLUDE SYSLIB  (IEFUCBOB)                                       */ 02400000
*/*%INCLUDE SYSLIB  (IECDIOCM)                                       */ 02401000
*/*%INCLUDE SYSLIB  (IHASRB  )                                       */ 02402000
*/*%INCLUDE SYSLIB  (IHAPSA  )                                       */ 02403000
*                                                                  0787 02404000
*       ;                                                          0787 02405000
@DATA    DS    0H                                                       02406000
@CH00054 DC    H'1'                                                     02407000
@CH00070 DC    H'4'                                                     02408000
@CH00108 DC    H'5'                                                     02409000
@CH00081 DC    H'6'                                                     02410000
@CH00052 DC    H'8'                                                     02411000
@CH00413 DC    H'24'                                                    02412000
@CH00311 DC    H'83'                                                    02413000
@CH02088 DC    XL2'0E'                                                  02414000
@DATD    DSECT                                                          02415000
         DS    0F                                                       02416000
IGE0301H CSECT                                                          02417000
         DS    0F                                                       02418000
@CF02080 DC    XL4'10000020'                                            02419000
@DATD    DSECT                                                          02420000
         DS    0D                                                       02421000
UCBDCPTR DS    A                                                        02422000
         DS    0D                                                       02423000
@TS00001 DS    CL8                                                      02424000
         ORG   *+1-(*-@DATD)/(*-@DATD) INSURE DSECT DATA                02425000
@ENDDATD EQU   *                                                        02426000
IGE0301H CSECT                                                          02427000
         DS    0F                                                       02428000
@SIZDATD DC    AL1(0)                                                   02429000
         DC    AL3(@ENDDATD-@DATD)                                      02430000
         DS    0D                                                       02431000
FSWMAINT DS    CL400                                                    02432000
         ORG   FSWMAINT                                                 02433000
FSWNAME  DC    CL20'IGE0301H PATCH AREA '                               02434000
         ORG   FSWMAINT+400                                             02435000
LIBROUT  DC    X'8000'                                                  02436000
RTECODE  DC    X'4000'                                                  02437000
ONEOFF   DC    X'7FFF'                                                  02438000
MCSFLG   DC    X'8000'                                                  02439000
MASKSSID DC    X'0FFF'                                                  02440000
DESC2    DC    X'4000'                                                  02441000
DESC3    DC    X'2000'                                                  02442000
DESC4    DC    X'1000'                                                  02443000
MSGID508 DC    CL14'ICB508I ***,,,'                                     02444000
VOLID    DC    CL6'VOLID='                                              02445000
CSN      DC    CL6', CSN='                                              02446000
CASE     DC    CL5'CASE='                                               02447000
CYL      DC    CL6', CYL='                                              02448000
MSF      DC    CL4'MSF='                                                02449000
XYZ      DC    CL6', XYZ='                                              02450000
MSF1     DC    CL6', MSF='                                              02451000
MSGEND   DC    CL1' '                                                   02452000
TRTABLE  DC    CL16'0123456789ABCDEF'                                   02453000
MSGID500 DC    CL10'ICB500E - '                                         02454000
MSGID501 DC    CL10'ICB501E - '                                         02455000
MSGID502 DC    CL10'ICB502E - '                                         02456000
MSG500   DC    CL13'STAGE ERROR, '                                      02457000
MSG501   DC    CL24'STRIPES AVAILABLE ZERO, '                           02458000
MSG502   DC    CL24'CARTRIDGE LOAD FAILURE, '                           02459000
MSGID504 DC    CL10'ICB504E - '                                         02460000
MSG504   DC    CL28'MSS CARTRIDGE INACCESSIBLE, '                       02461000
MSGID503 DC    CL10'ICB503E - '                                         02462000
MSGID505 DC    CL10'ICB505A - '                                         02463000
MSGID506 DC    CL10'ICB506A - '                                         02464000
MSGID507 DC    CL10'ICB507E - '                                         02465000
MSGID509 DC    CL10'ICB509E - '                                         02466000
MSGID510 DC    CL8'ICB510A '                                            02467000
MSGID512 DC    CL10'ICB512E - '                                         02468000
MSGID513 DC    CL10'ICB513E - '                                         02469000
MSGID515 DC    CL10'ICB515E - '                                         02470000
MSGID516 DC    CL10'ICB516E - '                                         02471000
MSGID517 DC    CL10'ICB517E - '                                         02472000
MSG503   DC    CL24'MSS UNIT UNUSABLE, SSID='                           02473000
MSG503A  DC    CL7', MC=C5'                                             02474000
MSG505   DC    CL34'CARTRIDGE EXIT STATION FULL, SSID='                 02475000
MSG506   DC    CL32'PERMANENT MSC TABLE PACK FAILURE'                   02476000
MSG507   DC    CL25'MSS ACCESSOR HAS FAILED, '                          02477000
MSG509   DC    CL28'PERMANENT READ/WRITE ERROR, '                       02478000
MS509A   DC    CL9', CASE=0*'                                           02479000
MSG510   DC    CL63'SSID0 STATUS=**,SSID2 STATUS=**,SSID4 STATUS=**,SSIC02480000
               D6 STATUS=**'                                            02481000
MSG516   DC    CL23'NO DASD SPACE AVAILABLE'                            02482000
MSG512   DC    CL19'NO FREE CELL IN MSF'                                02483000
MSG513   DC    CL37'CSN ************ NO TABLE ENTRY SPACE'              02484000
MSG517   DC    CL41'UNTHREADABLE CARTRIDGE, CARTRIDGE EJECTED'          02485000
MSG515   DC    CL37'LAST ONLINE MSS UNIT FAILED, SSID=XXX'              02486000
CASEDS   DS    CL24                                                     02487000
         ORG   CASEDS+0                                                 02488000
CASES    DC    CL24',EMPTY CELL '                                       02489000
         ORG   CASEDS+24                                                02490000
         ORG   CASEDS+24                                                02491000
         DC    CL24',NON-MATCHING CART LABEL'                           02492000
         ORG   CASEDS+48                                                02493000
         ORG   CASEDS+48                                                02494000
         DC    CL24',FULL CELL '                                        02495000
         ORG   CASEDS+72                                                02496000
         ORG   CASEDS+72                                                02497000
         DC    CL24',CART STUCK IN ACCESR '                             02498000
         ORG   CASEDS+96                                                02499000
         ORG   CASEDS+96                                                02500000
         DC    CL24',CART STUCK/ACCESR DOWN '                           02501000
         ORG   CASEDS+120                                               02502000
         ORG   CASEDS+120                                               02503000
         DC    CL24',INVALID XYZ ADDR '                                 02504000
         ORG   CASEDS+144                                               02505000
         ORG   CASEDS+144                                               02506000
         DC    CL24',CART UNLOAD FAILURE '                              02507000
         ORG   CASEDS+168                                               02508000
         ORG   CASEDS+168                                               02509000
         DC    CL24',DRD XXX MARKED SUU '                               02510000
         ORG   CASEDS+192                                               02511000
         ORG   CASEDS+192                                               02512000
         DC    CL24',CARTRIDGE LEFT IN DRD '                            02513000
         ORG   CASEDS+216                                               02514000
@00      EQU   00                      EQUATES FOR REGISTERS 0-15       02515000
@01      EQU   01                                                       02516000
@02      EQU   02                                                       02517000
@03      EQU   03                                                       02518000
@04      EQU   04                                                       02519000
@05      EQU   05                                                       02520000
@06      EQU   06                                                       02521000
@07      EQU   07                                                       02522000
@08      EQU   08                                                       02523000
@09      EQU   09                                                       02524000
@10      EQU   10                                                       02525000
@11      EQU   11                                                       02526000
@12      EQU   12                                                       02527000
@13      EQU   13                                                       02528000
@14      EQU   14                                                       02529000
@15      EQU   15                                                       02530000
REG0     EQU   @00                                                      02531000
IOSBPTR  EQU   @01                                                      02532000
GPR01P   EQU   @01                                                      02533000
EWAPTR   EQU   @02                                                      02534000
SNSPTR   EQU   @03                                                      02535000
FSWAPTR  EQU   @04                                                      02536000
IOCOMPTR EQU   @05                                                      02537000
REG6     EQU   @06                                                      02538000
UCBPTR   EQU   @07                                                      02539000
ICBPTR   EQU   @08                                                      02540000
BASEREG  EQU   @09                                                      02541000
CVTPTR   EQU   @10                                                      02542000
REGB     EQU   @11                                                      02543000
REGC     EQU   @12                                                      02544000
REGD     EQU   @13                                                      02545000
BALRREG  EQU   @14                                                      02546000
REGF     EQU   @15                                                      02547000
SAVE123  EQU   @06                                                      02548000
SAVE5    EQU   @06                                                      02549000
SAVE4678 EQU   @06                                                      02550000
SAVCLUP  EQU   @06                                                      02551000
SENSPTR8 EQU   @06                                                      02552000
CVTLOC   EQU   16                                                       02553000
PSA      EQU   0                                                        02554000
FLCRNPSW EQU   PSA                                                      02555000
FLCROPSW EQU   PSA+8                                                    02556000
FLCICCW2 EQU   PSA+16                                                   02557000
PSAEEPSW EQU   PSA+132                                                  02558000
PSAESPSW EQU   PSA+136                                                  02559000
FLCSVILC EQU   PSAESPSW+1                                               02560000
PSAEPPSW EQU   PSA+140                                                  02561000
FLCPIILC EQU   PSAEPPSW+1                                               02562000
FLCPICOD EQU   PSAEPPSW+2                                               02563000
PSAPICOD EQU   FLCPICOD+1                                               02564000
FLCTEA   EQU   PSAEPPSW+4                                               02565000
FLCPER   EQU   PSA+152                                                  02566000
FLCMCLA  EQU   PSA+168                                                  02567000
FLCIOEL  EQU   FLCMCLA+4                                                02568000
FLCIOA   EQU   FLCMCLA+16                                               02569000
FLCFSA   EQU   FLCMCLA+80                                               02570000
PSASUPER EQU   PSA+552                                                  02571000
PSASUP1  EQU   PSASUPER                                                 02572000
PSASUP2  EQU   PSASUPER+1                                               02573000
PSASUP3  EQU   PSASUPER+2                                               02574000
PSASUP4  EQU   PSASUPER+3                                               02575000
PSACLHT  EQU   PSA+640                                                  02576000
PSALKSA  EQU   PSA+696                                                  02577000
PSAHLHI  EQU   PSA+760                                                  02578000
PSALITA  EQU   PSA+764                                                  02579000
PSADSSFL EQU   PSA+836                                                  02580000
PSADSSF1 EQU   PSADSSFL                                                 02581000
PSADSSF3 EQU   PSADSSFL+2                                               02582000
PSADSSF4 EQU   PSADSSFL+3                                               02583000
PSARSVT  EQU   PSA+896                                                  02584000
EWOSNS   EQU   0                                                        02585000
EWOSNS0  EQU   EWOSNS                                                   02586000
EWOSSID  EQU   EWOSNS+1                                                 02587000
EWOSNS1  EQU   EWOSSID                                                  02588000
CEM      EQU   EWOSNS1                                                  02589000
SUU      EQU   EWOSNS1                                                  02590000
EWOSNS2  EQU   EWOSSID+1                                                02591000
EWOSNS3  EQU   EWOSNS+3                                                 02592000
FORMAT0  EQU   EWOSNS3                                                  02593000
FORMAT3  EQU   EWOSNS3                                                  02594000
FORMAT4  EQU   EWOSNS3                                                  02595000
EWOVOLID EQU   EWOSNS+4                                                 02596000
EWOSNS4  EQU   EWOVOLID                                                 02597000
EWOSNS5  EQU   EWOVOLID+1                                               02598000
RECON    EQU   EWOSNS5                                                  02599000
EWOSNS11 EQU   EWOSNS+11                                                02600000
EWOCHECK EQU   EWOSNS11                                                 02601000
EWOMSGCD EQU   EWOCHECK                                                 02602000
EWOSNS12 EQU   EWOSNS+12                                                02603000
EWOLZYX  EQU   EWOSNS+14                                                02604000
EWOLZYX1 EQU   EWOLZYX                                                  02605000
XVALUE   EQU   EWOLZYX+1                                                02606000
EWOCSN   EQU   EWOSNS+16                                                02607000
EWOFSC   EQU   EWOCSN+10                                                02608000
EWOCYL   EQU   EWOSNS+28                                                02609000
CCHHR    EQU   EWOCYL                                                   02610000
FMTSNWA1 EQU   0                                                        02611000
FMTSWTCH EQU   FMTSNWA1                                                 02612000
FSEXIT   EQU   FMTSWTCH                                                 02613000
MSGBLT   EQU   FMTSWTCH                                                 02614000
MSGNUM   EQU   FMTSNWA1+1                                               02615000
ALTCON   EQU   FMTSNWA1+2                                               02616000
FMTWORK  EQU   FMTSNWA1+4                                               02617000
YVAL     EQU   FMTWORK                                                  02618000
ZVAL     EQU   FMTWORK+2                                                02619000
MSFVAL   EQU   FMTWORK+3                                                02620000
XVAL     EQU   FMTWORK+4                                                02621000
SSIDAREA EQU   FMTWORK+7                                                02622000
FMTSNWA3 EQU   FMTSNWA1+15                                              02623000
FMTWT01  EQU   FMTSNWA3                                                 02624000
FMTWT02  EQU   FMTSNWA3+2                                               02625000
FMTWT03  EQU   FMTSNWA3+4                                               02626000
FMTWT04  EQU   FMTSNWA3+83                                              02627000
FMTWT05  EQU   FMTSNWA3+85                                              02628000
FSWSAVE  EQU   FMTSNWA1+102                                             02629000
SAVER1   EQU   FSWSAVE                                                  02630000
SAVR12   EQU   FSWSAVE+4                                                02631000
VVIPTR   EQU   FSWSAVE+8                                                02632000
SRBPTR   EQU   FSWSAVE+12                                               02633000
FMTRANL  EQU   FSWSAVE+16                                               02634000
FMTTRSN  EQU   FMTRANL                                                  02635000
FMTRAN   EQU   FMTTRSN                                                  02636000
FMTRES1  EQU   FMTRAN                                                   02637000
CYLINDER EQU   FSWSAVE+25                                               02638000
CYLTRAN  EQU   CYLINDER                                                 02639000
CYLIND   EQU   CYLTRAN+1                                                02640000
CYLIND1  EQU   CYLIND                                                   02641000
GENTRAN  EQU   FSWSAVE+30                                               02642000
TRVAL3CH EQU   GENTRAN                                                  02643000
CHAR2INP EQU   TRVAL3CH                                                 02644000
CHAR2FIX EQU   CHAR2INP                                                 02645000
CHAR1INP EQU   CHAR2FIX                                                 02646000
CHAR1VAL EQU   CHAR2FIX+1                                               02647000
FIXVAL   EQU   CHAR1VAL                                                 02648000
CONVERT  EQU   FSWSAVE+35                                               02649000
I        EQU   FSWSAVE+37                                               02650000
VVICB    EQU   0                                                        02651000
VVIALCON EQU   VVICB+14                                                 02652000
VVIFLGA  EQU   VVICB+15                                                 02653000
SENS4    EQU   0                                                        02654000
SENS8    EQU   0                                                        02655000
CVTMAP   EQU   0                                                        02656000
CVTXTLER EQU   CVTMAP+44                                                02657000
CVTDAR   EQU   CVTMAP+72                                                02658000
CVTFLGS1 EQU   CVTDAR                                                   02659000
CVTDCB   EQU   CVTMAP+116                                               02660000
CVTIOQET EQU   CVTMAP+120                                               02661000
CVTIXAVL EQU   CVTMAP+124                                               02662000
CVTIERLC EQU   CVTMAP+144                                               02663000
CVTHEAD  EQU   CVTMAP+160                                               02664000
CVTSV76C EQU   CVTHEAD                                                  02665000
CVTOPTA  EQU   CVTMAP+182                                               02666000
CVTOPTB  EQU   CVTMAP+183                                               02667000
CVTGTF   EQU   CVTMAP+236                                               02668000
CVTGTFST EQU   CVTGTF                                                   02669000
CVTGTFS  EQU   CVTGTFST                                                 02670000
CVTSTATE EQU   CVTGTFST                                                 02671000
CVTTMODE EQU   CVTGTFST                                                 02672000
CVTFORM  EQU   CVTGTFST                                                 02673000
CVTAQAVT EQU   CVTMAP+240                                               02674000
CVTTCMFG EQU   CVTAQAVT                                                 02675000
CVTVOLM2 EQU   CVTMAP+244                                               02676000
CVTTATA  EQU   CVTVOLM2                                                 02677000
CVTTSKS  EQU   CVTTATA                                                  02678000
CVTVOLF2 EQU   CVTTSKS                                                  02679000
CVTTAT   EQU   CVTTATA+1                                                02680000
CVTATER  EQU   CVTMAP+248                                               02681000
CVTEXT1  EQU   CVTMAP+252                                               02682000
CVTPURG  EQU   CVTMAP+260                                               02683000
CVTQMSG  EQU   CVTMAP+268                                               02684000
CVTDMSR  EQU   CVTMAP+272                                               02685000
CVTRSV37 EQU   CVTDMSR                                                  02686000
CVTDMSRF EQU   CVTRSV37                                                 02687000
CVTERPV  EQU   CVTMAP+316                                               02688000
CVTINTLA EQU   CVTMAP+320                                               02689000
CVTAPF   EQU   CVTMAP+324                                               02690000
CVTEXT2  EQU   CVTMAP+328                                               02691000
CVTHJES  EQU   CVTMAP+332                                               02692000
CVTPGSIA EQU   CVTMAP+348                                               02693000
CVTA1F1  EQU   CVTMAP+356                                               02694000
CVTSYSK  EQU   CVTMAP+357                                               02695000
CVTVOLM1 EQU   CVTMAP+380                                               02696000
CVTVOLF1 EQU   CVTVOLM1                                                 02697000
CVTATMCT EQU   CVTMAP+388                                               02698000
CVTXTNT1 EQU   0                                                        02699000
CVTXTNT2 EQU   0                                                        02700000
CVTDSSV  EQU   CVTXTNT2                                                 02701000
CVTFLGBT EQU   CVTXTNT2+5                                               02702000
CVTQID   EQU   CVTXTNT2+24                                              02703000
CVTICB   EQU   CVTXTNT2+48                                              02704000
CVTRV400 EQU   CVTXTNT2+52                                              02705000
CVTRV409 EQU   CVTXTNT2+53                                              02706000
CVTATCVT EQU   CVTXTNT2+64                                              02707000
CVTRV429 EQU   CVTXTNT2+84                                              02708000
CVTRV438 EQU   CVTXTNT2+85                                              02709000
CVTRV457 EQU   CVTXTNT2+112                                             02710000
CVTRV466 EQU   CVTXTNT2+113                                             02711000
CVTFIX   EQU   0                                                        02712000
CVTRELNO EQU   CVTFIX+252                                               02713000
IOSB     EQU   0                                                        02714000
IOSFLA   EQU   IOSB                                                     02715000
IOSACHN  EQU   IOSFLA                                                   02716000
IOSFLB   EQU   IOSB+1                                                   02717000
IOSMSG   EQU   IOSFLB                                                   02718000
IOSLOG   EQU   IOSFLB                                                   02719000
IOSFLC   EQU   IOSB+2                                                   02720000
IOSDVALT EQU   IOSFLC                                                   02721000
IOSASID  EQU   IOSB+6                                                   02722000
IOSPKEY  EQU   IOSB+12                                                  02723000
IOSOPT   EQU   IOSB+14                                                  02724000
IOSOPT2  EQU   IOSB+15                                                  02725000
IOSUCB   EQU   IOSB+16                                                  02726000
@NM00017 EQU   IOSB+20                                                  02727000
IOSCSW   EQU   @NM00017+1                                               02728000
IOSTATUS EQU   IOSCSW+3                                                 02729000
IOSSRB   EQU   IOSB+28                                                  02730000
IOSIPIB  EQU   IOSB+44                                                  02731000
IOSERP   EQU   IOSB+52                                                  02732000
IOSPATH  EQU   IOSB+86                                                  02733000
IOSCHN   EQU   IOSPATH                                                  02734000
IOSCKEY  EQU   IOSB+89                                                  02735000
IOSEEKA  EQU   IOSB+100                                                 02736000
IOSCCHH  EQU   IOSEEKA+3                                                02737000
IOSSKHH  EQU   IOSCCHH+2                                                02738000
EWA      EQU   0                                                        02739000
EWAHDR   EQU   EWA                                                      02740000
EWAFLAGS EQU   EWA+4                                                    02741000
EWAFLG1  EQU   EWAFLAGS                                                 02742000
EWASCCD  EQU   EWAFLG1                                                  02743000
EWASCC3  EQU   EWASCCD                                                  02744000
EWAFLG2  EQU   EWAFLAGS+1                                               02745000
EWAFLG3  EQU   EWAFLAGS+2                                               02746000
EWASNSCT EQU   EWAFLAGS+3                                               02747000
EWACNTRS EQU   EWA+10                                                   02748000
EWAERPIB EQU   EWA+16                                                   02749000
EWARGFG1 EQU   EWAERPIB+4                                               02750000
EWARGFG2 EQU   EWAERPIB+5                                               02751000
EWAXCSW1 EQU   EWAERPIB+6                                               02752000
EWAXCSW2 EQU   EWAERPIB+7                                               02753000
EWAIERP  EQU   EWA+32                                                   02754000
ICB2SSCB EQU   0                                                        02755000
ICBOPT   EQU   ICB2SSCB+48                                              02756000
ICBFLG   EQU   ICB2SSCB+52                                              02757000
ICBFG1   EQU   ICBFLG                                                   02758000
ICBVVICB EQU   ICB2SSCB+76                                              02759000
ICBTRACE EQU   ICB2SSCB+148                                             02760000
UCB      EQU   0                                                        02761000
UCBOB    EQU   0                                                        02762000
UCBJBNR  EQU   UCBOB                                                    02763000
UCBFL5   EQU   UCBOB+1                                                  02764000
UCBAF    EQU   UCBFL5                                                   02765000
UCBSTAT  EQU   UCBOB+3                                                  02766000
UCBCHAN  EQU   UCBOB+4                                                  02767000
UCBSFLS  EQU   UCBOB+6                                                  02768000
UCBFLA   EQU   UCBSFLS                                                  02769000
UCBFL1   EQU   UCBFLA                                                   02770000
UCBBSY   EQU   UCBFL1                                                   02771000
UCBNRY   EQU   UCBFL1                                                   02772000
UCBPST   EQU   UCBFL1                                                   02773000
UCBCUB   EQU   UCBFL1                                                   02774000
UCBFLB   EQU   UCBSFLS+1                                                02775000
UCBCHM   EQU   UCBOB+8                                                  02776000
UCBCHM1  EQU   UCBCHM                                                   02777000
UCBPTH0  EQU   UCBCHM1                                                  02778000
UCBPTH1  EQU   UCBCHM1                                                  02779000
UCBWGT   EQU   UCBOB+12                                                 02780000
UCBTYP   EQU   UCBOB+16                                                 02781000
UCBTBYT1 EQU   UCBTYP                                                   02782000
UCB1FEA5 EQU   UCBTBYT1                                                 02783000
UCB1FEA6 EQU   UCBTBYT1                                                 02784000
UCBTBYT2 EQU   UCBTYP+1                                                 02785000
UCB2OPT2 EQU   UCBTBYT2                                                 02786000
UCBDUDN1 EQU   UCB2OPT2                                                 02787000
UCB2OPT3 EQU   UCBTBYT2                                                 02788000
UCBDUDN2 EQU   UCB2OPT3                                                 02789000
UCB2OPT4 EQU   UCBTBYT2                                                 02790000
UCBRWTAU EQU   UCB2OPT4                                                 02791000
UCB2OPT6 EQU   UCBTBYT2                                                 02792000
UCB2OPT7 EQU   UCBTBYT2                                                 02793000
UCBTBYT3 EQU   UCBTYP+2                                                 02794000
UCBDVCLS EQU   UCBTBYT3                                                 02795000
UCBTBYT4 EQU   UCBTYP+3                                                 02796000
UCBEXTPT EQU   UCBOB+20                                                 02797000
UCBFLC   EQU   UCBEXTPT                                                 02798000
UCBDEV   EQU   UCBOB+24                                                 02799000
UCBCMEXT EQU   0                                                        02800000
UCBATI   EQU   UCBCMEXT+3                                               02801000
@NM00036 EQU   UCBATI                                                   02802000
UCBFLP1  EQU   UCBCMEXT+5                                               02803000
UCBMT    EQU   0                                                        02804000
UCBOCR   EQU   0                                                        02805000
UCB3540X EQU   0                                                        02806000
UCBDKBYT EQU   UCB3540X+6                                               02807000
UCBUCS   EQU   0                                                        02808000
UCBUCSOP EQU   UCBUCS+4                                                 02809000
UCBFCBOP EQU   UCBUCS+5                                                 02810000
IOCOM    EQU   0                                                        02811000
IOCORMGT EQU   IOCOM+36                                                 02812000
SRBSECT  EQU   0                                                        02813000
SRB      EQU   SRBSECT                                                  02814000
SRBFLC   EQU   SRB+12                                                   02815000
SNSVALUE EQU   0                                                        02816000
UCBBGN   EQU   0                                                        02817000
MSG11    EQU   FMTWT03                                                  02818000
MSGID11  EQU   MSG11                                                    02819000
MSGTXT11 EQU   MSG11+14                                                 02820000
FMTSNWA2 EQU   MSGTXT11                                                 02821000
YTRAN3   EQU   CHAR1INP                                                 02822000
CVTS01   EQU   CVTPGSIA                                                 02823000
CVTLPDIA EQU   CVTS01+12                                                02824000
CVTDIRST EQU   CVTLPDIA                                                 02825000
CVTSLIDA EQU   CVTS01+24                                                02826000
CVTCTLFG EQU   CVTS01+50                                                02827000
CVTRV210 EQU   CVTS01+424                                               02828000
CVTRV219 EQU   CVTS01+425                                               02829000
CVTRV228 EQU   CVTS01+426                                               02830000
CVTRV237 EQU   CVTS01+427                                               02831000
CVTMFRTR EQU   CVTS01+452                                               02832000
CVTRV262 EQU   CVTS01+468                                               02833000
CVTRV271 EQU   CVTS01+469                                               02834000
CVTRV280 EQU   CVTS01+470                                               02835000
CVTRV289 EQU   CVTS01+471                                               02836000
CVTGSDA  EQU   CVTS01+600                                               02837000
IOSATTSC EQU   IOSIPIB                                                  02838000
IOSWTOWA EQU   IOSIPIB                                                  02839000
IOSPCISC EQU   IOSIPIB                                                  02840000
EWADDIOS EQU   EWAIERP                                                  02841000
EWASNS   EQU   EWADDIOS                                                 02842000
UCBOBS01 EQU   UCBDEV                                                   02843000
UCBSTAB  EQU   UCBOBS01+10                                              02844000
UCBBSVL  EQU   UCBSTAB                                                  02845000
UCBPRSRS EQU   UCBSTAB                                                  02846000
UCBDMCT  EQU   UCBOBS01+11                                              02847000
UCBFL4   EQU   UCBOBS01+13                                              02848000
UCBOBS02 EQU   UCBDEV                                                   02849000
UCBTFL1  EQU   UCBOBS02+19                                              02850000
UCBXTN   EQU   UCBOBS02+20                                              02851000
UCBVOPT  EQU   UCBXTN                                                   02852000
UCBOBS03 EQU   UCBDEV                                                   02853000
UCBXTADR EQU   UCBOBS03                                                 02854000
UCBOBS04 EQU   UCBDEV                                                   02855000
UCBBTA   EQU   UCBOBS04+12                                              02856000
UCBOBS06 EQU   UCBDEV                                                   02857000
UCBAOF   EQU   UCBOBS06                                                 02858000
UCBAOF1  EQU   UCBAOF                                                   02859000
UCBAOF2  EQU   UCBAOF+1                                                 02860000
@NM00035 EQU   UCBOBS06+3                                               02861000
UCBIRB   EQU   UCBOBS06+4                                               02862000
UCBGRAF  EQU   UCBIRB                                                   02863000
UCBLDNCA EQU   UCBOBS06+8                                               02864000
UCBRDYQ  EQU   UCBLDNCA                                                 02865000
UCBIRLN  EQU   UCBRDYQ                                                  02866000
UCBLDNCB EQU   UCBRDYQ+1                                                02867000
UCBCTLNK EQU   UCBOBS06+12                                              02868000
UCBOBS07 EQU   UCBDEV                                                   02869000
UCBOBS08 EQU   UCBDEV                                                   02870000
UCBOBS09 EQU   UCBDEV                                                   02871000
PSARSVTE EQU   PSARSVT                                                  02872000
MSG1     EQU   FMTWT03                                                  02873000
MSGID    EQU   MSG1                                                     02874000
MSGTEXT  EQU   MSG1+10                                                  02875000
VOL500   EQU   MSG1+23                                                  02876000
VOLVAL   EQU   MSG1+29                                                  02877000
CYL500   EQU   MSG1+35                                                  02878000
CYLVAL   EQU   MSG1+41                                                  02879000
END500   EQU   MSG1+45                                                  02880000
MSG2     EQU   FMTWT03                                                  02881000
MSGID2   EQU   MSG2                                                     02882000
MSGTXT2  EQU   MSG2+10                                                  02883000
VOL501   EQU   MSG2+34                                                  02884000
VOLVAL2  EQU   MSG2+40                                                  02885000
CSN501   EQU   MSG2+46                                                  02886000
CSNVAL2  EQU   MSG2+52                                                  02887000
END501   EQU   MSG2+64                                                  02888000
MSG2A    EQU   FMTWT03                                                  02889000
MSGID2A  EQU   MSG2A                                                    02890000
MSGTXT2A EQU   MSG2A+10                                                 02891000
MSF501A  EQU   MSG2A+34                                                 02892000
MSFVAL2A EQU   MSG2A+38                                                 02893000
XYZ501A  EQU   MSG2A+39                                                 02894000
XYZVAL2A EQU   MSG2A+45                                                 02895000
XVAL2A   EQU   XYZVAL2A                                                 02896000
YVAL2A   EQU   XYZVAL2A+3                                               02897000
ZVAL2A   EQU   XYZVAL2A+5                                               02898000
END501A  EQU   MSG2A+51                                                 02899000
MSG3     EQU   FMTWT03                                                  02900000
MSGID3   EQU   MSG3                                                     02901000
MSGTXT3  EQU   MSG3+10                                                  02902000
VOL502   EQU   MSG3+34                                                  02903000
VOLVAL3  EQU   MSG3+40                                                  02904000
CSN502   EQU   MSG3+46                                                  02905000
CSNVAL3  EQU   MSG3+52                                                  02906000
END502   EQU   MSG3+64                                                  02907000
MSG5     EQU   FMTWT03                                                  02908000
MSGID5   EQU   MSG5                                                     02909000
MSGTEXT5 EQU   MSG5+10                                                  02910000
VOL504   EQU   MSG5+38                                                  02911000
VOLVAL5  EQU   MSG5+44                                                  02912000
CSN504   EQU   MSG5+50                                                  02913000
CSNVAL5  EQU   MSG5+56                                                  02914000
END504   EQU   MSG5+68                                                  02915000
MSG5A    EQU   FMTWT03                                                  02916000
MSF504A  EQU   MSG5A+38                                                 02917000
MSFVAL5A EQU   MSG5A+42                                                 02918000
XYZ504A  EQU   MSG5A+43                                                 02919000
XYZVAL5A EQU   MSG5A+49                                                 02920000
XVAL5A   EQU   XYZVAL5A                                                 02921000
YVAL5A   EQU   XYZVAL5A+3                                               02922000
ZVAL5A   EQU   XYZVAL5A+5                                               02923000
END504A  EQU   MSG5A+55                                                 02924000
MSG5B    EQU   FMTWT03                                                  02925000
CASE504B EQU   MSG5B+38                                                 02926000
CASVAL5B EQU   MSG5B+43                                                 02927000
CASDESC  EQU   MSG5B+45                                                 02928000
MSG4     EQU   FMTWT03                                                  02929000
MSGID4   EQU   MSG4                                                     02930000
MSGTEXT4 EQU   MSG4+10                                                  02931000
SSIDVAL  EQU   MSG4+34                                                  02932000
MCTEXT   EQU   MSG4+37                                                  02933000
END503   EQU   MSG4+44                                                  02934000
MSG6     EQU   FMTWT03                                                  02935000
MSGID6   EQU   MSG6                                                     02936000
MSGTEXT6 EQU   MSG6+10                                                  02937000
SSIDVAL6 EQU   MSG6+44                                                  02938000
END505   EQU   MSG6+47                                                  02939000
MSG7     EQU   FMTWT03                                                  02940000
MSGID7   EQU   MSG7                                                     02941000
MSGTEXT7 EQU   MSG7+10                                                  02942000
END506   EQU   MSG7+42                                                  02943000
MSG8     EQU   FMTWT03                                                  02944000
MSGID8   EQU   MSG8                                                     02945000
MSGTEXT8 EQU   MSG8+10                                                  02946000
MSF507   EQU   MSG8+35                                                  02947000
MSFVAL7  EQU   MSG8+39                                                  02948000
END507   EQU   MSG8+40                                                  02949000
MSG9     EQU   FMTWT03                                                  02950000
MSGID9   EQU   MSG9                                                     02951000
MSGTEXT9 EQU   MSG9+10                                                  02952000
VOL509   EQU   MSG9+38                                                  02953000
VOLVAL9  EQU   MSG9+44                                                  02954000
CSN509   EQU   MSG9+50                                                  02955000
CSNVAL9  EQU   MSG9+56                                                  02956000
END509   EQU   MSG9+68                                                  02957000
MSG9A    EQU   FMTWT03                                                  02958000
MSF509   EQU   MSG9A+38                                                 02959000
MSFVAL9  EQU   MSG9A+42                                                 02960000
XYZ509   EQU   MSG9A+43                                                 02961000
XYZVAL9A EQU   MSG9A+49                                                 02962000
XVAL9A   EQU   XYZVAL9A                                                 02963000
YVAL9A   EQU   XYZVAL9A+3                                               02964000
ZVAL9A   EQU   XYZVAL9A+5                                               02965000
CANO     EQU   MSG9A+55                                                 02966000
CANR     EQU   CANO+8                                                   02967000
END509A  EQU   MSG9A+64                                                 02968000
MSG510A  EQU   FMTWT03                                                  02969000
MSGID51A EQU   MSG510A                                                  02970000
MSGT51A  EQU   MSG510A+8                                                02971000
STAT0    EQU   MSGT51A+13                                               02972000
STAT2    EQU   MSGT51A+29                                               02973000
STAT4    EQU   MSGT51A+45                                               02974000
STAT6    EQU   MSGT51A+61                                               02975000
MSG5116  EQU   FMTWT03                                                  02976000
MGID516  EQU   MSG5116                                                  02977000
MTXT516  EQU   MSG5116+10                                               02978000
MSG5112  EQU   FMTWT03                                                  02979000
MID5112  EQU   MSG5112                                                  02980000
MTXT5112 EQU   MSG5112+10                                               02981000
CSN5112  EQU   MTXT5112+4                                               02982000
STAT5112 EQU   MTXT5112+17                                              02983000
MSG5113  EQU   FMTWT03                                                  02984000
MID5113  EQU   MSG5113                                                  02985000
MTXT5113 EQU   MSG5113+10                                               02986000
CSN5113  EQU   MTXT5113+4                                               02987000
MSG5117  EQU   FMTWT03                                                  02988000
MID5117  EQU   MSG5117                                                  02989000
MTXT5117 EQU   MSG5117+10                                               02990000
MSG5115  EQU   FMTWT03                                                  02991000
MID5115  EQU   MSG5115                                                  02992000
MTXT5115 EQU   MSG5115+10                                               02993000
FLC      EQU   PSA                                                      02994000
*                                      START UNREFERENCED COMPONENTS    02995000
STAT5113 EQU   MTXT5113+17                                              02996000
@NM00075 EQU   MTXT5113+16                                              02997000
@NM00074 EQU   MTXT5113                                                 02998000
@NM00073 EQU   MTXT5112+16                                              02999000
@NM00072 EQU   MTXT5112                                                 03000000
@NM00071 EQU   MSGT51A+47                                               03001000
@NM00070 EQU   MSGT51A+31                                               03002000
@NM00069 EQU   MSGT51A+15                                               03003000
@NM00068 EQU   MSGT51A                                                  03004000
CATXT    EQU   CANO                                                     03005000
@NM00067 EQU   MSG9A                                                    03006000
@NM00066 EQU   MSG5B                                                    03007000
@NM00065 EQU   MSG5A                                                    03008000
PSARSAV  EQU   PSARSVTE+60                                              03009000
PSARSTK  EQU   PSARSVTE+56                                              03010000
PSAESAV3 EQU   PSARSVTE+52                                              03011000
PSAESTK3 EQU   PSARSVTE+48                                              03012000
PSAESAV2 EQU   PSARSVTE+44                                              03013000
PSAESTK2 EQU   PSARSVTE+40                                              03014000
PSAESAV1 EQU   PSARSVTE+36                                              03015000
PSAESTK1 EQU   PSARSVTE+32                                              03016000
PSAPSAV  EQU   PSARSVTE+28                                              03017000
PSAPSTK  EQU   PSARSVTE+24                                              03018000
PSAMSAV  EQU   PSARSVTE+20                                              03019000
PSAMSTK  EQU   PSARSVTE+16                                              03020000
PSASSAV  EQU   PSARSVTE+12                                              03021000
PSASSTK  EQU   PSARSVTE+8                                               03022000
PSANSTK  EQU   PSARSVTE+4                                               03023000
PSACSTK  EQU   PSARSVTE                                                 03024000
UCBRV066 EQU   UCBOBS09+4                                               03025000
UCBIOSBA EQU   UCBOBS09                                                 03026000
UCBRV042 EQU   UCBOBS08+5                                               03027000
UCBCTCF1 EQU   UCBOBS08+4                                               03028000
UCBCTCAD EQU   UCBOBS08                                                 03029000
UCBICNCB EQU   UCBOBS07+4                                               03030000
UCBRV040 EQU   UCBOBS07                                                 03031000
UCBCTLNA EQU   UCBCTLNK+1                                               03032000
UCBRLN   EQU   UCBCTLNK                                                 03033000
UCBRDYQA EQU   UCBLDNCB                                                 03034000
UCBINRLN EQU   UCBIRLN                                                  03035000
UCBIRBA  EQU   UCBIRB+1                                                 03036000
UCBRV039 EQU   UCBGRAF                                                  03037000
UCBDWNR  EQU   UCBGRAF                                                  03038000
UCBRPND  EQU   UCBGRAF                                                  03039000
UCBUPM   EQU   UCBGRAF                                                  03040000
UCBBTAM  EQU   UCBGRAF                                                  03041000
UCBDRNO  EQU   UCBGRAF                                                  03042000
UCBDRO   EQU   UCBGRAF                                                  03043000
UCBOIP   EQU   UCBGRAF                                                  03044000
UCBATRCD EQU   @NM00035                                                 03045000
UCBSKPFG EQU   @NM00035                                                 03046000
UCBRIPND EQU   @NM00035                                                 03047000
UCBRTIAC EQU   @NM00035                                                 03048000
UCBRSV79 EQU   @NM00035                                                 03049000
UCBRSV78 EQU   @NM00035                                                 03050000
UCBRSV77 EQU   @NM00035                                                 03051000
UCBOLTEP EQU   @NM00035                                                 03052000
UCBATNCT EQU   UCBOBS06+2                                               03053000
UCBRSV76 EQU   UCBAOF2                                                  03054000
UCBRSV75 EQU   UCBAOF2                                                  03055000
UCBRSV74 EQU   UCBAOF2                                                  03056000
UCBRSV73 EQU   UCBAOF2                                                  03057000
UCBRSV72 EQU   UCBAOF2                                                  03058000
UCBRSV71 EQU   UCBAOF2                                                  03059000
UCBRSV70 EQU   UCBAOF2                                                  03060000
UCBRSV69 EQU   UCBAOF2                                                  03061000
UCBRSV68 EQU   UCBAOF1                                                  03062000
UCBRSV67 EQU   UCBAOF1                                                  03063000
UCBRSV66 EQU   UCBAOF1                                                  03064000
UCBRSV65 EQU   UCBAOF1                                                  03065000
UCBRSV64 EQU   UCBAOF1                                                  03066000
UCBOFNL  EQU   UCBAOF1                                                  03067000
UCBOFSP  EQU   UCBAOF1                                                  03068000
UCBOFMCR EQU   UCBAOF1                                                  03069000
UCBBTB   EQU   UCBBTA+1                                                 03070000
UCBDI    EQU   UCBBTA                                                   03071000
UCBSNS   EQU   UCBOBS04+8                                               03072000
UCBTEB   EQU   UCBOBS04+4                                               03073000
UCBGCB   EQU   UCBOBS04+3                                               03074000
UCBOPEN  EQU   UCBOBS04+2                                               03075000
UCBSTART EQU   UCBOBS04                                                 03076000
UCBXTNB  EQU   UCBXTN+1                                                 03077000
UCBRSV22 EQU   UCBVOPT                                                  03078000
UCBRSV21 EQU   UCBVOPT                                                  03079000
UCBRSV20 EQU   UCBVOPT                                                  03080000
UCBESVE  EQU   UCBVOPT                                                  03081000
UCBERPC  EQU   UCBVOPT                                                  03082000
UCBESVC  EQU   UCBVOPT                                                  03083000
UCBEVA   EQU   UCBVOPT                                                  03084000
UCBESV   EQU   UCBVOPT                                                  03085000
UCBRV009 EQU   UCBTFL1                                                  03086000
UCBRV008 EQU   UCBTFL1                                                  03087000
UCBRV007 EQU   UCBTFL1                                                  03088000
UCBRV006 EQU   UCBTFL1                                                  03089000
UCBRV005 EQU   UCBTFL1                                                  03090000
UCBRV038 EQU   UCBTFL1                                                  03091000
UCBNSLTP EQU   UCBTFL1                                                  03092000
UCBNLTP  EQU   UCBTFL1                                                  03093000
UCBRES1B EQU   UCBOBS02+18                                              03094000
UCBFSER  EQU   UCBOBS02+12                                              03095000
@NM00034 EQU   UCBOBS02+4                                               03096000
UCBFSEQ  EQU   UCBOBS02+2                                               03097000
UCBFSCT  EQU   UCBOBS02                                                 03098000
UCBNEXP  EQU   UCBOBS01+20                                              03099000
UCBBASE  EQU   UCBOBS01+16                                              03100000
UCBRES1A EQU   UCBOBS01+15                                              03101000
UCBUSER  EQU   UCBOBS01+14                                              03102000
UCBFL47  EQU   UCBFL4                                                   03103000
UCBFL46  EQU   UCBFL4                                                   03104000
UCBFL45  EQU   UCBFL4                                                   03105000
UCBRV065 EQU   UCBFL4                                                   03106000
UCBDSS   EQU   UCBFL4                                                   03107000
UCBRV028 EQU   UCBFL4                                                   03108000
UCBWDAV  EQU   UCBFL4                                                   03109000
UCBDAVV  EQU   UCBFL4                                                   03110000
UCBSQC   EQU   UCBOBS01+12                                              03111000
UCBDATP  EQU   UCBOBS01+12                                              03112000
UCBDMC   EQU   UCBDMCT                                                  03113000
UCBMOUNT EQU   UCBDMCT                                                  03114000
UCBBNUL  EQU   UCBSTAB                                                  03115000
UCBSHAR  EQU   UCBSTAB                                                  03116000
UCBBSTR  EQU   UCBSTAB                                                  03117000
UCBBPUB  EQU   UCBSTAB                                                  03118000
UCBBPRV  EQU   UCBSTAB                                                  03119000
UCBBALB  EQU   UCBPRSRS                                                 03120000
UCBPGFL  EQU   UCBSTAB                                                  03121000
UCBDVSHR EQU   UCBBSVL                                                  03122000
UCBVOLI  EQU   UCBOBS01+4                                               03123000
UCBVTOC  EQU   UCBOBS01                                                 03124000
EWAEND   EQU   EWADDIOS+71                                              03125000
EWASCSW  EQU   EWADDIOS+64                                              03126000
IOSPCIWA EQU   IOSPCISC+44                                              03127000
IOSPCIRS EQU   IOSPCISC+8                                               03128000
@NM00022 EQU   IOSPCISC+4                                               03129000
@NM00021 EQU   IOSPCISC                                                 03130000
IOSWRNDR EQU   IOSWTOWA+4                                               03131000
IOSWTOPT EQU   IOSWTOWA+3                                               03132000
IOSWTOCP EQU   IOSWTOWA+2                                               03133000
IOSWTOCH EQU   IOSWTOWA                                                 03134000
IOSATTWA EQU   IOSATTSC+40                                              03135000
@NM00020 EQU   IOSATTSC+24                                              03136000
IOSATTSN EQU   IOSATTSC                                                 03137000
CVTRV628 EQU   CVTS01+728                                               03138000
CVTRV627 EQU   CVTS01+724                                               03139000
CVTRV626 EQU   CVTS01+720                                               03140000
CVTRV625 EQU   CVTS01+716                                               03141000
CVTRV624 EQU   CVTS01+712                                               03142000
CVTRV623 EQU   CVTS01+708                                               03143000
CVTRV622 EQU   CVTS01+704                                               03144000
CVTRV621 EQU   CVTS01+700                                               03145000
CVTIHASU EQU   CVTS01+696                                               03146000
CVTSUSP  EQU   CVTS01+692                                               03147000
CVTT6SVC EQU   CVTS01+688                                               03148000
CVTCDAL  EQU   CVTS01+684                                               03149000
CVTTCTL  EQU   CVTS01+680                                               03150000
CVTRSUME EQU   CVTS01+676                                               03151000
CVTJTERM EQU   CVTS01+672                                               03152000
CVTASMRM EQU   CVTS01+668                                               03153000
CVTTCASP EQU   CVTS01+664                                               03154000
CVT0PT03 EQU   CVTS01+660                                               03155000
CVT0PT0E EQU   CVTS01+656                                               03156000
CVTRV609 EQU   CVTS01+652                                               03157000
CVTCGK   EQU   CVTS01+648                                               03158000
CVTRAC   EQU   CVTS01+644                                               03159000
CVTHSM   EQU   CVTS01+640                                               03160000
CVTRV605 EQU   CVTS01+636                                               03161000
CVTRV604 EQU   CVTS01+632                                               03162000
CVTEFF02 EQU   CVTS01+628                                               03163000
CVTCBBR  EQU   CVTS01+624                                               03164000
CVTSSCR  EQU   CVTS01+620                                               03165000
CVTEVENT EQU   CVTS01+616                                               03166000
CVTCRCA  EQU   CVTS01+612                                               03167000
CVTTPIO  EQU   CVTS01+608                                               03168000
CVTADV   EQU   CVTS01+604                                               03169000
CVTGSDAB EQU   CVTGSDA                                                  03170000
CVTQV3   EQU   CVTS01+596                                               03171000
CVTQV2   EQU   CVTS01+592                                               03172000
CVTQV1   EQU   CVTS01+588                                               03173000
CVTRPT   EQU   CVTS01+584                                               03174000
CVTSSRB  EQU   CVTS01+580                                               03175000
CVTCSDRL EQU   CVTS01+576                                               03176000
CVTEXP1  EQU   CVTS01+572                                               03177000
CVTRMPMT EQU   CVTS01+568                                               03178000
CVTRMPTT EQU   CVTS01+564                                               03179000
CVTVPSA  EQU   CVTS01+560                                               03180000
CVTVSTOP EQU   CVTS01+556                                               03181000
CVTGTFR8 EQU   CVTS01+552                                               03182000
CVTQUIT  EQU   CVTS01+548                                               03183000
CVTVACR  EQU   CVTS01+544                                               03184000
CVTWTCB  EQU   CVTS01+540                                               03185000
CVTSTPRS EQU   CVTS01+536                                               03186000
CVT0PT02 EQU   CVTS01+532                                               03187000
CVTDARCM EQU   CVTS01+528                                               03188000
CVTIRECM EQU   CVTS01+524                                               03189000
CVTJRECM EQU   CVTS01+520                                               03190000
CVTVEMS0 EQU   CVTS01+516                                               03191000
CVTSPFRR EQU   CVTS01+512                                               03192000
CVTRLSTG EQU   CVTS01+508                                               03193000
CVT0TC0A EQU   CVTS01+504                                               03194000
CVTGMBR  EQU   CVTS01+500                                               03195000
CVTLFRM  EQU   CVTS01+496                                               03196000
CVTRMBR  EQU   CVTS01+492                                               03197000
CVTVIOP  EQU   CVTS01+488                                               03198000
CVTRV307 EQU   CVTS01+486                                               03199000
CVTRV306 EQU   CVTS01+484                                               03200000
CVTRV305 EQU   CVTS01+482                                               03201000
CVTRV304 EQU   CVTS01+480                                               03202000
CVTRV303 EQU   CVTS01+478                                               03203000
CVTRV302 EQU   CVTS01+476                                               03204000
CVTTRCA  EQU   CVTS01+472                                               03205000
CVTRV297 EQU   CVTRV289                                                 03206000
CVTRV296 EQU   CVTRV289                                                 03207000
CVTRV295 EQU   CVTRV289                                                 03208000
CVTRV294 EQU   CVTRV289                                                 03209000
CVTRV293 EQU   CVTRV289                                                 03210000
CVTRV292 EQU   CVTRV289                                                 03211000
CVTRV291 EQU   CVTRV289                                                 03212000
CVTRV290 EQU   CVTRV289                                                 03213000
CVTRV288 EQU   CVTRV280                                                 03214000
CVTRV287 EQU   CVTRV280                                                 03215000
CVTRV286 EQU   CVTRV280                                                 03216000
CVTRV285 EQU   CVTRV280                                                 03217000
CVTRV284 EQU   CVTRV280                                                 03218000
CVTRV283 EQU   CVTRV280                                                 03219000
CVTRV282 EQU   CVTRV280                                                 03220000
CVTRV281 EQU   CVTRV280                                                 03221000
CVTRV279 EQU   CVTRV271                                                 03222000
CVTRV278 EQU   CVTRV271                                                 03223000
CVTRV277 EQU   CVTRV271                                                 03224000
CVTRV276 EQU   CVTRV271                                                 03225000
CVTRV275 EQU   CVTRV271                                                 03226000
CVTRV274 EQU   CVTRV271                                                 03227000
CVTRV273 EQU   CVTRV271                                                 03228000
CVTRV272 EQU   CVTRV271                                                 03229000
CVTRV270 EQU   CVTRV262                                                 03230000
CVTRV269 EQU   CVTRV262                                                 03231000
CVTRV268 EQU   CVTRV262                                                 03232000
CVTRV267 EQU   CVTRV262                                                 03233000
CVTRV266 EQU   CVTRV262                                                 03234000
CVTRV265 EQU   CVTRV262                                                 03235000
CVTRV264 EQU   CVTRV262                                                 03236000
CVTRV263 EQU   CVTRV262                                                 03237000
CVTVFP   EQU   CVTS01+464                                               03238000
CVTVSI   EQU   CVTS01+460                                               03239000
CVTVPSIB EQU   CVTS01+456                                               03240000
CVTMFACT EQU   CVTMFRTR                                                 03241000
CVTMFCTL EQU   CVTS01+448                                               03242000
CVTPVBP  EQU   CVTS01+444                                               03243000
CVTPWI   EQU   CVTS01+440                                               03244000
CVTRV254 EQU   CVTS01+438                                               03245000
CVTRV253 EQU   CVTS01+436                                               03246000
CVTRV252 EQU   CVTS01+434                                               03247000
CVTRV251 EQU   CVTS01+433                                               03248000
CVTRV250 EQU   CVTS01+432                                               03249000
CVTRV249 EQU   CVTS01+431                                               03250000
CVTRV248 EQU   CVTS01+430                                               03251000
CVTRV247 EQU   CVTS01+429                                               03252000
CVTRV246 EQU   CVTS01+428                                               03253000
CVTRV245 EQU   CVTRV237                                                 03254000
CVTRV244 EQU   CVTRV237                                                 03255000
CVTRV243 EQU   CVTRV237                                                 03256000
CVTRV242 EQU   CVTRV237                                                 03257000
CVTRV241 EQU   CVTRV237                                                 03258000
CVTRV240 EQU   CVTRV237                                                 03259000
CVTRV239 EQU   CVTRV237                                                 03260000
CVTRV238 EQU   CVTRV237                                                 03261000
CVTRV236 EQU   CVTRV228                                                 03262000
CVTRV235 EQU   CVTRV228                                                 03263000
CVTRV234 EQU   CVTRV228                                                 03264000
CVTRV233 EQU   CVTRV228                                                 03265000
CVTRV232 EQU   CVTRV228                                                 03266000
CVTRV231 EQU   CVTRV228                                                 03267000
CVTRV230 EQU   CVTRV228                                                 03268000
CVTRV229 EQU   CVTRV228                                                 03269000
CVTRV227 EQU   CVTRV219                                                 03270000
CVTRV226 EQU   CVTRV219                                                 03271000
CVTRV225 EQU   CVTRV219                                                 03272000
CVTRV224 EQU   CVTRV219                                                 03273000
CVTRV223 EQU   CVTRV219                                                 03274000
CVTRV222 EQU   CVTRV219                                                 03275000
CVTRV221 EQU   CVTRV219                                                 03276000
CVTRV220 EQU   CVTRV219                                                 03277000
CVTRV218 EQU   CVTRV210                                                 03278000
CVTRV217 EQU   CVTRV210                                                 03279000
CVTRV216 EQU   CVTRV210                                                 03280000
CVTRV215 EQU   CVTRV210                                                 03281000
CVTRV214 EQU   CVTRV210                                                 03282000
CVTRV213 EQU   CVTRV210                                                 03283000
CVTRV212 EQU   CVTRV210                                                 03284000
CVTRV211 EQU   CVTRV210                                                 03285000
CVTLCCAT EQU   CVTS01+420                                               03286000
CVTPCCAT EQU   CVTS01+416                                               03287000
CVTIPCRP EQU   CVTS01+412                                               03288000
CVTIPCRI EQU   CVTS01+408                                               03289000
CVTIPCDS EQU   CVTS01+404                                               03290000
CVTAIDVT EQU   CVTS01+400                                               03291000
CVTSSAP  EQU   CVTS01+396                                               03292000
CVTEHCIR EQU   CVTS01+392                                               03293000
CVTEHDEF EQU   CVTS01+388                                               03294000
CVTDAIR  EQU   CVTS01+384                                               03295000
CVTPERFM EQU   CVTS01+380                                               03296000
CVT044R2 EQU   CVTS01+376                                               03297000
CVTFETCH EQU   CVTS01+372                                               03298000
CVTRSTWD EQU   CVTS01+368                                               03299000
CVTSPOST EQU   CVTS01+364                                               03300000
CVTIOBP  EQU   CVTS01+360                                               03301000
CVTASMVT EQU   CVTS01+356                                               03302000
CVTRECRQ EQU   CVTS01+352                                               03303000
CVTWSAC  EQU   CVTS01+348                                               03304000
CVTRV149 EQU   CVTS01+344                                               03305000
CVTWSAL  EQU   CVTS01+340                                               03306000
CVTSPSA  EQU   CVTS01+336                                               03307000
CVTGLMN  EQU   CVTS01+332                                               03308000
CVTVEAC0 EQU   CVTS01+328                                               03309000
CVT062R1 EQU   CVTS01+324                                               03310000
CVTRPOST EQU   CVTS01+320                                               03311000
CVTDQIQE EQU   CVTS01+316                                               03312000
CVTCSD   EQU   CVTS01+312                                               03313000
CVTLKRMA EQU   CVTS01+308                                               03314000
CVTRSPIE EQU   CVTS01+304                                               03315000
CVTRENQ  EQU   CVTS01+300                                               03316000
CVTLQCB  EQU   CVTS01+296                                               03317000
CVTFQCB  EQU   CVTS01+292                                               03318000
CVTQCS01 EQU   CVTS01+288                                               03319000
CVTAPFT  EQU   CVTS01+284                                               03320000
CVTPARRL EQU   CVTS01+280                                               03321000
CVTVWAIT EQU   CVTS01+276                                               03322000
CVTGSPL  EQU   CVTS01+272                                               03323000
CVTLSMQ  EQU   CVTS01+268                                               03324000
CVTGSMQ  EQU   CVTS01+264                                               03325000
CVTEXPRO EQU   CVTS01+260                                               03326000
CVTOPCTP EQU   CVTS01+256                                               03327000
CVTSIC   EQU   CVTS01+252                                               03328000
CVTTPIOS EQU   CVTS01+248                                               03329000
CVTRTMS  EQU   CVTS01+244                                               03330000
CVTSDBF  EQU   CVTS01+240                                               03331000
CVTSCBP  EQU   CVTS01+236                                               03332000
CVTSDMP  EQU   CVTS01+232                                               03333000
CVTSV60  EQU   CVTS01+228                                               03334000
CVTRTMCT EQU   CVTS01+224                                               03335000
CVTASCBL EQU   CVTS01+220                                               03336000
CVTASCBH EQU   CVTS01+216                                               03337000
CVTGDA   EQU   CVTS01+212                                               03338000
CVTASVT  EQU   CVTS01+208                                               03339000
CVTVVMDI EQU   CVTS01+204                                               03340000
CVTAQTOP EQU   CVTS01+200                                               03341000
CVTIOSCS EQU   CVTS01+196                                               03342000
CVTSDRM  EQU   CVTS01+192                                               03343000
CVTOPTE  EQU   CVTS01+188                                               03344000
CVTSTXU  EQU   CVTS01+184                                               03345000
CVTQUIS  EQU   CVTS01+180                                               03346000
CVTPARS  EQU   CVTS01+176                                               03347000
CVTS1EE  EQU   CVTS01+172                                               03348000
CVTFRAS  EQU   CVTS01+168                                               03349000
CVTQSAS  EQU   CVTS01+164                                               03350000
CVTCRAS  EQU   CVTS01+160                                               03351000
CVTCRMN  EQU   CVTS01+156                                               03352000
CVTDELCP EQU   CVTS01+152                                               03353000
CVTFRECL EQU   CVTS01+148                                               03354000
CVTGETCL EQU   CVTS01+144                                               03355000
CVTBLDCP EQU   CVTS01+140                                               03356000
CVTAUTHL EQU   CVTS01+136                                               03357000
CVTSCAN  EQU   CVTS01+132                                               03358000
CVTRV144 EQU   CVTS01+130                                               03359000
CVTMAXMP EQU   CVTS01+128                                               03360000
CVTSTCK  EQU   CVTS01+124                                               03361000
CVTRV139 EQU   CVTS01+123                                               03362000
CVTDSSAC EQU   CVTS01+122                                               03363000
CVTRV513 EQU   CVTS01+121                                               03364000
CVTIOSPL EQU   CVTS01+120                                               03365000
CVTPTGT  EQU   CVTS01+116                                               03366000
CVTCSPIE EQU   CVTS01+112                                               03367000
CVTSMFEX EQU   CVTS01+108                                               03368000
CVTOLT0A EQU   CVTS01+104                                               03369000
CVTSRBRT EQU   CVTS01+100                                               03370000
CVTPUTL  EQU   CVTS01+96                                                03371000
CVTASCRL EQU   CVTS01+92                                                03372000
CVTASCRF EQU   CVTS01+88                                                03373000
CVTRV326 EQU   CVTS01+84                                                03374000
CVTRV325 EQU   CVTS01+80                                                03375000
CVTRV324 EQU   CVTS01+76                                                03376000
CVT0VL01 EQU   CVTS01+72                                                03377000
CVTSHRVM EQU   CVTS01+68                                                03378000
CVTRV332 EQU   CVTS01+64                                                03379000
CVTTAS   EQU   CVTS01+60                                                03380000
CVTRSCN  EQU   CVTS01+56                                                03381000
CVTTRAC2 EQU   CVTS01+54                                                03382000
CVTTRACE EQU   CVTS01+52                                                03383000
CVTAPG   EQU   CVTS01+51                                                03384000
CVTSDTRC EQU   CVTCTLFG                                                 03385000
CVTGTRCE EQU   CVTCTLFG                                                 03386000
CVTNOMP  EQU   CVTCTLFG                                                 03387000
CVTRSV79 EQU   CVTCTLFG                                                 03388000
CVTDSTAT EQU   CVTCTLFG                                                 03389000
CVTRSV78 EQU   CVTCTLFG                                                 03390000
CVTRV333 EQU   CVTCTLFG                                                 03391000
CVTRV323 EQU   CVTCTLFG                                                 03392000
CVTSPVLK EQU   CVTS01+49                                                03393000
CVTRSV77 EQU   CVTS01+48                                                03394000
CVTRV331 EQU   CVTS01+44                                                03395000
CVTRV330 EQU   CVTS01+40                                                03396000
CVTRV329 EQU   CVTS01+36                                                03397000
CVTRV328 EQU   CVTS01+32                                                03398000
CVTRV322 EQU   CVTS01+28                                                03399000
CVTSLID  EQU   CVTSLIDA+1                                               03400000
CVTSYLK  EQU   CVTSLIDA                                                 03401000
CVTRV321 EQU   CVTS01+20                                                03402000
CVTRV320 EQU   CVTS01+16                                                03403000
CVTLPDIR EQU   CVTLPDIA+1                                               03404000
CVTRSV69 EQU   CVTDIRST                                                 03405000
CVTRSV68 EQU   CVTDIRST                                                 03406000
CVTRSV67 EQU   CVTDIRST                                                 03407000
CVTRSV66 EQU   CVTDIRST                                                 03408000
CVTRSV65 EQU   CVTDIRST                                                 03409000
CVTRSV64 EQU   CVTDIRST                                                 03410000
CVTRSV63 EQU   CVTDIRST                                                 03411000
CVTDICOM EQU   CVTDIRST                                                 03412000
CVTPVTP  EQU   CVTS01+8                                                 03413000
CVTLPDSR EQU   CVTS01+4                                                 03414000
CVTGETL  EQU   CVTS01                                                   03415000
FMTTRSN8 EQU   FMTSNWA2+56                                              03416000
FMTTRSN7 EQU   FMTSNWA2+48                                              03417000
FMTTRSN6 EQU   FMTSNWA2+40                                              03418000
FMTTRSN5 EQU   FMTSNWA2+32                                              03419000
FMTTRSN4 EQU   FMTSNWA2+24                                              03420000
FMTTRSN3 EQU   FMTSNWA2+16                                              03421000
FMTTRSN2 EQU   FMTSNWA2+8                                               03422000
FMTTRSN1 EQU   FMTSNWA2                                                 03423000
END508   EQU   MSG11+78                                                 03424000
@NM00040 EQU   SRB+40                                                   03425000
@NM00039 EQU   SRB+38                                                   03426000
SRBPRIOR EQU   SRB+37                                                   03427000
SRBPKF   EQU   SRB+36                                                   03428000
SRBSAVE  EQU   SRB+32                                                   03429000
SRBPARM  EQU   SRB+28                                                   03430000
SRBRMTR  EQU   SRB+24                                                   03431000
SRBEP    EQU   SRB+20                                                   03432000
SRBPTCB  EQU   SRBFLC+4                                                 03433000
SRBPASID EQU   SRBFLC+2                                                 03434000
SRBCPAFF EQU   SRBFLC                                                   03435000
SRBASCB  EQU   SRB+8                                                    03436000
SRBFLNK  EQU   SRB+4                                                    03437000
SRBID    EQU   SRB                                                      03438000
IOCOEND  EQU   IOCOM+128                                                03439000
IOCPATCH EQU   IOCOM+124                                                03440000
IOCUCBBM EQU   IOCOM+120                                                03441000
IOCQCNT  EQU   IOCOM+116                                                03442000
IOCIOSDQ EQU   IOCOM+112                                                03443000
IOCIOSEQ EQU   IOCOM+108                                                03444000
IOCSVCF  EQU   IOCOM+104                                                03445000
IOCTCCW  EQU   IOCOM+100                                                03446000
IOCRSVTB EQU   IOCOM+96                                                 03447000
IOCMFCNT EQU   IOCOM+92                                                 03448000
IOCMFHK  EQU   IOCOM+88                                                 03449000
IOCGENA  EQU   IOCOM+84                                                 03450000
IOCCCH   EQU   IOCOM+80                                                 03451000
IOCASYNQ EQU   IOCOM+76                                                 03452000
IOCLCHTB EQU   IOCOM+72                                                 03453000
IOCATTBL EQU   IOCOM+68                                                 03454000
IOCOMEX  EQU   IOCOM+64                                                 03455000
IOCSYNCH EQU   IOCOM+56                                                 03456000
IOCCATLK EQU   IOCOM+48                                                 03457000
IOCPRGID EQU   IOCOM+44                                                 03458000
IOCIOSCP EQU   IOCOM+40                                                 03459000
IOCVOID  EQU   IOCOM+32                                                 03460000
IOCSTIO  EQU   IOCOM+28                                                 03461000
@NM00038 EQU   IOCOM+24                                                 03462000
@NM00037 EQU   IOCOM+20                                                 03463000
IOCINT   EQU   IOCOM+16                                                 03464000
IOCCTBL  EQU   IOCOM+12                                                 03465000
IOCHIO   EQU   IOCOM+8                                                  03466000
IOCPST   EQU   IOCOM+4                                                  03467000
IOCPGCT  EQU   IOCOM+2                                                  03468000
IOCVOICT EQU   IOCOM                                                    03469000
UCBERADR EQU   UCBUCS+12                                                03470000
UCBFCBID EQU   UCBUCS+8                                                 03471000
UCBERCNT EQU   UCBUCS+7                                                 03472000
UCBRSV51 EQU   UCBUCS+6                                                 03473000
UCBRSV50 EQU   UCBFCBOP                                                 03474000
UCBRSV49 EQU   UCBFCBOP                                                 03475000
UCBRSV48 EQU   UCBFCBOP                                                 03476000
UCBRSV47 EQU   UCBFCBOP                                                 03477000
UCBRSV46 EQU   UCBFCBOP                                                 03478000
UCBRSV45 EQU   UCBFCBOP                                                 03479000
UCBRSV44 EQU   UCBFCBOP                                                 03480000
UCBFCBO1 EQU   UCBFCBOP                                                 03481000
UCBUCSPE EQU   UCBUCSOP                                                 03482000
UCBRSV43 EQU   UCBUCSOP                                                 03483000
UCBRSV42 EQU   UCBUCSOP                                                 03484000
UCBRSV41 EQU   UCBUCSOP                                                 03485000
UCBRSV40 EQU   UCBUCSOP                                                 03486000
UCBRSV39 EQU   UCBUCSOP                                                 03487000
UCBUCSO2 EQU   UCBUCSOP                                                 03488000
UCBUCSO1 EQU   UCBUCSOP                                                 03489000
UCBUCSID EQU   UCBUCS                                                   03490000
UCBRV073 EQU   UCB3540X+7                                               03491000
UCBRV072 EQU   UCBDKBYT                                                 03492000
UCBRV071 EQU   UCBDKBYT                                                 03493000
UCBRV070 EQU   UCBDKBYT                                                 03494000
UCBRV069 EQU   UCBDKBYT                                                 03495000
UCBRV068 EQU   UCBDKBYT                                                 03496000
UCBRV067 EQU   UCBDKBYT                                                 03497000
UCBVLVER EQU   UCBDKBYT                                                 03498000
UCBDKAMX EQU   UCBDKBYT                                                 03499000
UCBVLSER EQU   UCB3540X                                                 03500000
UCBRDATA EQU   UCBOCR+4                                                 03501000
UCBFRID  EQU   UCBOCR                                                   03502000
UCBCLN   EQU   UCBMT+14                                                 03503000
UCBERG   EQU   UCBMT+12                                                 03504000
UCBMS    EQU   UCBMT+11                                                 03505000
UCBNB    EQU   UCBMT+10                                                 03506000
UCBPW    EQU   UCBMT+9                                                  03507000
UCBPR    EQU   UCBMT+8                                                  03508000
UCBSIO   EQU   UCBMT+6                                                  03509000
UCBTW    EQU   UCBMT+5                                                  03510000
UCBTR    EQU   UCBMT+4                                                  03511000
UCBTWT   EQU   UCBMT+3                                                  03512000
UCBTRT   EQU   UCBMT+2                                                  03513000
UCBCTD   EQU   UCBMT                                                    03514000
UCBWTOID EQU   UCBCMEXT+17                                              03515000
UCBRV043 EQU   UCBCMEXT+16                                              03516000
UCBASID  EQU   UCBCMEXT+14                                              03517000
UCBMFCNT EQU   UCBCMEXT+12                                              03518000
UCBPMSK  EQU   UCBCMEXT+10                                              03519000
UCBCCWOF EQU   UCBCMEXT+8                                               03520000
UCBRV041 EQU   UCBCMEXT+6                                               03521000
UCBRV036 EQU   UCBFLP1                                                  03522000
UCBRV035 EQU   UCBFLP1                                                  03523000
UCBRV034 EQU   UCBFLP1                                                  03524000
UCBRV033 EQU   UCBFLP1                                                  03525000
UCBRV032 EQU   UCBFLP1                                                  03526000
UCBRV031 EQU   UCBFLP1                                                  03527000
UCBSHRUP EQU   UCBFLP1                                                  03528000
UCBNSRCH EQU   UCBFLP1                                                  03529000
UCBSNSCT EQU   UCBCMEXT+4                                               03530000
UCBHPDV  EQU   @NM00036                                                 03531000
UCBHALI  EQU   @NM00036                                                 03532000
UCBRSV09 EQU   @NM00036                                                 03533000
UCBRSV08 EQU   @NM00036                                                 03534000
UCBRSV07 EQU   @NM00036                                                 03535000
UCBRSV06 EQU   @NM00036                                                 03536000
UCBRSV05 EQU   @NM00036                                                 03537000
UCBRSV04 EQU   @NM00036                                                 03538000
UCBDTI   EQU   UCBCMEXT+2                                               03539000
UCBSTI   EQU   UCBCMEXT+1                                               03540000
UCBETI   EQU   UCBCMEXT                                                 03541000
UCBEXTP  EQU   UCBEXTPT+1                                               03542000
UCBDDRSW EQU   UCBFLC                                                   03543000
UCBTICBT EQU   UCBFLC                                                   03544000
UCBIVRR  EQU   UCBFLC                                                   03545000
UCBIVRS  EQU   UCBFLC                                                   03546000
UCBITF   EQU   UCBFLC                                                   03547000
UCBUDE   EQU   UCBFLC                                                   03548000
UCBWAA   EQU   UCBFLC                                                   03549000
UCBATTP  EQU   UCBFLC                                                   03550000
UCBUNTYP EQU   UCBTBYT4                                                 03551000
UCBRSV11 EQU   UCBDVCLS                                                 03552000
UCBRSV10 EQU   UCBDVCLS                                                 03553000
UCB3CHAR EQU   UCBDVCLS                                                 03554000
UCB3UREC EQU   UCBDVCLS                                                 03555000
UCB3DISP EQU   UCBDVCLS                                                 03556000
UCB3DACC EQU   UCBDVCLS                                                 03557000
UCB3COMM EQU   UCBDVCLS                                                 03558000
UCB3TAPE EQU   UCBDVCLS                                                 03559000
UCBDVPWR EQU   UCB2OPT7                                                 03560000
UCBVLPWR EQU   UCB2OPT6                                                 03561000
UCB2OPT5 EQU   UCBTBYT2                                                 03562000
UCBRVDEV EQU   UCBRWTAU                                                 03563000
UCBRPS   EQU   UCBDUDN2                                                 03564000
UCBRR    EQU   UCBDUDN1                                                 03565000
UCB2OPT1 EQU   UCBTBYT2                                                 03566000
UCB2OPT0 EQU   UCBTBYT2                                                 03567000
UCB1FEA7 EQU   UCBTBYT1                                                 03568000
UCBD6250 EQU   UCB1FEA6                                                 03569000
UCBD1600 EQU   UCB1FEA5                                                 03570000
UCB1FEA4 EQU   UCBTBYT1                                                 03571000
UCB1FEA3 EQU   UCBTBYT1                                                 03572000
UCB1FEA2 EQU   UCBTBYT1                                                 03573000
UCB1FEA1 EQU   UCBTBYT1                                                 03574000
UCB1FEA0 EQU   UCBTBYT1                                                 03575000
UCBNAME  EQU   UCBOB+13                                                 03576000
UCBRV029 EQU   UCBWGT                                                   03577000
UCBVHRSN EQU   UCBWGT                                                   03578000
UCBVORSN EQU   UCBWGT                                                   03579000
UCBMTPXP EQU   UCBWGT                                                   03580000
UCBREW   EQU   UCBWGT                                                   03581000
UCBPUB   EQU   UCBWGT                                                   03582000
UCBOUT   EQU   UCBWGT                                                   03583000
UCBIN    EQU   UCBWGT                                                   03584000
UCBCPU   EQU   UCBOB+11                                                 03585000
UCBLCI   EQU   UCBOB+10                                                 03586000
UCBCNT   EQU   UCBOB+9                                                  03587000
UCBRV017 EQU   UCBCHM1                                                  03588000
UCBRV016 EQU   UCBCHM1                                                  03589000
UCBRV015 EQU   UCBCHM1                                                  03590000
UCBRV014 EQU   UCBCHM1                                                  03591000
UCBSPB   EQU   UCBPTH1                                                  03592000
UCBPPB   EQU   UCBPTH1                                                  03593000
UCBSPA   EQU   UCBPTH0                                                  03594000
UCBPPA   EQU   UCBPTH0                                                  03595000
UCBFLB7  EQU   UCBFLB                                                   03596000
UCBVALPH EQU   UCBFLB                                                   03597000
UCBCRHSN EQU   UCBFLB                                                   03598000
UCBCRHRV EQU   UCBFLB                                                   03599000
UCBRESVH EQU   UCBFLB                                                   03600000
UCBSPST  EQU   UCBFLB                                                   03601000
UCBASNS  EQU   UCBFLB                                                   03602000
UCBIORST EQU   UCBFLB                                                   03603000
UCBQISCE EQU   UCBFL1                                                   03604000
UCBACTV  EQU   UCBFL1                                                   03605000
UCBSAP   EQU   UCBFL1                                                   03606000
UCBNOTRC EQU   UCBCUB                                                   03607000
UCBPSNS  EQU   UCBFL1                                                   03608000
UCBUSING EQU   UCBPST                                                   03609000
UCBNOTRD EQU   UCBNRY                                                   03610000
UCBBUSYD EQU   UCBBSY                                                   03611000
UCBUA    EQU   UCBCHAN+1                                                03612000
UCBCHA   EQU   UCBCHAN                                                  03613000
UCBDADI  EQU   UCBSTAT                                                  03614000
UCBSYSR  EQU   UCBSTAT                                                  03615000
UCBPRES  EQU   UCBSTAT                                                  03616000
UCBALOC  EQU   UCBSTAT                                                  03617000
UCBUNLD  EQU   UCBSTAT                                                  03618000
UCBRESV  EQU   UCBSTAT                                                  03619000
UCBCHGS  EQU   UCBSTAT                                                  03620000
UCBONLI  EQU   UCBSTAT                                                  03621000
UCBID    EQU   UCBOB+2                                                  03622000
UCBALTPH EQU   UCBFL5                                                   03623000
UCBALTCU EQU   UCBFL5                                                   03624000
UCBNALOC EQU   UCBFL5                                                   03625000
UCBENVRD EQU   UCBFL5                                                   03626000
UCBVSDR  EQU   UCBFL5                                                   03627000
UCBSASK  EQU   UCBFL5                                                   03628000
UCBAMV   EQU   UCBAF                                                    03629000
UCBDCC   EQU   UCBFL5                                                   03630000
UCBMONT  EQU   UCBJBNR                                                  03631000
UCBRV011 EQU   UCBJBNR                                                  03632000
UCBRSV02 EQU   UCBJBNR                                                  03633000
UCBOLDSM EQU   UCBJBNR                                                  03634000
UCBRV003 EQU   UCBJBNR                                                  03635000
UCBRV002 EQU   UCBJBNR                                                  03636000
UCBJES3  EQU   UCBJBNR                                                  03637000
UCBVRDEV EQU   UCBJBNR                                                  03638000
UCBCMSEG EQU   UCBOB                                                    03639000
UCBPFXND EQU   UCB+512                                                  03640000
UCBIOQ   EQU   UCB+508                                                  03641000
UCBLOCK  EQU   UCB+504                                                  03642000
UCBPXST  EQU   UCB+504                                                  03643000
@NM00033 EQU   UCB                                                      03644000
ICBLORD  EQU   ICBTRACE+256                                             03645000
ICBOTRC  EQU   ICBTRACE                                                 03646000
ICBRESV  EQU   ICB2SSCB+128                                             03647000
ICBVOLST EQU   ICB2SSCB+124                                             03648000
ICBVSCRA EQU   ICB2SSCB+120                                             03649000
ICBSAMP  EQU   ICB2SSCB+118                                             03650000
ICBRESVD EQU   ICB2SSCB+117                                             03651000
ICBCPUID EQU   ICB2SSCB+112                                             03652000
ICBFAB   EQU   ICB2SSCB+108                                             03653000
ICBMSSC  EQU   ICB2SSCB+104                                             03654000
ICBRSVP  EQU   ICB2SSCB+100                                             03655000
ICBAEAP  EQU   ICB2SSCB+96                                              03656000
ICBSIOBP EQU   ICB2SSCB+92                                              03657000
ICBIATNA EQU   ICB2SSCB+88                                              03658000
ICBIPRGA EQU   ICB2SSCB+84                                              03659000
ICBSRBP  EQU   ICB2SSCB+80                                              03660000
ICBVVIC  EQU   ICB2SSCB+72                                              03661000
ICBSIOP  EQU   ICB2SSCB+68                                              03662000
ICBMEP   EQU   ICB2SSCB+64                                              03663000
ICBIORCI EQU   ICB2SSCB+60                                              03664000
ICB2ACTP EQU   ICB2SSCB+56                                              03665000
ICBFG3   EQU   ICBFLG+2                                                 03666000
ICBFG2   EQU   ICBFLG+1                                                 03667000
@NM00032 EQU   ICBFG1                                                   03668000
ICBMSCA  EQU   ICBFG1                                                   03669000
ICBMSCMP EQU   ICBFG1                                                   03670000
ICBS     EQU   ICBFG1                                                   03671000
ICBB     EQU   ICBFG1                                                   03672000
ICBV     EQU   ICBFG1                                                   03673000
ICBR     EQU   ICBFG1                                                   03674000
ICBI     EQU   ICBFG1                                                   03675000
ICBNVT   EQU   ICBOPT                                                   03676000
ICBVN02P EQU   ICB2SSCB+44                                              03677000
ICBTCB   EQU   ICB2SSCB+40                                              03678000
ICBQHEAD EQU   ICB2SSCB+36                                              03679000
ICBAUCB  EQU   ICB2SSCB+32                                              03680000
ICBPUCB  EQU   ICB2SSCB+28                                              03681000
ICBCOMQ  EQU   ICB2SSCB+24                                              03682000
ICBIOR   EQU   ICB2SSCB+20                                              03683000
ICBCOM   EQU   ICB2SSCB+16                                              03684000
ICBACTV  EQU   ICB2SSCB+12                                              03685000
ICBECB   EQU   ICB2SSCB+8                                               03686000
ICBSSNAM EQU   ICB2SSCB                                                 03687000
EWADDISP EQU   EWA+29                                                   03688000
EWADCNT  EQU   EWA+28                                                   03689000
EWACPU   EQU   EWA+27                                                   03690000
@NM00031 EQU   EWA+26                                                   03691000
EWACHA   EQU   EWA+24                                                   03692000
EWACSEQ  EQU   EWAXCSW2                                                 03693000
EWACDIN  EQU   EWAXCSW2                                                 03694000
@NM00030 EQU   EWAXCSW2                                                 03695000
EWACTEC  EQU   EWAXCSW2                                                 03696000
EWACDAV  EQU   EWAXCSW1                                                 03697000
EWACCHV  EQU   EWAXCSW1                                                 03698000
EWACCMD  EQU   EWAXCSW1                                                 03699000
EWACUNS  EQU   EWAXCSW1                                                 03700000
EWACSQV  EQU   EWAXCSW1                                                 03701000
@NM00029 EQU   EWAXCSW1                                                 03702000
EWACITF  EQU   EWAXCSW1                                                 03703000
@NM00028 EQU   EWARGFG2                                                 03704000
EWACCUE  EQU   EWARGFG2                                                 03705000
EWACSTG  EQU   EWARGFG2                                                 03706000
EWACSCU  EQU   EWARGFG2                                                 03707000
EWACCHA  EQU   EWARGFG2                                                 03708000
EWACCPU  EQU   EWARGFG2                                                 03709000
EWANORTY EQU   EWARGFG1                                                 03710000
EWACCNT  EQU   EWARGFG1                                                 03711000
EWACSNS  EQU   EWARGFG1                                                 03712000
@NM00027 EQU   EWARGFG1                                                 03713000
EWACHIO  EQU   EWARGFG1                                                 03714000
EWACTIO  EQU   EWARGFG1                                                 03715000
EWACINT  EQU   EWARGFG1                                                 03716000
EWACSIO  EQU   EWARGFG1                                                 03717000
EWAUCB   EQU   EWAERPIB+1                                               03718000
@NM00026 EQU   EWAERPIB                                                 03719000
EWASTUP  EQU   EWA+14                                                   03720000
EWACNTR4 EQU   EWACNTRS+3                                               03721000
EWACNTR3 EQU   EWACNTRS+2                                               03722000
EWACNTR2 EQU   EWACNTRS+1                                               03723000
EWACNTR1 EQU   EWACNTRS                                                 03724000
EWASSTAT EQU   EWA+8                                                    03725000
EWASCTMX EQU   EWASNSCT                                                 03726000
@NM00025 EQU   EWASNSCT                                                 03727000
EWAJAM   EQU   EWAFLG3                                                  03728000
@NM00024 EQU   EWAFLG2                                                  03729000
EWADIR   EQU   EWAFLG2                                                  03730000
EWACOVF  EQU   EWAFLG2                                                  03731000
EWAWTEMP EQU   EWAFLG2                                                  03732000
EWAMDR   EQU   EWAFLG2                                                  03733000
EWABDSNS EQU   EWAFLG1                                                  03734000
EWADDMSG EQU   EWAFLG1                                                  03735000
EWASCC1  EQU   EWASCC3                                                  03736000
EWASCC2  EQU   EWASCC3                                                  03737000
@NM00023 EQU   EWAFLG1                                                  03738000
EWASLIS  EQU   EWAFLG1                                                  03739000
EWAEXT   EQU   EWAHDR                                                   03740000
IOSEND   EQU   IOSB+108                                                 03741000
IOSSKR   EQU   IOSEEKA+7                                                03742000
IOSSKH2  EQU   IOSSKHH+1                                                03743000
IOSSKH1  EQU   IOSSKHH                                                  03744000
IOSSKCC  EQU   IOSCCHH                                                  03745000
IOSSKBB  EQU   IOSEEKA+1                                                03746000
IOSSKM   EQU   IOSEEKA                                                  03747000
IOSEEK   EQU   IOSB+92                                                  03748000
IOSMDM   EQU   IOSB+91                                                  03749000
IOSMDB   EQU   IOSB+90                                                  03750000
IOSCKEY7 EQU   IOSCKEY                                                  03751000
IOSCKEY6 EQU   IOSCKEY                                                  03752000
IOSCKEY5 EQU   IOSCKEY                                                  03753000
IOSCKEY4 EQU   IOSCKEY                                                  03754000
@NM00019 EQU   IOSCKEY                                                  03755000
IOSFMSK  EQU   IOSB+88                                                  03756000
IOSCUDEV EQU   IOSPATH+1                                                03757000
@NM00018 EQU   IOSCHN                                                   03758000
IOSPATH3 EQU   IOSCHN                                                   03759000
IOSPATH2 EQU   IOSCHN                                                   03760000
IOSEXP   EQU   IOSCHN                                                   03761000
IOSGDP   EQU   IOSCHN                                                   03762000
IOSAFF   EQU   IOSB+85                                                  03763000
IOSRSS1B EQU   IOSB+84                                                  03764000
IOSDSID  EQU   IOSB+80                                                  03765000
IOSVST   EQU   IOSB+76                                                  03766000
IOSRST   EQU   IOSB+72                                                  03767000
IOSDIE   EQU   IOSB+68                                                  03768000
IOSABN   EQU   IOSB+64                                                  03769000
IOSNRM   EQU   IOSB+60                                                  03770000
IOSPCI   EQU   IOSB+56                                                  03771000
IOSPCHN  EQU   IOSB+48                                                  03772000
IOSSNS   EQU   IOSB+42                                                  03773000
IOSAPMSK EQU   IOSB+40                                                  03774000
IOSRES4A EQU   IOSB+36                                                  03775000
IOSUSE   EQU   IOSB+32                                                  03776000
IOSCSWRC EQU   IOSCSW+5                                                 03777000
IOSTSB   EQU   IOSTATUS+1                                               03778000
IOSTSA   EQU   IOSTATUS                                                 03779000
IOSCSWCA EQU   IOSCSW                                                   03780000
IOSCC    EQU   @NM00017                                                 03781000
IOSOPT2X EQU   IOSOPT2                                                  03782000
IOSIGP   EQU   IOSOPT2                                                  03783000
IOSHTP   EQU   IOSOPT2                                                  03784000
IOSRELSE EQU   IOSOPT                                                   03785000
IOSAPR   EQU   IOSOPT                                                   03786000
IOSTSLL  EQU   IOSOPT                                                   03787000
IOSNERP  EQU   IOSOPT                                                   03788000
IOSPSLL  EQU   IOSOPT                                                   03789000
IOSQISCE EQU   IOSOPT                                                   03790000
IOSDEP   EQU   IOSOPT                                                   03791000
IOSBYP   EQU   IOSOPT                                                   03792000
IOSCOD   EQU   IOSB+13                                                  03793000
IOSPKY7  EQU   IOSPKEY                                                  03794000
IOSPGDPX EQU   IOSPKEY                                                  03795000
IOSIDR   EQU   IOSPKEY                                                  03796000
IOSLCL   EQU   IOSPKEY                                                  03797000
@NM00016 EQU   IOSPKEY                                                  03798000
IOSPGAD  EQU   IOSB+8                                                   03799000
IOSPRLVL EQU   IOSB+5                                                   03800000
IOSDVRID EQU   IOSB+4                                                   03801000
IOSPROC  EQU   IOSB+3                                                   03802000
IOSFLC7  EQU   IOSFLC                                                   03803000
IOSCTCNR EQU   IOSFLC                                                   03804000
IOSRWAIT EQU   IOSFLC                                                   03805000
IOSTP    EQU   IOSFLC                                                   03806000
IOSCC3WE EQU   IOSFLC                                                   03807000
IOSVERIF EQU   IOSDVALT                                                 03808000
IOSDVMNT EQU   IOSFLC                                                   03809000
IOSBDCST EQU   IOSFLB                                                   03810000
IOSFLB4  EQU   IOSFLB                                                   03811000
IOSFLB3  EQU   IOSFLB                                                   03812000
IOSNOTRS EQU   IOSFLB                                                   03813000
IOSSDR   EQU   IOSFLB                                                   03814000
IOSDIESE EQU   IOSFLB                                                   03815000
IOSIOSB  EQU   IOSFLA                                                   03816000
IOSDOM   EQU   IOSFLA                                                   03817000
IOSEX    EQU   IOSFLA                                                   03818000
IOSSMDB  EQU   IOSFLA                                                   03819000
IOSSMDA  EQU   IOSFLA                                                   03820000
IOSERR   EQU   IOSFLA                                                   03821000
IOSCCHN  EQU   IOSACHN                                                  03822000
IOSDCHN  EQU   IOSACHN                                                  03823000
CVTLEVL  EQU   CVTRELNO+2                                               03824000
CVTNUMB  EQU   CVTRELNO                                                 03825000
CVTMDL   EQU   CVTFIX+250                                               03826000
@NM00015 EQU   CVTFIX+248                                               03827000
@NM00014 EQU   CVTFIX                                                   03828000
CVTRV482 EQU   CVTXTNT2+128                                             03829000
CVTRV481 EQU   CVTXTNT2+124                                             03830000
CVTRV480 EQU   CVTXTNT2+120                                             03831000
CVTRV479 EQU   CVTXTNT2+118                                             03832000
CVTRV478 EQU   CVTXTNT2+117                                             03833000
CVTRV477 EQU   CVTXTNT2+116                                             03834000
CVTRV476 EQU   CVTXTNT2+115                                             03835000
CVTRV475 EQU   CVTXTNT2+114                                             03836000
CVTRV474 EQU   CVTRV466                                                 03837000
CVTRV473 EQU   CVTRV466                                                 03838000
CVTRV472 EQU   CVTRV466                                                 03839000
CVTRV471 EQU   CVTRV466                                                 03840000
CVTRV470 EQU   CVTRV466                                                 03841000
CVTRV469 EQU   CVTRV466                                                 03842000
CVTRV468 EQU   CVTRV466                                                 03843000
CVTRV467 EQU   CVTRV466                                                 03844000
CVTRV465 EQU   CVTRV457                                                 03845000
CVTRV464 EQU   CVTRV457                                                 03846000
CVTRV463 EQU   CVTRV457                                                 03847000
CVTRV462 EQU   CVTRV457                                                 03848000
CVTRV461 EQU   CVTRV457                                                 03849000
CVTRV460 EQU   CVTRV457                                                 03850000
CVTRV459 EQU   CVTRV457                                                 03851000
CVTRV458 EQU   CVTRV457                                                 03852000
CVTRV456 EQU   CVTXTNT2+108                                             03853000
CVTRV455 EQU   CVTXTNT2+104                                             03854000
CVTRV454 EQU   CVTXTNT2+100                                             03855000
CVTRV453 EQU   CVTXTNT2+96                                              03856000
CVTRV452 EQU   CVTXTNT2+94                                              03857000
CVTRV451 EQU   CVTXTNT2+92                                              03858000
CVTRV450 EQU   CVTXTNT2+90                                              03859000
CVTRV449 EQU   CVTXTNT2+88                                              03860000
CVTRV448 EQU   CVTXTNT2+87                                              03861000
CVTRV447 EQU   CVTXTNT2+86                                              03862000
CVTRV446 EQU   CVTRV438                                                 03863000
CVTRV445 EQU   CVTRV438                                                 03864000
CVTRV444 EQU   CVTRV438                                                 03865000
CVTRV443 EQU   CVTRV438                                                 03866000
CVTRV442 EQU   CVTRV438                                                 03867000
CVTRV441 EQU   CVTRV438                                                 03868000
CVTRV440 EQU   CVTRV438                                                 03869000
CVTRV439 EQU   CVTRV438                                                 03870000
CVTRV437 EQU   CVTRV429                                                 03871000
CVTRV436 EQU   CVTRV429                                                 03872000
CVTRV435 EQU   CVTRV429                                                 03873000
CVTRV434 EQU   CVTRV429                                                 03874000
CVTRV433 EQU   CVTRV429                                                 03875000
CVTRV432 EQU   CVTRV429                                                 03876000
CVTRV431 EQU   CVTRV429                                                 03877000
CVTRV430 EQU   CVTRV429                                                 03878000
CVTRV428 EQU   CVTXTNT2+80                                              03879000
CVTRV427 EQU   CVTXTNT2+76                                              03880000
CVTRV426 EQU   CVTXTNT2+72                                              03881000
CVTRV425 EQU   CVTXTNT2+68                                              03882000
CVTATACT EQU   CVTATCVT                                                 03883000
CVTRV423 EQU   CVTXTNT2+62                                              03884000
CVTRV422 EQU   CVTXTNT2+60                                              03885000
CVTRV421 EQU   CVTXTNT2+58                                              03886000
CVTRV420 EQU   CVTXTNT2+56                                              03887000
CVTRV419 EQU   CVTXTNT2+55                                              03888000
CVTRV418 EQU   CVTXTNT2+54                                              03889000
CVTRV417 EQU   CVTRV409                                                 03890000
CVTRV416 EQU   CVTRV409                                                 03891000
CVTRV415 EQU   CVTRV409                                                 03892000
CVTRV414 EQU   CVTRV409                                                 03893000
CVTRV413 EQU   CVTRV409                                                 03894000
CVTRV412 EQU   CVTRV409                                                 03895000
CVTRV411 EQU   CVTRV409                                                 03896000
CVTRV410 EQU   CVTRV409                                                 03897000
CVTRV408 EQU   CVTRV400                                                 03898000
CVTRV407 EQU   CVTRV400                                                 03899000
CVTRV406 EQU   CVTRV400                                                 03900000
CVTRV405 EQU   CVTRV400                                                 03901000
CVTRV404 EQU   CVTRV400                                                 03902000
CVTRV403 EQU   CVTRV400                                                 03903000
CVTRV402 EQU   CVTRV400                                                 03904000
CVTRV401 EQU   CVTRV400                                                 03905000
CVTSKTA  EQU   CVTXTNT2+44                                              03906000
CVTCCVT  EQU   CVTXTNT2+40                                              03907000
CVTRSV98 EQU   CVTXTNT2+36                                              03908000
CVTRSV97 EQU   CVTXTNT2+34                                              03909000
CVTRSV96 EQU   CVTXTNT2+32                                              03910000
CVTOLTEP EQU   CVTXTNT2+28                                              03911000
CVTQIDA  EQU   CVTQID+1                                                 03912000
CVTRSV95 EQU   CVTQID                                                   03913000
CVTRSV94 EQU   CVTXTNT2+20                                              03914000
CVTRSV93 EQU   CVTXTNT2+16                                              03915000
CVTRSV92 EQU   CVTXTNT2+12                                              03916000
CVTDEBVR EQU   CVTXTNT2+8                                               03917000
CVTRSV91 EQU   CVTXTNT2+6                                               03918000
CVTRSV9H EQU   CVTFLGBT                                                 03919000
CVTRSV9G EQU   CVTFLGBT                                                 03920000
CVTRSV9F EQU   CVTFLGBT                                                 03921000
CVTRSV9E EQU   CVTFLGBT                                                 03922000
CVTRSV9D EQU   CVTFLGBT                                                 03923000
CVTRSV9C EQU   CVTFLGBT                                                 03924000
CVTVME   EQU   CVTFLGBT                                                 03925000
CVTNPE   EQU   CVTFLGBT                                                 03926000
CVTNUCLS EQU   CVTXTNT2+4                                               03927000
CVTDSSVA EQU   CVTDSSV+1                                                03928000
CVTRSV89 EQU   CVTDSSV                                                  03929000
CVTRSV88 EQU   CVTXTNT1+8                                               03930000
CVTRSV87 EQU   CVTXTNT1+4                                               03931000
CVTFACHN EQU   CVTXTNT1                                                 03932000
CVTRV488 EQU   CVTMAP+412                                               03933000
CVTRV487 EQU   CVTMAP+408                                               03934000
CVTRV486 EQU   CVTMAP+404                                               03935000
CVTRV485 EQU   CVTMAP+400                                               03936000
CVTACTAP EQU   CVTMAP+396                                               03937000
CVTAUTH  EQU   CVTMAP+392                                               03938000
CVTATMCA EQU   CVTATMCT+1                                               03939000
CVTATMST EQU   CVTATMCT                                                 03940000
CVTRSV61 EQU   CVTMAP+384                                               03941000
CVTVOLT1 EQU   CVTVOLM1+1                                               03942000
CVTVOLI1 EQU   CVTVOLF1                                                 03943000
CVTSTOA  EQU   CVTMAP+376                                               03944000
CVTRSV58 EQU   CVTMAP+374                                               03945000
CVTRSV57 EQU   CVTMAP+372                                               03946000
CVTDDCE  EQU   CVTMAP+368                                               03947000
CVTPNWFR EQU   CVTMAP+364                                               03948000
CVTSMF   EQU   CVTMAP+360                                               03949000
CVTSULK  EQU   CVTMAP+358                                               03950000
CVTSLKO  EQU   CVTSYSK                                                  03951000
CVTSLKP  EQU   CVTSYSK                                                  03952000
CVTSLKQ  EQU   CVTSYSK                                                  03953000
CVTSLKR  EQU   CVTSYSK                                                  03954000
CVTRSV56 EQU   CVTSYSK                                                  03955000
CVTRSV55 EQU   CVTSYSK                                                  03956000
CVTRSV54 EQU   CVTSYSK                                                  03957000
CVTRSV53 EQU   CVTSYSK                                                  03958000
CVTRSV52 EQU   CVTA1F1                                                  03959000
CVTRSV51 EQU   CVTA1F1                                                  03960000
CVTRSV50 EQU   CVTA1F1                                                  03961000
CVTRSV49 EQU   CVTA1F1                                                  03962000
CVTRSV48 EQU   CVTA1F1                                                  03963000
CVTRSV47 EQU   CVTA1F1                                                  03964000
CVTSRSW  EQU   CVTA1F1                                                  03965000
CVTPFSW  EQU   CVTA1F1                                                  03966000
CVTPCVT  EQU   CVTMAP+352                                               03967000
CVTRSV46 EQU   CVTMAP+344                                               03968000
CVTRSV45 EQU   CVTMAP+340                                               03969000
CVTRSV44 EQU   CVTMAP+338                                               03970000
CVTRSV43 EQU   CVTMAP+336                                               03971000
CVTHJESA EQU   CVTHJES+1                                                03972000
CVTRSV42 EQU   CVTHJES                                                  03973000
CVTEXT2A EQU   CVTEXT2+1                                                03974000
CVTRSV41 EQU   CVTEXT2                                                  03975000
CVTAPFA  EQU   CVTAPF+1                                                 03976000
CVTRSV40 EQU   CVTAPF                                                   03977000
CVTRV518 EQU   CVTINTLA                                                 03978000
CVTRV517 EQU   CVTERPV                                                  03979000
CVTEORM  EQU   CVTMAP+312                                               03980000
CVTMCHPR EQU   CVTMAP+308                                               03981000
CVTTZ    EQU   CVTMAP+304                                               03982000
CVTJEPS  EQU   CVTMAP+300                                               03983000
CVTJESCT EQU   CVTMAP+296                                               03984000
CVTMODE  EQU   CVTMAP+292                                               03985000
CVTPTRV  EQU   CVTMAP+288                                               03986000
CVTREAL  EQU   CVTMAP+284                                               03987000
CVTRSV39 EQU   CVTMAP+280                                               03988000
CVTRSV38 EQU   CVTMAP+276                                               03989000
CVTDMSRA EQU   CVTDMSR+1                                                03990000
CVTRV634 EQU   CVTDMSRF                                                 03991000
CVTRV633 EQU   CVTDMSRF                                                 03992000
CVTRV632 EQU   CVTDMSRF                                                 03993000
CVTRV631 EQU   CVTDMSRF                                                 03994000
CVTRV630 EQU   CVTDMSRF                                                 03995000
CVTRV629 EQU   CVTDMSRF                                                 03996000
CVTUDUMP EQU   CVTDMSRF                                                 03997000
CVTSDUMP EQU   CVTDMSRF                                                 03998000
CVTQMSGA EQU   CVTQMSG+1                                                03999000
CVTRSV36 EQU   CVTQMSG                                                  04000000
CVTAMFF  EQU   CVTMAP+264                                               04001000
CVTPURGA EQU   CVTPURG+1                                                04002000
CVTRSV35 EQU   CVTPURG                                                  04003000
CVTCBSP  EQU   CVTMAP+256                                               04004000
CVTATERA EQU   CVTATER+1                                                04005000
CVTSYST  EQU   CVTATER                                                  04006000
CVTVOLT2 EQU   CVTTAT                                                   04007000
CVTVOLI2 EQU   CVTVOLF2                                                 04008000
CVTAQAVB EQU   CVTAQAVT+1                                               04009000
CVTRSV34 EQU   CVTTCMFG                                                 04010000
CVTRSV33 EQU   CVTTCMFG                                                 04011000
CVTRSV32 EQU   CVTTCMFG                                                 04012000
CVTRSV31 EQU   CVTTCMFG                                                 04013000
CVTRSV30 EQU   CVTTCMFG                                                 04014000
CVTRSV29 EQU   CVTTCMFG                                                 04015000
CVTLDEV  EQU   CVTTCMFG                                                 04016000
CVTTCRDY EQU   CVTTCMFG                                                 04017000
CVTGTFA  EQU   CVTGTF+1                                                 04018000
CVTRSV27 EQU   CVTGTFST                                                 04019000
CVTRNIO  EQU   CVTGTFST                                                 04020000
CVTUSR   EQU   CVTGTFST                                                 04021000
CVTRV318 EQU   CVTFORM                                                  04022000
CVTRV317 EQU   CVTTMODE                                                 04023000
CVTRV316 EQU   CVTSTATE                                                 04024000
CVTRV315 EQU   CVTGTFS                                                  04025000
CVTGTFAV EQU   CVTGTFS                                                  04026000
CVT0SCR1 EQU   CVTMAP+232                                               04027000
CVTRV515 EQU   CVTMAP+228                                               04028000
CVTRMS   EQU   CVTMAP+224                                               04029000
CVTPATCH EQU   CVTMAP+220                                               04030000
CVTTSCE  EQU   CVTMAP+216                                               04031000
CVTLNKSC EQU   CVTMAP+214                                               04032000
CVTQABST EQU   CVTMAP+212                                               04033000
CVTMDLDS EQU   CVTMAP+208                                               04034000
CVTUSER  EQU   CVTMAP+204                                               04035000
CVTABEND EQU   CVTMAP+200                                               04036000
CVTSMCA  EQU   CVTMAP+196                                               04037000
CVTRSV18 EQU   CVTMAP+192                                               04038000
CVTQLPAQ EQU   CVTMAP+188                                               04039000
CVTQCDSR EQU   CVTMAP+184                                               04040000
CVTRSV17 EQU   CVTOPTB                                                  04041000
CVTRSV16 EQU   CVTOPTB                                                  04042000
CVTFP    EQU   CVTOPTB                                                  04043000
CVTAPTHR EQU   CVTOPTB                                                  04044000
CVTNLOG  EQU   CVTOPTB                                                  04045000
CVTTOD   EQU   CVTOPTB                                                  04046000
CVTCTIMS EQU   CVTOPTB                                                  04047000
CVTPROT  EQU   CVTOPTB                                                  04048000
CVTXPFP  EQU   CVTOPTA                                                  04049000
CVTASCII EQU   CVTOPTA                                                  04050000
CVTRSV13 EQU   CVTOPTA                                                  04051000
CVTRSV12 EQU   CVTOPTA                                                  04052000
CVTNIP   EQU   CVTOPTA                                                  04053000
CVTDDR   EQU   CVTOPTA                                                  04054000
CVTAPR   EQU   CVTOPTA                                                  04055000
CVTCCH   EQU   CVTOPTA                                                  04056000
CVTSNCTR EQU   CVTMAP+180                                               04057000
CVTQMWR  EQU   CVTMAP+176                                               04058000
CVTQOCR  EQU   CVTMAP+172                                               04059000
CVT1EF00 EQU   CVTMAP+168                                               04060000
CVTMZ00  EQU   CVTMAP+164                                               04061000
CVTSV76Q EQU   CVTSV76C                                                 04062000
CVTRSV11 EQU   CVTMAP+156                                               04063000
CVT0PT01 EQU   CVTMAP+152                                               04064000
CVTMSER  EQU   CVTMAP+148                                               04065000
CVTRV516 EQU   CVTIERLC                                                 04066000
CVTILCH  EQU   CVTMAP+140                                               04067000
CVT0DS   EQU   CVTMAP+136                                               04068000
CVTFBOSV EQU   CVTMAP+132                                               04069000
CVTNUCB  EQU   CVTMAP+128                                               04070000
CVTSV76M EQU   CVTIOQET                                                 04071000
CVTDCBA  EQU   CVTMAP+117                                               04072000
CVTMVS2  EQU   CVTDCB                                                   04073000
CVT6DAT  EQU   CVTDCB                                                   04074000
CVT4MPS  EQU   CVTDCB                                                   04075000
CVTRSV09 EQU   CVTDCB                                                   04076000
CVT4MS1  EQU   CVTDCB                                                   04077000
CVT2SPS  EQU   CVTDCB                                                   04078000
CVT1SSS  EQU   CVTDCB                                                   04079000
CVTRSV08 EQU   CVTDCB                                                   04080000
CVTSTB   EQU   CVTMAP+112                                               04081000
CVTQTD00 EQU   CVTMAP+108                                               04082000
CVTQTE00 EQU   CVTMAP+104                                               04083000
CVTCUCB  EQU   CVTMAP+100                                               04084000
CVTSJQ   EQU   CVTMAP+96                                                04085000
CVTPBLDL EQU   CVTMAP+92                                                04086000
CVTTPC   EQU   CVTMAP+88                                                04087000
CVTSVDCB EQU   CVTMAP+84                                                04088000
CVTBRET  EQU   CVTMAP+82                                                04089000
CVTEXIT  EQU   CVTMAP+80                                                04090000
CVT0FN00 EQU   CVTMAP+76                                                04091000
CVTDARA  EQU   CVTDAR+1                                                 04092000
CVTRSV07 EQU   CVTFLGS1                                                 04093000
CVTRSV06 EQU   CVTFLGS1                                                 04094000
CVTRSV05 EQU   CVTFLGS1                                                 04095000
CVTRSV04 EQU   CVTFLGS1                                                 04096000
CVTRSV03 EQU   CVTFLGS1                                                 04097000
CVTRSV02 EQU   CVTFLGS1                                                 04098000
CVTRSV01 EQU   CVTFLGS1                                                 04099000
CVTDMPLK EQU   CVTFLGS1                                                 04100000
CVTXITP  EQU   CVTMAP+68                                                04101000
CVTZDTAB EQU   CVTMAP+64                                                04102000
CVTMSLT  EQU   CVTMAP+60                                                04103000
CVTDATE  EQU   CVTMAP+56                                                04104000
CVTBTERM EQU   CVTMAP+52                                                04105000
CVTSYSAD EQU   CVTMAP+48                                                04106000
CVTILK2  EQU   CVTMAP+40                                                04107000
CVTILK1  EQU   CVTMAP+36                                                04108000
CVTPRLTV EQU   CVTMAP+32                                                04109000
CVTPCNVT EQU   CVTMAP+28                                                04110000
CVT0VL00 EQU   CVTMAP+24                                                04111000
CVTXAPG  EQU   CVTMAP+20                                                04112000
CVTBUF   EQU   CVTMAP+16                                                04113000
CVTJOB   EQU   CVTMAP+12                                                04114000
CVTLINK  EQU   CVTMAP+8                                                 04115000
CVT0EF00 EQU   CVTMAP+4                                                 04116000
CVTTCBP  EQU   CVTMAP                                                   04117000
CVT      EQU   CVTMAP                                                   04118000
VVIUNUSD EQU   VVICB+116                                                04119000
VVINUSDC EQU   VVICB+112                                                04120000
VVITPFCH EQU   VVICB+108                                                04121000
VVIDVMEL EQU   VVICB+104                                                04122000
VVIVBSTF EQU   VVICB+100                                                04123000
VVISSOBA EQU   VVICB+96                                                 04124000
VVIVSCRA EQU   VVICB+92                                                 04125000
VVISTPTB EQU   VVICB+88                                                 04126000
VVIDVMTA EQU   VVICB+84                                                 04127000
VVIJUCB  EQU   VVICB+80                                                 04128000
VVIIUCB  EQU   VVICB+76                                                 04129000
VVIRES6  EQU   VVICB+72                                                 04130000
VVIRES5  EQU   VVICB+68                                                 04131000
VVIRES4  EQU   VVICB+64                                                 04132000
VVIUCB   EQU   VVICB+60                                                 04133000
VVIVJL   EQU   VVICB+56                                                 04134000
VVIVRR   EQU   VVICB+52                                                 04135000
VVIQLSPL EQU   VVICB+48                                                 04136000
VVIQRPL2 EQU   VVICB+44                                                 04137000
VVIQRPL1 EQU   VVICB+40                                                 04138000
VVIVTRK  EQU   VVICB+37                                                 04139000
VVIOPCD  EQU   VVICB+36                                                 04140000
VVIVQMP  EQU   VVICB+32                                                 04141000
VVIECB1  EQU   VVICB+28                                                 04142000
VVICATAD EQU   VVICB+24                                                 04143000
VVIDCBAD EQU   VVICB+20                                                 04144000
VVIACBAD EQU   VVICB+16                                                 04145000
VVIFLG7  EQU   VVIFLGA                                                  04146000
VVIFLG6  EQU   VVIFLGA                                                  04147000
VVIFLG5  EQU   VVIFLGA                                                  04148000
VVIFLG4  EQU   VVIFLGA                                                  04149000
VVIFLG3  EQU   VVIFLGA                                                  04150000
VVIFLG2  EQU   VVIFLGA                                                  04151000
VVIFLG1  EQU   VVIFLGA                                                  04152000
VVIFLG0  EQU   VVIFLGA                                                  04153000
VVICPUID EQU   VVICB+12                                                 04154000
VVIUCAT  EQU   VVICB+4                                                  04155000
VVICID   EQU   VVICB                                                    04156000
DATASTOR EQU   FSWSAVE+38                                               04157000
@NM00013 EQU   GENTRAN+4                                                04158000
@NM00012 EQU   GENTRAN+3                                                04159000
@NM00011 EQU   TRVAL3CH+2                                               04160000
CYLFILL  EQU   CYLINDER+4                                               04161000
@NM00010 EQU   CYLIND+2                                                 04162000
@NM00009 EQU   CYLTRAN                                                  04163000
@NM00008 EQU   FMTRANL+8                                                04164000
@NM00007 EQU   FMTTRSN+5                                                04165000
@NM00006 EQU   FMTRAN+4                                                 04166000
@NM00005 EQU   FMTWORK+10                                               04167000
EWOCC    EQU   CCHHR                                                    04168000
EWOSNS27 EQU   EWOFSC+1                                                 04169000
EWOSNS26 EQU   EWOFSC                                                   04170000
EWOSNS25 EQU   EWOCSN+9                                                 04171000
EWOSNS24 EQU   EWOCSN+8                                                 04172000
EWOSNS23 EQU   EWOCSN+7                                                 04173000
EWOSNS22 EQU   EWOCSN+6                                                 04174000
EWOSNS21 EQU   EWOCSN+5                                                 04175000
EWOSNS20 EQU   EWOCSN+4                                                 04176000
EWOSNS19 EQU   EWOCSN+3                                                 04177000
EWOSNS18 EQU   EWOCSN+2                                                 04178000
EWOSNS17 EQU   EWOCSN+1                                                 04179000
EWOSNS16 EQU   EWOCSN                                                   04180000
YVALUE   EQU   EWOLZYX1                                                 04181000
ZVALUE   EQU   EWOLZYX1                                                 04182000
MSFVALUE EQU   EWOLZYX1                                                 04183000
EWOSNS13 EQU   EWOSNS+13                                                04184000
EWOCNUM  EQU   EWOSNS12                                                 04185000
EWOCCOND EQU   EWOSNS12                                                 04186000
EWOSNS10 EQU   EWOSNS+10                                                04187000
EWOSNS9  EQU   EWOVOLID+5                                               04188000
EWOSNS8  EQU   EWOVOLID+4                                               04189000
EWOSNS7  EQU   EWOVOLID+3                                               04190000
EWOSNS6  EQU   EWOVOLID+2                                               04191000
@NM00004 EQU   EWOSNS5                                                  04192000
DATACHK  EQU   EWOSNS4                                                  04193000
EQCHK    EQU   EWOSNS4                                                  04194000
CHBOPAR  EQU   EWOSNS4                                                  04195000
INTVREQ  EQU   EWOSNS4                                                  04196000
@NM00003 EQU   EWOSNS4                                                  04197000
FORMAT5  EQU   EWOSNS3                                                  04198000
FORMAT2  EQU   EWOSNS3                                                  04199000
FORMAT1  EQU   EWOSNS3                                                  04200000
EWOSSID2 EQU   EWOSNS2                                                  04201000
EWOSSID1 EQU   EWOSNS1                                                  04202000
@NM00002 EQU   EWOSNS1                                                  04203000
ENV      EQU   EWOSNS0                                                  04204000
PERR     EQU   EWOSNS0                                                  04205000
HRET     EQU   EWOSNS0                                                  04206000
@NM00001 EQU   EWOSNS0                                                  04207000
EQU      EQU   EWOSNS0                                                  04208000
BUSO     EQU   EWOSNS0                                                  04209000
INTV     EQU   EWOSNS0                                                  04210000
CREJ     EQU   EWOSNS0                                                  04211000
@NM00064 EQU   PSA+3668                                                 04212000
PSASTAK  EQU   PSA+3072                                                 04213000
@NM00063 EQU   PSA+1048                                                 04214000
PSAUSEND EQU   PSA+1048                                                 04215000
PSARV062 EQU   PSA+1044                                                 04216000
PSACDAL  EQU   PSA+1040                                                 04217000
PSAWTCOD EQU   PSA+1036                                                 04218000
PSAATCVT EQU   PSA+1032                                                 04219000
PSAPCPSW EQU   PSA+1024                                                 04220000
PSAPIR2  EQU   PSA+1020                                                 04221000
PSARV059 EQU   PSA+1018                                                 04222000
PSASVC13 EQU   PSA+1016                                                 04223000
PSALSFCC EQU   PSA+1012                                                 04224000
PSASFACC EQU   PSA+1008                                                 04225000
PSASTOP  EQU   PSA+992                                                  04226000
PSASTART EQU   PSA+976                                                  04227000
PSARSPSW EQU   PSA+968                                                  04228000
PSASRPSW EQU   PSA+960                                                  04229000
PSARV045 EQU   PSA+892                                                  04230000
PSARV044 EQU   PSA+888                                                  04231000
PSARV043 EQU   PSA+884                                                  04232000
PSARV042 EQU   PSA+880                                                  04233000
PSARV041 EQU   PSA+876                                                  04234000
PSARV040 EQU   PSA+872                                                  04235000
PSARV025 EQU   PSA+868                                                  04236000
PSADSSED EQU   PSA+868                                                  04237000
PSADSSPR EQU   PSA+864                                                  04238000
PSADSSFW EQU   PSA+860                                                  04239000
PSADSS14 EQU   PSA+856                                                  04240000
PSADSSPP EQU   PSA+848                                                  04241000
PSADSSRP EQU   PSA+840                                                  04242000
PSADSS05 EQU   PSADSSF4                                                 04243000
PSADSS10 EQU   PSADSSF4                                                 04244000
PSADSSVE EQU   PSADSSF4                                                 04245000
PSADSSDE EQU   PSADSSF4                                                 04246000
PSADSSC0 EQU   PSADSSF4                                                 04247000
PSADSSIE EQU   PSADSSF4                                                 04248000
PSADSS12 EQU   PSADSSF4                                                 04249000
PSADSSRC EQU   PSADSSF4                                                 04250000
PSARV057 EQU   PSADSSF3                                                 04251000
PSARV056 EQU   PSADSSF3                                                 04252000
PSARV055 EQU   PSADSSF3                                                 04253000
PSADSSMC EQU   PSADSSF3                                                 04254000
PSADSSRW EQU   PSADSSF3                                                 04255000
PSADSSNM EQU   PSADSSF3                                                 04256000
PSADSSES EQU   PSADSSF3                                                 04257000
PSADSSGP EQU   PSADSSF3                                                 04258000
PSADSSF2 EQU   PSADSSFL+1                                               04259000
PSADSSPI EQU   PSADSSF1                                                 04260000
PSADSSOI EQU   PSADSSF1                                                 04261000
PSADSSSP EQU   PSADSSF1                                                 04262000
PSADSSTP EQU   PSADSSF1                                                 04263000
PSADSSDW EQU   PSADSSF1                                                 04264000
PSADSSDD EQU   PSADSSF1                                                 04265000
PSADSSDM EQU   PSADSSF1                                                 04266000
PSADSSMV EQU   PSADSSF1                                                 04267000
PSADSSTS EQU   PSA+816                                                  04268000
PSADSSWK EQU   PSA+812                                                  04269000
PSADSSR3 EQU   PSA+808                                                  04270000
PSADSSR2 EQU   PSA+804                                                  04271000
PSADSSRS EQU   PSA+800                                                  04272000
PSASTOR  EQU   PSA+796                                                  04273000
PSACPUSA EQU   PSA+794                                                  04274000
PSAVSTAP EQU   PSA+792                                                  04275000
PSAWKVAP EQU   PSA+788                                                  04276000
PSAWKRAP EQU   PSA+784                                                  04277000
PSAMCHIC EQU   PSA+783                                                  04278000
PSARV061 EQU   PSA+782                                                  04279000
PSASYMSK EQU   PSA+781                                                  04280000
PSAMCHFL EQU   PSA+780                                                  04281000
PSACR0   EQU   PSA+776                                                  04282000
PSAPSWSV EQU   PSA+768                                                  04283000
PSACLHS  EQU   PSAHLHI                                                  04284000
PSALKR15 EQU   PSALKSA+60                                               04285000
PSALKR14 EQU   PSALKSA+56                                               04286000
PSALKR13 EQU   PSALKSA+52                                               04287000
PSALKR12 EQU   PSALKSA+48                                               04288000
PSALKR11 EQU   PSALKSA+44                                               04289000
PSALKR10 EQU   PSALKSA+40                                               04290000
PSALKR9  EQU   PSALKSA+36                                               04291000
PSALKR8  EQU   PSALKSA+32                                               04292000
PSALKR7  EQU   PSALKSA+28                                               04293000
PSALKR6  EQU   PSALKSA+24                                               04294000
PSALKR5  EQU   PSALKSA+20                                               04295000
PSALKR4  EQU   PSALKSA+16                                               04296000
PSALKR3  EQU   PSALKSA+12                                               04297000
PSALKR2  EQU   PSALKSA+8                                                04298000
PSALKR1  EQU   PSALKSA+4                                                04299000
PSALKR0  EQU   PSALKSA                                                  04300000
PSARV023 EQU   PSACLHT+52                                               04301000
PSALOCAL EQU   PSACLHT+48                                               04302000
PSACMSL  EQU   PSACLHT+44                                               04303000
PSAOPTL  EQU   PSACLHT+40                                               04304000
PSATPACL EQU   PSACLHT+36                                               04305000
PSATPDNL EQU   PSACLHT+32                                               04306000
PSATPNCL EQU   PSACLHT+28                                               04307000
PSAIOSLL EQU   PSACLHT+24                                               04308000
PSAIOSUL EQU   PSACLHT+20                                               04309000
PSAIOSCL EQU   PSACLHT+16                                               04310000
PSAIOSSL EQU   PSACLHT+12                                               04311000
PSASALCL EQU   PSACLHT+8                                                04312000
PSAASML  EQU   PSACLHT+4                                                04313000
PSADISPL EQU   PSACLHT                                                  04314000
PSASRSA  EQU   PSA+636                                                  04315000
PSARV050 EQU   PSA+634                                                  04316000
PSADSSGO EQU   PSA+633                                                  04317000
PSARECUR EQU   PSA+632                                                  04318000
PSAHLHIS EQU   PSA+628                                                  04319000
PSAIPCSA EQU   PSA+624                                                  04320000
@NM00062 EQU   PSA+621                                                  04321000
PSAIPCDM EQU   PSA+620                                                  04322000
PSAIPCD  EQU   PSA+616                                                  04323000
@NM00061 EQU   PSA+613                                                  04324000
PSAIPCRM EQU   PSA+612                                                  04325000
PSAIPCR  EQU   PSA+608                                                  04326000
PSAMCHEX EQU   PSA+600                                                  04327000
PSAMPSW  EQU   PSA+592                                                  04328000
PSAEXPS2 EQU   PSA+584                                                  04329000
PSAEXPS1 EQU   PSA+576                                                  04330000
PSAPIREG EQU   PSA+572                                                  04331000
PSARSREG EQU   PSA+568                                                  04332000
PSAGPREG EQU   PSA+556                                                  04333000
PSARV022 EQU   PSASUP4                                                  04334000
PSARV021 EQU   PSASUP4                                                  04335000
PSARV020 EQU   PSASUP4                                                  04336000
PSARV019 EQU   PSASUP4                                                  04337000
PSARV018 EQU   PSASUP4                                                  04338000
PSARV017 EQU   PSASUP4                                                  04339000
PSARV016 EQU   PSASUP4                                                  04340000
PSARV015 EQU   PSASUP4                                                  04341000
PSARV014 EQU   PSASUP3                                                  04342000
PSARV013 EQU   PSASUP3                                                  04343000
PSARV012 EQU   PSASUP3                                                  04344000
PSAESTA  EQU   PSASUP3                                                  04345000
PSASPR   EQU   PSASUP3                                                  04346000
PSAPSREG EQU   PSASUP3                                                  04347000
PSAPI2   EQU   PSASUP3                                                  04348000
PSAIOSUP EQU   PSASUP3                                                  04349000
PSALCR   EQU   PSASUP2                                                  04350000
PSARTM   EQU   PSASUP2                                                  04351000
PSAACR   EQU   PSASUP2                                                  04352000
PSAIPCE2 EQU   PSASUP2                                                  04353000
PSAIPCES EQU   PSASUP2                                                  04354000
PSAIPCEC EQU   PSASUP2                                                  04355000
PSAGTF   EQU   PSASUP2                                                  04356000
PSAIPCRI EQU   PSASUP2                                                  04357000
PSATYPE6 EQU   PSASUP1                                                  04358000
PSATCTL  EQU   PSASUP1                                                  04359000
PSADISP  EQU   PSASUP1                                                  04360000
PSALOCK  EQU   PSASUP1                                                  04361000
PSAPI    EQU   PSASUP1                                                  04362000
PSAEXT   EQU   PSASUP1                                                  04363000
PSASVC   EQU   PSASUP1                                                  04364000
PSAIO    EQU   PSASUP1                                                  04365000
PSAAOLD  EQU   PSA+548                                                  04366000
PSAANEW  EQU   PSA+544                                                  04367000
PSATOLD  EQU   PSA+540                                                  04368000
PSATNEW  EQU   PSA+536                                                  04369000
PSALCCAR EQU   PSA+532                                                  04370000
PSALCCAV EQU   PSA+528                                                  04371000
PSAPCCAR EQU   PSA+524                                                  04372000
PSAPCCAV EQU   PSA+520                                                  04373000
PSACPULA EQU   PSA+518                                                  04374000
PSACPUPA EQU   PSA+516                                                  04375000
PSAPSA   EQU   PSA+512                                                  04376000
FLCHDEND EQU   PSA+512                                                  04377000
FLCCRSAV EQU   FLCMCLA+280                                              04378000
FLCGRSAV EQU   FLCMCLA+216                                              04379000
FLCFPSAV EQU   FLCMCLA+184                                              04380000
FLCFLA   EQU   FLCMCLA+88                                               04381000
FLCRGNCD EQU   FLCMCLA+84                                               04382000
FLCFSAA  EQU   FLCFSA+1                                                 04383000
@NM00060 EQU   FLCFSA                                                   04384000
@NM00059 EQU   FLCMCLA+72                                               04385000
FLCMCIC  EQU   FLCMCLA+64                                               04386000
@NM00058 EQU   FLCMCLA+20                                               04387000
FLCIOAA  EQU   FLCIOA+1                                                 04388000
@NM00057 EQU   FLCIOA                                                   04389000
@NM00056 EQU   FLCMCLA+15                                               04390000
@NM00055 EQU   FLCMCLA+14                                               04391000
@NM00054 EQU   FLCMCLA+12                                               04392000
FLCLCL   EQU   FLCMCLA+8                                                04393000
FLCIOELA EQU   FLCIOEL+1                                                04394000
@NM00053 EQU   FLCIOEL                                                  04395000
FLCCHNID EQU   FLCMCLA                                                  04396000
@NM00052 EQU   PSA+160                                                  04397000
FLCMTRCD EQU   PSA+157                                                  04398000
@NM00051 EQU   PSA+156                                                  04399000
FLCPERA  EQU   FLCPER+1                                                 04400000
@NM00050 EQU   FLCPER                                                   04401000
@NM00049 EQU   PSA+151                                                  04402000
FLCPERCD EQU   PSA+150                                                  04403000
FLCMCNUM EQU   PSA+149                                                  04404000
@NM00048 EQU   PSA+148                                                  04405000
FLCTEAA  EQU   FLCTEA+1                                                 04406000
@NM00047 EQU   FLCTEA                                                   04407000
PSAPIPC  EQU   PSAPICOD                                                 04408000
PSAPIMC  EQU   PSAPICOD                                                 04409000
PSAPIPER EQU   PSAPICOD                                                 04410000
PSARV049 EQU   FLCPICOD                                                 04411000
FLCPILCB EQU   FLCPIILC                                                 04412000
@NM00046 EQU   FLCPIILC                                                 04413000
@NM00045 EQU   PSAEPPSW                                                 04414000
FLCSVCN  EQU   PSAESPSW+2                                               04415000
FLCSILCB EQU   FLCSVILC                                                 04416000
@NM00044 EQU   FLCSVILC                                                 04417000
@NM00043 EQU   PSAESPSW                                                 04418000
FLCEICOD EQU   PSAEEPSW+2                                               04419000
PSASPAD  EQU   PSAEEPSW                                                 04420000
@NM00042 EQU   PSA+128                                                  04421000
FLCINPSW EQU   PSA+120                                                  04422000
FLCMNPSW EQU   PSA+112                                                  04423000
FLCPNPSW EQU   PSA+104                                                  04424000
FLCSNPSW EQU   PSA+96                                                   04425000
FLCENPSW EQU   PSA+88                                                   04426000
FLCTRACE EQU   PSA+84                                                   04427000
FLCTIMER EQU   PSA+80                                                   04428000
FLCCVT2  EQU   PSA+76                                                   04429000
FLCCAW   EQU   PSA+72                                                   04430000
FLCCSW   EQU   PSA+64                                                   04431000
FLCIOPSW EQU   PSA+56                                                   04432000
FLCMOPSW EQU   PSA+48                                                   04433000
FLCPOPSW EQU   PSA+40                                                   04434000
FLCSOPSW EQU   PSA+32                                                   04435000
FLCEOPSW EQU   PSA+24                                                   04436000
@NM00041 EQU   FLCICCW2+4                                               04437000
FLCCVT   EQU   FLCICCW2                                                 04438000
FLCICCW1 EQU   FLCROPSW                                                 04439000
FLCIPPSW EQU   FLCRNPSW                                                 04440000
*                                      END UNREFERENCED COMPONENTS      04441000
@RF00235 EQU   @RC00223                                                 04442000
@RC00230 EQU   @RC00223                                                 04443000
@RC00225 EQU   @RC00223                                                 04444000
@RC00284 EQU   @RC00258                                                 04445000
@RC00279 EQU   @RC00258                                                 04446000
@RC00274 EQU   @RC00258                                                 04447000
@RC00269 EQU   @RC00258                                                 04448000
@RC00264 EQU   @RC00258                                                 04449000
@RC00259 EQU   @RC00258                                                 04450000
@PB00004 EQU   @PB00005                                                 04451000
@PB00003 EQU   @PB00004                                                 04452000
@PB00002 EQU   @PB00003                                                 04453000
@ENDDATA EQU   *                                                        04454000
         END   IGE0301H,(C'PLS1035',0701,78153)                         04455000
